<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#22522;&#26412;&#30340;&#24037;&#20316;&#24490;&#29615;</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="ch02.html" title="&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#22522;&#26412;&#20351;&#29992;"><link rel="prev" href="ch02s03.html" title="&#21021;&#22987;&#21270;&#26816;&#20986;"><link rel="next" href="ch02s05.html" title="&#26816;&#39564;&#21382;&#21490;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#22522;&#26412;&#30340;&#24037;&#20316;&#24490;&#29615;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch02s03.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#22522;&#26412;&#20351;&#29992;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch02s05.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.tour.cycle"></a>&#22522;&#26412;&#30340;&#24037;&#20316;&#24490;&#29615;</h2></div></div></div><p>Subversion&#26377;&#35768;&#22810;&#29305;&#24615;&#12289;&#36873;&#39033;&#21644;&#21326;&#32780;&#19981;&#23454;&#30340;&#39640;&#32423;&#21151;&#33021;&#65292;&#20294;&#26085;&#24120;&#30340;&#24037;&#20316;&#20013;&#20320;&#21482;&#20351;&#29992;&#20854;&#20013;&#30340;&#19968;&#23567;&#37096;&#20998;&#65292;&#22312;&#36825;&#19968;&#33410;&#37324;&#65292;&#25105;&#20204;&#20250;&#20171;&#32461;&#35768;&#22810;&#20320;&#22312;&#26085;&#24120;&#24037;&#20316;&#20013;&#24120;&#29992;&#30340;&#21629;&#20196;&#12290;</p><p>&#20856;&#22411;&#30340;&#24037;&#20316;&#21608;&#26399;&#26159;&#36825;&#26679;&#30340;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#26356;&#26032;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;</p><div class="itemizedlist"><ul type="circle"><li><p>
                <span class="command"><strong>svn update</strong></span>
              </p></li></ul></div></li><li><p>&#20570;&#20986;&#20462;&#25913;</p><div class="itemizedlist"><ul type="circle"><li><p>
                <span class="command"><strong>svn add</strong></span>
              </p></li><li><p>
                <span class="command"><strong>svn delete</strong></span>
              </p></li><li><p>
                <span class="command"><strong>svn copy</strong></span>
              </p></li><li><p>
                <span class="command"><strong>svn move</strong></span>
              </p></li></ul></div></li><li><p>&#26816;&#39564;&#20462;&#25913;</p><div class="itemizedlist"><ul type="circle"><li><p>
                <span class="command"><strong>svn status</strong></span>
              </p></li><li><p>
                <span class="command"><strong>svn diff</strong></span>
              </p></li></ul></div></li><li><p>&#21487;&#33021;&#20250;&#21462;&#28040;&#19968;&#20123;&#20462;&#25913;</p><div class="itemizedlist"><ul type="circle"><li><p>
                <span class="command"><strong>svn revert</strong></span>
              </p></li></ul></div></li><li><p>&#35299;&#20915;&#20914;&#31361;&#65288;&#21512;&#24182;&#21035;&#20154;&#30340;&#20462;&#25913;&#65289;</p><div class="itemizedlist"><ul type="circle"><li><p>
                <span class="command"><strong>svn update</strong></span>
              </p></li><li><p>
                <span class="command"><strong>svn resolved</strong></span>
              </p></li></ul></div></li><li><p>&#25552;&#20132;&#20320;&#30340;&#20462;&#25913;</p><div class="itemizedlist"><ul type="circle"><li><p>
                <span class="command"><strong>svn commit</strong></span>
              </p></li></ul></div></li></ul></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.tour.cycle.update"></a>&#26356;&#26032;&#20320;&#30340;&#24037;&#20316;&#21103;&#26412;</h3></div></div></div><p>&#24403;&#20320;&#22312;&#19968;&#20010;&#22242;&#38431;&#30340;&#39033;&#30446;&#37324;&#24037;&#20316;&#26102;&#65292;&#20320;&#24076;&#26395;&#26356;&#26032;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#24471;&#21040;&#25152;&#26377;&#20854;&#20182;&#20154;&#36825;&#27573;&#26102;&#38388;&#20316;&#20986;&#30340;&#20462;&#25913;&#65292;&#20351;&#29992;<span class="command"><strong>svn update</strong></span>&#35753;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#19982;&#26368;&#26032;&#30340;&#29256;&#26412;&#21516;&#27493;&#12290;</p><pre class="screen">
$ svn update
U  foo.c
U  bar.c
Updated to revision 2.
</pre><p>&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20854;&#20182;&#20154;&#22312;&#20320;&#19978;&#27425;&#26356;&#26032;&#20043;&#21518;&#25552;&#20132;&#20102;&#23545;<code class="filename">foo.c</code>&#21644;<code class="filename">bar.c</code>&#30340;&#20462;&#25913;&#65292;&#22240;&#27492;Subversion&#26356;&#26032;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#26469;&#24341;&#20837;&#36825;&#20123;&#26356;&#25913;&#12290;</p><p>&#24403;&#26381;&#21153;&#22120;&#36890;&#36807;<span class="command"><strong>svn update</strong></span>&#23558;&#20462;&#25913;&#20256;&#36882;&#21040;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#26102;&#65292;&#27599;&#19968;&#20010;&#39033;&#30446;&#20043;&#21069;&#20250;&#26377;&#19968;&#20010;&#23383;&#27597;&#65292;&#26469;&#35753;&#20320;&#30693;&#36947;Subversion&#20026;&#20445;&#25345;&#26368;&#26032;&#23545;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#20316;&#20102;&#21738;&#20123;&#24037;&#20316;&#12290;&#20851;&#20110;&#36825;&#20123;&#23383;&#27597;&#30340;&#35814;&#32454;&#21547;&#20041;&#65292;&#21487;&#20197;&#30475;<a class="xref" href="re32.html" title="svn update">svn update</a>&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.tour.cycle.edit"></a>&#20462;&#25913;&#20320;&#30340;&#24037;&#20316;&#21103;&#26412;</h3></div></div></div><p>&#29616;&#22312;&#20320;&#21487;&#20197;&#24320;&#22987;&#24037;&#20316;&#24182;&#19988;&#20462;&#25913;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#20102;&#65292;&#20320;&#24456;&#23481;&#26131;&#20915;&#23450;&#20316;&#20986;&#19968;&#20010;&#20462;&#25913;&#65288;&#25110;&#32773;&#26159;&#19968;&#32452;&#65289;&#65292;&#20687;&#20889;&#19968;&#20010;&#26032;&#30340;&#29305;&#24615;&#65292;&#20462;&#27491;&#19968;&#20010;&#38169;&#35823;&#31561;&#31561;&#12290;&#36825;&#26102;&#21487;&#20197;&#20351;&#29992;&#30340;Subversion&#21629;&#20196;&#21253;&#25324;<span class="command"><strong>svn add</strong></span>&#12289; <span class="command"><strong>svn delete</strong></span>&#12289;<span class="command"><strong>svn copy</strong></span>&#21644;<span class="command"><strong>svn move</strong></span>&#12290;&#22914;&#26524;&#20320;&#21482;&#26159;&#20462;&#25913;&#29256;&#26412;&#24211;&#20013;&#24050;&#32463;&#23384;&#22312;&#30340;&#25991;&#20214;&#65292;&#22312;&#20320;&#25552;&#20132;&#20043;&#21069;&#65292;&#19981;&#24517;&#20351;&#29992;&#19978;&#38754;&#30340;&#20219;&#20309;&#19968;&#20010;&#21629;&#20196;&#12290;</p><p>&#20320;&#21487;&#20197;&#23545;&#24037;&#20316;&#25335;&#36125;&#20570;&#20986;&#20004;&#31181;&#20462;&#25913;&#65306;&#25991;&#20214;&#20462;&#25913;&#21644;&#30446;&#24405;&#26641;&#20462;&#25913;&#12290;&#20320;&#19981;&#38656;&#35201;&#21578;&#35785;Subversion&#20320;&#24076;&#26395;&#20462;&#25913;&#19968;&#20010;&#25991;&#20214;&#65292;&#21482;&#38656;&#35201;&#29992;&#20320;&#30340;&#32534;&#36753;&#22120;&#12289;&#23383;&#22788;&#29702;&#22120;&#12289;&#22270;&#24418;&#31243;&#24207;&#25110;&#20219;&#20309;&#24037;&#20855;&#20570;&#20986;&#20462;&#25913;&#65292;Subversion&#33258;&#21160;&#30417;&#27979;&#21040;&#25991;&#20214;&#30340;&#26356;&#25913;&#65292;&#27492;&#22806;&#65292;&#20108;&#36827;&#21046;&#25991;&#20214;&#30340;&#22788;&#29702;&#26041;&#24335;&#21644;&#25991;&#26412;&#25991;&#20214;&#19968;&#26679;&#8212;&#20063;&#26377;&#21516;&#26679;&#30340;&#25928;&#29575;&#12290;&#23545;&#20110;&#30446;&#24405;&#26641;&#26356;&#25913;&#65292;&#20320;&#21487;&#20197;&#21578;&#35785;Subversion&#23558;&#25991;&#20214;&#21644;&#30446;&#24405;&#39044;&#23450;&#30340;&#21024;&#38500;&#12289;&#28155;&#21152;&#12289;&#25335;&#36125;&#25110;&#31227;&#21160;&#26631;&#35760;&#65292;&#36825;&#20123;&#21160;&#20316;&#20250;&#22312;&#24037;&#20316;&#25335;&#36125;&#19978;&#31435;&#21051;&#21457;&#29983;&#25928;&#26524;&#65292;&#20294;&#21482;&#26377;&#25552;&#20132;&#21518;&#25165;&#20250;&#22312;&#29256;&#26412;&#24211;&#37324;&#29983;&#25928;&#12290;</p><p>&#19979;&#38754;&#26159;Subversion&#29992;&#26469;&#20462;&#25913;&#30446;&#24405;&#26641;&#32467;&#26500;&#30340;&#20116;&#20010;&#23376;&#21629;&#20196;&#12290;</p><div class="sidebar"><p class="title"><b>&#29256;&#26412;&#25511;&#21046;&#31526;&#21495;&#36830;&#25509;</b></p><p>&#22312;&#38750;Windows&#24179;&#21488;&#65292;Subversion&#21487;&#20197;&#23558;&#29305;&#27530;&#31867;&#22411;<em class="firstterm">&#31526;&#21495;&#38142;&#25509;</em>&#65288;&#25110;&#26159;&#8220;<span class="quote">symlink</span>&#8221;&#65289;&#29256;&#26412;&#21270;&#65292;&#19968;&#20010;&#31526;&#21495;&#38142;&#25509;&#26159;&#23545;&#25991;&#20214;&#31995;&#32479;&#20013;&#20854;&#20182;&#23545;&#35937;&#30340;&#36879;&#26126;&#24341;&#29992;&#65292;&#21487;&#20197;&#36890;&#36807;&#23545;&#31526;&#21512;&#38142;&#25509;&#25805;&#20316;&#23454;&#29616;&#23545;&#24341;&#29992;&#23545;&#35937;&#30340;&#35835;&#20889;&#25805;&#20316;&#12290;</p><p>&#24403;&#31526;&#21495;&#38142;&#25552;&#20132;&#21040;Subversion&#29256;&#26412;&#24211;&#65292;Subversion&#20250;&#35760;&#20303;&#36825;&#20010;&#25991;&#20214;&#23454;&#38469;&#19978;&#26159;&#19968;&#20010;&#31526;&#21495;&#38142;&#65292;&#20063;&#20250;&#30693;&#36947;&#36825;&#20010;&#31526;&#21495;&#38142;&#25351;&#21521;&#30340;&#8220;<span class="quote">&#23545;&#35937;</span>&#8221;&#12290;&#24403;&#36825;&#20010;&#31526;&#21495;&#38142;&#26816;&#20986;&#21040;&#21478;&#19968;&#20010;&#25903;&#25345;&#31526;&#21495;&#38142;&#30340;&#25805;&#20316;&#31995;&#32479;&#19978;&#26102;&#65292;Subversion&#20250;&#37325;&#26032;&#26500;&#24314;&#25991;&#20214;&#31995;&#32479;&#32423;&#30340;&#31526;&#21495;&#38142;&#25509;&#12290;&#24403;&#28982;&#36825;&#26679;&#19981;&#20250;&#24433;&#21709;&#22312;Windows&#36825;&#31867;&#19981;&#25903;&#25345;&#31526;&#21495;&#38142;&#30340;&#31995;&#32479;&#19978;&#65292;&#22312;&#27492;&#31867;&#31995;&#32479;&#19978;&#65292;Subversion&#21482;&#20250;&#21019;&#24314;&#19968;&#20010;&#21253;&#21547;&#25351;&#21521;&#23545;&#35937;&#36335;&#24452;&#30340;&#25991;&#26412;&#25991;&#20214;&#65292;&#22240;&#20026;&#36825;&#20010;&#25991;&#20214;&#19981;&#33021;&#22312;Windows&#31995;&#32479;&#19978;&#20316;&#20026;&#31526;&#21495;&#38142;&#20351;&#29992;&#65292;&#25152;&#20197;&#23427;&#20063;&#20250;&#38450;&#27490;Windows&#29992;&#25143;&#20316;&#20854;&#20182;Subversion&#30456;&#20851;&#30340;&#25805;&#20316;&#12290;</p></div><div class="variablelist"><dl><dt><span class="term">
              <span class="command"><strong>svn add foo</strong></span>
            </span></dt><dd><p>&#39044;&#23450;&#23558;&#25991;&#20214;&#12289;&#30446;&#24405;&#25110;&#32773;&#31526;&#21495;&#38142;<code class="filename">foo</code>&#28155;&#21152;&#21040;&#29256;&#26412;&#24211;&#65292;&#24403;&#20320;&#19979;&#27425;&#25552;&#20132;&#21518;&#65292;<code class="filename">foo</code>&#20250;&#25104;&#20026;&#20854;&#29238;&#30446;&#24405;&#30340;&#19968;&#20010;&#23376;&#23545;&#35937;&#12290;&#27880;&#24847;&#65292;&#22914;&#26524;<code class="filename">foo</code>&#26159;&#30446;&#24405;&#65292;&#25152;&#26377;foo&#20013;&#30340;&#20869;&#23481;&#20063;&#20250;&#39044;&#23450;&#28155;&#21152;&#36827;&#21435;&#65292;&#22914;&#26524;&#20320;&#21482;&#24819;&#28155;&#21152;<code class="filename">foo</code>&#26412;&#36523;&#65292;&#35831;&#20351;&#29992;<code class="option">--non-recursive (-N)</code>&#21442;&#25968;&#12290;</p></dd><dt><span class="term">
              <span class="command"><strong>svn delete foo</strong></span>
            </span></dt><dd><p>&#39044;&#23450;&#23558;&#25991;&#20214;&#12289;&#30446;&#24405;&#25110;&#32773;&#31526;&#21495;&#38142;<code class="filename">foo</code>&#20174;&#29256;&#26412;&#24211;&#20013;&#21024;&#38500;&#25481;&#65292;&#22914;&#26524;foo&#26159;&#25991;&#20214;&#65292;&#23427;&#39532;&#19978;&#20174;&#24037;&#20316;&#25335;&#36125;&#20013;&#21024;&#38500;&#65292;&#22914;&#26524;&#26159;&#30446;&#24405;&#65292;&#19981;&#20250;&#34987;&#21024;&#38500;&#65292;&#20294;&#26159;Subversion&#20934;&#22791;&#22909;&#21024;&#38500;&#20102;&#65292;&#24403;&#20320;&#25552;&#20132;&#20320;&#30340;&#20462;&#25913;&#65292;<code class="filename">foo</code>&#23601;&#20250;&#22312;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#21644;&#29256;&#26412;&#24211;&#20013;&#34987;&#21024;&#38500;&#12290;<sup>[<a name="d0e2060" href="#ftn.d0e2060" class="footnote">4</a>]</sup></p></dd><dt><span class="term">
              <span class="command"><strong>svn copy foo bar</strong></span>
            </span></dt><dd><p>Create a new item <code class="filename">bar</code> as a
              duplicate of <code class="filename">foo</code> and automatically
              schedule <code class="filename">bar</code> for addition.  When
              <code class="filename">bar</code> is added to the repository on
              the next commit, its copy history is recorded (as having
              originally come from <code class="filename">foo</code>).
              <span class="command"><strong>svn copy</strong></span> does not create intermediate
              directories unless you pass the
              <code class="option">--parents</code>.</p></dd><dt><span class="term">
              <span class="command"><strong>svn move foo bar</strong></span>
            </span></dt><dd><p>This command is exactly the same as running
              <span class="command"><strong>svn copy foo bar; svn delete foo</strong></span>.
              That is, <code class="filename">bar</code> is scheduled for
              addition as a copy of <code class="filename">foo</code>, and
              <code class="filename">foo</code> is scheduled for removal.
              <span class="command"><strong>svn move</strong></span> does not create intermediate
              directories unless you pass the
              <code class="option">--parents</code>.</p></dd><dt><span class="term">
              <span class="command"><strong>svn mkdir blort</strong></span>
            </span></dt><dd><p>&#36825;&#20010;&#21629;&#20196;&#21516;&#36816;&#34892; <span class="command"><strong>mkdir blort; svn add blort</strong></span>&#30456;&#21516;&#65292;&#20063;&#23601;&#26159;&#21019;&#24314;&#19968;&#20010;&#21483;&#20570;<code class="filename">blort</code>&#30340;&#25991;&#20214;&#65292;&#24182;&#19988;&#39044;&#23450;&#28155;&#21152;&#21040;&#29256;&#26412;&#24211;&#12290;</p></dd></dl></div><div class="sidebar"><p class="title"><b>&#19981;&#36890;&#36807;&#24037;&#20316;&#21103;&#26412;&#20462;&#25913;&#29256;&#26412;&#24211;</b></p><p>&#26377;&#19968;&#20123;&#24773;&#20917;&#19979;&#20250;&#31435;&#21051;&#25552;&#20132;&#30446;&#24405;&#26641;&#30340;&#20462;&#25913;&#21040;&#29256;&#26412;&#24211;&#65292;&#36825;&#21482;&#21457;&#29983;&#22312;&#23376;&#21629;&#20196;&#30452;&#25509;&#25805;&#20316;URL&#65292;&#32780;&#19981;&#26159;&#24037;&#20316;&#25335;&#36125;&#36335;&#24452;&#26102;&#12290;&#20197;&#29305;&#23450;&#30340;&#26041;&#24335;&#20351;&#29992;<span class="command"><strong>svn mkdir</strong></span>&#12289;<span class="command"><strong>svn copy</strong></span>&#12289;<span class="command"><strong>svn move</strong></span>&#21644;<span class="command"><strong>svn delete</strong></span>&#21487;&#20197;&#38024;&#23545;URL&#25805;&#20316;&#65288;&#24182;&#19988;&#19981;&#35201;&#24536;&#35760;<span class="command"><strong>svn import</strong></span>&#21482;&#38024;&#23545;URL&#25805;&#20316;&#65289;&#12290;</p><p>&#25351;&#23450;URL&#30340;&#25805;&#20316;&#26041;&#24335;&#26377;&#19968;&#20123;&#21306;&#21035;&#65292;&#22240;&#20026;&#22312;&#20351;&#29992;&#24037;&#20316;&#25335;&#36125;&#30340;&#36816;&#20316;&#26041;&#24335;&#26102;&#65292;&#24037;&#20316;&#25335;&#36125;&#25104;&#20026;&#19968;&#20010;&#8220;<span class="quote">&#38598;&#32467;&#22320;</span>&#8221;&#65292;&#21487;&#20197;&#22312;&#25552;&#20132;&#20043;&#21069;&#25972;&#29702;&#32452;&#32455;&#25152;&#35201;&#20570;&#30340;&#20462;&#25913;&#65292;&#30452;&#25509;&#23545;URL&#25805;&#20316;&#23601;&#27809;&#26377;&#36825;&#31181;&#22882;&#20360;&#65292;&#25152;&#20197;&#24403;&#20320;&#30452;&#25509;&#25805;&#20316;URL&#30340;&#26102;&#20505;&#65292;&#25152;&#26377;&#20197;&#19978;&#30340;&#21160;&#20316;&#20195;&#34920;&#19968;&#20010;&#31435;&#21363;&#30340;&#25552;&#20132;&#12290;</p></div></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.tour.cycle.examine"></a>&#26816;&#26597;&#20320;&#30340;&#20462;&#25913;</h3></div></div></div><p>&#24403;&#20320;&#23436;&#25104;&#20462;&#25913;&#65292;&#20320;&#38656;&#35201;&#25552;&#20132;&#20182;&#20204;&#21040;&#29256;&#26412;&#24211;&#65292;&#20294;&#26159;&#22312;&#27492;&#20043;&#21069;&#65292;&#26816;&#26597;&#19968;&#19979;&#20570;&#36807;&#20160;&#20040;&#20462;&#25913;&#26159;&#20010;&#22909;&#20027;&#24847;&#65292;&#36890;&#36807;&#25552;&#20132;&#21069;&#30340;&#26816;&#26597;&#65292;&#20320;&#21487;&#20197;&#25972;&#29702;&#19968;&#20221;&#31934;&#30830;&#30340;&#26085;&#24535;&#20449;&#24687;&#65292;&#20320;&#20063;&#21487;&#20197;&#21457;&#29616;&#20320;&#19981;&#23567;&#24515;&#20462;&#25913;&#30340;&#25991;&#20214;&#65292;&#32473;&#20102;&#20320;&#19968;&#27425;&#24674;&#22797;&#20462;&#25913;&#30340;&#26426;&#20250;&#12290;&#27492;&#22806;&#65292;&#36825;&#26159;&#19968;&#20010;&#23457;&#26597;&#21644;&#20180;&#32454;&#23519;&#30475;&#20462;&#25913;&#30340;&#22909;&#26426;&#20250;&#65292;&#20320;&#21487;&#36890;&#36807;&#21629;&#20196;<span class="command"><strong>svn status</strong></span>&#27983;&#35272;&#25152;&#20570;&#30340;&#20462;&#25913;&#65292;&#36890;&#36807;<span class="command"><strong>svn diff</strong></span>&#26816;&#26597;&#20462;&#25913;&#30340;&#35814;&#32454;&#20449;&#24687;&#12290;</p><div class="sidebar"><p class="title"><b>&#30475;&#65281;&#27809;&#26377;&#32593;&#32476;&#65281;</b></p><p>&#36825;&#19977;&#20010;&#21629;&#20196;&#65288;<span class="command"><strong>svn status</strong></span>&#12289;<span class="command"><strong>svn diff</strong></span>&#21644;<span class="command"><strong>svn revert</strong></span>&#65289;&#37117;&#21487;&#20197;&#22312;&#27809;&#26377;&#32593;&#32476;&#30340;&#24773;&#20917;&#19979;&#24037;&#20316;&#65288;&#20551;&#23450;&#20320;&#30340;&#29256;&#26412;&#24211;&#26159;&#36890;&#36807;&#32593;&#32476;&#32780;&#19981;&#26159;&#26412;&#22320;&#35775;&#38382;&#30340;&#65289;&#65292;&#36825;&#35753;&#20320;&#22312;&#27809;&#26377;&#32593;&#32476;&#36830;&#25509;&#26102;&#30340;&#31649;&#29702;&#20462;&#25913;&#36807;&#31243;&#26356;&#21152;&#23481;&#26131;&#65292;&#20687;&#22312;&#39134;&#26426;&#19978;&#26053;&#34892;&#65292;&#20056;&#22352;&#28779;&#36710;&#24448;&#36820;&#25110;&#26159;&#22312;&#28023;&#28393;&#19978;&#22859;&#21147;&#24037;&#20316;&#26102;&#12290;<sup>[<a name="d0e2194" href="#ftn.d0e2194" class="footnote">5</a>]</sup></p><p>Subversion&#36890;&#36807;&#22312;<code class="filename">.svn</code>&#31649;&#29702;&#21306;&#22495;&#20351;&#29992;&#21407;&#22987;&#30340;&#29256;&#26412;&#32531;&#23384;&#26469;&#20570;&#21040;&#36825;&#19968;&#28857;&#65292;&#36825;&#20351;&#24471;&#25253;&#21578;&#21644;&#24674;&#22797;&#26412;&#22320;&#20462;&#25913;&#32780;<span class="emphasis"><em>&#19981;&#24517;&#35775;&#38382;&#32593;&#32476;</em></span>&#65292;&#36825;&#20010;&#32531;&#23384;&#65288;&#21483;&#20570;&#8220;<span class="quote">text-base</span>&#8221;&#65289;&#20063;&#20801;&#35768;Subversion&#21487;&#20197;&#26681;&#25454;&#21407;&#22987;&#29256;&#26412;&#29983;&#25104;&#19968;&#20010;&#21387;&#32553;&#30340;&#22686;&#37327;&#65288;&#8220;<span class="quote">&#21306;&#21035;</span>&#8221;&#65289; &#25552;&#20132;&#8212;&#21363;&#20351;&#20320;&#26377;&#20010;&#38750;&#24120;&#24555;&#30340;&#32593;&#32476;&#65292;&#26377;&#36825;&#26679;&#19968;&#20010;&#32531;&#23384;&#26377;&#26497;&#22823;&#30340;&#22909;&#22788;&#65292;&#21482;&#21521;&#26381;&#21153;&#22120;&#25552;&#20132;&#20462;&#25913;&#30340;&#37096;&#20998;&#32780;&#19981;&#26159;&#25972;&#20010;&#25991;&#20214;&#12290;</p></div><p>Subversion&#24050;&#32463;&#34987;&#20248;&#21270;&#26469;&#24110;&#21161;&#20320;&#23436;&#25104;&#36825;&#20010;&#20219;&#21153;&#65292;&#21487;&#20197;&#22312;&#19981;&#19982;&#29256;&#26412;&#24211;&#36890;&#35759;&#30340;&#24773;&#20917;&#19979;&#20570;&#35768;&#22810;&#20107;&#24773;&#65292;&#35814;&#32454;&#26469;&#35828;&#65292;&#23545;&#20110;&#27599;&#19968;&#20010;&#25991;&#20214;&#65292;&#20320;&#30340;&#30340;&#24037;&#20316;&#25335;&#36125;&#22312;<code class="filename">.svn</code>&#21253;&#21547;&#20102;&#19968;&#20010;&#8220;<span class="quote">&#21407;&#22987;&#30340;</span>&#8221;&#25335;&#36125;&#65292;&#25152;&#20197;Subversion&#21487;&#20197;&#24555;&#36895;&#30340;&#21578;&#35785;&#20320;&#37027;&#20123;&#25991;&#20214;&#20462;&#25913;&#20102;&#65292;&#29978;&#33267;&#20801;&#35768;&#20320;&#22312;&#19981;&#19982;&#29256;&#26412;&#24211;&#36890;&#35759;&#30340;&#24773;&#20917;&#19979;&#24674;&#22797;&#20462;&#25913;&#12290;</p><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.tour.cycle.examine.status"></a>&#26597;&#30475;&#20320;&#30340;&#20462;&#25913;&#27010;&#20917;</h4></div></div></div><p>&#20026;&#20102;&#27983;&#35272;&#20462;&#25913;&#30340;&#20869;&#23481;&#65292;&#20320;&#20250;&#20351;&#29992;&#36825;&#20010;<span class="command"><strong>svn status</strong></span>&#21629;&#20196;&#65292;&#22312;&#25152;&#26377;Subversion&#21629;&#20196;&#37324;&#65292;&#20320;&#21487;&#33021;&#20250;&#26368;&#22810;&#20351;&#29992;<span class="command"><strong>svn status</strong></span>&#12290;</p><div class="sidebar"><p class="title"><b>CVS &#29992;&#25143;&#65306;&#25511;&#21046;&#21478;&#31867;&#30340;&#26356;&#26032;&#65281;</b></p><p>&#20320;&#20063;&#35768;&#20351;&#29992;<span class="command"><strong>cvs update</strong></span>&#26469;&#30475;&#20320;&#20570;&#20102;&#21738;&#20123;&#20462;&#25913;&#65292;<span class="command"><strong>svn status</strong></span>&#20250;&#32473;&#20320;&#25152;&#26377;&#20320;&#20570;&#30340;&#25913;&#21464;&#8212;&#32780;&#19981;&#38656;&#35201;&#35775;&#38382;&#29256;&#26412;&#24211;&#65292;&#24182;&#19988;&#19981;&#20250;&#22312;&#19981;&#30693;&#24773;&#30340;&#24773;&#20917;&#19979;&#19982;&#20854;&#20182;&#29992;&#25143;&#20316;&#30340;&#26356;&#25913;&#27604;&#36739;&#12290;</p><p>&#22312;Subversion&#65292;<span class="command"><strong>update</strong></span>&#21482;&#26159;&#20570;&#36825;&#20214;&#20107;&#8212;&#23558;&#24037;&#20316;&#25335;&#36125;&#26356;&#26032;&#21040;&#29256;&#26412;&#24211;&#30340;&#26368;&#26032;&#29256;&#26412;&#65292;&#20320;&#21487;&#20197;&#28040;&#38500;&#20351;&#29992;<span class="command"><strong>update</strong></span>&#23519;&#30475;&#26412;&#22320;&#20462;&#25913;&#30340;&#20064;&#24815;&#12290;</p></div><p>&#22914;&#26524;&#20320;&#22312;&#24037;&#20316;&#25335;&#36125;&#30340;&#39030;&#32423;&#30446;&#24405;&#36816;&#34892;&#19981;&#24102;&#21442;&#25968;&#30340;<span class="command"><strong>svn status</strong></span>&#21629;&#20196;&#65292;&#23427;&#20250;&#26816;&#27979;&#20320;&#20570;&#30340;&#25152;&#26377;&#30340;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#20462;&#25913;&#65292;&#20197;&#19979;&#30340;&#20363;&#23376;&#26159;&#26469;&#23637;&#31034;<span class="command"><strong>svn status</strong></span>&#21487;&#33021;&#36820;&#22238;&#30340;&#29366;&#24577;&#30721;&#65288;&#27880;&#24847;&#65292;<code class="literal">#</code>&#20043;&#21518;&#30340;&#19981;&#26159;<span class="command"><strong>svn status</strong></span>&#25171;&#21360;&#30340;&#65289;&#12290;</p><pre class="screen">
A       stuff/loot/bloo.h   # file is scheduled for addition
C       stuff/loot/lump.c   # file has textual conflicts from an update
D       stuff/fish.c        # file is scheduled for deletion
M       bar.c               # the content in bar.c has local modifications
</pre><p>&#22312;&#36825;&#31181;&#26684;&#24335;&#19979;&#65292;<span class="command"><strong>svn status</strong></span>&#25171;&#21360;6&#21015;&#23383;&#31526;&#65292;&#32039;&#36319;&#19968;&#20123;&#31354;&#26684;&#65292;&#25509;&#30528;&#26159;&#25991;&#20214;&#25110;&#32773;&#30446;&#24405;&#21517;&#12290;&#31532;&#19968;&#21015;&#21578;&#35785;&#19968;&#20010;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#29366;&#24577;&#25110;&#23427;&#30340;&#20869;&#23481;&#65292;&#36820;&#22238;&#20195;&#30721;&#22914;&#19979;&#65306;</p><div class="variablelist"><dl><dt><span class="term">
                <code class="computeroutput">A      item</code>
              </span></dt><dd><p>&#39044;&#23450;&#21152;&#20837;&#21040;&#29256;&#26412;&#24211;&#30340;&#25991;&#20214;&#12289;&#30446;&#24405;&#25110;&#31526;&#21495;&#38142;&#30340;<code class="filename">item</code>&#12290;</p></dd><dt><span class="term">
                <code class="computeroutput">C      item</code>
              </span></dt><dd><p>The file <code class="filename">item</code> is in a state
                of conflict.  That is, changes received from the
                server during an update overlap with local changes
                that you have in your working copy (and weren't
                resolved during the update).  You must resolve this
                conflict before committing your changes to the
                repository.</p></dd><dt><span class="term">
                <code class="computeroutput">D      item</code>
              </span></dt><dd><p>&#25991;&#20214;&#12289;&#30446;&#24405;&#25110;&#26159;&#31526;&#21495;&#38142;<code class="filename">item</code>&#39044;&#23450;&#20174;&#29256;&#26412;&#24211;&#20013;&#21024;&#38500;&#12290;</p></dd><dt><span class="term">
                <code class="computeroutput">M      item</code>
              </span></dt><dd><p>&#25991;&#20214;<code class="filename">item</code>&#30340;&#20869;&#23481;&#34987;&#20462;&#25913;&#20102;&#12290;</p></dd></dl></div><p>&#22914;&#26524;&#20320;&#20256;&#36882;&#19968;&#20010;&#36335;&#24452;&#32473;<span class="command"><strong>svn status</strong></span>&#65292;&#23427;&#21482;&#32473;&#20320;&#36825;&#20010;&#39033;&#30446;&#30340;&#20449;&#24687;&#65306;</p><pre class="screen">
$ svn status stuff/fish.c
D      stuff/fish.c
</pre><p><span class="command"><strong>svn status</strong></span>&#20063;&#26377;&#19968;&#20010;<code class="option">--verbose (-v)</code>&#36873;&#39033;&#65292;&#23427;&#21487;&#20197;&#26174;&#31034;&#24037;&#20316;&#25335;&#36125;&#20013;&#30340;<span class="emphasis"><em>&#25152;&#26377;</em></span>&#39033;&#30446;&#65292;&#21363;&#20351;&#27809;&#26377;&#25913;&#21464;&#36807;&#30340;&#65306;</p><pre class="screen">
$ svn status -v
M               44        23    sally     README
                44        30    sally     INSTALL
M               44        20    harry     bar.c
                44        18    ira       stuff
                44        35    harry     stuff/trout.c
D               44        19    ira       stuff/fish.c
                44        21    sally     stuff/things
A                0         ?     ?        stuff/things/bloo.h
                44        36    harry     stuff/things/gloo.c
</pre><p>&#36825;&#26159;<span class="command"><strong>svn status</strong></span>&#30340;&#8220;<span class="quote">&#21152;&#38271;&#24418;&#24335;</span>&#8221;&#65292;&#31532;&#19968;&#21015;&#20445;&#25345;&#30456;&#21516;&#65292;&#31532;&#20108;&#21015;&#26174;&#31034;&#19968;&#20010;&#24037;&#20316;&#29256;&#26412;&#21495;&#65292;&#31532;&#19977;&#21644;&#31532;&#22235;&#21015;&#26174;&#31034;&#26368;&#21518;&#19968;&#27425;&#20462;&#25913;&#30340;&#29256;&#26412;&#21495;&#21644;&#20462;&#25913;&#20154;&#65288;&#36825;&#20123;&#21015;&#19981;&#20250;&#19982;&#25105;&#20204;&#21018;&#25165;&#25552;&#21040;&#30340;&#23383;&#31526;&#28151;&#28102;&#65289;&#12290;</p><p>&#19978;&#38754;&#25152;&#26377;&#30340;<span class="command"><strong>svn status</strong></span>&#35843;&#29992;&#24182;&#27809;&#26377;&#32852;&#31995;&#29256;&#26412;&#24211;&#65292;&#21482;&#26159;&#19982;<code class="filename">.svn</code>&#20013;&#30340;&#21407;&#22987;&#25968;&#25454;&#36827;&#34892;&#27604;&#36739;&#30340;&#32467;&#26524;&#65292;&#26368;&#21518;&#65292;&#26159;<code class="option">--show-updates (-u)</code>&#36873;&#39033;&#65292;&#23427;&#23558;&#20250;&#32852;&#31995;&#29256;&#26412;&#24211;&#20026;&#24050;&#32463;&#36807;&#26102;&#30340;&#25968;&#25454;&#28155;&#21152;&#26032;&#20449;&#24687;&#65306;</p><pre class="screen">
$ svn status -u -v
M      *        44        23    sally     README
M               44        20    harry     bar.c
       *        44        35    harry     stuff/trout.c
D               44        19    ira       stuff/fish.c
A                0         ?     ?        stuff/things/bloo.h
Status against revision:   46
</pre><p>&#27880;&#24847;&#36825;&#20004;&#20010;&#26143;&#21495;&#65306;&#22914;&#26524;&#20320;&#29616;&#22312;&#25191;&#34892;<span class="command"><strong>svn update</strong></span>&#65292;&#20320;&#30340;<code class="filename">README</code>&#21644;<code class="filename">trout.c</code>&#20250;&#34987;&#26356;&#26032;&#65292;&#36825;&#21578;&#35785;&#20320;&#35768;&#22810;&#26377;&#29992;&#30340;&#20449;&#24687;&#8212;&#20320;&#21487;&#20197;&#22312;&#25552;&#20132;&#20043;&#21069;&#65292;&#38656;&#35201;&#20351;&#29992;&#26356;&#26032;&#25805;&#20316;&#24471;&#21040;&#25991;&#20214;<code class="filename">README</code>&#30340;&#26356;&#26032;&#65292;&#25110;&#32773;&#35828;&#25991;&#20214;&#24050;&#32463;&#36807;&#26102;&#65292;&#29256;&#26412;&#24211;&#20250;&#25298;&#32477;&#20102;&#20320;&#30340;&#25552;&#20132;&#12290;&#65288;&#21518;&#38754;&#36824;&#26377;&#26356;&#22810;&#20851;&#20110;&#27492;&#20027;&#39064;&#65289;&#12290;</p><p>&#20851;&#20110;&#25991;&#20214;&#21644;&#30446;&#24405;&#65292;<span class="command"><strong>svn status</strong></span>&#21487;&#20197;&#27604;&#25105;&#20204;&#30340;&#23637;&#31034;&#26174;&#31034;&#26356;&#22810;&#30340;&#20869;&#23481;&#65292;&#23436;&#25972;&#30340;&#25551;&#36848;&#21487;&#20197;&#30475;<a class="xref" href="re29.html" title="svn status">svn status</a>&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.tour.cycle.examine.diff"></a>&#26816;&#26597;&#20320;&#30340;&#26412;&#22320;&#20462;&#25913;&#30340;&#35814;&#24773;</h4></div></div></div><p>&#21478;&#19968;&#31181;&#26816;&#26597;&#20462;&#25913;&#30340;&#26041;&#24335;&#26159;<span class="command"><strong>svn diff</strong></span>&#21629;&#20196;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#19981;&#24102;&#21442;&#25968;&#30340;<span class="command"><strong>svn diff</strong></span><span class="emphasis"><em>&#31934;&#30830;&#30340;</em></span>&#25214;&#20986;&#20320;&#25152;&#20570;&#30340;&#20462;&#25913;&#65292;&#36825;&#20250;&#36755;&#20986;<em class="firstterm">&#32479;&#19968;&#21306;&#21035;&#26684;&#24335;</em>&#30340;&#21306;&#21035;&#20449;&#24687;&#65306;</p><pre class="screen">
$ svn diff
Index: bar.c
===================================================================
--- bar.c	(revision 3)
+++ bar.c	(working copy)
@@ -1,7 +1,12 @@
+#include &lt;sys/types.h&gt;
+#include &lt;sys/stat.h&gt;
+#include &lt;unistd.h&gt;
+
+#include &lt;stdio.h&gt;

 int main(void) {
-  printf("Sixty-four slices of American Cheese...\n");
+  printf("Sixty-five slices of American Cheese...\n");
 return 0;
 }

Index: README
===================================================================
--- README	(revision 3)
+++ README	(working copy)
@@ -193,3 +193,4 @@
+Note to self:  pick up laundry.

Index: stuff/fish.c
===================================================================
--- stuff/fish.c	(revision 1)
+++ stuff/fish.c	(working copy)
-Welcome to the file known as 'fish'.
-Information on fish will be here soon.

Index: stuff/things/bloo.h
===================================================================
--- stuff/things/bloo.h	(revision 8)
+++ stuff/things/bloo.h	(working copy)
+Here is a new file to describe
+things about bloo.
</pre><p><span class="command"><strong>svn diff</strong></span>&#21629;&#20196;&#36890;&#36807;&#27604;&#36739;&#20320;&#30340;&#25991;&#20214;&#21644;<code class="filename">.svn</code>&#30340;&#8220;<span class="quote">&#21407;&#22987;</span>&#8221;&#25991;&#20214;&#26469;&#36755;&#20986;&#20449;&#24687;&#65292;&#39044;&#23450;&#35201;&#22686;&#21152;&#30340;&#25991;&#20214;&#20250;&#26174;&#31034;&#25152;&#26377;&#22686;&#21152;&#30340;&#25991;&#26412;&#65292;&#35201;&#21024;&#38500;&#30340;&#25991;&#20214;&#20250;&#26174;&#31034;&#25152;&#26377;&#35201;&#21024;&#38500;&#30340;&#25991;&#26412;&#12290;</p><p>&#36755;&#20986;&#30340;&#26684;&#24335;&#20026;&#32479;&#19968;&#21306;&#21035;&#26684;&#24335;&#65288;unified diff format&#65289;&#65292;&#21024;&#38500;&#30340;&#34892;&#21069;&#38754;&#21152;&#19968;&#20010;<code class="literal">-</code>&#65292;&#28155;&#21152;&#30340;&#34892;&#21069;&#38754;&#26377;&#19968;&#20010;<code class="literal">+</code>&#65292;<span class="command"><strong>svn diff</strong></span>&#21629;&#20196;&#20063;&#25171;&#21360;&#25991;&#20214;&#21517;&#21644;<span class="command"><strong>&#25171;&#34917;&#19969;</strong></span>&#38656;&#35201;&#30340;&#20449;&#24687;&#65292;&#25152;&#20197;&#20320;&#21487;&#20197;&#36890;&#36807;&#37325;&#23450;&#21521;&#19968;&#20010;&#21306;&#21035;&#25991;&#20214;&#26469;&#29983;&#25104;&#8220;<span class="quote">&#34917;&#19969;</span>&#8221;&#65306;</p><pre class="screen">
$ svn diff &gt; patchfile
</pre><p>&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#21487;&#20197;&#25226;&#34917;&#19969;&#25991;&#20214;&#21457;&#36865;&#37038;&#20214;&#21040;&#20854;&#20182;&#24320;&#21457;&#32773;&#65292;&#22312;&#25552;&#20132;&#20043;&#21069;&#23457;&#26680;&#21644;&#27979;&#35797;&#12290;</p><p>Subversion&#20351;&#29992;&#20869;&#32622;&#21306;&#21035;&#24341;&#25806;&#65292;&#32570;&#30465;&#24773;&#20917;&#19979;&#36755;&#20986;&#20026;&#32479;&#19968;&#21306;&#21035;&#26684;&#24335;&#12290;&#22914;&#26524;&#20320;&#26399;&#26395;&#19981;&#21516;&#30340;&#36755;&#20986;&#26684;&#24335;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<code class="option">--diff-cmd</code>&#25351;&#23450;&#22806;&#32622;&#30340;&#21306;&#21035;&#31243;&#24207;&#65292;&#24182;&#19988;&#36890;&#36807;<code class="option">--extensions</code>&#20256;&#36882;&#20854;&#20182;&#21442;&#25968;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#23519;&#30475;&#26412;&#22320;&#25991;&#20214;<code class="filename">foo.c</code>&#30340;&#21306;&#21035;&#65292;&#21516;&#26102;&#24573;&#30053;&#22823;&#23567;&#20889;&#24046;&#24322;&#65292;&#20320;&#21487;&#20197;&#36816;&#34892;<span class="command"><strong>svn diff --diff-cmd /usr/bin/diff --extensions '-bc' foo.c</strong></span>&#12290;</p></div></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.tour.cycle.revert"></a>&#21462;&#28040;&#26412;&#22320;&#20462;&#25913;</h3></div></div></div><p>&#20551;&#23450;&#25105;&#20204;&#22312;&#30475;<span class="command"><strong>svn diff</strong></span>&#30340;&#36755;&#20986;&#65292;&#20320;&#21457;&#29616;&#23545;&#26576;&#20010;&#25991;&#20214;&#30340;&#25152;&#26377;&#20462;&#25913;&#37117;&#26159;&#38169;&#35823;&#30340;&#65292;&#25110;&#35768;&#20320;&#26681;&#26412;&#19981;&#24212;&#35813;&#20462;&#25913;&#36825;&#20010;&#25991;&#20214;&#65292;&#25110;&#32773;&#26159;&#20174;&#24320;&#22836;&#37325;&#26032;&#20462;&#25913;&#20250;&#26356;&#21152;&#23481;&#26131;&#12290;</p><p>&#36825;&#26159;&#20351;&#29992;<span class="command"><strong>svn revert</strong></span>&#30340;&#22909;&#26426;&#20250;&#65306;</p><pre class="screen">
$ svn revert README
Reverted 'README'
</pre><p>Subversion&#25226;&#25991;&#20214;&#24674;&#22797;&#21040;&#26410;&#20462;&#25913;&#30340;&#29366;&#24577;&#65292;&#21483;&#20570;<code class="filename">.svn</code>&#30446;&#24405;&#30340;&#8220;<span class="quote">&#21407;&#22987;</span>&#8221;&#25335;&#36125;&#65292;&#24212;&#35813;&#30693;&#36947;<span class="command"><strong>svn revert</strong></span>&#21487;&#20197;&#24674;&#22797;&#20219;&#20309;&#39044;&#23450;&#35201;&#20570;&#30340;&#25805;&#20316;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#19981;&#20877;&#24819;&#28155;&#21152;&#19968;&#20010;&#25991;&#20214;&#65306;</p><pre class="screen">
$ svn status foo
?      foo

$ svn add foo
A         foo

$ svn revert foo
Reverted 'foo'

$ svn status foo
?      foo
</pre><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3><p><span class="command"><strong>svn revert</strong></span><em class="replaceable"><code>ITEM</code></em>&#30340;&#25928;&#26524;&#19982;&#21024;&#38500;<em class="replaceable"><code>ITEM</code></em>&#28982;&#21518;&#25191;&#34892;<span class="command"><strong>svn update -r BASE</strong></span><em class="replaceable"><code>ITEM</code></em>&#23436;&#20840;&#19968;&#26679;&#65292;&#20294;&#26159;&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;<span class="command"><strong>svn revert</strong></span>&#23427;&#19981;&#24517;&#36890;&#30693;&#29256;&#26412;&#24211;&#23601;&#21487;&#20197;&#24674;&#22797;&#25991;&#20214;&#12290;</p></div><p>&#25110;&#35768;&#20320;&#19981;&#23567;&#24515;&#21024;&#38500;&#20102;&#19968;&#20010;&#25991;&#20214;&#65306;</p><pre class="screen">
$ svn status README
       README

$ svn delete README
D         README

$ svn revert README
Reverted 'README'

$ svn status README
       README
</pre></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.tour.cycle.resolve"></a>&#35299;&#20915;&#20914;&#31361;&#65288;&#21512;&#24182;&#21035;&#20154;&#30340;&#20462;&#25913;&#65289;</h3></div></div></div><p>&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn status -u</strong></span>&#26469;&#39044;&#27979;&#20914;&#31361;&#65292;&#24403;&#20320;&#36816;&#34892;<span class="command"><strong>svn update</strong></span>&#19968;&#20123;&#26377;&#36259;&#30340;&#20107;&#24773;&#21457;&#29983;&#20102;&#65306;</p><pre class="screen">
$ svn update
U  INSTALL
G  README
Conflict discovered in 'bar.c.
Select: (p)ostpone, (d)iff, (e)dit, (h)elp for more options :
</pre><p><code class="computeroutput">U</code>&#21644;<code class="computeroutput">G</code>&#27809;&#24517;&#35201;&#20851;&#24515;&#65292;&#25991;&#20214;&#24178;&#20928;&#30340;&#25509;&#21463;&#20102;&#29256;&#26412;&#24211;&#30340;&#21464;&#21270;&#65292;&#25991;&#20214;&#26631;&#31034;&#20026;<code class="computeroutput">U</code>&#34920;&#26126;&#26412;&#22320;&#27809;&#26377;&#20462;&#25913;&#65292;&#25991;&#20214;&#24050;&#32463;&#26681;&#25454;&#29256;&#26412;&#24211;&#26356;&#26032;&#12290;<code class="computeroutput">G</code>&#26631;&#31034;&#21512;&#24182;&#65292;&#26631;&#31034;&#26412;&#22320;&#24050;&#32463;&#20462;&#25913;&#36807;&#65292;&#19982;&#29256;&#26412;&#24211;&#27809;&#26377;&#37325;&#36845;&#30340;&#22320;&#26041;&#65292;&#24050;&#32463;&#21512;&#24182;&#12290;</p><p>But the next line is part of a feature new in Subversion
        1.5 called interactive conflict resolution.  This means that
        the changes from the server overlapped with your own, and you
        have the opportunity to resolve this conflict.  The most
        commonly used options are displayed, but you can see all of
        the options by typing <em class="replaceable"><code>h</code></em>: </p><pre class="screen">
...
  (p)ostpone - mark the conflict to be resolved later
  (d)iff     - show all changes made to merged file
  (e)dit     - change merged file in an editor
  (r)esolved - accept merged version of file
  (m)ine     - accept my version of file
  (t)heirs   - accept their version of file
  (l)aunch   - use third-party tool to resolve conflict
  (h)elp     - show this list
</pre><p>Let's briefly review each of these options before we go
        into detail on what each option means.</p><div class="variablelist"><dl><dt><span class="term">
              <code class="computeroutput">(p)ostpone</code>
            </span></dt><dd><p>Leaves the file in a conflicted state for you to
            resolve after your update is complete.</p></dd><dt><span class="term">
              <code class="computeroutput">(d)iff</code>
            </span></dt><dd><p>Display the differences between the base revision
            and the conflicted file itself in unified diff format.</p></dd><dt><span class="term">
              <code class="computeroutput">(e)dit</code>
            </span></dt><dd><p>Open the file in conflict with your favorite editor,
              as set in the environment variable
              <code class="literal">EDITOR</code>.</p></dd><dt><span class="term">
              <code class="computeroutput">(r)esolved</code>
            </span></dt><dd><p>After editing a file, choosing this command tells
              <span class="command"><strong>svn</strong></span> that you've resolved the
              conflicts in the file and that it should accept the
              current contents&#8212;basically that you've
              &#8220;<span class="quote">resolved</span>&#8221; the conflict.</p></dd><dt><span class="term">
              <code class="computeroutput">(m)ine</code>
            </span></dt><dd><p>Discard the newly received changes from the server
              and use only your local changes for the file under review.</p></dd><dt><span class="term">
              <code class="computeroutput">(t)heirs</code>
            </span></dt><dd><p>Discard your local changes to the file under review
              and use only the newly received changes from the
              server.</p></dd><dt><span class="term">
              <code class="computeroutput">(l)aunch</code>
            </span></dt><dd><p>Launch an external program to perform the conflict
            resolution.  This requires a bit of preparation
            beforehand.</p></dd><dt><span class="term">
              <code class="computeroutput">(h)elp</code>
            </span></dt><dd><p>Shows the list of all possible commands you can use
            in interactive conflict resolution.</p></dd></dl></div><p>We'll cover these commands in more detail now, grouping
        them together by related functionality.</p><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.tour.cycle.resolve.diff"></a>Viewing Conflict Differences Interactively</h4></div></div></div><p>Before deciding how to attack a conflict interactively,
          odds are that you'd like to see what exactly is in conflict,
          and the diff command (<span class="command"><strong>d</strong></span>) is what you'll
          use for this:</p><pre class="screen">
...
Select: (p)ostpone, (d)iff, (e)dit, (h)elp for more options : d
--- .svn/text-base/sandwich.txt.svn-base      Tue Dec 11 21:33:57 2007
+++ .svn/tmp/tempfile.32.tmp     Tue Dec 11 21:34:33 2007
@@ -1 +1,5 @@
-Just buy a sandwich.
+&lt;&lt;&lt;&lt;&lt;&lt;&lt; .mine
+Go pickup a cheesesteak.
+=======
+Bring me a taco!
+&gt;&gt;&gt;&gt;&gt;&gt;&gt; .r32
...
</pre><p>The first line of the diff content shows the previous
          contents of the working copy (the <code class="literal">BASE</code>
          revision), the next content line is your change, and the
          last content line is the change that was just received from
          the server (<span class="emphasis"><em>usually</em></span> the
          <code class="literal">HEAD</code> revision).  With this information in
          hand, you're ready to move on to the next action.</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.tour.cycle.resolve.resolve"></a>Resolving Conflict Differences Interactively</h4></div></div></div><p>There are four different ways to resolve conflicts
          interactively&#8212;two of which allow you to selectively
          merge and edit changes, and two of which allow you to simply
          pick a version of the file and move along.</p><p>If you wish to choose some combination of your local
          changes, you can use the &#8220;<span class="quote">edit</span>&#8221; command
          (<span class="command"><strong>e</strong></span>) to manually edit the file with
          conflict markers in a text editor (determined by the
          <code class="literal">EDITOR</code> environment variable).  Editing
          the file by hand in your favorite text editor is a somewhat
          low-tech way of remedying conflicts (see <a class="xref" href="ch02s04.html#svn.tour.cycle.resolve.byhand" title="&#25163;&#24037;&#21512;&#24182;&#20914;&#31361;">&#8220;&#25163;&#24037;&#21512;&#24182;&#20914;&#31361;&#8221;&#19968;&#33410;</a> for a
          walkthrough), so some people like to use fancy graphical
          merge tools instead.</p><p>In order to use a merge tool, you need to either set the
          <code class="literal">SVN_MERGE</code> environment variable, or define
          the <code class="literal">merge-tool-cmd</code> option in your
          Subversion configuration file (see <a class="xref" href="ch07.html#svn.advanced.confarea.opts" title="&#37197;&#32622;&#36873;&#39033;">&#8220;&#37197;&#32622;&#36873;&#39033;&#8221;&#19968;&#33410;</a> for more details).
          Subversion will pass four arguments to the merge tool: The
          <code class="literal">BASE</code> revision of the file, the revision
          of the file received from the server as part of the update,
          the copy of the file containing your local edits, and
          lastly, the merged copy of the file (which contains conflict
          markers).  If your merge tool is expecting arguments in a
          different order or format, you'll need to write a wrapper
          script for Subversion to invoke.  After you've edited the
          file, if you're satisfied with the changes you've made, you
          can tell Subversion that the edited file is no longer in
          conflict by using the &#8220;<span class="quote">resolved</span>&#8221; command
          (<code class="literal">r</code>).</p><p>If you decide that you don't need to merge any changes,
          but just want to accept one version of the file or the
          other, you can either choose your changes (aka
          &#8220;<span class="quote">mine</span>&#8221;) by using the &#8220;<span class="quote">mine</span>&#8221;
          command (<span class="command"><strong>m</strong></span>) or choose theirs by using the
          &#8220;<span class="quote">theirs</span>&#8221; command (<span class="command"><strong>t</strong></span>).</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.tour.cycle.resolve.pending"></a>Postponing Conflict Resolution</h4></div></div></div><p>This may sound like an appropriate section for avoiding
          marital disagreements, but it's actually still about
          Subversion, so read on.  If you're doing an update and
          encounter a conflict that you're not prepared to review or
          resolve, you can type <span class="command"><strong>p</strong></span> to postpone
          resolving a conflict on a file-by-file basis when you run
          <span class="command"><strong>svn update</strong></span>.  If you're running an update
          and don't want to resolve any conflicts, you can pass the
          <code class="option">--non-interactive</code> option to <span class="command"><strong>svn
          update</strong></span> and any file in conflict will be marked
          with a <code class="computeroutput">C</code>
          automatically.</p><p>The <code class="computeroutput">C</code> stands for
          <code class="computeroutput">c</code>onflict.  This means that
          the changes from the server overlapped with your own, and
          now you have to manually choose between them after the
          update has completed.  When you postpone a conflict
          resolution, <span class="command"><strong>svn</strong></span> typically does three
          things to assist you in noticing and resolving that
          conflict:</p><div class="itemizedlist"><ul type="disc"><li><p>Subversion&#22312;&#26356;&#26032;&#26102;&#25171;&#21360;<code class="computeroutput">C</code>&#26631;&#35760;&#65292;&#24182;&#19988;&#26631;&#35760;&#36825;&#20010;&#25991;&#20214;&#24050;&#20914;&#31361;&#12290;</p></li><li><p>&#22914;&#26524;Subversion&#35748;&#20026;&#36825;&#20010;&#25991;&#20214;&#26159;&#21487;&#21512;&#24182;&#30340;&#65292;&#23427;&#20250;&#32622;&#20837;<em class="firstterm">&#20914;&#31361;&#26631;&#35760;</em>&#8212;&#29305;&#27530;&#30340;&#27178;&#32447;&#20998;&#24320;&#20914;&#31361;&#30340;&#8220;<span class="quote">&#20004;&#38754;</span>&#8221;&#8212;&#22312;&#25991;&#20214;&#37324;&#21487;&#35270;&#21270;&#30340;&#25551;&#36848;&#37325;&#21472;&#30340;&#37096;&#20998;&#65288;Subversion&#20351;&#29992;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#26469;&#20915;&#23450;&#19968;&#20010;&#25991;&#20214;&#26159;&#21542;&#21487;&#20197;&#20351;&#29992;&#19978;&#19979;&#25991;&#30340;&#65292;&#20197;&#34892;&#20026;&#22522;&#30784;&#30340;&#21512;&#24182;&#65292;&#26356;&#22810;&#20449;&#24687;&#21487;&#20197;&#30475;<a class="xref" href="ch03s03.html#svn.advanced.props.special.mime-type" title="&#25991;&#20214;&#20869;&#23481;&#31867;&#22411;">&#8220;&#25991;&#20214;&#20869;&#23481;&#31867;&#22411;&#8221;&#19968;&#33410;</a>&#12290;&#65289;</p></li><li><p>&#23545;&#20110;&#27599;&#19968;&#20010;&#20914;&#31361;&#30340;&#25991;&#20214;&#65292;Subversion&#25918;&#32622;&#19977;&#20010;&#39069;&#22806;&#30340;&#26410;&#29256;&#26412;&#21270;&#25991;&#20214;&#21040;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65306;</p><div class="variablelist"><dl><dt><span class="term">
                    <code class="filename">filename.mine</code>
                  </span></dt><dd><p>&#20320;&#26356;&#26032;&#21069;&#30340;&#25991;&#20214;&#65292;&#27809;&#26377;&#20914;&#31361;&#26631;&#24535;&#65292;&#21482;&#26159;&#20320;&#26368;&#26032;&#26356;&#25913;&#30340;&#20869;&#23481;&#12290;&#65288;&#22914;&#26524;Subversion&#35748;&#20026;&#36825;&#20010;&#25991;&#20214;&#19981;&#21487;&#20197;&#21512;&#24182;&#65292;<code class="filename">.mine</code>&#25991;&#20214;&#19981;&#20250;&#21019;&#24314;&#65292;&#22240;&#20026;&#23427;&#21644;&#24037;&#20316;&#25991;&#20214;&#30456;&#21516;&#12290;&#65289;</p></dd><dt><span class="term">
                    <code class="filename">filename.rOLDREV</code>
                  </span></dt><dd><p>&#36825;&#26159;&#20320;&#30340;&#20570;&#26356;&#26032;&#25805;&#20316;&#20197;&#21069;&#30340;<code class="literal">BASE</code>&#29256;&#26412;&#25991;&#20214;&#65292;&#23601;&#26159;&#20320;&#22312;&#19978;&#27425;&#26356;&#26032;&#20043;&#21518;&#26410;&#20316;&#26356;&#25913;&#30340;&#29256;&#26412;&#12290;</p></dd><dt><span class="term">
                    <code class="filename">filename.rNEWREV</code>
                  </span></dt><dd><p>&#36825;&#26159;&#20320;&#30340;Subversion&#23458;&#25143;&#31471;&#20174;&#26381;&#21153;&#22120;&#21018;&#21018;&#25910;&#21040;&#30340;&#29256;&#26412;&#65292;&#36825;&#20010;&#25991;&#20214;&#23545;&#24212;&#29256;&#26412;&#24211;&#30340;<code class="literal">HEAD</code>&#29256;&#26412;&#12290;</p></dd></dl></div><p>&#36825;&#37324;<code class="literal">OLDREV</code>&#26159;&#20320;&#30340;<code class="filename">.svn</code>&#30446;&#24405;&#20013;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#65292;<code class="literal">NEWREV</code>&#26159;&#29256;&#26412;&#24211;&#20013;<code class="literal">HEAD</code>&#30340;&#29256;&#26412;&#21495;&#12290;</p></li></ul></div><p>For example, Sally makes changes to the file
          <code class="filename">sandwich.txt</code> in the repository.  Harry has
          just changed the file in his working copy and checked it in.
          Sally updates her working copy before checking in and she gets
          a conflict, which she postpones:</p><pre class="screen">
$ svn update
Conflict discovered in 'sandwich.txt'.
Select: (p)ostpone, (d)iff, (e)dit, (h)elp for more options : p
C  sandwich.txt
Updated to revision 2.
$ ls -1
sandwich.txt
sandwich.txt.mine
sandwich.txt.r1
sandwich.txt.r2
</pre><p>At this point, Subversion will <span class="emphasis"><em>not</em></span>
          allow Sally to commit the file
          <code class="filename">sandwich.txt</code> until the three temporary
          files are removed.</p><pre class="screen">
$ svn commit -m "Add a few more things"
svn: Commit failed (details follow):
svn: Aborting commit: '/home/sally/svn-work/sandwich.txt' remains in conflict
</pre><p>If you've postponed a conflict, you need to do one of three
          things:</p><div class="itemizedlist"><ul type="disc"><li><p>&#8220;<span class="quote">&#25163;&#21160;</span>&#8221;&#21512;&#24182;&#20914;&#31361;&#25991;&#26412;&#65288;&#26816;&#26597;&#21644;&#20462;&#25913;&#25991;&#20214;&#20013;&#30340;&#20914;&#31361;&#26631;&#24535;&#65289;&#12290;</p></li><li><p>&#29992;&#26576;&#19968;&#20010;&#20020;&#26102;&#25991;&#20214;&#35206;&#30422;&#20320;&#30340;&#24037;&#20316;&#25991;&#20214;&#12290;</p></li><li><p>&#36816;&#34892;<span class="command"><strong>svn revert &lt;filename&gt;</strong></span>&#26469;&#25918;&#24323;&#25152;&#26377;&#30340;&#26412;&#22320;&#20462;&#25913;&#12290;</p></li></ul></div><p>&#19968;&#26086;&#20320;&#35299;&#20915;&#20102;&#20914;&#31361;&#65292;&#20320;&#38656;&#35201;&#36890;&#36807;&#21629;&#20196;<span class="command"><strong>svn resolved</strong></span>&#35753;Subversion&#30693;&#36947;&#65292;&#36825;&#26679;&#23601;&#20250;&#21024;&#38500;&#19977;&#20010;&#20020;&#26102;&#25991;&#20214;&#65292;Subversion&#23601;&#19981;&#20250;&#35748;&#20026;&#36825;&#20010;&#25991;&#20214;&#26159;&#22312;&#20914;&#31361;&#29366;&#24577;&#20102;&#12290;<sup>[<a name="d0e2849" href="#ftn.d0e2849" class="footnote">6</a>]</sup></p><pre class="screen">
$ svn resolved sandwich.txt
Resolved conflicted state of 'sandwich.txt'
</pre></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.tour.cycle.resolve.byhand"></a>&#25163;&#24037;&#21512;&#24182;&#20914;&#31361;</h4></div></div></div><p>&#31532;&#19968;&#27425;&#23581;&#35797;&#35299;&#20915;&#20914;&#31361;&#35753;&#20154;&#24863;&#35273;&#24456;&#23475;&#24597;&#65292;&#20294;&#32463;&#36807;&#19968;&#28857;&#35757;&#32451;&#65292;&#23427;&#31616;&#21333;&#30340;&#20687;&#26159;&#39569;&#30528;&#36710;&#23376;&#19979;&#22369;&#12290;</p><p>&#36825;&#37324;&#19968;&#20010;&#31616;&#21333;&#30340;&#20363;&#23376;&#65292;&#30001;&#20110;&#19981;&#33391;&#30340;&#20132;&#27969;&#65292;&#20320;&#21644;&#21516;&#20107;Sally&#65292;&#21516;&#26102;&#32534;&#36753;&#20102;<code class="filename">sandwich.txt</code>&#12290;Sally&#25552;&#20132;&#20102;&#20462;&#25913;&#65292;&#24403;&#20320;&#20934;&#22791;&#26356;&#26032;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#20914;&#31361;&#21457;&#29983;&#20102;&#65292;&#25105;&#20204;&#19981;&#24471;&#19981;&#21435;&#20462;&#25913;<code class="filename">sandwich.txt</code>&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;&#39318;&#20808;&#65292;&#30475;&#19968;&#19979;&#36825;&#20010;&#25991;&#20214;&#65306;</p><pre class="screen">
$ cat sandwich.txt
Top piece of bread
Mayonnaise
Lettuce
Tomato
Provolone
&lt;&lt;&lt;&lt;&lt;&lt;&lt; .mine
Salami
Mortadella
Prosciutto
=======
Sauerkraut
Grilled Chicken
&gt;&gt;&gt;&gt;&gt;&gt;&gt; .r2
Creole Mustard
Bottom piece of bread
</pre><p>&#23567;&#20110;&#21495;&#12289;&#31561;&#20110;&#21495;&#21644;&#22823;&#20110;&#21495;&#20018;&#26159;&#20914;&#31361;&#26631;&#35760;&#65292;&#24182;&#19981;&#26159;&#20914;&#31361;&#30340;&#25968;&#25454;&#65292;&#20320;&#19968;&#23450;&#35201;&#30830;&#23450;&#36825;&#20123;&#20869;&#23481;&#22312;&#19979;&#27425;&#25552;&#20132;&#20043;&#21069;&#24471;&#21040;&#21024;&#38500;&#65292;&#21069;&#20004;&#32452;&#26631;&#24535;&#20013;&#38388;&#30340;&#20869;&#23481;&#26159;&#20320;&#22312;&#20914;&#31361;&#21306;&#25152;&#20570;&#30340;&#20462;&#25913;&#65306;</p><pre class="screen">
&lt;&lt;&lt;&lt;&lt;&lt;&lt; .mine
Salami
Mortadella
Prosciutto
=======
</pre><p>&#21518;&#20004;&#32452;&#20043;&#38388;&#30340;&#26159;Sally&#25552;&#20132;&#30340;&#20462;&#25913;&#20914;&#31361;&#65306;</p><pre class="screen">
=======
Sauerkraut
Grilled Chicken
&gt;&gt;&gt;&gt;&gt;&gt;&gt; .r2
</pre><p>&#36890;&#24120;&#20320;&#24182;&#19981;&#24076;&#26395;&#21482;&#26159;&#21024;&#38500;&#20914;&#31361;&#26631;&#24535;&#21644;Sally&#30340;&#20462;&#25913;&#8212;&#24403;&#22905;&#25910;&#21040;&#19977;&#26126;&#27835;&#26102;&#65292;&#20250;&#38750;&#24120;&#30340;&#21507;&#24778;&#12290;&#25152;&#20197;&#20320;&#24212;&#35813;&#36208;&#21040;&#22905;&#30340;&#21150;&#20844;&#23460;&#25110;&#26159;&#25343;&#36215;&#30005;&#35805;&#21578;&#35785;Sally&#65292;&#20320;&#27809;&#21150;&#27861;&#20174;&#20174;&#24847;&#22823;&#21033;&#29087;&#39135;&#24215;&#24471;&#21040;&#24819;&#35201;&#30340;&#27873;&#33756;&#12290;<sup>[<a name="d0e2881" href="#ftn.d0e2881" class="footnote">7</a>]</sup>&#19968;&#26086;&#20320;&#20204;&#30830;&#35748;&#20102;&#25552;&#20132;&#20869;&#23481;&#21518;&#65292;&#20462;&#25913;&#25991;&#20214;&#24182;&#19988;&#21024;&#38500;&#20914;&#31361;&#26631;&#24535;&#12290;</p><pre class="screen">
Top piece of bread
Mayonnaise
Lettuce
Tomato
Provolone
Salami
Mortadella
Prosciutto
Creole Mustard
Bottom piece of bread
</pre><p>&#29616;&#22312;&#36816;&#34892;<span class="command"><strong>svn resolved</strong></span>&#65292;&#20320;&#24050;&#32463;&#20934;&#22791;&#22909;&#25552;&#20132;&#20102;&#65306;</p><pre class="screen">
$ svn resolved sandwich.txt
$ svn commit -m "Go ahead and use my sandwich, discarding Sally's edits."
</pre><p>&#29616;&#22312;&#25105;&#20204;&#20934;&#22791;&#22909;&#25552;&#20132;&#20462;&#25913;&#20102;&#65292;&#27880;&#24847;<span class="command"><strong>svn resolved</strong></span>&#19981;&#20687;&#25105;&#20204;&#26412;&#31456;&#23398;&#36807;&#30340;&#20854;&#20182;&#21629;&#20196;&#19968;&#26679;&#38656;&#35201;&#21442;&#25968;&#65292;&#22312;&#20219;&#20309;&#20320;&#35748;&#20026;&#35299;&#20915;&#20102;&#20914;&#31361;&#30340;&#26102;&#20505;&#65292;&#21482;&#38656;&#35201;&#23567;&#24515;&#36816;&#34892;<span class="command"><strong>svn resolved</strong></span>&#65292;&#8212;&#19968;&#26086;&#21024;&#38500;&#20102;&#20020;&#26102;&#25991;&#20214;&#65292;Subversion&#20250;&#35753;&#20320;&#25552;&#20132;&#36825;&#25991;&#20214;&#65292;&#21363;&#20351;&#25991;&#20214;&#20013;&#36824;&#23384;&#22312;&#20914;&#31361;&#26631;&#35760;&#12290;</p><p>&#35760;&#20303;&#65292;&#22914;&#26524;&#20320;&#20462;&#25913;&#20914;&#31361;&#26102;&#24863;&#21040;&#28151;&#20081;&#65292;&#20320;&#21487;&#20197;&#21442;&#32771;subversion&#29983;&#25104;&#30340;&#19977;&#20010;&#25991;&#20214;&#8212;&#21253;&#25324;&#20320;&#26410;&#20316;&#26356;&#26032;&#30340;&#25991;&#20214;&#12290;&#20320;&#20063;&#21487;&#20197;&#20351;&#29992;&#19977;&#26041;&#20132;&#20114;&#21512;&#24182;&#24037;&#20855;&#26816;&#39564;&#36825;&#19977;&#20010;&#25991;&#20214;&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.tour.cycle.resolve.copyover"></a>&#22797;&#21046;&#25991;&#20214;&#21040;&#20320;&#30340;&#24037;&#20316;&#25991;&#20214;</h4></div></div></div><p>&#22914;&#26524;&#20320;&#21482;&#26159;&#24076;&#26395;&#21462;&#28040;&#20320;&#30340;&#20462;&#25913;&#65292;&#20320;&#21487;&#20197;&#20165;&#20165;&#25335;&#36125;Subversion&#20026;&#20320;&#29983;&#25104;&#30340;&#25991;&#20214;&#26367;&#25442;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65306;</p><pre class="screen">
$ svn update
C  sandwich.txt
Updated to revision 2.
$ ls sandwich.*
sandwich.txt  sandwich.txt.mine  sandwich.txt.r2  sandwich.txt.r1
$ cp sandwich.txt.r2 sandwich.txt
$ svn resolved sandwich.txt
</pre></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.tour.cycle.resolve.revert"></a>&#33050;&#27880;&#65306;&#20351;&#29992;<span class="command"><strong>svn revert</strong></span></h4></div></div></div><p>&#22914;&#26524;&#20320;&#24471;&#21040;&#20914;&#31361;&#65292;&#32463;&#36807;&#26816;&#26597;&#20320;&#20915;&#23450;&#21462;&#28040;&#33258;&#24049;&#30340;&#20462;&#25913;&#24182;&#19988;&#37325;&#26032;&#32534;&#36753;&#65292;&#20320;&#21487;&#20197;&#24674;&#22797;&#20320;&#30340;&#20462;&#25913;&#65306;</p><pre class="screen">
$ svn revert sandwich.txt
Reverted 'sandwich.txt'
$ ls sandwich.*
sandwich.txt
</pre><p>&#27880;&#24847;&#65292;&#24403;&#20320;&#24674;&#22797;&#19968;&#20010;&#20914;&#31361;&#30340;&#25991;&#20214;&#26102;&#65292;&#19981;&#38656;&#35201;&#20877;&#36816;&#34892;<span class="command"><strong>svn resolved</strong></span>&#12290;</p></div></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.tour.cycle.commit"></a>&#25552;&#20132;&#20320;&#30340;&#20462;&#25913;</h3></div></div></div><p>&#26368;&#21518;&#65281;&#20320;&#30340;&#20462;&#25913;&#32467;&#26463;&#20102;&#65292;&#20320;&#21512;&#24182;&#20102;&#26381;&#21153;&#22120;&#19978;&#25152;&#26377;&#30340;&#20462;&#25913;&#65292;&#20320;&#20934;&#22791;&#22909;&#25552;&#20132;&#20462;&#25913;&#21040;&#29256;&#26412;&#24211;&#12290;</p><p><span class="command"><strong>svn commit</strong></span>&#21629;&#20196;&#21457;&#36865;&#25152;&#26377;&#30340;&#20462;&#25913;&#21040;&#29256;&#26412;&#24211;&#65292;&#24403;&#20320;&#25552;&#20132;&#20462;&#25913;&#26102;&#65292;&#20320;&#38656;&#35201;&#25552;&#20379;&#19968;&#20123;&#25551;&#36848;&#20462;&#25913;&#30340;<em class="firstterm">&#26085;&#24535;&#20449;&#24687;</em>&#65292;&#20320;&#30340;&#20449;&#24687;&#20250;&#38468;&#21040;&#36825;&#20010;&#20462;&#35746;&#29256;&#26412;&#19978;&#65292;&#22914;&#26524;&#20449;&#24687;&#24456;&#31616;&#30701;&#65292;&#20320;&#21487;&#20197;&#22312;&#21629;&#20196;&#34892;&#20013;&#20351;&#29992;<code class="option">--message</code>&#65288;&#25110;<code class="option">-m</code>&#65289;&#36873;&#39033;&#65306;</p><pre class="screen">
$ svn commit -m "Corrected number of cheese slices."
Sending        sandwich.txt
Transmitting file data .
Committed revision 3.
</pre><p>&#28982;&#32780;&#65292;&#22914;&#26524;&#20320;&#25226;&#20889;&#26085;&#24535;&#20449;&#24687;&#24403;&#20316;&#24037;&#20316;&#30340;&#19968;&#37096;&#20998;&#65292;&#20320;&#20063;&#35768;&#20250;&#24076;&#26395;&#21578;&#35785;Subversion&#36890;&#36807;&#19968;&#20010;&#25991;&#20214;&#21517;&#24471;&#21040;&#26085;&#24535;&#20449;&#24687;&#65292;&#20351;&#29992;<code class="option">--file</code>&#36873;&#39033;&#65306;</p><pre class="screen">
$ svn commit -F logmsg
Sending        sandwich.txt
Transmitting file data .
Committed revision 4.
</pre><p>&#22914;&#26524;&#20320;&#27809;&#26377;&#25351;&#23450;<code class="option">--message</code>&#25110;&#32773;<code class="option">--file</code>&#36873;&#39033;&#65292;Subversion&#20250;&#33258;&#21160;&#22320;&#21551;&#21160;&#20320;&#26368;&#21916;&#27426;&#30340;&#32534;&#36753;&#22120;&#65288;&#35265;<a class="xref" href="ch07.html#svn.advanced.confarea.opts.config" title="&#37197;&#32622;">&#8220;&#37197;&#32622;&#8221;&#19968;&#33410;</a>&#30340;<code class="literal">editor-cmd</code>&#37096;&#20998;&#65289;&#26469;&#32534;&#36753;&#26085;&#24535;&#20449;&#24687;&#12290;</p><div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3><p>&#22914;&#26524;&#20320;&#20351;&#29992;&#32534;&#36753;&#22120;&#25776;&#20889;&#26085;&#24535;&#20449;&#24687;&#26102;&#24076;&#26395;&#21462;&#28040;&#25552;&#20132;&#65292;&#20320;&#21487;&#20197;&#30452;&#25509;&#20851;&#25481;&#32534;&#36753;&#22120;&#65292;&#19981;&#35201;&#20445;&#23384;&#65292;&#22914;&#26524;&#20320;&#24050;&#32463;&#20570;&#36807;&#20445;&#23384;&#65292;&#21482;&#35201;&#31616;&#21333;&#30340;&#21024;&#25481;&#25152;&#26377;&#30340;&#25991;&#26412;&#24182;&#20877;&#27425;&#20445;&#23384;&#65292;&#28982;&#21518;&#36864;&#20986;&#12290;</p><pre class="screen">
$ svn commit
Waiting for Emacs...Done

Log message unchanged or not specified
a)bort, c)ontinue, e)dit
a
$
</pre></div><p>&#29256;&#26412;&#24211;&#19981;&#30693;&#36947;&#20063;&#19981;&#20851;&#24515;&#20320;&#30340;&#20462;&#25913;&#20316;&#20026;&#19968;&#20010;&#25972;&#20307;&#26159;&#21542;&#26377;&#24847;&#20041;&#65292;&#23427;&#21482;&#26816;&#26597;&#26159;&#21542;&#26377;&#20854;&#20182;&#20154;&#20462;&#25913;&#20102;&#21516;&#19968;&#20010;&#25991;&#20214;&#65292;&#22914;&#26524;&#21035;&#20154;<span class="emphasis"><em>&#24050;&#32463;</em></span>&#36825;&#26679;&#20570;&#20102;&#65292;&#20320;&#30340;&#25972;&#20010;&#25552;&#20132;&#20250;&#22833;&#36133;&#65292;&#24182;&#19988;&#25552;&#31034;&#20320;&#19968;&#20010;&#25110;&#22810;&#20010;&#25991;&#20214;&#24050;&#32463;&#36807;&#26102;&#20102;&#65306;</p><pre class="screen">
$ svn commit -m "Add another rule"
Sending        rules.txt
svn: Commit failed (details follow):
svn: Your file or directory 'sandwich.txt' is probably out-of-date
&#8230;
</pre><p>&#65288;&#38169;&#35823;&#20449;&#24687;&#30340;&#31934;&#30830;&#25514;&#36766;&#20381;&#36182;&#20110;&#32593;&#32476;&#21327;&#35758;&#21644;&#20320;&#20351;&#29992;&#30340;&#26381;&#21153;&#22120;&#65292;&#20294;&#23545;&#20110;&#25152;&#26377;&#30340;&#24773;&#20917;&#65292;&#20854;&#24605;&#24819;&#23436;&#20840;&#19968;&#26679;&#12290;&#65289;</p><p>&#27492;&#21051;&#65292;&#20320;&#38656;&#35201;&#36816;&#34892;<span class="command"><strong>svn update</strong></span>&#26469;&#22788;&#29702;&#25152;&#26377;&#30340;&#21512;&#24182;&#21644;&#20914;&#31361;&#65292;&#28982;&#21518;&#20877;&#23581;&#35797;&#25552;&#20132;&#12290;</p><p>&#25105;&#20204;&#24050;&#32463;&#35206;&#30422;&#20102;Subversion&#22522;&#26412;&#30340;&#24037;&#20316;&#21608;&#26399;&#65292;&#36824;&#26377;&#35768;&#22810;&#20854;&#23427;&#29305;&#24615;&#21487;&#20197;&#31649;&#29702;&#20320;&#24471;&#29256;&#26412;&#24211;&#21644;&#24037;&#20316;&#25335;&#36125;&#65292;&#20294;&#26159;&#21482;&#20351;&#29992;&#21069;&#38754;&#20171;&#32461;&#30340;&#21629;&#20196;&#20320;&#23601;&#21487;&#20197;&#24456;&#36827;&#34892;&#26085;&#24120;&#24037;&#20316;&#20102;&#65292;&#25105;&#20204;&#36824;&#20250;&#35206;&#30422;&#26356;&#22810;&#29992;&#30340;&#36824;&#31639;&#39057;&#32321;&#30340;&#21629;&#20196;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d0e2060" href="#d0e2060" class="para">4</a>] </sup>Of course, nothing is ever totally
              deleted from the repository&#8212;just from the
              <code class="literal">HEAD</code> of the repository.  You can get
              back anything you delete by checking out (or updating
              your working copy to) a revision earlier than the one in
              which you deleted it. Also see
              <a class="xref" href="ch04s04.html#svn.branchmerge.advanced.resurrect" title="&#25214;&#22238;&#21024;&#38500;&#30340;&#39033;&#30446;">&#8220;&#25214;&#22238;&#21024;&#38500;&#30340;&#39033;&#30446;&#8221;&#19968;&#33410;</a>.
            </p></div><div class="footnote"><p><sup>[<a name="ftn.d0e2194" href="#d0e2194" class="para">5</a>] </sup>&#32780;&#19988;&#20320;&#20063;&#27809;&#26377;WAN&#21345;&#65292;&#32771;&#34385;&#21040;&#20320;&#24471;&#21040;&#25105;&#20204;&#65292;&#21704;!</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e2849" href="#d0e2849" class="para">6</a>] </sup>&#20320;&#20063;&#21487;&#20197;&#25163;&#24037;&#30340;&#21024;&#38500;&#36825;&#19977;&#20010;&#20020;&#26102;&#25991;&#20214;&#65292;&#20294;&#26159;&#24403;Subversion&#20250;&#32473;&#20320;&#20570;&#26102;&#20320;&#20250;&#33258;&#24049;&#21435;&#20570;&#21527;&#65311;&#25105;&#20204;&#26159;&#36825;&#26679;&#24819;&#30340;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e2881" href="#d0e2881" class="para">7</a>] </sup>&#22914;&#26524;&#20320;&#21521;&#20182;&#20204;&#35810;&#38382;&#65292;&#20182;&#20204;&#38750;&#24120;&#26377;&#29702;&#30001;&#25226;&#20320;&#24102;&#21040;&#22478;&#22806;&#30340;&#38081;&#36712;&#19978;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch02s03.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch02.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch02s05.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#21021;&#22987;&#21270;&#26816;&#20986;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#26816;&#39564;&#21382;&#21490;</td></tr></table></div></body></html>