<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#24573;&#30053;&#26410;&#29256;&#26412;&#25511;&#21046;&#30340;&#26465;&#30446;</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="ch03.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="ch03s03.html" title="&#25991;&#20214;&#31227;&#26893;&#24615;"><link rel="next" href="ch03s05.html" title="&#20851;&#38190;&#23383;&#26367;&#25442;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24573;&#30053;&#26410;&#29256;&#26412;&#25511;&#21046;&#30340;&#26465;&#30446;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch03s03.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch03s05.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.props.special.ignore"></a>&#24573;&#30053;&#26410;&#29256;&#26412;&#25511;&#21046;&#30340;&#26465;&#30446;</h2></div></div></div><p>&#22312;&#20219;&#20309;&#24037;&#20316;&#25335;&#36125;&#65292;&#23558;&#29256;&#26412;&#21270;&#25991;&#20214;&#21644;&#30446;&#24405;&#19982;&#27809;&#26377;&#20063;&#19981;&#20934;&#22791;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#20998;&#24320;&#20250;&#26159;&#38750;&#24120;&#24120;&#35265;&#30340;&#24773;&#20917;&#12290;&#25991;&#26412;&#32534;&#36753;&#22120;&#30340;&#22791;&#20221;&#25991;&#20214;&#20250;&#23558;&#30446;&#24405;&#25630;&#20081;&#65292;&#20195;&#30721;&#32534;&#35793;&#36807;&#31243;&#20013;&#29983;&#25104;&#30340;&#20013;&#38388;&#25991;&#20214;&#65292;&#29978;&#33267;&#26368;&#32456;&#25991;&#20214;&#20063;&#19981;&#26159;&#20320;&#24076;&#26395;&#29256;&#26412;&#21270;&#30340;&#65292;&#29992;&#25143;&#22312;&#35265;&#21040;&#36825;&#20123;&#25991;&#20214;&#21644;&#30446;&#24405;&#65288;&#32463;&#24120;&#26159;&#29256;&#26412;&#25511;&#21046;&#24037;&#20316;&#25335;&#36125;&#20013;&#65289;&#30340;&#20219;&#20309;&#26102;&#20505;&#37117;&#20250;&#23558;&#20182;&#20204;&#21024;&#38500;&#12290;</p><p>&#26399;&#26395;&#35753;Subversion&#30340;&#24037;&#20316;&#25335;&#36125;&#25670;&#33073;&#28151;&#20081;&#20445;&#25345;&#24178;&#20928;&#26159;&#21487;&#31505;&#30340;&#65292;&#23454;&#38469;&#19978;Subversion&#23558;&#24037;&#20316;&#25335;&#36125;&#26159;&#26222;&#36890;&#30446;&#24405;&#20316;&#20026;&#23427;&#30340;&#19968;&#39033;<span class="emphasis"><em>&#29305;&#24615;</em></span>&#12290;&#20294;&#26159;&#36825;&#20123;&#27809;&#26377;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#20250;&#32473;Subversion&#29992;&#25143;&#24102;&#26469;&#19968;&#20123;&#28902;&#24700;&#65292;&#20363;&#22914;&#65292;&#22240;&#20026;<span class="command"><strong>svn add</strong></span>&#21644;<span class="command"><strong>svn import</strong></span>&#21629;&#20196;&#37117;&#26159;&#20250;&#36882;&#24402;&#25191;&#34892;&#30340;&#65292;&#24182;&#19981;&#30693;&#36947;&#21738;&#20123;&#25991;&#20214;&#20320;&#19981;&#24076;&#26395;&#29256;&#26412;&#21270;&#65292;&#24456;&#23481;&#26131;&#24847;&#22806;&#30340;&#28155;&#21152;&#19968;&#20123;&#25991;&#20214;&#12290;&#22240;&#20026;<span class="command"><strong>svn status</strong></span>&#20250;&#25253;&#21578;&#24037;&#20316;&#25335;&#36125;&#20013;&#21253;&#25324;&#26410;&#29256;&#26412;&#21270;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#20449;&#24687;&#65292;&#22914;&#26524;&#36825;&#31181;&#25991;&#20214;&#24456;&#22810;&#65292;&#23427;&#30340;&#36755;&#20986;&#20250;&#21464;&#24471;&#38750;&#24120;&#22024;&#26434;&#12290;</p><p>So Subversion provides two ways for telling it which files
      you would prefer that it simply disregard.  One of the ways
      involves the use of Subversion's runtime configuration system
      (see <a class="xref" href="ch07.html#svn.advanced.confarea" title="&#36816;&#34892;&#37197;&#32622;&#21306;">&#8220;&#36816;&#34892;&#37197;&#32622;&#21306;&#8221;&#19968;&#33410;</a>), and therefore
      applies to all the Subversion operations which make use of that
      runtime configuration, generally those performed on a particular
      computer, or by a particular user of a computer.  The other way
      makes use of Subversion's directory property support, is more
      tightly bound to the versioned tree itself, and therefore
      affects everyone who has a working copy of that tree.  Both of
      the mechanisms use <em class="firstterm">file patterns</em> (strings
      of literal and special wildcard characters used to match against
      file names) to decide which files to ignore.</p><p>The Subversion runtime configuration system provides an
      option, <code class="literal">global-ignores</code>, whose value is a
      whitespace-delimited collection of file patterns.  The
      Subversion client checks these patterns against the names of the
      files which are candidates for addition to version control, as
      well as to unversioned files which the <span class="command"><strong>svn
      status</strong></span> command notices.  If any file's name matches
      one of the patterns, Subversion will basically act as if the
      file didn't exist at all.  This is really useful for the kinds
      of files that you almost never want to version, such as editor
      backup files like Emacs' <code class="literal">*~</code> and
      <code class="literal">.*~</code> files.</p><div class="sidebar"><p class="title"><b>File Patterns in Subversion</b></p><p>File patterns (also called <em class="firstterm">globs</em> or
        <em class="firstterm">shell wildcard patterns</em>) are strings of
        characters that are intended to be matched against file names,
        typically for the purpose of quickly selecting some subset of
        similar files from a larger grouping without having to
        explicitly name each file.  The patterns contain two types of
        characters:  regular characters which are compared explicitly
        against potential matches, and special wildcard characters
        which are interpreted differently for matching
        purposes.</p><p>There are different types of file pattern syntaxes, but
        Subversion uses the one most commonly found in Unix systems
        implemented as the <code class="function">fnmatch</code> system
        function.  It supports the following wildcards, described here
        simply for your convenience:</p><div class="variablelist"><dl><dt><span class="term">
              <code class="literal">?</code>
            </span></dt><dd><p>matches any single character</p></dd><dt><span class="term">
              <code class="literal">*</code>
            </span></dt><dd><p>matches any string of characters, including the
              empty string</p></dd><dt><span class="term">
              <code class="literal">[</code>
            </span></dt><dd><p>begins a character class definition terminated by
              <code class="literal">]</code>, used for matching a subset of
              characters</p></dd></dl></div><p>You can see this same pattern matching behavior at a Unix
        shell prompt.  The following are some examples of patterns
        being used for various things.</p><pre class="screen">
$ ls   ### the book sources
appa-quickstart.xml		ch06-server-configuration.xml
appb-svn-for-cvs-users.xml	ch07-customizing-svn.xml
appc-webdav.xml			ch08-embedding-svn.xml
appd-third-party-tools.xml	ch09-reference.xml
book.xml			ch10-world-peace-thru-svn.xml
ch00-preface.xml		copyright.xml
ch01-fundamental-concepts.xml	foreword.xml
ch02-basic-usage.xml		images/
ch03-advanced-topics.xml	index.xml
ch04-branching-and-merging.xml	styles.css
ch05-repository-admin.xml
$ ls ch*   ### the book chapters
ch00-preface.xml		ch06-server-configuration.xml
ch01-fundamental-concepts.xml	ch07-customizing-svn.xml
ch02-basic-usage.xml		ch08-embedding-svn.xml
ch03-advanced-topics.xml	ch09-reference.xml
ch04-branching-and-merging.xml	ch10-world-peace-thru-svn.xml
ch05-repository-admin.xml
$ ls ch?0-*   ### the book chapters whose numbers end in zero
ch00-preface.xml  ch10-world-peace-thru-svn.xml
$ ls ch0[3578]-*   ### the book chapters that Mike is responsible for
ch03-advanced-topics.xml   ch07-customizing-svn.xml
ch05-repository-admin.xml  ch08-embedding-svn.xml
$
</pre><p>File pattern matching is a bit more complex than what
        we've described here, but this basic usage level tends to suit
        the majority of Subversion users.</p></div><p>&#22914;&#26524;&#26159;&#22312;&#29256;&#26412;&#21270;&#30446;&#24405;&#19978;&#21457;&#29616;<code class="literal">svn:ignore</code>&#23646;&#24615;&#65292;&#20854;&#20869;&#23481;&#26159;&#19968;&#21015;&#20197;&#34892;&#20998;&#21106;&#30340;&#25991;&#20214;&#27169;&#24335;&#65292;Subversion&#29992;&#26469;&#21028;&#26029;&#22312;&#36825;&#20010;&#30446;&#24405;&#19979;&#23545;&#35937;&#26159;&#21542;&#34987;&#24573;&#30053;&#12290;&#36825;&#20123;&#27169;&#24335;&#19981;&#20250;&#35206;&#30422;&#22312;&#36816;&#34892;&#37197;&#32622;&#35774;&#32622;&#30340;&#20840;&#23616;&#24573;&#30053;&#65292;&#32780;&#26159;&#21521;&#20854;&#28155;&#21152;&#24573;&#30053;&#27169;&#24335;&#12290;&#19981;&#20687;&#20840;&#23616;&#24573;&#30053;&#36873;&#39033;&#65292;&#22312;<code class="literal">svn:ignore</code>&#23646;&#24615;&#20013;&#35774;&#32622;&#30340;&#20540;&#21482;&#20250;&#24212;&#29992;&#21040;&#20854;&#35774;&#32622;&#30340;&#30446;&#24405;&#65292;&#32780;&#19981;&#20250;&#24212;&#29992;&#21040;&#20854;&#23376;&#30446;&#24405;&#12290;<code class="literal">svn:ignore</code>&#23646;&#24615;&#26159;&#21578;&#35785;Subversion&#22312;&#27599;&#20010;&#29992;&#25143;&#30340;&#24037;&#20316;&#25335;&#36125;&#23545;&#24212;&#30446;&#24405;&#24573;&#30053;&#30456;&#21516;&#30340;&#25991;&#20214;&#30340;&#22909;&#26041;&#27861;&#65292;&#20363;&#22914;&#32534;&#35793;&#36755;&#20986;&#25110;&#8212;&#20351;&#29992;&#19968;&#20010;&#26412;&#20070;&#30456;&#20851;&#30340;&#20363;&#23376;&#8212;&#26412;&#20070;&#20174;DocBook XML&#25991;&#20214;&#29983;&#25104;&#30340;HTML&#12289;PDF&#25110;PostScript&#12290;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3><p>Subversion&#23545;&#20110;&#24573;&#30053;&#25991;&#20214;&#27169;&#24335;&#30340;&#25903;&#25345;&#20165;&#38480;&#20110;&#23558;&#26410;&#29256;&#26412;&#21270;&#25991;&#20214;&#21644;&#30446;&#24405;&#28155;&#21152;&#21040;&#29256;&#26412;&#25511;&#21046;&#26102;&#65292;&#22914;&#26524;&#19968;&#20010;&#25991;&#20214;&#24050;&#32463;&#22312;Subversion&#25511;&#21046;&#19979;&#65292;&#24573;&#30053;&#27169;&#24335;&#26426;&#21046;&#19981;&#20250;&#20877;&#26377;&#25928;&#26524;&#65292;&#19981;&#35201;&#26399;&#26395;Subversion&#20250;&#38459;&#27490;&#20320;&#25552;&#20132;&#19968;&#20010;&#31526;&#21512;&#24573;&#30053;&#26465;&#20214;&#30340;&#20462;&#25913;&#8212;Subversion&#19968;&#30452;&#35748;&#20026;&#23427;&#26159;&#29256;&#26412;&#21270;&#30340;&#23545;&#35937;&#12290;</p></div><div class="sidebar"><p class="title"><b>CVS &#29992;&#25143;&#30340;&#24573;&#30053;&#27169;&#24335;</b></p><p>Subversion&#30340;<code class="literal">svn:ignore</code>&#23646;&#24615;&#19982;CVS&#30340;<code class="filename">.cvsignore</code>&#25991;&#20214;&#30340;&#35821;&#27861;&#21644;&#21151;&#33021;&#38750;&#24120;&#31867;&#20284;&#65292;&#23454;&#38469;&#19978;&#65292;&#22914;&#26524;&#20320;&#31227;&#26893;&#19968;&#20010;CVS&#30340;&#24037;&#20316;&#25335;&#36125;&#21040;Subversion&#65292;&#20320;&#21487;&#20197;&#30452;&#25509;&#20351;&#29992;<code class="filename">.cvsignore</code>&#20316;&#20026;<span class="command"><strong>svn propset</strong></span>&#36755;&#20837;&#25991;&#20214;&#21442;&#25968;&#65306;</p><pre class="screen">
$ svn propset svn:ignore -F .cvsignore .
property 'svn:ignore' set on '.'
$
</pre><p>&#20294;&#26159;CVS&#21644;Subversion&#22788;&#29702;&#24573;&#30053;&#27169;&#24335;&#30340;&#26041;&#24335;&#26377;&#19968;&#20123;&#19981;&#21516;&#65292;&#36825;&#20004;&#20010;&#31995;&#32479;&#22312;&#19981;&#21516;&#30340;&#26102;&#20505;&#20351;&#29992;&#24573;&#30053;&#27169;&#24335;&#65292;&#24573;&#30053;&#27169;&#24335;&#24212;&#29992;&#30340;&#23545;&#35937;&#20063;&#30001;&#24494;&#23567;&#30340;&#19981;&#21516;&#65292;&#21478;&#22806;Subversion&#19981;&#21487;&#20197;&#20351;&#29992;<code class="literal">!</code>&#27169;&#24335;&#26469;&#21435;&#21462;&#28040;&#24573;&#30053;&#27169;&#24335;&#12290;</p></div><p>&#20840;&#23616;&#24573;&#30053;&#27169;&#24335;&#21482;&#26159;&#19968;&#31181;&#20010;&#20154;&#21916;&#22909;&#65292;&#21487;&#33021;&#26356;&#25509;&#36817;&#20110;&#29992;&#25143;&#30340;&#29305;&#23450;&#24037;&#20855;&#38142;&#65292;&#32780;&#19981;&#26159;&#29305;&#23450;&#24037;&#20316;&#25335;&#36125;&#30340;&#38656;&#35201;&#65292;&#25152;&#20197;&#20313;&#19979;&#30340;&#23567;&#33410;&#23558;&#20851;&#27880;<code class="literal">svn:ignore</code>&#23646;&#24615;&#21644;&#23427;&#30340;&#20351;&#29992;&#12290;</p><p>&#20551;&#23450;&#20320;&#30340;<span class="command"><strong>svn status</strong></span>&#26377;&#22914;&#19979;&#36755;&#20986;&#65306;</p><pre class="screen">
$ svn status calc
 M     calc/button.c
?      calc/calculator
?      calc/data.c
?      calc/debug_log
?      calc/debug_log.1
?      calc/debug_log.2.gz
?      calc/debug_log.3.gz
</pre><p>&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;&#20320;&#23545;<code class="filename">button.c</code>&#25991;&#20214;&#20316;&#20102;&#19968;&#20123;&#23646;&#24615;&#20462;&#25913;&#65292;&#20294;&#26159;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#20063;&#26377;&#19968;&#20123;&#26410;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#65306;&#20320;&#20174;&#28304;&#20195;&#30721;&#32534;&#35793;&#30340;&#26368;&#26032;<code class="filename">&#35745;&#31639;&#22120;</code>&#31243;&#24207;&#65292;&#19968;&#31995;&#21015;&#35843;&#35797;&#36755;&#20986;&#26085;&#24535;&#25991;&#20214;&#65292;&#29616;&#22312;&#20320;&#30693;&#36947;&#20320;&#30340;&#32534;&#35793;&#31995;&#32479;&#19968;&#30452;&#20250;&#32534;&#35793;&#29983;&#25104;<code class="filename">&#35745;&#31639;&#22120;</code>&#31243;&#24207;&#12290; <sup>[<a name="d0e4483" href="#ftn.d0e4483" class="footnote">13</a>]</sup>&#32780;&#19988;&#20320;&#30693;&#36947;&#20320;&#30340;&#27979;&#35797;&#32452;&#20214;&#24635;&#26159;&#20250;&#30041;&#19979;&#36825;&#20123;&#35843;&#35797;&#26085;&#24535;&#65292;&#36825;&#23545;&#25152;&#26377;&#30340;&#24037;&#20316;&#25335;&#36125;&#37117;&#26159;&#19968;&#26679;&#30340;&#65292;&#19981;&#20165;&#20165;&#26159;&#20320;&#30340;&#12290;&#20320;&#20063;&#30693;&#36947;&#20320;&#19981;&#20250;&#26377;&#20852;&#36259;&#22312;<span class="command"><strong>svn status</strong></span>&#21629;&#20196;&#20013;&#26174;&#31034;&#36825;&#20123;&#20449;&#24687;&#65292;&#25152;&#20197;&#20351;&#29992;<span class="command"><strong>svn propedit svn:ignore calc</strong></span>&#26469;&#20026;<code class="filename">calc</code>&#30446;&#24405;&#22686;&#21152;&#19968;&#20123;&#24573;&#30053;&#27169;&#24335;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#25110;&#35768;&#20250;&#28155;&#21152;&#22914;&#19979;&#30340;&#20540;&#20316;&#20026;<code class="literal">svn:ignore</code>&#30340;&#23646;&#24615;&#65306;</p><pre class="programlisting">
calculator
debug_log*
</pre><p>&#24403;&#20320;&#28155;&#21152;&#23436;&#36825;&#20123;&#23646;&#24615;&#65292;&#20320;&#20250;&#22312;<code class="filename">calc</code>&#30446;&#24405;&#26377;&#19968;&#20010;&#26412;&#22320;&#20462;&#25913;&#65292;&#20294;&#26159;&#27880;&#24847;&#20320;&#30340;<span class="command"><strong>svn status</strong></span>&#36755;&#20986;&#26377;&#20160;&#20040;&#20854;&#20182;&#30340;&#19981;&#21516;&#65306;</p><pre class="screen">
$ svn status
 M     calc
 M     calc/button.c
?      calc/data.c
</pre><p>&#29616;&#22312;&#65292;&#25152;&#26377;&#22810;&#20313;&#30340;&#36755;&#20986;&#19981;&#35265;&#20102;&#65281;&#24403;&#28982;&#65292;&#20320;&#30340;<code class="filename">&#35745;&#31639;&#22120;</code>&#31243;&#24207;&#21644;&#25152;&#26377;&#30340;&#26085;&#24535;&#25991;&#20214;&#36824;&#22312;&#24037;&#20316;&#25335;&#36125;&#20013;&#65292;Subversion&#20165;&#20165;&#26159;&#19981;&#20877;&#25552;&#37266;&#20320;&#23427;&#20204;&#30340;&#23384;&#22312;&#21644;&#26410;&#29256;&#26412;&#21270;&#12290;&#29616;&#22312;&#25152;&#26377;&#35752;&#21388;&#30340;&#22122;&#38899;&#37117;&#24050;&#32463;&#19981;&#20877;&#26174;&#31034;&#65292;&#21482;&#30041;&#19979;&#20102;&#20320;&#24863;&#20852;&#36259;&#30340;&#26465;&#30446;&#8212;&#22914;&#20320;&#24536;&#35760;&#28155;&#21152;&#21040;&#29256;&#26412;&#25511;&#21046;&#30340;&#28304;&#20195;&#30721;&#25991;&#20214;<code class="filename">data.c</code>&#12290;</p><p>&#24403;&#28982;&#65292;&#19981;&#20165;&#20165;&#21482;&#26377;&#36825;&#31181;&#31616;&#30053;&#30340;&#24037;&#20316;&#25335;&#36125;&#29366;&#24577;&#36755;&#20986;&#65292;&#22914;&#26524;&#24819;&#26597;&#30475;&#34987;&#24573;&#30053;&#30340;&#25991;&#20214;&#65292;&#21487;&#20197;&#20351;&#29992;Subversion&#30340;<code class="option">--no-ignore</code>&#36873;&#39033;&#65306;</p><pre class="screen">
$ svn status --no-ignore
 M     calc
 M     calc/button.c
I      calc/calculator
?      calc/data.c
I      calc/debug_log
I      calc/debug_log.1
I      calc/debug_log.2.gz
I      calc/debug_log.3.gz
</pre><p>&#25105;&#20204;&#22312;&#21069;&#38754;&#25552;&#21040;&#36807;&#65292;<span class="command"><strong>svn add</strong></span>&#21644;<span class="command"><strong>svn import</strong></span>&#20063;&#20250;&#20351;&#29992;&#36825;&#20010;&#24573;&#30053;&#27169;&#24335;&#21015;&#34920;&#65292;&#36825;&#20004;&#20010;&#25805;&#20316;&#37117;&#21253;&#25324;&#20102;&#35810;&#38382;Subversion&#26469;&#24320;&#22987;&#31649;&#29702;&#19968;&#32452;&#25991;&#20214;&#21644;&#30446;&#24405;&#12290;&#27604;&#24378;&#21046;&#29992;&#25143;&#25361;&#25315;&#30446;&#24405;&#26641;&#20013;&#37027;&#20010;&#25991;&#20214;&#35201;&#32435;&#20837;&#29256;&#26412;&#25511;&#21046;&#30340;&#26041;&#24335;&#26356;&#22909;&#65292;Subversion&#20351;&#29992;&#24573;&#30053;&#27169;&#24335;&#26469;&#26816;&#27979;&#37027;&#20010;&#25991;&#20214;&#19981;&#24212;&#35813;&#22312;&#22823;&#30340;&#36845;&#20195;&#28155;&#21152;&#21644;&#23548;&#20837;&#25805;&#20316;&#20013;&#36827;&#20837;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#20877;&#27425;&#35828;&#26126;&#65292;&#25805;&#20316;Subversion&#25991;&#20214;&#21644;&#30446;&#24405;&#26102;&#20320;&#21487;&#20197;&#20351;&#29992;<code class="option">--no-ignore</code>&#36873;&#39033;&#24573;&#30053;&#36825;&#20010;&#24573;&#30053;&#21015;&#34920;&#12290;</p><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d0e4483" href="#d0e4483" class="para">13</a>] </sup>&#36825;&#19981;&#26159;&#32534;&#35793;&#31995;&#32479;&#30340;&#22522;&#26412;&#21151;&#33021;&#21527;&#65311;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch03s03.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch03.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch03s05.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#25991;&#20214;&#31227;&#26893;&#24615;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#20851;&#38190;&#23383;&#26367;&#25442;</td></tr></table></div></body></html>