<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Advanced Merging</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="ch04.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="ch04s03.html" title="Basic Merging"><link rel="next" href="ch04s05.html" title="&#20351;&#29992;&#20998;&#25903;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Advanced Merging</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch04s03.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch04s05.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.branchmerge.advanced"></a>Advanced Merging</h2></div></div></div><p>Here ends the automated magic.  Sooner or later, once you
      get the hang of branching and merging, you're going to have to
      ask Subversion to merge <span class="emphasis"><em>specific</em></span> changes
      from one place to another.  And in order to do this, you're
      going to have to start passing more complicated arguments
      to <span class="command"><strong>svn merge</strong></span>.  This next section describes
      the fully-expanded syntax of the merge command, and discusses a
      number of common scenarios that require it.</p><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.cherrypicking"></a>Cherrypicking</h3></div></div></div><p>Just as the term &#8220;<span class="quote">changeset</span>&#8221; is often used in
        version control systems, so is the term
        of <em class="firstterm">cherrypicking</em>.  This word refers to
        the act of choosing <span class="emphasis"><em>one</em></span> specific
        changeset from a branch and replicating it to another.
        Cherrypicking may also refer to the act of duplicating a
        particular set of (not necessarily contiguous!) changesets
        from one branch to another.  This is in contrast to more
        typical merging scenarios, where the &#8220;<span class="quote">next</span>&#8221;
        contiguous range of revisions is duplicated
        automatically.</p><p>Why would people want to replicate just a single change?
        It comes up more often than you'd think.  For example, let's
        go back in time and imagine that you haven't yet merged your
        private feature-branch back to the trunk.  At the
        water-cooler, you get word that Sally made an interesting
        change to <code class="filename">integer.c</code> on the trunk.
        Looking over the history of commits to the trunk, you see that
        in revision 355 she fixed a critical bug that directly
        impacts the feature you're working on.  You might not be ready
        to merge all the trunk changes to your branch just yet, but
        you certainly need that particular bugfix in order to continue
        your work.</p><pre class="screen">
$ svn diff -c 355 http://svn.example.com/repos/calc/trunk

Index: integer.c
===================================================================
--- integer.c	(revision 354)
+++ integer.c	(revision 355)
@@ -147,7 +147,7 @@
     case 6:  sprintf(info-&gt;operating_system, "HPFS (OS/2 or NT)"); break;
     case 7:  sprintf(info-&gt;operating_system, "Macintosh"); break;
     case 8:  sprintf(info-&gt;operating_system, "Z-System"); break;
-    case 9:  sprintf(info-&gt;operating_system, "CP/MM");
+    case 9:  sprintf(info-&gt;operating_system, "CP/M"); break;
     case 10:  sprintf(info-&gt;operating_system, "TOPS-20"); break;
     case 11:  sprintf(info-&gt;operating_system, "NTFS (Windows NT)"); break;
     case 12:  sprintf(info-&gt;operating_system, "QDOS"); break;
</pre><p>Just as you used <span class="command"><strong>svn diff</strong></span> in the prior
        example to examine revision 355, you can pass the same option
        to <span class="command"><strong>svn merge</strong></span>:</p><pre class="screen">
$ svn merge -c 355 http://svn.example.com/repos/calc/trunk
U    integer.c

$ svn status
M      integer.c
</pre><p>You can now go through the usual testing procedures before
        committing this change to your branch.  After the commit,
        Subversion marks r355 as having been merged to the branch, so
        that future &#8220;<span class="quote">magic</span>&#8221; merges that synchronize your
        branch with the trunk know to skip over r355.  (Merging the
        same change to the same branch almost always results in a
        conflict!)</p><pre class="screen">
$ cd my-calc-branch

$ svn propget svn:mergeinfo .
/trunk:341-349,355

$ svn mergeinfo .
Path: .
  Source path: /trunk
    Merged ranges: r341:349,r355
    Eligible ranges: r350:354,r356:360

$ svn merge http://svn.example.com/repos/calc/trunk
--- Merging r350 through r354 into '.':
U    integer.c
U    Makefile
--- Merging r356 through r360 into '.':
U    integer.c
U    button.c
</pre><p>This use-case of replicating
        (or <em class="firstterm">backporting</em>) bugfixes from one
        branch to another is perhaps the most popular reason for
        cherrypicking changes; it comes up all the time, for example,
        when a team is maintaining a &#8220;<span class="quote">release branch</span>&#8221; of
        software.  (We discuss this pattern in
        <a class="xref" href="ch04s08.html#svn.branchmerge.commonpatterns.release" title="&#21457;&#24067;&#20998;&#25903;">&#8220;&#21457;&#24067;&#20998;&#25903;&#8221;&#19968;&#33410;</a>.)</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#35686;&#21578;</h3><p>Did you notice how, in the last example, the merge
        invocation caused two distinct ranges of merges to be applied?
        The <span class="command"><strong>svn merge</strong></span> command applied two
        independent patches to your working copy in order to skip over
        changeset 355, which your branch already contained.  There's
        nothing inherently wrong with this, except that it has the
        potential to make conflict-resolution more tricky.  If the
        first range of changes creates conflicts,
        you <span class="emphasis"><em>must</em></span> resolve them interactively in
        order for the merge process to continue and apply the second
        range of changes.  If you postpone a conflict from the first
        wave of changes, the whole merge command will bail out with an
        error message.<sup>[<a name="d0e7005" href="#ftn.d0e7005" class="footnote">21</a>]</sup></p></div><p>A word of warning: while <span class="command"><strong>svn diff</strong></span> and
        <span class="command"><strong>svn merge</strong></span> are very similar in concept, they
        do have different syntax in many cases.  Be sure to read about
        them in <a class="xref" href="ch09.html" title="&#31532;&nbsp;9&nbsp;&#31456;&nbsp;Subversion &#23436;&#20840;&#21442;&#32771;">&#31532;&nbsp;9&nbsp;&#31456; <i>Subversion &#23436;&#20840;&#21442;&#32771;</i></a> for details, or ask
        <span class="command"><strong>svn help</strong></span>.  For example, <span class="command"><strong>svn
        merge</strong></span> requires a working-copy path as a target, i.e.
        a place where it should apply the generated patch.  If the
        target isn't specified, it assumes you are trying to perform
        one of the following common operations:</p><div class="orderedlist"><ol type="1"><li><p>&#20320;&#24076;&#26395;&#21512;&#24182;&#30446;&#24405;&#20462;&#25913;&#21040;&#24037;&#20316;&#25335;&#36125;&#30340;&#24403;&#21069;&#30446;&#24405;&#12290;</p></li><li><p>&#20320;&#24076;&#26395;&#21512;&#24182;&#20462;&#25913;&#21040;&#20320;&#30340;&#24403;&#21069;&#24037;&#20316;&#30446;&#24405;&#30340;&#30456;&#21516;&#25991;&#20214;&#21517;&#30340;&#25991;&#20214;&#12290;</p></li></ol></div><p>&#22914;&#26524;&#20320;&#21512;&#24182;&#19968;&#20010;&#30446;&#24405;&#32780;&#27809;&#26377;&#25351;&#23450;&#29305;&#23450;&#30340;&#30446;&#26631;&#65292;<span class="command"><strong>svn merge</strong></span>&#20551;&#23450;&#31532;&#19968;&#31181;&#24773;&#20917;&#65292;&#22312;&#20320;&#30340;&#24403;&#21069;&#30446;&#24405;&#24212;&#29992;&#20462;&#25913;&#12290;&#22914;&#26524;&#20320;&#21512;&#24182;&#19968;&#20010;&#25991;&#20214;&#65292;&#32780;&#36825;&#20010;&#25991;&#20214;&#65288;&#25110;&#26159;&#19968;&#20010;&#26377;&#30456;&#21516;&#30340;&#21517;&#23383;&#25991;&#20214;&#65289;&#22312;&#20320;&#30340;&#24403;&#21069;&#24037;&#20316;&#30446;&#24405;&#23384;&#22312;&#65292;<span class="command"><strong>svn merge</strong></span>&#20551;&#23450;&#31532;&#20108;&#31181;&#24773;&#20917;&#65292;&#20320;&#24819;&#23545;&#36825;&#20010;&#21516;&#21517;&#25991;&#20214;&#20351;&#29992;&#21512;&#24182;&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.advancedsyntax"></a>Merge Syntax:  Full Disclosure</h3></div></div></div><p>You've now seen some examples of the <span class="command"><strong>svn
        merge</strong></span> command, and you're about to see several more.
        If you're feeling confused about exactly how merging works,
        you're not alone.  Many users (especially those new to version
        control) are initially perplexed about the proper syntax of
        the command, and about how and when the feature should be
        used.  But fear not, this command is actually much simpler
        than you think!  There's a very easy technique for
        understanding exactly how <span class="command"><strong>svn merge</strong></span>
        behaves.</p><p>&#36855;&#24785;&#30340;&#20027;&#35201;&#21407;&#22240;&#26159;&#36825;&#20010;&#21629;&#20196;&#30340;<span class="emphasis"><em>&#21517;&#31216;</em></span>&#65292;&#26415;&#35821;&#8220;<span class="quote">&#21512;&#24182;</span>&#8221;&#19981;&#30693;&#20160;&#20040;&#21407;&#22240;&#34987;&#29992;&#26469;&#34920;&#26126;&#20998;&#25903;&#30340;&#32452;&#21512;&#65292;&#25110;&#32773;&#26159;&#20854;&#20182;&#20160;&#20040;&#31070;&#22855;&#30340;&#25968;&#25454;&#28151;&#21512;&#65292;&#36825;&#19981;&#26159;&#20107;&#23454;&#65292;&#19968;&#20010;&#26356;&#22909;&#30340;&#21517;&#31216;&#24212;&#35813;&#26159;<span class="command"><strong>svn diff-and-apply</strong></span>&#65292;&#36825;&#26159;&#21457;&#29983;&#30340;&#25152;&#26377;&#20107;&#20214;&#65306;&#39318;&#20808;&#20004;&#20010;&#29256;&#26412;&#24211;&#26641;&#27604;&#36739;&#65292;&#28982;&#21518;&#23558;&#21306;&#21035;&#24212;&#29992;&#21040;&#26412;&#22320;&#25335;&#36125;&#12290;</p><p>If you're using <span class="command"><strong>svn merge</strong></span> to do basic
        copying of changes between branches, it will generally do the
        right thing automatically.  For example, a command like</p><pre class="screen">
$ svn merge http://svn.example.com/repos/calc/some-branch
</pre><p>... will attempt to duplicate any changes made
        on <code class="filename">some-branch</code> into your current working
        directory, which is presumably a working copy that shares some
        historical connection to the branch.  The command is smart
        enough to only duplicate changes that your working copy
        doesn't yet have.  If you repeat this command once a week, it
        will only duplicate the &#8220;<span class="quote">newest</span>&#8221; branch changes
        that happened since you last merged.</p><p>If you choose to use the <span class="command"><strong>svn merge</strong></span>
        command in all its full glory by giving it specific revision
        ranges to duplicate, then the command takes three main
        arguments:</p><div class="orderedlist"><ol type="1"><li><p>&#21021;&#22987;&#30340;&#29256;&#26412;&#26641;&#65288;&#36890;&#24120;&#21483;&#20570;&#27604;&#36739;&#30340;<em class="firstterm">&#24038;&#36793;</em>&#65289;&#65292;</p></li><li><p>&#26368;&#32456;&#30340;&#29256;&#26412;&#26641;&#65288;&#36890;&#24120;&#21483;&#20570;&#27604;&#36739;&#30340;<em class="firstterm">&#21491;&#36793;</em>&#65289;&#65292;</p></li><li><p>&#19968;&#20010;&#25509;&#25910;&#21306;&#21035;&#30340;&#24037;&#20316;&#25335;&#36125;&#65288;&#36890;&#24120;&#21483;&#20570;&#21512;&#24182;&#30340;<em class="firstterm">&#30446;&#26631;</em>&#65289;&#12290;</p></li></ol></div><p>&#19968;&#26086;&#36825;&#19977;&#20010;&#21442;&#25968;&#25351;&#23450;&#20197;&#21518;&#65292;&#20004;&#20010;&#30446;&#24405;&#26641;&#23558;&#35201;&#20570;&#27604;&#36739;&#65292;&#27604;&#36739;&#32467;&#26524;&#23558;&#20250;&#20316;&#20026;&#26412;&#22320;&#20462;&#25913;&#24212;&#29992;&#21040;&#30446;&#26631;&#24037;&#20316;&#25335;&#36125;&#65292;&#24403;&#21629;&#20196;&#32467;&#26463;&#21518;&#65292;&#32467;&#26524;&#21516;&#20320;&#25163;&#24037;&#20462;&#25913;&#25110;&#32773;&#26159;&#20351;&#29992;<span class="command"><strong>svn add</strong></span>&#25110;<span class="command"><strong>svn delete</strong></span>&#27809;&#26377;&#20160;&#20040;&#21306;&#21035;&#65292;&#22914;&#26524;&#20320;&#21916;&#27426;&#36825;&#32467;&#26524;&#65292;&#20320;&#21487;&#20197;&#25552;&#20132;&#65292;&#22914;&#26524;&#19981;&#21916;&#27426;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn revert</strong></span>&#24674;&#22797;&#20462;&#25913;&#12290;</p><p><span class="command"><strong>svn merge</strong></span>&#30340;&#35821;&#27861;&#20801;&#35768;&#38750;&#24120;&#28789;&#27963;&#30340;&#25351;&#23450;&#19977;&#20010;&#24517;&#35201;&#30340;&#21442;&#25968;&#65292;&#22914;&#19979;&#26159;&#19968;&#20123;&#20363;&#23376;&#65306;</p><pre class="screen">
$ svn merge http://svn.example.com/repos/branch1@150 \
            http://svn.example.com/repos/branch2@212 \
            my-working-copy

$ svn merge -r 100:200 http://svn.example.com/repos/trunk my-working-copy

$ svn merge -r 100:200 http://svn.example.com/repos/trunk
</pre><p>&#31532;&#19968;&#31181;&#35821;&#27861;&#20351;&#29992;<span class="emphasis"><em>URL@REV</em></span>&#30340;&#24418;&#24335;&#30452;&#25509;&#21015;&#20986;&#20102;&#25152;&#26377;&#21442;&#25968;&#65292;&#31532;&#20108;&#31181;&#35821;&#27861;&#21487;&#20197;&#29992;&#26469;&#20316;&#20026;&#27604;&#36739;&#21516;&#19968;&#20010;URL&#30340;&#19981;&#21516;&#29256;&#26412;&#30340;&#31616;&#30053;&#20889;&#27861;&#65292;&#26368;&#21518;&#19968;&#31181;&#35821;&#27861;&#34920;&#31034;&#24037;&#20316;&#25335;&#36125;&#26159;&#21487;&#36873;&#30340;&#65292;&#22914;&#26524;&#30465;&#30053;&#65292;&#40664;&#35748;&#26159;&#24403;&#21069;&#30446;&#24405;&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.undo"></a>&#21462;&#28040;&#20462;&#25913;</h3></div></div></div><p><span class="command"><strong>svn merge</strong></span>&#21478;&#19968;&#20010;&#24120;&#29992;&#30340;&#20570;&#27861;&#26159;&#21462;&#28040;&#24050;&#32463;&#20570;&#24471;&#25552;&#20132;&#65292;&#20551;&#35774;&#20320;&#24841;&#24555;&#30340;&#22312;<code class="filename">/calc/trunk</code>&#24037;&#20316;&#65292;&#20320;&#21457;&#29616;303&#29256;&#26412;&#23545;<code class="filename">integer.c</code>&#30340;&#20462;&#25913;&#23436;&#20840;&#38169;&#20102;&#65292;&#23427;&#19981;&#24212;&#35813;&#34987;&#25552;&#20132;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#26469;&#8220;<span class="quote">&#21462;&#28040;</span>&#8221;&#36825;&#20010;&#24037;&#20316;&#25335;&#36125;&#19978;&#25152;&#20316;&#30340;&#25805;&#20316;&#65292;&#28982;&#21518;&#25552;&#20132;&#26412;&#22320;&#20462;&#25913;&#21040;&#29256;&#26412;&#24211;&#65292;&#20320;&#35201;&#20570;&#24471;&#21482;&#26159;&#25351;&#23450;&#19968;&#20010;&#30456;&#21453;&#30340;&#21306;&#21035;&#12290;&#65288;&#20320;&#21487;&#20197;&#36890;&#36807;&#25351;&#23450;<code class="option">--revision 303:302--change -303</code></p><pre class="screen">
$ svn merge -c -303 http://svn.example.com/repos/calc/trunk
--- Reverse-merging r303 into 'integer.c':
U    integer.c

$ svn status
M      integer.c

$ svn diff
&#8230;
# verify that the change is removed
&#8230;

$ svn commit -m "Undoing change committed in r303."
Sending        integer.c
Transmitting file data .
Committed revision 350.
</pre><p>As we mentioned earlier, one way to think about a
        repository revision is as a specific changeset.  By using the
        <code class="option">-r</code> option, you can ask <span class="command"><strong>svn
        merge</strong></span> to apply a changeset, or whole range of
        changesets, to your working copy.  In our case of undoing a
        change, we're asking <span class="command"><strong>svn merge</strong></span> to apply
        changeset #303 to our working copy
        <span class="emphasis"><em>backwards</em></span>.</p><p>&#35760;&#20303;&#22238;&#28378;&#20462;&#25913;&#21644;&#20219;&#20309;&#19968;&#20010;<span class="command"><strong>svn merge</strong></span>&#21629;&#20196;&#37117;&#19968;&#26679;&#65292;&#25152;&#20197;&#20320;&#24212;&#35813;&#20351;&#29992;<span class="command"><strong>svn status</strong></span>&#25110;&#26159;<span class="command"><strong>svn diff</strong></span>&#26469;&#30830;&#23450;&#20320;&#30340;&#24037;&#20316;&#22788;&#20110;&#26399;&#26395;&#30340;&#29366;&#24577;&#20013;&#65292;&#28982;&#21518;&#20351;&#29992;<span class="command"><strong>svn commit</strong></span>&#26469;&#25552;&#20132;&#65292;&#25552;&#20132;&#20043;&#21518;&#65292;&#36825;&#20010;&#29305;&#23450;&#20462;&#25913;&#38598;&#19981;&#20250;&#21453;&#26144;&#21040;<code class="literal">HEAD</code>&#29256;&#26412;&#20102;&#12290;</p><p>&#32487;&#32493;&#65292;&#20320;&#20063;&#35768;&#20250;&#24819;&#65306;&#22909;&#21543;&#65292;&#36825;&#19981;&#26159;&#30495;&#30340;&#21462;&#28040;&#25552;&#20132;&#21543;&#65281;&#26159;&#21543;&#65311;&#29256;&#26412;303&#36824;&#20381;&#28982;&#23384;&#22312;&#30528;&#20462;&#25913;&#65292;&#22914;&#26524;&#20219;&#20309;&#20154;&#21462;&#20986;<code class="filename">calc</code>&#30340;303-349&#29256;&#26412;&#65292;&#20182;&#36824;&#20250;&#24471;&#21040;&#38169;&#35823;&#30340;&#20462;&#25913;&#65292;&#23545;&#21543;&#65311;</p><p>Yes, that's true.  When we talk about
        &#8220;<span class="quote">removing</span>&#8221; a change, we're really talking about
        removing it from the <code class="literal">HEAD</code> revision.  The
        original change still exists in the repository's history.  For
        most situations, this is good enough.  Most people are only
        interested in tracking the <code class="literal">HEAD</code> of a
        project anyway.  There are special cases, however, where you
        really might want to destroy all evidence of the commit.
        (Perhaps somebody accidentally committed a confidential
        document.)  This isn't so easy, it turns out, because
        Subversion was deliberately designed to never lose
        information.  Revisions are immutable trees which build upon
        one another.  Removing a revision from history would cause a
        domino effect, creating chaos in all subsequent revisions and
        possibly invalidating all working copies.
        <sup>[<a name="d0e7196" href="#ftn.d0e7196" class="footnote">22</a>]</sup>
      </p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.resurrect"></a>&#25214;&#22238;&#21024;&#38500;&#30340;&#39033;&#30446;</h3></div></div></div><p>&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#38750;&#24120;&#37325;&#35201;&#30340;&#19968;&#20010;&#29305;&#24615;&#23601;&#26159;&#23427;&#30340;&#20449;&#24687;&#20174;&#19981;&#20002;&#22833;&#65292;&#21363;&#20351;&#24403;&#20320;&#21024;&#38500;&#20102;&#25991;&#20214;&#25110;&#30446;&#24405;&#65292;&#23427;&#20063;&#35768;&#20174;<code class="literal">HEAD</code>&#29256;&#26412;&#28040;&#22833;&#20102; &#65292;&#20294;&#36825;&#20010;&#23545;&#35937;&#20381;&#28982;&#23384;&#22312;&#20110;&#21382;&#21490;&#30340;&#26089;&#26399;&#29256;&#26412; &#65292;&#19968;&#20010;&#26032;&#25163;&#32463;&#24120;&#38382;&#21040;&#30340;&#38382;&#39064;&#26159;&#8220;<span class="quote">&#24590;&#26679;&#25214;&#22238;&#25105;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#65311;</span>&#8221;&#12290;</p><p>&#31532;&#19968;&#27493;&#39318;&#20808;&#35201;&#30693;&#36947;&#38656;&#35201;&#25327;&#25937;&#30340;&#39033;&#30446;&#26159;<span class="bold"><strong>&#20160;&#20040;</strong></span>&#65292;&#36825;&#37324;&#26377;&#20010;&#24456;&#26377;&#29992;&#30340;&#27604;&#21947;&#65306;&#20320;&#21487;&#20197;&#35748;&#20026;&#20219;&#20309;&#23384;&#22312;&#20110;&#29256;&#26412;&#24211;&#30340;&#23545;&#35937;&#29983;&#27963;&#22312;&#19968;&#20010;&#20108;&#32500;&#30340;&#22352;&#26631;&#31995;&#32479;&#37324;&#65292;&#31532;&#19968;&#32500;&#26159;&#19968;&#20010;&#29305;&#23450;&#30340;&#29256;&#26412;&#26641;&#65292;&#31532;&#20108;&#32500;&#26159;&#22312;&#26641;&#20013;&#30340;&#36335;&#24452;&#65292;&#25152;&#20197;&#20320;&#30340;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#20219;&#20309;&#29256;&#26412;&#21487;&#20197;&#36890;&#36807;&#36825;&#26679;&#19968;&#23545;&#22352;&#26631;&#23450;&#20041;&#12290;&#65288;&#35760;&#20303;&#24120;&#35265;&#30340;&#8220;<span class="quote">peg&#20462;&#35746;&#29256;&#26412;</span>&#8221;&#35821;&#27861;&#8212; foo.c@224 &#8212; &#22312;&#21069;&#38754;&#30340;<a class="xref" href="ch03s09.html" title="Peg &#31639;&#27861;&#21644;&#29256;&#26412;">&#8220;Peg &#31639;&#27861;&#21644;&#29256;&#26412;&#8221;&#19968;&#33410;</a>&#25552;&#21040;&#36807;&#12290; &#65289;</p><p>&#39318;&#20808;&#65292;&#20320;&#38656;&#35201;<span class="command"><strong>svn log</strong></span>&#26469;&#23519;&#30475;&#20320;&#38656;&#35201;&#25214;&#22238;&#30340;&#22352;&#26631;&#23545;&#65292;&#19968;&#20010;&#22909;&#30340;&#31574;&#30053;&#26159;&#20351;&#29992;<span class="command"><strong>svn log --verbose</strong></span>&#26469;&#23519;&#30475;&#21253;&#21547;&#21024;&#38500;&#39033;&#30446;&#30340;&#30446;&#24405;&#65292;--verbose&#36873;&#39033;&#26174;&#31034;&#25152;&#26377;&#25913;&#21464;&#30340;&#39033;&#30446;&#30340;&#27599;&#19968;&#20010;&#29256;&#26412; &#65292;&#20320;&#21482;&#38656;&#35201;&#25214;&#20986;&#20320;&#21024;&#38500;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#37027;&#19968;&#20010;&#29256;&#26412;&#12290;&#20320;&#21487;&#20197;&#36890;&#36807;&#30446;&#27979;&#25214;&#20986;&#36825;&#20010;&#29256;&#26412;&#65292;&#20063;&#21487;&#20197;&#20351;&#29992;&#21478;&#19968;&#31181;&#24037;&#20855;&#26469;&#26816;&#26597;&#26085;&#24535;&#30340;&#36755;&#20986; &#65288;&#36890;&#36807;<span class="command"><strong>grep</strong></span>&#25110;&#26159;&#22312;&#32534;&#36753;&#22120;&#37324;&#22686;&#37327;&#26597;&#25214;&#65289;&#12290;</p><pre class="screen">
$ cd parent-dir
$ svn log -v
&#8230;
------------------------------------------------------------------------
r808 | joe | 2003-12-26 14:29:40 -0600 (Fri, 26 Dec 2003) | 3 lines
Changed paths:
   D /calc/trunk/real.c
   M /calc/trunk/integer.c

Added fast fourier transform functions to integer.c.
Removed real.c because code now in double.c.
&#8230;
</pre><p>&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;&#20320;&#21487;&#20197;&#20551;&#23450;&#20320;&#27491;&#22312;&#25214;&#24050;&#32463;&#21024;&#38500;&#20102;&#30340;&#25991;&#20214;<code class="filename">real.c</code>&#65292;&#36890;&#36807;&#26597;&#25214;&#29238;&#30446;&#24405;&#30340;&#21382;&#21490; &#65292;&#20320;&#30693;&#36947;&#36825;&#20010;&#25991;&#20214;&#22312;808&#29256;&#26412;&#34987;&#21024;&#38500;&#65292;&#25152;&#20197;&#23384;&#22312;&#36825;&#20010;&#23545;&#35937;&#30340;&#29256;&#26412;&#22312;&#27492;&#20043;&#21069; &#12290;&#32467;&#35770;&#65306;&#20320;&#24819;&#20174;&#29256;&#26412;807&#25214;&#22238;<code class="filename">/calc/trunk/real.c</code>&#12290;</p><p>&#20197;&#19978;&#26159;&#26368;&#37325;&#35201;&#30340;&#37096;&#20998;&#8212;&#37325;&#26032;&#25214;&#21040;&#20320;&#38656;&#35201;&#24674;&#22797;&#30340;&#23545;&#35937;&#12290;&#29616;&#22312;&#20320;&#24050;&#32463;&#30693;&#36947;&#35813;&#24674;&#22797;&#30340;&#25991;&#20214;&#65292;&#32780;&#20320;&#26377;&#20004;&#31181;&#36873;&#25321;&#12290;</p><p>One option is to use <span class="command"><strong>svn merge</strong></span> to apply
        revision 808 &#8220;<span class="quote">in reverse</span>&#8221;.  (We've already
        discussed how to undo changes, see
        <a class="xref" href="ch04s04.html#svn.branchmerge.advanced.undo" title="&#21462;&#28040;&#20462;&#25913;">&#8220;&#21462;&#28040;&#20462;&#25913;&#8221;&#19968;&#33410;</a>.)  This
        would have the effect of re-adding <code class="filename">real.c</code>
        as a local modification.  The file would be scheduled for
        addition, and after a commit, the file would again exist
        in <code class="literal">HEAD</code>.</p><p>&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;&#36825;&#19981;&#26159;&#19968;&#20010;&#22909;&#30340;&#31574;&#30053;&#65292;&#36825;&#26679;&#20570;&#19981;&#20165;&#25226;<code class="filename">real.c</code>&#21152;&#20837;&#28155;&#21152;&#21040;&#35745;&#21010;&#65292;&#20063;&#21462;&#28040;&#20102;&#23545;<code class="filename">integer.c</code>&#30340;&#20462;&#25913;&#65292;&#32780;&#36825;&#19981;&#26159;&#20320;&#26399;&#26395;&#30340;&#12290;&#30830;&#23454;&#65292;&#20320;&#21487;&#20197;&#24674;&#22797;&#21040;&#29256;&#26412;808&#65292;&#28982;&#21518;&#23545;<code class="filename">integer.c</code>&#25191;&#34892;&#21462;&#28040;<span class="command"><strong>svn revert</strong></span>&#25805;&#20316;&#65292;&#20294;&#36825;&#26679;&#30340;&#25805;&#20316;&#26080;&#27861;&#25193;&#22823;&#20351;&#29992;&#65292;&#22240;&#20026;&#22914;&#26524;&#20174;&#29256;&#26412;808&#20462;&#25913;&#20102;90&#20010;&#25991;&#20214;&#24590;&#20040;&#21150;&#65311;</p><p>&#25152;&#20197;&#31532;&#20108;&#20010;&#26041;&#27861;&#19981;&#26159;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#65292;&#32780;&#26159;&#20351;&#29992;<span class="command"><strong>svn copy</strong></span>&#21629;&#20196;&#65292;&#31934;&#30830;&#30340;&#25335;&#36125;&#29256;&#26412;&#21644;&#36335;&#24452;&#8220;<span class="quote">&#22352;&#26631;&#23545;</span>&#8221;&#21040;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65306;</p><pre class="screen">
$ svn copy http://svn.example.com/repos/calc/trunk/real.c@807 ./real.c

$ svn status
A  +   real.c

$ svn commit -m "Resurrected real.c from revision 807, /calc/trunk/real.c."
Adding         real.c
Transmitting file data .
Committed revision 1390.
</pre><p>The plus sign in the status output indicates that the item
        isn't merely scheduled for addition, but scheduled for
        addition &#8220;<span class="quote">with history</span>&#8221;.  Subversion remembers
        where it was copied from.  In the future, running <span class="command"><strong>svn
        log</strong></span> on this file will traverse back through the
        file's resurrection and through all the history it had prior
        to revision 807.  In other words, this new
        <code class="filename">real.c</code> isn't really new; it's a direct
        descendant of the original, deleted file.  This is usually
        considered a good and useful thing.  If, however, you wanted
        to resurrect the file <span class="emphasis"><em>without</em></span>
        maintaining a historical link to the old file, this technique
        works just as well:</p><pre class="screen">
$ svn cat http://svn.example.com/repos/calc/trunk/real.c@807 &gt; ./real.c

$ svn add real.c
A         real.c

$ svn commit -m "Recreated real.c from revision 807."
Adding         real.c
Transmitting file data .
Committed revision 1390.
</pre><p>Although our example shows us resurrecting a file, note
        that these same techniques work just as well for resurrecting
        deleted directories.  Also note that a resurrection doesn't
        have to happen in your working copy&#8212;it can happen
        entirely in the repository:</p><pre class="screen">
$ svn copy http://svn.example.com/repos/calc/trunk/real.c@807 \
           http://svn.example.com/repos/calc/trunk/
Committed revision 1390.

$ svn update
A    real.c
Updated to revision 1390.
</pre></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.mergeconflicts"></a>More on Merge Conflicts</h3></div></div></div><p>&#23601;&#20687;<span class="command"><strong>svn update</strong></span>&#21629;&#20196;&#65292;<span class="command"><strong>svn merge</strong></span>&#20250;&#25226;&#20462;&#25913;&#24212;&#29992;&#21040;&#24037;&#20316;&#25335;&#36125;&#65292;&#22240;&#27492;&#23427;&#20063;&#20250;&#36896;&#25104;&#20914;&#31361;&#65292;&#22240;&#20026;<span class="command"><strong>svn merge</strong></span>&#36896;&#25104;&#30340;&#20914;&#31361;&#26377;&#26102;&#20505;&#20250;&#26377;&#20123;&#19981;&#21516;&#65292;&#26412;&#23567;&#33410;&#20250;&#35299;&#37322;&#36825;&#20123;&#21306;&#21035;&#12290;</p><p>&#20316;&#20026;&#24320;&#22987;&#65292;&#25105;&#20204;&#20551;&#23450;&#26412;&#22320;&#27809;&#26377;&#20462;&#25913;&#65292;&#24403;&#20320;<span class="command"><strong>svn update</strong></span>&#21040;&#19968;&#20010;&#29305;&#23450;&#20462;&#35746;&#29256;&#26412;&#26102;&#65292;&#20462;&#25913;&#20250;&#8220;<span class="quote">&#24178;&#20928;&#30340;</span>&#8221;&#24212;&#29992;&#21040;&#24037;&#20316;&#25335;&#36125;&#65292;&#26381;&#21153;&#22120;&#20135;&#29983;&#27604;&#36739;&#20004;&#26641;&#30340;&#22686;&#37327;&#25968;&#25454;&#65306;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#21644;&#20320;&#20851;&#27880;&#30340;&#29256;&#26412;&#26641;&#30340;&#34394;&#25311;&#24555;&#29031;&#65292;&#22240;&#20026;&#27604;&#36739;&#30340;&#24038;&#36793;&#21516;&#20320;&#25317;&#26377;&#30340;&#23436;&#20840;&#30456;&#21516;&#65292;&#22686;&#37327;&#25968;&#25454;&#30830;&#20445;&#20320;&#25226;&#24037;&#20316;&#25335;&#36125;&#36716;&#21270;&#21040;&#21491;&#36793;&#30340;&#26641;&#12290;</p><p>But <span class="command"><strong>svn merge</strong></span> has no such guarantees
        and can be much more chaotic: the advanced user can ask the
        server to compare <span class="emphasis"><em>any</em></span> two trees at all,
        even ones that are unrelated to the working copy!  This means
        there's large potential for human error.  Users will sometimes
        compare the wrong two trees, creating a delta that doesn't
        apply cleanly.  <span class="command"><strong>svn merge</strong></span> will do its best
        to apply as much of the delta as possible, but some parts may
        be impossible.  Just as the Unix
        <span class="command"><strong>patch</strong></span> command sometimes complains about
        &#8220;<span class="quote">failed hunks</span>&#8221;, <span class="command"><strong>svn merge</strong></span>
        will complain about &#8220;<span class="quote">skipped targets</span>&#8221;:</p><pre class="screen">
$ svn merge -r 1288:1351 http://svn.example.com/repos/branch
U    foo.c
U    bar.c
Skipped missing target: 'baz.c'
U    glub.c
U    sputter.h
Conflict discovered in 'glorb.h'.
Select: (p)ostpone, (d)iff, (e)dit, (h)elp for more options : 
</pre><p>&#22312;&#21069;&#19968;&#20010;&#20363;&#23376;&#20013;&#65292;<code class="filename">baz.c</code>&#20063;&#35768;&#20250;&#23384;&#22312;&#20110;&#27604;&#36739;&#30340;&#20004;&#20010;&#20998;&#25903;&#24555;&#29031;&#37324;&#65292;&#20294;&#24037;&#20316;&#25335;&#36125;&#37324;&#19981;&#23384;&#22312;&#65292;&#27604;&#36739;&#30340;&#22686;&#37327;&#25968;&#25454;&#35201;&#24212;&#29992;&#21040;&#36825;&#20010;&#25991;&#20214;&#65292;&#36825;&#31181;&#24773;&#20917;&#19979;&#20250;&#21457;&#29983;&#20160;&#20040;&#65311;&#8220;<span class="quote">skipped</span>&#8221;&#20449;&#24687;&#24847;&#21619;&#30528;&#29992;&#25143;&#21487;&#33021;&#26159;&#22312;&#27604;&#36739;&#38169;&#35823;&#30340;&#20004;&#26869;&#26641;&#65292;&#36825;&#26159;&#32463;&#20856;&#30340;&#29992;&#25143;&#38169;&#35823;&#65292;&#24403;&#21457;&#29983;&#36825;&#31181;&#24773;&#20917;&#65292;&#21487;&#20197;&#20351;&#29992;&#36845;&#20195;&#24674;&#22797;&#65288;<span class="command"><strong>svn revert --recursive</strong></span>&#65289;&#21512;&#24182;&#25152;&#20316;&#30340;&#20462;&#25913;&#65292;&#21024;&#38500;&#24674;&#22797;&#21518;&#30041;&#19979;&#30340;&#25152;&#26377;&#26410;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#65292;&#24182;&#19988;&#20351;&#29992;&#21478;&#22806;&#30340;&#21442;&#25968;&#36816;&#34892;<span class="command"><strong>svn merge</strong></span>&#12290;</p><p>&#20063;&#24212;&#24403;&#27880;&#24847;&#21069;&#19968;&#20010;&#20363;&#23376;&#26174;&#31034;<code class="filename">glorb.h</code>&#21457;&#29983;&#20102;&#20914;&#31361;&#65292;&#25105;&#20204;&#24050;&#32463;&#35268;&#23450;&#26412;&#22320;&#25335;&#36125;&#27809;&#26377;&#20462;&#25913;&#65306;&#20914;&#31361;&#24590;&#20040;&#20250;&#21457;&#29983;&#21602;&#65311;&#22240;&#20026;&#29992;&#25143;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#23558;&#36807;&#21435;&#30340;&#20219;&#20309;&#21464;&#21270;&#24212;&#29992;&#21040;&#24403;&#21069;&#24037;&#20316;&#25335;&#36125;&#65292;&#21464;&#21270;&#21253;&#21547;&#30340;&#25991;&#26412;&#20462;&#25913;&#20063;&#35768;&#24182;&#19981;&#33021;&#24178;&#20928;&#30340;&#24212;&#29992;&#21040;&#24037;&#20316;&#25335;&#36125;&#25991;&#20214;&#65292;&#21363;&#20351;&#36825;&#20123;&#25991;&#20214;&#27809;&#26377;&#26412;&#22320;&#20462;&#25913;&#12290;</p><p>&#21478;&#19968;&#20010;<span class="command"><strong>svn update</strong></span>&#21644;<span class="command"><strong>svn merge</strong></span>&#30340;&#23567;&#21306;&#21035;&#26159;&#20914;&#31361;&#20135;&#29983;&#30340;&#25991;&#20214;&#30340;&#21517;&#23383;&#19981;&#21516;&#65292;&#22312;<a class="xref" href="ch02s04.html#svn.tour.cycle.resolve" title="&#35299;&#20915;&#20914;&#31361;&#65288;&#21512;&#24182;&#21035;&#20154;&#30340;&#20462;&#25913;&#65289;">&#8220;&#35299;&#20915;&#20914;&#31361;&#65288;&#21512;&#24182;&#21035;&#20154;&#30340;&#20462;&#25913;&#65289;&#8221;&#19968;&#33410;</a>&#65292;&#25105;&#20204;&#30475;&#21040;&#36807;&#26356;&#26032;&#20135;&#29983;&#30340;&#25991;&#20214;&#21517;&#23383;&#20026;<code class="filename">filename.mine</code>&#12289;<code class="filename">filename.rOLDREV</code>&#21644;<code class="filename">filename.rNEWREV</code>&#65292;&#24403;<span class="command"><strong>svn merge</strong></span>&#20135;&#29983;&#20914;&#31361;&#26102;&#65292;&#23427;&#20135;&#29983;&#30340;&#19977;&#20010;&#25991;&#20214;&#20998;&#21035;&#20026; <code class="filename">filename.working</code>&#12289;<code class="filename">filename.left</code>&#21644;<code class="filename">filename.right</code>&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#26415;&#35821;&#8220;<span class="quote">left</span>&#8221;&#21644;&#8220;<span class="quote">right</span>&#8221;&#34920;&#31034;&#20102;&#20004;&#26869;&#26641;&#27604;&#36739;&#26102;&#30340;&#20004;&#36793;&#65292;&#22312;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#19981;&#21516;&#30340;&#21517;&#23383;&#20250;&#24110;&#21161;&#20320;&#21306;&#20998;&#20914;&#31361;&#26159;&#22240;&#20026;&#26356;&#26032;&#36896;&#25104;&#30340;&#36824;&#26159;&#21512;&#24182;&#36896;&#25104;&#30340;&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.blockchanges"></a>Blocking Changes</h3></div></div></div><p>Sometimes there's a particular changeset which you don't
        want to be automatically merged.  For example, perhaps your
        team's policy is to do new development work on
        <code class="filename">/trunk</code>, but to be more conservative about
        backporting changes to a &#8220;<span class="quote">stable</span>&#8221; branch you use
        for releasing to the public.  On one extreme, you can manually
        cherrypick single changesets from trunk to the
        branch&#8212;only the changes that are stable enough to pass
        muster.  Maybe things aren't quite that strict, though;
        perhaps most of the time you'd like to just let <span class="command"><strong>svn
        merge</strong></span> automatically merge most changes from trunk to
        branch.  In this case, you'd like a way to mask a few specific
        changes out, i.e. prevent them from ever being automatically
        merged.</p><p>In Subversion 1.5, the only way to block a changeset is to
        make the system believe that the change has
        <span class="emphasis"><em>already</em></span> been merged.  You'll need to
        manually edit the <code class="literal">svn:mergeinfo</code> property on
        the branch, and add the blocked revision(s) to the
        list:</p><pre class="screen">
$ cd my-calc-branch

$ svn propget svn:mergeinfo .
/trunk:1680-3305

$ svn propset svn:mergeinfo "/trunk:1680-3305,3328" .
property 'svn:mergeinfo' set on '.'
</pre><p>This technique works, but it's also a little bit
        dangerous.  The main problem is that we're not differentiating
        between the ideas of &#8220;<span class="quote">I don't want this change</span>&#8221;
        and &#8220;<span class="quote">I don't have this change</span>&#8221;.  We're
        effectively lying to the system, making it think that the
        change was previously merged.  This puts the responsibility on
        you&#8212;the user&#8212;to remember that the change wasn't
        actually merged, it just wasn't wanted.  There's no way to ask
        Subversion for a list of &#8220;<span class="quote">blocked changelists</span>&#8221;.
        If you want to track them (so that you can unblock them
        someday) you'll need to record it in a text file somewhere, or
        perhaps in an invented property.  In Subversion 1.5,
        unfortunately, this is the only way to manage blocked
        revisions; the plans are to make a better interface for this
        in future versions.</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.logblame"></a>Merge-Sensitive Logs and Annotations</h3></div></div></div><p>One of the main features of any version control system is
        to keep track of who changed what, and when they did it.
        The <span class="command"><strong>svn log</strong></span> and <span class="command"><strong>svn
        blame</strong></span> commands are just the tools for this: when
        invoked on individual files, they show not only the history of
        changesets that affected the file, but exactly which user
        wrote which line of code, and when they did it.</p><p>When changes start getting replicated between branches,
        however, things start to get complicated.  For example, if you
        were to ask <span class="command"><strong>svn log</strong></span> about the history of
        your feature branch, it shows exactly every revision that ever
        affected the branch:</p><pre class="screen">
$ cd my-calc-branch
$ svn log -q
------------------------------------------------------------------------
r390 | user | 2002-11-22 11:01:57 -0600 (Fri, 22 Nov 2002) | 1 line
------------------------------------------------------------------------
r388 | user | 2002-11-21 05:20:00 -0600 (Thu, 21 Nov 2002) | 2 lines
------------------------------------------------------------------------
r381 | user | 2002-11-20 15:07:06 -0600 (Wed, 20 Nov 2002) | 2 lines
------------------------------------------------------------------------
r359 | user | 2002-11-19 19:19:20 -0600 (Tue, 19 Nov 2002) | 2 lines
------------------------------------------------------------------------
r357 | user | 2002-11-15 14:29:52 -0600 (Fri, 15 Nov 2002) | 2 lines
------------------------------------------------------------------------
r343 | user | 2002-11-07 13:50:10 -0600 (Thu, 07 Nov 2002) | 2 lines
------------------------------------------------------------------------
r341 | user | 2002-11-03 07:17:16 -0600 (Sun, 03 Nov 2002) | 2 lines
------------------------------------------------------------------------
r303 | sally | 2002-10-29 21:14:35 -0600 (Tue, 29 Oct 2002) | 2 lines
------------------------------------------------------------------------
r98 | sally | 2002-02-22 15:35:29 -0600 (Fri, 22 Feb 2002) | 2 lines
------------------------------------------------------------------------
</pre><p>But is this really an accurate picture of all the changes
        that happened on the branch?  What's being left out here is
        the fact that revisions 390, 381, and 357 were actually the
        results of merging changes from trunk.  If you look at a one
        of these logs in detail, the multiple trunk changesets that
        comprised the branch change are nowhere to be seen.</p><pre class="screen">
$ svn log -v -r 390
------------------------------------------------------------------------
r390 | user | 2002-11-22 11:01:57 -0600 (Fri, 22 Nov 2002) | 1 line
Changed paths:
   M /branches/my-calc-branch/button.c
   M /branches/my-calc-branch/README

Final merge of trunk changes to my-calc-branch.
</pre><p>We happen to know that this merge to the branch was
        nothing but a merge of trunk changes.  How can we see those
        trunk changes as well?  The answer is to use
        the <code class="option">--use-merge-history (-g)</code> option.  This
        option expands those &#8220;<span class="quote">child</span>&#8221; changes that were
        part of the merge.</p><pre class="screen">
$ svn log -v -r 390 -g
------------------------------------------------------------------------
r390 | user | 2002-11-22 11:01:57 -0600 (Fri, 22 Nov 2002) | 1 line
Changed paths:
   M /branches/my-calc-branch/button.c
   M /branches/my-calc-branch/README

Final merge of trunk changes to my-calc-branch.
------------------------------------------------------------------------
r383 | sally | 2002-11-21 03:19:00 -0600 (Thu, 21 Nov 2002) | 2 lines
Changed paths:
   M /branches/my-calc-branch/button.c
Result of a merge from: r390

Fix inverse graphic error on button.
------------------------------------------------------------------------
r382 | sally | 2002-11-20 16:57:06 -0600 (Wed, 20 Nov 2002) | 2 lines
Changed paths:
   M /branches/my-calc-branch/README
Result of a merge from: r390

Document my last fix in README.
</pre><p>By making the log operation use merge history, we see not
        just the revision we queried (r390), but the two revisions
        that came along on the ride with it&#8212;a couple of changes
        made by Sally to the trunk.  This is a much more complete
        picture of history!</p><p>The <span class="command"><strong>svn blame</strong></span> command also takes
        the <code class="option">--use-merge-history (-g)</code> option.  If this
        option is neglected, then somebody looking at a line-by-line
        annotation of <code class="filename">button.c</code> may get the
        mistaken impression that you were responsible for the lines
        that fixed a certain error:</p><pre class="screen">
$ svn blame button.c
...
   390    user    retval = inverse_func(button, path);
   390    user    return retval;
   390    user    }
...
</pre><p>And while it's true that you did actually commit those
        three lines in revision 390, two of them were actually writen
        by Sally back in revision 383:</p><pre class="screen">
$ svn blame button.c -g
...
G    383    sally   retval = inverse_func(button, path);
G    383    sally   return retval;
     390    user    }
...
</pre><p>Now we know who to <span class="emphasis"><em>really</em></span> blame for
        those two lines of code!</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.ancestry"></a>&#20851;&#27880;&#36824;&#26159;&#24573;&#35270;&#31062;&#20808;</h3></div></div></div><p>&#24403;&#19982;Subversion&#24320;&#21457;&#32773;&#20132;&#35848;&#26102;&#20320;&#19968;&#23450;&#20250;&#21548;&#21040;&#25552;&#21450;&#26415;&#35821;<em class="firstterm">&#31062;&#20808;</em>&#65292;&#36825;&#20010;&#35789;&#26159;&#29992;&#26469;&#25551;&#36848;&#20004;&#20010;&#23545;&#35937;&#30340;&#20851;&#31995;&#65306;&#22914;&#26524;&#20182;&#20204;&#20114;&#30456;&#20851;&#32852;&#65292;&#19968;&#20010;&#23545;&#35937;&#23601;&#26159;&#21478;&#19968;&#20010;&#30340;&#31062;&#20808;&#65292;&#25110;&#32773;&#30456;&#21453;&#12290;</p><p>&#20030;&#20010;&#20363;&#23376;&#65292;&#20551;&#35774;&#20320;&#25552;&#20132;&#29256;&#26412;100&#65292;&#21253;&#25324;&#23545;<code class="filename">foo.c</code>&#30340;&#20462;&#25913;&#65292;&#21017;foo.c@99&#26159;foo.c@100&#30340;&#19968;&#20010;&#8220;<span class="quote">&#31062;&#20808;</span>&#8221;&#65292;&#21478;&#19968;&#26041;&#38754;&#65292;&#20551;&#35774;&#20320;&#22312;&#29256;&#26412;101&#21024;&#38500;&#36825;&#20010;&#25991;&#20214;&#65292;&#32780;&#22312;102&#29256;&#26412;&#25552;&#20132;&#19968;&#20010;&#21516;&#21517;&#30340;&#25991;&#20214;&#65292;&#22312;&#36825;&#20010;&#24773;&#20917;&#19979;&#65292;<code class="filename">foo.c@99</code>&#19982;<code class="filename">foo.c@102</code>&#30475;&#36215;&#26469;&#26159;&#20851;&#32852;&#30340;&#65288;&#26377;&#21516;&#26679;&#30340;&#36335;&#24452;&#65289;&#65292;&#20294;&#26159;&#20107;&#23454;&#19978;&#20182;&#20204;&#26159;&#23436;&#20840;&#19981;&#21516;&#30340;&#23545;&#35937;&#65292;&#23427;&#20204;&#24182;&#19981;&#20849;&#20139;&#21516;&#19968;&#20010;&#21382;&#21490;&#25110;&#32773;&#35828;&#8220;<span class="quote">&#31062;&#20808;</span>&#8221;&#12290;</p><p>&#25351;&#20986;<span class="command"><strong>svn diff</strong></span>&#21644;<span class="command"><strong>svn merge</strong></span>&#21306;&#21035;&#30340;&#37325;&#35201;&#24615;&#22312;&#20110;&#65292;&#21069;&#19968;&#20010;&#21629;&#20196;&#24573;&#30053;&#31062;&#20808;&#65292;&#22914;&#26524;&#20320;&#35810;&#38382;<span class="command"><strong>svn diff</strong></span>&#26469;&#27604;&#36739;&#25991;&#20214;<code class="filename">foo.c</code>&#30340;&#29256;&#26412;99&#21644;102&#65292;&#20320;&#20250;&#30475;&#21040;&#34892;&#20026;&#22522;&#30784;&#30340;&#21306;&#21035;&#65292;<code class="literal">diff</code>&#21629;&#20196;&#21482;&#26159;&#30450;&#30446;&#30340;&#27604;&#36739;&#20004;&#26465;&#36335;&#24452;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#26159;&#27604;&#36739;&#21516;&#26679;&#30340;&#20004;&#20010;&#23545;&#35937;&#65292;&#23427;&#20250;&#27880;&#24847;&#21040;&#20182;&#20204;&#26159;&#19981;&#20851;&#32852;&#30340;&#65292;&#32780;&#19988;&#39318;&#20808;&#23581;&#35797;&#21024;&#38500;&#26087;&#25991;&#20214;&#65292;&#28982;&#21518;&#28155;&#21152;&#26032;&#25991;&#20214;&#65292;&#36755;&#20986;&#20250;&#26159;&#19968;&#20010;&#21024;&#38500;&#32039;&#25509;&#30528;&#19968;&#20010;&#22686;&#21152;&#65306;</p><pre class="screen">
D    foo.c
A    foo.c
      </pre><p>&#22823;&#22810;&#25968;&#21512;&#24182;&#21253;&#25324;&#27604;&#36739;&#21253;&#25324;&#31062;&#20808;&#20851;&#32852;&#30340;&#20004;&#26465;&#26641;&#65292;&#22240;&#27492;<span class="command"><strong>svn merge</strong></span>&#36825;&#26679;&#36816;&#20316;&#65292;&#28982;&#32780;&#65292;&#20320;&#20063;&#35768;&#20250;&#24076;&#26395;<code class="literal">merge</code>&#21629;&#20196;&#33021;&#22815;&#27604;&#36739;&#20004;&#20010;&#19981;&#30456;&#20851;&#30340;&#30446;&#24405;&#26641;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#26377;&#20004;&#20010;&#30446;&#24405;&#26641;&#20998;&#21035;&#20195;&#34920;&#20102;&#21334;&#20027;&#36719;&#20214;&#39033;&#30446;&#30340;&#19981;&#21516;&#29256;&#26412;&#65288;&#35265;<a class="xref" href="ch04s09.html" title="&#21334;&#20027;&#20998;&#25903;">&#8220;&#21334;&#20027;&#20998;&#25903;&#8221;&#19968;&#33410;</a>&#65289;&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#36827;&#34892;&#27604;&#36739;&#65292;&#20320;&#20250;&#30475;&#21040;&#31532;&#19968;&#20010;&#30446;&#24405;&#26641;&#34987;&#21024;&#38500;&#65292;&#32780;&#31532;&#20108;&#20010;&#26641;&#28155;&#21152;&#19978;&#65281;&#22312;&#36825;&#20010;&#24773;&#20917;&#19979;&#65292;&#20320;&#20165;&#20165;&#26159;&#24076;&#26395;<span class="command"><strong>svn merge</strong></span>&#20197;&#36335;&#24452;&#20026;&#22522;&#30784;&#27604;&#36739;&#20004;&#26869;&#26641;&#65292;&#32780;&#24573;&#30053;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#19981;&#30456;&#20851;&#24615;&#65292;&#24403;&#20026;&#21512;&#24182;&#21629;&#20196;&#28155;&#21152;<code class="option">--ignore-ancestry</code>&#36873;&#39033;&#26102;&#65292;&#23601;&#20250;&#20687;<span class="command"><strong>svn diff</strong></span>&#19968;&#26679;&#24037;&#20316;&#12290;&#65288;&#30456;&#21453;&#65292;<code class="option">--notice-ancestry</code>&#20250;&#23548;&#33268;<span class="command"><strong>svn diff</strong></span>&#20687;<code class="literal">merge</code>&#21629;&#20196;&#19968;&#26679;&#24037;&#20316;&#12290;&#65289;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.moves"></a>&#21512;&#24182;&#21644;&#31227;&#21160;</h3></div></div></div><p>&#19968;&#20010;&#26222;&#36941;&#30340;&#24895;&#26395;&#26159;&#37325;&#26500;&#28304;&#31243;&#24207;&#65292;&#29305;&#21035;&#26159;Java&#36719;&#20214;&#39033;&#30446;&#12290;&#22312;&#25913;&#21517;&#20013;&#25991;&#20214;&#21644;&#30446;&#24405;&#21464;&#20081;&#65292;&#36890;&#24120;&#23548;&#33268;&#27599;&#20010;&#39033;&#30446;&#25104;&#21592;&#30340;&#26497;&#22823;&#30772;&#22351;&#12290;&#21548;&#36215;&#26469;&#22909;&#20687;&#24212;&#35813;&#20351;&#29992;&#20998;&#25903;&#65292;&#19981;&#26159;&#21527;&#65311;&#21482;&#26159;&#21019;&#24314;&#20998;&#25903;&#65292;&#21464;&#20081;&#20107;&#24773;&#65292;&#28982;&#21518;&#21512;&#24182;&#22238;&#20027;&#24178;&#65292;&#19981;&#23545;&#21527;&#65311;</p><p>&#21769;&#65292;&#36825;&#20010;&#22330;&#26223;&#19979;&#36825;&#26679;&#24182;&#19981;&#27491;&#30830;&#65292;&#21487;&#20197;&#30475;&#20316;Subversion&#24403;&#21069;&#30340;&#24369;&#28857;&#65292;&#36825;&#20010;&#38382;&#39064;&#26159;&#22240;&#20026;Subversion&#30340;<span class="command"><strong>update</strong></span>&#36824;&#19981;&#26159;&#36275;&#22815;&#30340;&#24378;&#22766;&#65292;&#29305;&#21035;&#26159;&#38024;&#23545;&#25335;&#36125;&#21644;&#31227;&#21160;&#25805;&#20316;&#12290;</p><p>&#24403;&#20320;&#20351;&#29992;<span class="command"><strong>svn copy</strong></span>&#22797;&#21046;&#25991;&#20214;&#26102;&#65292;&#29256;&#26412;&#24211;&#20250;&#35760;&#20303;&#26032;&#25991;&#20214;&#30340;&#20986;&#22788;&#65292;&#20294;&#26159;&#23427;&#19981;&#33021;&#23558;&#36825;&#20010;&#20449;&#24687;&#20256;&#36882;&#32473;&#20351;&#29992;<span class="command"><strong>svn update</strong></span>&#25110;<span class="command"><strong>svn merge</strong></span>&#30340;&#23458;&#25143;&#31471;&#65292;&#19981;&#26159;&#21578;&#35785;&#23458;&#25143;&#31471;&#8220;<span class="quote"> &#23558;&#25991;&#20214;&#25335;&#36125;&#21040;&#26032;&#30340;&#20301;&#32622;</span>&#8221;&#65292;&#32780;&#26159;&#20256;&#36882;&#19968;&#25972;&#20010;&#26032;&#25991;&#20214;&#12290;&#36825;&#26679;&#20250;&#23548;&#33268;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#22240;&#20026;&#36825;&#20214;&#20107;&#20063;&#21457;&#29983;&#22312;&#25913;&#21517;&#30340;&#25991;&#20214;&#12290; &#19968;&#20010;&#40092;&#20026;&#20154;&#30693;&#30340;&#20107;&#23454;&#26159;Subversion&#32570;&#20047;&#30495;&#27491;&#30340;&#37325;&#21629;&#21517;&#8212;<span class="command"><strong>svn move</strong></span>&#21629;&#20196;&#21482;&#26159;&#19968;&#20010;<span class="command"><strong>svn copy</strong></span>&#21644;<span class="command"><strong>svn delete</strong></span>&#30340;&#32452;&#21512;&#12290;</p><p>&#20363;&#22914;&#65292;&#20551;&#23450;&#25105;&#20204;&#22312;&#19968;&#20010;&#31169;&#26377;&#20998;&#25903;&#24037;&#20316;&#65292;&#20320;&#23558;<code class="filename">integer.c</code>&#25913;&#21517;&#20026;<code class="filename">whole.c</code>&#65292;&#20320;&#36825;&#26159;&#22312;&#20998;&#25903;&#19978;&#21019;&#24314;&#20102;&#21407;&#26469;&#25991;&#20214;&#30340;&#19968;&#20010;&#25335;&#36125;&#65292;&#24182;&#19988;&#21024;&#38500;&#20102;&#21407;&#26469;&#30340;&#25991;&#20214;&#12290;&#21516;&#26102;&#65292;&#22238;&#21040;<code class="filename">trunk</code>&#65292;Sally&#25552;&#20132;&#20102;&#19968;&#20123;<code class="filename">integer.c</code>&#30340;&#20462;&#25913;&#65292;&#25152;&#20197;&#20320;&#38656;&#35201;&#23558;&#20998;&#25903;&#21512;&#24182;&#21040;&#20027;&#24178;&#65306;</p><pre class="screen">
$ cd calc/trunk

$ svn merge --reintegrate http://svn.example.com/repos/calc/branches/my-calc-branch
D   integer.c
A   whole.c
      </pre><p>&#31532;&#19968;&#30524;&#30475;&#36215;&#26469;&#19981;&#26159;&#24456;&#24046;&#65292;&#20294;&#26159;&#24456;&#21487;&#33021;&#36825;&#19981;&#26159;&#20320;&#21644;Sally&#24076;&#26395;&#30340;&#65292;&#21512;&#24182;&#25805;&#20316;&#24050;&#32463;&#21024;&#38500;&#20102;&#26368;&#26032;&#29256;&#26412;&#30340;<code class="filename">integer.c</code>&#65288;&#21253;&#21547;&#20102;Sally&#26368;&#26032;&#30340;&#20462;&#25913;&#65289;&#65292;&#32780;&#19988;&#30450;&#30446;&#30340;&#28155;&#21152;&#20102;&#20320;&#30340;<code class="filename">whole.c</code>&#25991;&#20214;&#8212;&#26159;&#26087;&#29256;&#26412;&#30340;<code class="filename">integer.c</code>&#22797;&#21046;&#21697;&#12290;&#26368;&#32456;&#30340;&#32467;&#26524;&#26159;&#23558;&#20320;&#30340;&#8220;<span class="quote">rename</span>&#8221;&#21512;&#24182;&#21040;&#20998;&#25903;&#65292;&#24182;&#19988;&#20174;&#26368;&#26032;&#20462;&#35746;&#29256;&#26412;&#21024;&#38500;&#20102;Sally&#26368;&#36817;&#30340;&#20462;&#25913;&#12290;</p><p>&#36825;&#19981;&#26159;&#30495;&#30340;&#25968;&#25454;&#20002;&#22833;&#65307;Sally&#30340;&#20462;&#25913;&#36824;&#22312;&#29256;&#26412;&#24211;&#30340;&#21382;&#21490;&#20013;&#65292;&#20294;&#26159;&#12290;&#22312;Subversion&#25913;&#36827;&#20043;&#21069;&#65292;&#26368;&#22909;&#23567;&#24515;&#23545;&#20998;&#25903;&#36827;&#34892;&#21512;&#24182;&#21644;&#25913;&#21517;&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.advanced.pre1.5clients"></a>Blocking Merge-Unaware Clients</h3></div></div></div><p>If you've just upgraded your server to Subversion 1.5 or
        later, then there's a significant risk that pre-1.5 Subversion
        clients can mess up your merge-tracking.  Why is this?  When a
        pre-1.5 Subversion client performs <span class="command"><strong>svn
        merge</strong></span>, it doesn't modify the value of
        the <code class="literal">svn:mergeinfo</code> property at all.  So the
        subsequent commit, despite being the result of a merge,
        doesn't tell the repository about the duplicated
        changes&#8212;that information is lost.  Later on,
        when &#8220;<span class="quote">merge-aware</span>&#8221; clients attempt automatic
        merging, they're likely to run into all sorts of conflicts
        resulting from repeated merges.</p><p>If you and your team are relying on the merge-tracking
        features of Subversion, then you may want to configure your
        repository to prevent older clients from committing changes.
        The easy way to do this is by inspecting
        the &#8220;<span class="quote">capabilities</span>&#8221; parameter in
        the <code class="literal">start-commit</code> hook script.  If the
        client reports itself as having <code class="literal">mergeinfo</code>
        capabilities, the hook script can allow the commit to start.
        If the client doesn't report that capability, have the hook
        deny the commit.  We'll learn more about hook scripts in the
        next chapter; see
        <a class="xref" href="ch05s03.html#svn.reposadmin.create.hooks" title="&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;">&#8220;&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;&#8221;&#19968;&#33410;</a> and
        <a class="xref" href="re69.html" title="start-commit">start-commit</a> for
        details.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d0e7005" href="#d0e7005" class="para">21</a>] </sup>At least, this is true in
        Subversion 1.5 at the time of writing.  This behavior may
        improve in future versions of
        Subversion.</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e7196" href="#d0e7196" class="para">22</a>] </sup>Subversion&#39033;&#30446;&#26377;&#35745;&#21010;&#65292;&#19981;&#31649;&#29992;&#20160;&#20040;&#26041;&#24335;&#65292;&#20250;&#26377;&#19968;&#22825;&#35201;&#23454;&#29616;<span class="command"><strong>svnadmin obliterate</strong></span>&#21629;&#20196;&#26469;&#36827;&#34892;&#27704;&#20037;&#21024;&#38500;&#25805;&#20316;&#65292;&#32780;&#27492;&#26102;&#21487;&#20197;&#30475;<a class="xref" href="ch05s04.html#svn.reposadmin.maint.tk.svndumpfilter" title="svndumpfilter">&#8220;svndumpfilter&#8221;&#19968;&#33410;</a>&#25214;&#21040;&#21487;&#34892;&#30340;&#26041;&#26696;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch04s03.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch04.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch04s05.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">Basic Merging&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#20351;&#29992;&#20998;&#25903;</td></tr></table></div></body></html>