<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#21069;&#35328;</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="prev" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="next" href="svn.preface.html" title="&#24207;&#35328;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21069;&#35328;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.preface.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="preface" lang="zh-cn"><div class="titlepage"><div><div><h1 class="title"><a name="svn.foreword"></a>&#21069;&#35328;</h1></div><div><div class="author"><h3 class="author"><span class="firstname">Karl</span> <span class="surname">Fogel</span></h3></div></div><div><p class="pubdate">&#33437;&#21152;&#21733;&#65292;2004&#24180;3&#26376;14&#26085;</p></div></div></div><p>A bad Frequently Asked Questions (FAQ) sheet is one that is
    composed not of the questions people actually ask, but of the
    questions the FAQ's author <span class="emphasis"><em>wishes</em></span> people
    would ask.  Perhaps you've seen the type before:</p><div class="blockquote"><blockquote class="blockquote"><p>Q&#65306;&#24590;&#26679;&#20351;&#29992;Glorbosoft XYZ&#26368;&#22823;&#31243;&#24230;&#30340;&#25552;&#39640;&#22242;&#38431;&#29983;&#20135;&#29575;&#65311;</p></blockquote></div><div class="blockquote"><blockquote class="blockquote"><p>A: Many of our customers want to know how they can
      maximize productivity through our patented office groupware
      innovations.  The answer is simple.  First, click on the
      <code class="literal">File</code> menu, scroll down to
      <code class="literal">Increase&nbsp;Productivity</code>,
      then&#8230;</p></blockquote></div><p>The problem with such FAQs is that they are not, in a
    literal sense, FAQs at all.  No one ever called the tech support
    line and asked, &#8220;<span class="quote">How can we maximize
    productivity?</span>&#8221;.  Rather, people asked highly specific
    questions, such as &#8220;<span class="quote">How can we change the calendaring system
    to send reminders two days in advance instead of one?</span>&#8221;
    and so on.  But it's a lot easier to make up imaginary
    Frequently Asked Questions than it is to discover the real ones.
    Compiling a true FAQ sheet requires a sustained, organized
    effort: over the lifetime of the software, incoming questions
    must be tracked, responses monitored, and all gathered into a
    coherent, searchable whole that reflects the collective
    experience of users in the wild.  It calls for the patient,
    observant attitude of a field naturalist.  No grand
    hypothesizing, no visionary pronouncements here&#8212;open eyes
    and accurate note-taking are what's needed most.</p><p>&#25105;&#24456;&#21916;&#27426;&#36825;&#26412;&#20070;&#65292;&#22240;&#20026;&#23427;&#27491;&#26159;&#25353;&#29031;&#36825;&#31181;&#31934;&#31070;&#24314;&#31435;&#36215;&#26469;&#30340;&#65292;&#36825;&#31181;&#31934;&#31070;&#20307;&#29616;&#22312;&#26412;&#20070;&#30340;&#27599;&#19968;&#39029;&#20013;&#12290;&#36825;&#26159;&#20316;&#32773;&#19982;&#29992;&#25143;&#30452;&#25509;&#20132;&#27969;&#30340;&#32467;&#26524;&#12290;&#32780;&#36825;&#19968;&#20999;&#26159;&#28304;&#20110;Ben Collins-Sussman's&#23545;&#20110;Subversion&#24120;&#35265;&#38382;&#39064;&#37038;&#20214;&#21015;&#34920;&#30340;&#30740;&#31350;&#12290;&#20182;&#21457;&#29616;&#20154;&#20204;&#24635;&#26159;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#37325;&#22797;&#35810;&#38382;&#19968;&#20123;&#22522;&#26412;&#38382;&#39064;&#65306;&#20351;&#29992;subversion&#30340;&#19968;&#33324;&#31243;&#24207;&#26159;&#24590;&#26679;&#30340;&#65311;&#20998;&#25903;&#19982;&#26631;&#31614;&#21516;&#20854;&#23427;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#24037;&#20316;&#26041;&#24335;&#19968;&#26679;&#21527;&#65311;&#25105;&#24590;&#26679;&#30693;&#36947;&#26576;&#19968;&#22788;&#20462;&#25913;&#26159;&#35841;&#20570;&#30340;&#65311;</p><p>Frustrated at seeing the same questions day after day, Ben
    worked intensely over a month in the summer of 2002 to write
    <em class="citetitle">The Subversion Handbook</em>, a 60 page
    manual that covered all the basics of using Subversion.  The
    manual made no pretense of being complete, but it was
    distributed with Subversion and got users over that initial hump
    in the learning curve.  When O'Reilly decided to
    publish a full-length Subversion book, the path of least
    resistance was obvious: just expand the Subversion
    handbook.</p><p>The three coauthors of the new book were thus presented
    with an unusual opportunity.  Officially, their task was to
    write a book top-down, starting from a table of contents and an
    initial draft.  But they also had access to a steady
    stream&#8212;indeed, an uncontrollable geyser&#8212;of bottom-up
    source material.  Subversion was already in the hands of
    thousands of early adopters, and those users were giving tons of
    feedback, not only about Subversion, but about its existing
    documentation.</p><p>&#22312;&#20889;&#36825;&#26412;&#20070;&#30340;&#36807;&#31243;&#37324;&#65292;Ben&#65292;Mike &#21644; Brian&#19968;&#30452;&#20687;&#39740;&#39746;&#19968;&#26679;&#28216;&#33633;&#22312;Subversion&#37038;&#20214;&#21015;&#34920;&#21644;&#32842;&#22825;&#23460;&#20013;&#65292;&#20180;&#32454;&#30340;&#30740;&#31350;&#29992;&#25143;&#23454;&#38469;&#36935;&#21040;&#30340;&#38382;&#39064;&#12290;&#30417;&#35270;&#36825;&#20123;&#21453;&#39304;&#20063;&#26159;&#20182;&#20204;&#22312;CollabNet&#24037;&#20316;&#30340;&#19968;&#37096;&#20998;&#65292;&#36825;&#32473;&#20182;&#20204;&#25776;&#20889;Subversion&#25991;&#26723;&#25552;&#20379;&#20102;&#24040;&#22823;&#30340;&#20415;&#21033;&#12290;&#36825;&#26412;&#20070;&#24314;&#31435;&#22312;&#20016;&#23500;&#30340;&#20351;&#29992;&#32463;&#39564;&#65292;&#32780;&#38750;&#22312;&#27969;&#27801;&#33324;&#33030;&#24369;&#30340;&#24819;&#35937;&#20043;&#19978;&#65292;&#23427;&#32467;&#21512;&#20102;&#29992;&#25143;&#25163;&#20876;&#21644;FAQ&#30340;&#20248;&#28857;&#12290;&#21021;&#27425;&#38405;&#35835;&#26102;&#65292;&#36825;&#31181;&#20108;&#20803;&#24615;&#30340;&#20248;&#21183;&#24182;&#19981;&#26126;&#26174;&#65292;&#25353;&#29031;&#39034;&#24207;&#65292;&#20174;&#21069;&#21040;&#21518;&#65292;&#36825;&#26412;&#20070;&#21482;&#26159;&#31616;&#21333;&#30340;&#20174;&#22836;&#21040;&#23614;&#25551;&#36848;&#20102;&#36719;&#20214;&#30340;&#32454;&#33410;&#12290;&#20070;&#20013;&#30340;&#20869;&#23481;&#21253;&#25324;&#19968;&#31456;&#27010;&#36848;&#65292;&#19968;&#31456;&#24517;&#19981;&#21487;&#23569;&#30340;&#24555;&#36895;&#25351;&#21335;&#65292;&#19968;&#31456;&#20851;&#20110;&#31649;&#29702;&#37197;&#32622;&#65292;&#19968;&#20123;&#39640;&#32423;&#20027;&#39064;&#65292;&#24403;&#28982;&#36824;&#21253;&#25324;&#21629;&#20196;&#21442;&#32771;&#25163;&#20876;&#21644;&#25925;&#38556;&#25490;&#38500;&#25351;&#21335;&#12290;&#32780;&#24403;&#20320;&#36807;&#19968;&#27573;&#26102;&#38388;&#20043;&#21518;&#65292;&#20877;&#27425;&#32763;&#24320;&#26412;&#20070;&#26597;&#25214;&#19968;&#20123;&#29305;&#23450;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#26102;&#65292;&#36825;&#31181;&#20108;&#20803;&#24615;&#25165;&#24471;&#20197;&#26174;&#29616;&#65306;&#36825;&#20123;&#29983;&#21160;&#30340;&#32454;&#33410;&#19968;&#23450;&#26469;&#33258;&#19981;&#21487;&#39044;&#27979;&#30340;&#23454;&#38469;&#29992;&#20363;&#30340;&#25552;&#28860;&#65292;&#22823;&#22810;&#26159;&#28304;&#20110;&#29992;&#25143;&#30340;&#38656;&#35201;&#21644;&#35270;&#28857;&#12290;</p><p>Of course, no one can promise that this book will answer
    every question you have about Subversion.  Sometimes, the
    precision with which it anticipates your questions will seem
    eerily telepathic; yet occasionally, you will stumble into a
    hole in the community's knowledge and come away empty-handed.
    When this happens, the best thing you can do is email
    <code class="email">&lt;<a class="email" href="mailto:users@subversion.tigris.org">users@subversion.tigris.org</a>&gt;</code> and present your
    problem.  The authors are still there and still watching, and the
    authors include not just the three listed on the cover, but many others
    who contributed corrections and original material.  From the
    community's point of view, solving your problem is merely a
    pleasant side effect of a much larger project&#8212;namely,
    slowly adjusting this book, and ultimately Subversion itself, to
    more closely match the way people actually use it.  They are
    eager to hear from you, not only because they can help you, but
    because you can help them.  With Subversion, as with all active
    free software projects, <span class="emphasis"><em>you are not
    alone</em></span>.</p><p>&#35753;&#36825;&#26412;&#20070;&#23558;&#25104;&#20026;&#20320;&#30340;&#31532;&#19968;&#20010;&#20249;&#20276;&#12290;</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.preface.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">Subversion &#26435;&#23041;&#25351;&#21335;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#24207;&#35328;</td></tr></table></div></body></html>