<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</title><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;"><link rel="prev" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;"><link rel="next" href="svn.reposadmin.create.html" title="&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.reposadmin.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.reposadmin.create.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.reposadmin.planning"></a>&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</h2></div></div></div>
      
      <p>Due largely to the simplicity of the overall design of the
      Subversion repository and the technologies on which it relies,
      creating and configuring a repository are fairly straightforward
      tasks.  There are a few preliminary decisions you'll want to
      make, but the actual work involved in any given setup of a
      Subversion repository is pretty basic, tending toward
      mindless repetition if you find yourself setting up multiples of
      these things.</p>
      <p>Some things you'll want to consider beforehand, though, are:</p>
      <div class="itemizedlist"><ul type="disc"><li>
          <p>&#20320;&#30340;&#29256;&#26412;&#24211;&#23558;&#35201;&#23384;&#25918;&#20160;&#20040;&#25968;&#25454;(&#25110;&#22810;&#20010;&#29256;&#26412;&#24211;)&#65292;&#36825;&#20123;&#25968;&#25454;&#22914;&#20309;&#32452;&#32455;&#65311;</p>
        </li><li>
          <p>&#29256;&#26412;&#24211;&#23384;&#25918;&#22312;&#21738;&#37324;&#65292;&#22914;&#20309;&#34987;&#35775;&#38382;&#65311;</p>
        </li><li>
          <p>&#20320;&#38656;&#35201;&#20160;&#20040;&#31867;&#22411;&#30340;&#35775;&#38382;&#25511;&#21046;&#21644;&#29256;&#26412;&#24211;&#20107;&#20214;&#25253;&#21578;&#65311;</p>
        </li><li>
          <p>&#20320;&#24076;&#26395;&#20351;&#29992;&#21738;&#31181;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#65311;</p>
        </li></ul></div>
      <p>&#22312;&#26412;&#33410;&#65292;&#25105;&#20204;&#35201;&#23581;&#35797;&#24110;&#20320;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.projects.chooselayout"></a>&#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;</h3></div></div></div>
        
        <p>&#22312;Subversion&#29256;&#26412;&#24211;&#20013;&#65292;&#31227;&#21160;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#20449;&#24687;&#65292;&#29978;&#33267;&#20063;&#21487;&#20197;&#23558;&#29256;&#26412;&#24211;&#30340;&#30340;&#19968;&#32452;&#25968;&#25454;&#26080;&#25439;&#21382;&#21490;&#30340;&#31227;&#26893;&#21040;&#21478;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#20294;&#26159;&#36825;&#26679;&#19968;&#26469;&#37027;&#20123;&#32463;&#24120;&#35775;&#38382;&#29256;&#26412;&#24211;&#24182;&#19988;&#20197;&#20026;&#25991;&#20214;&#24635;&#26159;&#22312;&#21516;&#19968;&#20010;&#36335;&#24452;&#30340;&#29992;&#25143;&#21487;&#33021;&#20250;&#21463;&#21040;&#24178;&#25200;&#12290;&#20026;&#23558;&#26469;&#30528;&#24819;&#65292;&#26368;&#22909;&#39044;&#20808;&#23545;&#20320;&#30340;&#29256;&#26412;&#24211;&#24067;&#23616;&#36827;&#34892;&#35268;&#21010;&#12290;&#20197;&#19968;&#31181;&#39640;&#25928;&#30340;&#8220;<span class="quote">&#24067;&#23616;</span>&#8221;&#24320;&#22987;&#39033;&#30446;&#65292;&#21487;&#20197;&#20943;&#23569;&#23558;&#26469;&#24456;&#22810;&#19981;&#24517;&#35201;&#30340;&#40635;&#28902;&#12290;</p>
        <p>&#20551;&#22914;&#20320;&#26159;&#19968;&#20010;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#65292;&#38656;&#35201;&#21521;&#22810;&#20010;&#39033;&#30446;&#25552;&#20379;&#29256;&#26412;&#25511;&#21046;&#25903;&#25345;&#12290;&#37027;&#20040;&#65292;&#20320;&#39318;&#20808;&#35201;&#20915;&#23450;&#30340;&#26159;&#65292;&#29992;&#19968;&#20010;&#29256;&#26412;&#24211;&#25903;&#25345;&#22810;&#20010;&#39033;&#30446;&#65292;&#36824;&#26159;&#20026;&#27599;&#20010;&#39033;&#30446;&#24314;&#31435;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#36824;&#26159;&#20004;&#31181;&#26041;&#27861;&#30340;&#28151;&#21512;&#26041;&#24335;&#12290;</p>
        <p>&#20351;&#29992;&#19968;&#20010;&#29256;&#26412;&#24211;&#25903;&#25345;&#22810;&#20010;&#39033;&#30446;&#26377;&#24456;&#22810;&#22909;&#22788;&#65292;&#26368;&#26126;&#26174;&#30340;&#26080;&#36807;&#20110;&#19981;&#38656;&#35201;&#32500;&#25252;&#22909;&#20960;&#20010;&#29256;&#26412;&#24211;&#12290;&#21333;&#19968;&#29256;&#26412;&#24211;&#23601;&#24847;&#21619;&#30528;&#21482;&#26377;&#19968;&#20010;&#38057;&#23376;&#31243;&#24207;&#65292;&#21482;&#38656;&#35201;&#22791;&#20221;&#19968;&#20010;&#25968;&#25454;&#24211;&#65292;&#24403;Subversion&#36827;&#34892;&#19981;&#20860;&#23481;&#21319;&#32423;&#26102;&#65292;&#21482;&#38656;&#35201;&#19968;&#27425;&#36716;&#20648;&#21644;&#35013;&#36733;&#25805;&#20316;&#65292;&#31561;&#31561;&#12290;&#36824;&#26377;&#65292;&#20320;&#21487;&#20197;&#36731;&#26131;&#30340;&#22312;&#39033;&#30446;&#20043;&#38388;&#31227;&#21160;&#25968;&#25454;&#65292;&#36824;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#21382;&#21490;&#29256;&#26412;&#20449;&#24687;&#12290;</p>
        <p>&#21333;&#19968;&#29256;&#26412;&#24211;&#30340;&#32570;&#28857;&#26159;&#65292;&#19981;&#21516;&#30340;&#39033;&#30446;&#36890;&#24120;&#37117;&#26377;&#19981;&#21516;&#30340;&#29256;&#26412;&#24211;&#35302;&#21457;&#20107;&#20214;&#38656;&#27714;&#65292;&#20363;&#22914;&#38656;&#35201;&#21457;&#36865;&#25552;&#20132;&#36890;&#30693;&#37038;&#20214;&#21040;&#19981;&#21516;&#30340;&#37038;&#20214;&#21015;&#34920;&#65292;&#38656;&#35201;&#19981;&#21516;&#30340;&#37492;&#23450;&#25552;&#20132;&#26159;&#21542;&#21512;&#27861;&#30340;&#23450;&#20041;&#12290;&#36825;&#20123;&#37117;&#19981;&#26159;&#19981;&#21487;&#36926;&#36234;&#30340;&#38382;&#39064;&#65292;&#24403;&#28982;&#8212;&#20043;&#38656;&#35201;&#20320;&#30340;&#38057;&#23376;&#31243;&#24207;&#33021;&#22815;&#23519;&#30475;&#29256;&#26412;&#24211;&#30340;&#24067;&#23616;&#65292;&#32780;&#19981;&#26159;&#20551;&#23450;&#25972;&#20010;&#29256;&#26412;&#24211;&#19982;&#21516;&#19968;&#32452;&#20154;&#20851;&#32852;&#12290;&#36824;&#26377;&#65292;&#21035;&#24536;&#20102;Subversion&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#26159;&#38024;&#23545;&#25972;&#20010;&#29256;&#26412;&#24211;&#30340;&#65292;&#36825;&#20123;&#21495;&#30721;&#27809;&#26377;&#20219;&#20309;&#39764;&#21147;&#12290;&#21363;&#20351;&#26368;&#36817;&#27809;&#26377;&#23545;&#26576;&#20010;&#39033;&#30446;&#20316;&#20986;&#20462;&#25913;&#65292;&#29256;&#26412;&#24211;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#36824;&#26159;&#20250;&#22240;&#20026;&#20854;&#23427;&#39033;&#30446;&#30340;&#20462;&#25913;&#32780;&#19981;&#20572;&#30340;&#25552;&#21319;&#65292;&#35768;&#22810;&#20154;&#24182;&#19981;&#21916;&#27426;&#36825;&#26679;&#30340;&#20107;&#23454;&#12290;<sup>[<a name="d4e4337" href="#ftn.d4e4337" class="footnote">26</a>]</sup></p>
        <p>&#21487;&#20197;&#37319;&#29992;&#25240;&#20013;&#30340;&#21150;&#27861;&#12290;&#27604;&#22914;&#65292;&#21487;&#20197;&#25226;&#35768;&#22810;&#39033;&#30446;&#25353;&#29031;&#24444;&#27492;&#20043;&#38388;&#30340;&#20851;&#32852;&#31243;&#24230;&#21010;&#20998;&#20026;&#20960;&#20010;&#32452;&#21512;&#65292;&#28982;&#21518;&#20026;&#27599;&#19968;&#20010;&#39033;&#30446;&#32452;&#21512;&#24314;&#31435;&#19968;&#20010;&#29256;&#26412;&#24211;&#12290;&#36825;&#26679;&#65292;&#22312;&#30456;&#20851;&#39033;&#30446;&#20043;&#38388;&#20849;&#20139;&#25968;&#25454;&#20381;&#26087;&#24456;&#31616;&#21333;&#65292;&#32780;&#22914;&#26524;&#20462;&#35746;&#29256;&#26412;&#21495;&#26377;&#20102;&#21464;&#21270;&#65292;&#33267;&#23569;&#24320;&#21457;&#20154;&#21592;&#30693;&#36947;&#65292;&#25913;&#21464;&#30340;&#19996;&#35199;&#22810;&#23569;&#21644;&#20182;&#20204;&#26377;&#20123;&#20851;&#31995;&#12290;</p>
        <p>After deciding how to organize your projects with respect
        to repositories, you'll probably want to think about directory
        hierarchies within the repositories themselves.  Because
        Subversion uses regular directory copies for branching and
        tagging (see <a class="xref" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;">&#31532;&nbsp;4&nbsp;&#31456; <i>&#20998;&#25903;&#19982;&#21512;&#24182;</i></a>), the
        Subversion community recommends that you choose a repository
        location for each <em class="firstterm">project
        root</em>&#8212;the &#8220;<span class="quote">topmost</span>&#8221; directory
        that contains data related to that project&#8212;and then
        create three subdirectories beneath that root:
        <code class="filename">trunk</code>, meaning the directory under which
        the main project development occurs;
        <code class="filename">branches</code>, which is a directory in which
        to create various named branches of the main development line;
        and <code class="filename">tags</code>, which is a collection of tree
        snapshots that are created, and perhaps destroyed, but never
        changed.
        <sup>[<a name="d4e4347" href="#ftn.d4e4347" class="footnote">27</a>]</sup>
        </p>
        <p>For example, your repository might look like this:</p>
        <pre class="screen">
/
   calc/
      trunk/
      tags/
      branches/
   calendar/
      trunk/
      tags/
      branches/
   spreadsheet/
      trunk/
      tags/
      branches/
   &#8230;
</pre>
        <p>Note that it doesn't matter where in your repository each
        project root is.  If you have only one project per repository,
        the logical place to put each project root is at the root of
        that project's respective repository.  If you have multiple
        projects, you might want to arrange them in groups inside the
        repository, perhaps putting projects with similar goals or
        shared code in the same subdirectory, or maybe just grouping
        them alphabetically.  Such an arrangement might look
        like this:</p>
        <pre class="screen">
/
   utils/
      calc/
         trunk/
         tags/
         branches/
      calendar/
         trunk/
         tags/
         branches/
      &#8230;
   office/
      spreadsheet/
         trunk/
         tags/
         branches/
      &#8230;
</pre>
        <p>&#25353;&#29031;&#20320;&#35748;&#20026;&#21512;&#36866;&#30340;&#26041;&#24335;&#23433;&#25490;&#29256;&#26412;&#24211;&#30340;&#24067;&#23616;&#65292;Subversion&#33258;&#36523;&#24182;&#19981;&#24378;&#21046;&#25110;&#32773;&#20559;&#22909;&#26576;&#19968;&#31181;&#24067;&#23616;&#24418;&#24335;&#65292;&#23545;&#20110;Subversion&#26469;&#35828;&#65292;&#30446;&#24405;&#23601;&#26159;&#30446;&#24405;&#12290;&#26368;&#21518;&#65292;&#22312;&#35774;&#35745;&#29256;&#26412;&#24211;&#24067;&#23616;&#30340;&#26102;&#20505;&#65292;&#19981;&#35201;&#24536;&#20102;&#32771;&#34385;&#19968;&#19979;&#39033;&#30446;&#21442;&#19982;&#32773;&#20204;&#30340;&#24847;&#35265;&#12290;</p>
        <p>In the name of full disclosure, though, we'll mention
        another very common layout.  In this layout, the
        <code class="filename">trunk</code>, <code class="filename">tags</code>, and
        <code class="filename">branches</code> directories live in the root
        directory of your repository, and your projects are in
        subdirectories beneath those, like so:</p>
        <pre class="screen">
/
   trunk/
      calc/
      calendar/
      spreadsheet/
      &#8230;
   tags/
      calc/
      calendar/
      spreadsheet/
      &#8230;
   branches/
      calc/
      calendar/
      spreadsheet/
      &#8230;
</pre>
        <p>There's nothing particularly incorrect about such a
        layout, but it may or may not seem as intuitive for your
        users.  Especially in large, multiproject situations with
        many users, those users may tend to be familiar with only one
        or two of the projects in the repository.  But the
        projects-as-branch-siblings approach tends to deemphasize project
        individuality and focus on the entire set of projects as a
        single entity.  That's a social issue, though.  We like our
        originally suggested arrangement for purely practical
        reasons&#8212;it's easier to ask about (or modify, or migrate
        elsewhere) the entire history of a single project when there's
        a single repository path that holds the entire
        history&#8212;past, present, tagged, and branched&#8212;for
        that project and that project alone.</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.basics.hosting"></a>&#20915;&#23450;&#22312;&#21738;&#37324;&#19982;&#22914;&#20309;&#37096;&#32626;&#20320;&#30340;&#29256;&#26412;&#24211;</h3></div></div></div>
        
        <p>Before creating your Subversion repository, an obvious
        question you'll need to answer is where the thing is going to
        live.  This is strongly connected to myriad other
        questions involving how the repository will be accessed (via a
        Subversion server or directly), by whom (users behind your
        corporate firewall or the whole world out on the open
        Internet), what other services you'll be providing around
        Subversion (repository browsing interfaces, email-based
        commit notification, etc.), your data backup strategy, and so
        on.</p>
        <p>&#25105;&#20204;&#22312;<a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>&#35206;&#30422;&#20102;&#26381;&#21153;&#22120;&#30340;&#36873;&#25321;&#21644;&#37197;&#32622;&#65292;&#25105;&#20204;&#20063;&#25552;&#20379;&#19968;&#20123;&#21487;&#33021;&#20250;&#20351;&#20320;&#24517;&#39035;&#20915;&#23450;&#20351;&#29992;&#26576;&#31181;&#26381;&#21153;&#22120;&#30340;&#38382;&#39064;&#30340;&#31572;&#26696;&#12290;&#20363;&#22914;&#65292;&#29305;&#23450;&#30340;&#37096;&#32626;&#31574;&#30053;&#21487;&#33021;&#20250;&#38656;&#35201;&#20174;&#22810;&#20010;&#35745;&#31639;&#26426;&#36890;&#36807;&#36828;&#31243;&#25991;&#20214;&#31995;&#32479;&#35775;&#38382;&#29256;&#26412;&#24211;&#65292;&#36825;&#20010;&#24773;&#20917;&#19979;(&#19979;&#19968;&#23567;&#33410;&#20250;&#35835;&#21040;)&#35201;&#27714;&#20320;&#19981;&#33021;&#36873;&#25321;&#19968;&#31181;&#29256;&#26412;&#24211;&#21518;&#31471;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#65292;&#22240;&#20026;&#21482;&#26377;&#19968;&#31181;&#21518;&#31471;&#22312;&#36825;&#31181;&#22330;&#26223;&#19979;&#21487;&#20197;&#24037;&#20316;&#12290;</p>
        <p>&#21015;&#20986;&#25152;&#26377;&#30340;Subversion&#21487;&#33021;&#30340;&#37096;&#32626;&#26041;&#27861;&#26159;&#19981;&#21487;&#33021;&#30340;&#65292;&#36229;&#20986;&#20102;&#26412;&#20070;&#30340;&#33539;&#22260;&#65292;&#25105;&#20204;&#21482;&#26159;&#31616;&#21333;&#30340;&#40723;&#21169;&#20320;&#20351;&#29992;&#36825;&#37096;&#20998;&#20869;&#23481;&#21644;&#21442;&#32771;&#26448;&#26009;&#39564;&#35777;&#20320;&#30340;&#24819;&#27861;&#65292;&#24182;&#39044;&#20808;&#35745;&#21010;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.basics.backends"></a>&#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;</h3></div></div></div>
        
        <p>&#22312;Subversion1.1&#20013;&#65292;&#29256;&#26412;&#24211;&#20013;&#26377;&#20004;&#31181;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#8212;&#36890;&#24120;&#21483;&#20570;&#8220;<span class="quote">&#21518;&#31471;</span>&#8221;&#25110;&#20854;&#20182;&#23481;&#26131;&#28151;&#28102;&#30340;&#21517;&#23383;&#65292;&#22914;&#8220;<span class="quote">(&#29256;&#26412;&#21270;&#30340;)&#25991;&#20214;&#31995;&#32479;</span>&#8221;&#65292;&#27599;&#19968;&#20010;&#29256;&#26412;&#24211;&#37117;&#20250;&#20351;&#29992;&#19968;&#31181;&#12290;&#19968;&#31181;&#26159;&#22312;Berkeley DB&#25968;&#25454;&#24211;&#20013;&#23384;&#20648;&#25968;&#25454;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;<span class="quote">BDB&#21518;&#31471;</span>&#8221;&#65307;&#21478;&#19968;&#31181;&#26159;&#20351;&#29992;&#26222;&#36890;&#30340;&#25991;&#20214;&#65292;&#33258;&#23450;&#20041;&#26684;&#24335;&#65292;Subversion&#24320;&#21457;&#32773;&#26681;&#25454;&#20064;&#24815;&#31216;&#20043;&#20026;<em class="firstterm">FSFS</em><sup>[<a name="d4e4381" href="#ftn.d4e4381" class="footnote">28</a>]</sup> &#8212;&#19968;&#31181;&#20351;&#29992;&#26412;&#22320;&#25805;&#20316;&#31995;&#32479;&#25991;&#20214;&#23384;&#20648;&#25968;&#25454;&#30340;&#29256;&#26412;&#21270;&#25991;&#20214;&#31995;&#32479;&#30452;&#25509;&#23454;&#29616;&#8212;&#32780;&#19981;&#26159;&#36890;&#36807;&#26576;&#20010;&#25968;&#25454;&#24211;&#23618;&#25110;&#20854;&#20182;&#25277;&#35937;&#23618;&#26469;&#20445;&#23384;&#25968;&#25454;&#12290;</p>
        <p><a class="xref" href="svn.reposadmin.planning.html#svn.reposadmin.basics.backends.tbl-1" title="&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;">&#34920;&nbsp;5.1 &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;&#8221;</a>&#20174;&#24635;&#20307;&#19978;&#27604;&#36739;&#20102;Berkeley DB&#21644;FSFS&#29256;&#26412;&#24211;&#12290;</p>
        <div class="table"><a name="svn.reposadmin.basics.backends.tbl-1"></a><p class="title"><b>&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;</b></p><div class="table-contents">
          
          <table summary="&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;" border="1"><colgroup><col width="25%"><col width="25%"><col width="25%"><col width="25%"></colgroup><thead><tr><th>&#20998;&#31867;</th><th>&#29305;&#24615;</th><th>Berkeley DB</th><th>FSFS</th></tr></thead><tbody><tr><td rowspan="2">&#21487;&#38752;&#24615;</td><td>&#25968;&#25454;&#23436;&#25972;&#24615;</td><td>When properly deployed, extremely reliable;
                Berkeley DB 4.4 brings auto-recovery</td><td>Older versions had some rarely demonstrated, but
                data-destroying bugs</td></tr><tr><td>&#23545;&#25805;&#20316;&#20013;&#26029;&#30340;&#25935;&#24863;</td><td>Very; crashes and permission problems can leave the
                database &#8220;<span class="quote">&#26964;&#20303;</span>&#8221; requiring journaled
                recovery procedures</td><td>Quite insensitive</td></tr><tr><td rowspan="4">&#21487;&#29992;&#24615;</td><td>&#21487;&#21482;&#35835;&#21152;&#36733;</td><td>&#21542;</td><td>&#26159;</td></tr><tr><td>&#23384;&#20648;&#24179;&#21488;&#26080;&#20851;</td><td>&#21542;</td><td>&#26159;</td></tr><tr><td>&#21487;&#20174;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#35775;&#38382;</td><td>Generally, no</td><td>&#26159;</td></tr><tr><td>&#32452;&#35775;&#38382;&#26435;&#22788;&#29702;</td><td>Sensitive to user umask problems; best if accessed
                by only one user</td><td>Works around umask problems</td></tr><tr><td rowspan="3">&#20280;&#32553;&#24615;</td><td>&#29256;&#26412;&#24211;&#30913;&#30424;&#20351;&#29992;&#24773;&#20917;</td><td>Larger (especially if logfiles aren't purged)</td><td>Smaller</td></tr><tr><td>&#20462;&#35746;&#29256;&#26412;&#26641;&#30340;&#25968;&#37327;</td><td>Database; no problems</td><td>Some older native filesystems don't scale well with
                thousands of entries in a single directory</td></tr><tr><td>&#26377;&#24456;&#22810;&#25991;&#20214;&#30340;&#30446;&#24405;</td><td>Slower</td><td>Faster</td></tr><tr><td rowspan="2">&#24615;&#33021;</td><td>&#26816;&#20986;&#26368;&#26032;&#30340;&#20195;&#30721;</td><td>No meaningful difference</td><td>No meaningful difference</td></tr><tr><td>&#22823;&#30340;&#25552;&#20132;</td><td>Slower overall, but cost is amortized across the
                lifetime of the commit</td><td>Faster overall, but finalization delay may cause 
                client timeouts</td></tr></tbody></table>
        </div></div><br class="table-break">
        <p>&#20004;&#31181;&#21518;&#31471;&#37117;&#26377;&#20248;&#28857;&#21644;&#32570;&#28857;&#65292;&#27809;&#26377;&#19968;&#31181;&#26356;&#21152;&#8220;<span class="quote">&#27491;&#24335;</span>&#8221;&#65292;&#23613;&#31649;&#26032;&#30340;FSFS&#22312;Subversion1.2&#25104;&#20026;&#32570;&#30465;&#25968;&#25454;&#23384;&#20648;&#65292;&#20004;&#32773;&#29992;&#26469;&#23384;&#20648;&#29256;&#26412;&#21270;&#25968;&#25454;&#37117;&#26159;&#21487;&#38752;&#30340;&#12290;&#20294;&#26159;&#23601;&#35937;&#20320;&#22312;<a class="xref" href="svn.reposadmin.planning.html#svn.reposadmin.basics.backends.tbl-1" title="&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;">&#34920;&nbsp;5.1 &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;&#8221;</a>&#30475;&#21040;&#30340;&#65292;FSFS&#21518;&#31471;&#22312;&#37096;&#32626;&#22330;&#26223;&#20013;&#25552;&#20379;&#20102;&#26356;&#22810;&#30340;&#28789;&#27963;&#24615;&#65292;&#26356;&#28789;&#27963;&#24847;&#21619;&#30528;&#20320;&#24456;&#38590;&#38169;&#35823;&#30340;&#37197;&#32622;&#12290;&#37027;&#20123;&#21407;&#22240;&#8212;&#21152;&#19978;&#19981;&#20351;&#29992;Berkeley DB&#24847;&#21619;&#30528;&#22312;&#36825;&#20010;&#31995;&#32479;&#26377;&#26356;&#23569;&#30340;&#32452;&#20214;&#8212;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#20170;&#22825;&#20960;&#20046;&#25152;&#26377;&#30340;&#20154;&#37117;&#20351;&#29992;FSFS&#26469;&#21019;&#24314;&#26032;&#30340;&#29256;&#26412;&#24211;&#12290;</p>
        <p>&#24184;&#36816;&#30340;&#26159;&#65292;&#22823;&#22810;&#25968;&#35775;&#38382;Subversion&#30340;&#31243;&#24207;&#19981;&#20250;&#22312;&#24847;&#20854;&#25152;&#29992;&#30340;&#21518;&#31471;&#25968;&#25454;&#23384;&#20648;&#12290;&#32780;&#19988;&#20320;&#19981;&#24517;&#19968;&#23450;&#35201;&#20351;&#29992;&#20320;&#26368;&#21021;&#30340;&#25968;&#25454;&#23384;&#20648;&#26041;&#27861;&#8212;&#22914;&#26524;&#21518;&#26469;&#20320;&#25913;&#21464;&#20102;&#20027;&#24847;&#65292;Subversion&#25552;&#20379;&#20102;&#31227;&#26893;&#29256;&#26412;&#24211;&#25968;&#25454;&#21040;&#21478;&#19968;&#20010;&#29256;&#26412;&#24211;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#20250;&#22312;&#21518;&#38754;&#35814;&#32454;&#35752;&#35770;&#12290;</p>
        <p>&#19979;&#38754;&#30340;&#23567;&#33410;&#25552;&#20379;&#20102;&#25968;&#25454;&#23384;&#20648;&#31867;&#22411;&#26356;&#21152;&#35814;&#32454;&#30340;&#20171;&#32461;&#12290;</p>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.reposadmin.basics.backends.bdb"></a>Berkeley DB</h4></div></div></div>
          
          <p>When the initial design phase of Subversion was in
          progress, the developers decided to use Berkeley DB for a
          variety of reasons, including its open source license,
          transaction support, reliability, performance, API
          simplicity, thread safety, support for cursors, and so
          on.</p>
          <p>Berkeley DB provides real transaction
          support&#8212;perhaps its most powerful feature.  Multiple
          processes accessing your Subversion repositories don't have
          to worry about accidentally clobbering each other's data.
          The isolation provided by the transaction system is such
          that for any given operation, the Subversion repository code
          sees a static view of the database&#8212;not a database that
          is constantly changing at the hand of some other
          process&#8212;and can make decisions based on that view.  If
          the decision made happens to conflict with what another
          process is doing, the entire operation is rolled back as though
          it never happened, and Subversion gracefully retries the
          operation against a new, updated (and yet still static) view
          of the database.</p>
          <p>Berkeley DB&#21478;&#19968;&#20010;&#24378;&#22823;&#30340;&#29305;&#24615;&#26159;&#28909;&#22791;&#20221;&#65293;&#19981;&#24517;&#8220;<span class="quote">&#33073;&#26426;</span>&#8221;&#23601;&#21487;&#20197;&#22791;&#20221;&#25968;&#25454;&#24211;&#29615;&#22659;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#23558;&#20250;&#22312;<a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.backup" title="&#29256;&#26412;&#24211;&#22791;&#20221;">&#8220;&#29256;&#26412;&#24211;&#22791;&#20221;&#8221;&#19968;&#33410;</a>&#35752;&#35770;&#22914;&#20309;&#22791;&#20221;&#20320;&#30340;&#29256;&#26412;&#24211;&#65292;&#33021;&#22815;&#19981;&#20572;&#27490;&#31995;&#32479;&#23545;&#29256;&#26412;&#24211;&#20570;&#20840;&#38754;&#22791;&#20221;&#30340;&#22909;&#22788;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#12290;</p>
          <p>Berkeley DB&#21516;&#26102;&#26159;&#19968;&#20010;&#21487;&#20449;&#36182;&#30340;&#25968;&#25454;&#24211;&#31995;&#32479;&#12290;Subversion&#21033;&#29992;&#20102;Berkeley DB&#21487;&#20197;&#35760;&#26085;&#24535;&#30340;&#20415;&#21033;&#65292;&#36825;&#24847;&#21619;&#30528;&#25968;&#25454;&#24211;&#20808;&#22312;&#30913;&#30424;&#19978;&#20889;&#19968;&#20010;&#26085;&#24535;&#25991;&#20214;&#65292;&#25551;&#36848;&#23427;&#23558;&#35201;&#20570;&#30340;&#20462;&#25913;&#65292;&#28982;&#21518;&#20877;&#20570;&#36825;&#20123;&#20462;&#25913;&#12290;&#36825;&#26159;&#20026;&#20102;&#30830;&#20445;&#22914;&#26524;&#22914;&#26524;&#20219;&#20309;&#22320;&#26041;&#20986;&#20102;&#24046;&#38169;&#65292;&#25968;&#25454;&#24211;&#31995;&#32479;&#33021;&#24674;&#22797;&#21040;&#20808;&#21069;&#30340;<em class="firstterm">&#26816;&#26597;&#28857;</em>&#8212;&#19968;&#20010;&#26085;&#24535;&#25991;&#20214;&#35748;&#20026;&#27809;&#26377;&#38169;&#35823;&#30340;&#20301;&#32622;&#65292;&#37325;&#26032;&#24320;&#22987;&#20107;&#21153;&#30452;&#21040;&#25968;&#25454;&#24674;&#22797;&#20026;&#19968;&#20010;&#21487;&#29992;&#30340;&#29366;&#24577;&#12290;&#20851;&#20110;Berkeley DB&#26085;&#24535;&#25991;&#20214;&#30340;&#26356;&#22810;&#20449;&#24687;&#35831;&#26597;&#30475;<a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.diskspace" title="&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;">&#8220;&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;&#8221;&#19968;&#33410;</a>&#12290;</p>
          <p>But every rose has its thorn, and so we must note some
          known limitations of Berkeley DB.  First, Berkeley DB
          environments are not portable.  You cannot simply copy a
          Subversion repository that was created on a Unix system onto
          a Windows system and expect it to work.  While much of the
          Berkeley DB database format is architecture-independent,
          other aspects of the environment are not.
          Second, Subversion uses Berkeley DB in a way that will not
          operate on Windows 95/98 systems&#8212;if you need to house
          a BDB-backed repository on a Windows machine, stick with
          Windows 2000 or later.</p>
          <p>&#28982;&#32780;Berkeley DB&#23545;&#20110;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#32452;&#35268;&#33539;&#65292;<sup>[<a name="d4e4467" href="#ftn.d4e4467" class="footnote">29</a>]</sup>&#22823;&#22810;&#25968;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#21644;&#24212;&#29992;&#27809;&#26377;&#23454;&#29616;&#36825;&#20010;&#35201;&#27714;&#65292;&#25152;&#20197;&#19981;&#33021;&#20801;&#35768;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#30340;BDB&#21518;&#31471;&#29256;&#26412;&#24211;&#34987;&#22810;&#20010;&#23458;&#25143;&#31471;&#21516;&#26102;&#35775;&#38382;(&#39318;&#20808;&#35201;&#30693;&#36947;&#29256;&#26412;&#24211;&#23384;&#25918;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#26159;&#38750;&#24120;&#26222;&#36941;&#30340;)&#12290;</p>
          <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#35686;&#21578;</h3>
            <p>&#22914;&#26524;&#20320;&#23581;&#35797;&#22312;&#19981;&#39034;&#20174;&#30340;&#36828;&#31243;&#25991;&#20214;&#31995;&#32479;&#19978;&#20351;&#29992;Berkeley DB&#65292;&#32467;&#26524;&#26159;&#19981;&#21487;&#39044;&#30693;&#30340;&#8212;&#20320;&#20250;&#31435;&#21051;&#30475;&#21040;&#31070;&#31192;&#30340;&#38169;&#35823;&#65292;&#25110;&#32773;&#26159;&#22312;&#21457;&#29983;&#38544;&#21547;&#38169;&#35823;&#20043;&#21518;&#20960;&#20010;&#26376;&#20043;&#21518;&#25165;&#21457;&#29616;&#12290;&#20320;&#24517;&#39035;&#35748;&#30495;&#32771;&#34385;&#22312;&#32593;&#32476;&#20849;&#20139;&#24773;&#20917;&#19979;&#20351;&#29992;FSFS&#25968;&#25454;&#23384;&#20648;&#12290;</p>
          </div>
          <p>&#26368;&#21518;&#65292;&#22240;&#20026;Berkeley DB&#30340;&#24211;&#30452;&#25509;&#38142;&#25509;&#21040;&#20102;Subversion&#20013;&#65292;&#23427;&#23545;&#20110;&#20013;&#26029;&#27604;&#20856;&#22411;&#30340;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#31995;&#32479;&#26356;&#20026;&#25935;&#24863;&#12290;&#22823;&#22810;&#25968;SQL&#31995;&#32479;&#65292;&#20030;&#20363;&#26469;&#35828;&#65292;&#26377;&#19968;&#20010;&#20027;&#26381;&#21153;&#36827;&#31243;&#26469;&#21327;&#35843;&#23545;&#25968;&#25454;&#24211;&#34920;&#30340;&#35775;&#38382;&#12290;&#22914;&#26524;&#19968;&#20010;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#31243;&#24207;&#22240;&#20026;&#26576;&#31181;&#21407;&#22240;&#20986;&#29616;&#38382;&#39064;&#65292;&#25968;&#25454;&#24211;&#23432;&#25252;&#36827;&#31243;&#23519;&#35273;&#21040;&#36830;&#25509;&#20013;&#26029;&#20250;&#20570;&#19968;&#20123;&#28165;&#29702;&#12290;&#22240;&#20026;&#25968;&#25454;&#24211;&#23432;&#25252;&#36827;&#31243;&#26159;&#21807;&#19968;&#35775;&#38382;&#25968;&#25454;&#24211;&#34920;&#30340;&#36827;&#31243;&#65292;&#24212;&#29992;&#31243;&#24207;&#19981;&#38656;&#35201;&#25285;&#24515;&#35775;&#38382;&#35768;&#21487;&#30340;&#20914;&#31361;&#12290;&#20294;&#26159;&#65292;&#36825;&#20123;&#24773;&#20917;&#19982;Berkeley DB&#19981;&#21516;&#12290;Subversion(&#21644;&#20351;&#29992;Subversion&#24211;&#30340;&#31243;&#24207;)&#30452;&#25509;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#34920;&#65292;&#36825;&#24847;&#21619;&#30528;&#22914;&#26524;&#26377;&#19968;&#20010;&#31243;&#24207;&#23849;&#28291;&#65292;&#23601;&#20250;&#20351;&#25968;&#25454;&#24211;&#22788;&#20110;&#19968;&#20010;&#26242;&#26102;&#30340;&#19981;&#19968;&#33268;&#12289;&#19981;&#21487;&#35775;&#38382;&#30340;&#29366;&#24577;&#12290;&#24403;&#36825;&#31181;&#24773;&#20917;&#21457;&#29983;&#26102;&#65292;&#31649;&#29702;&#21592;&#38656;&#35201;&#35753;Berkeley DB&#24674;&#22797;&#21040;&#19968;&#20010;&#26816;&#26597;&#28857;&#65292;&#36825;&#30340;&#30830;&#26377;&#28857;&#35752;&#21388;&#12290;&#38500;&#20102;&#23849;&#28291;&#30340;&#36827;&#31243;&#65292;&#36824;&#26377;&#19968;&#20123;&#24773;&#20917;&#33021;&#35753;&#29256;&#26412;&#24211;&#20986;&#29616;&#24322;&#24120;&#65292;&#27604;&#22914;&#31243;&#24207;&#22312;&#25968;&#25454;&#24211;&#25991;&#20214;&#30340;&#25152;&#26377;&#26435;&#25110;&#35775;&#38382;&#26435;&#38480;&#19978;&#21457;&#29983;&#20914;&#31361;&#12290;</p>
          <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3>
            <p>Berkeley DB 4.4 brings (to Subversion 1.4 and later)
            the ability for Subversion to automatically and
            transparently recover Berkeley DB environments in need of
            such recovery.  When a Subversion process attaches to a
            repository's Berkeley DB environment, it uses some process
            accounting mechanisms to detect any unclean disconnections
            by previous processes, performs any necessary recovery,
            and then continues on as though nothing happened.  This
            doesn't completely eliminate instances of repository
            wedging, but it does drastically reduce the amount of
            human interaction required to recover from them.</p>
          </div>
          <p>So while a Berkeley DB repository is quite fast and
          scalable, it's best used by a single server process running
          as one user&#8212;such as Apache's <span class="command"><strong>httpd</strong></span>
          or <span class="command"><strong>svnserve</strong></span> (see <a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>)&#8212;rather than accessing it
          as many different users via <code class="literal">file://</code> or
          <code class="literal">svn+ssh://</code> URLs.  If you're accessing a Berkeley
          DB repository directly as multiple users, be sure to read
          <a class="xref" href="svn.serverconfig.multimethod.html" title="&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;">&#8220;&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;&#8221;&#19968;&#33410;</a> later in this
          chapter.</p>
        </div>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.reposadmin.basics.backends.fsfs"></a>FSFS</h4></div></div></div>
          
          <p>&#22312;2004&#24180;&#20013;&#26399;&#65292;&#21478;&#19968;&#31181;&#29256;&#26412;&#24211;&#23384;&#20648;&#31995;&#32479;&#24930;&#24930;&#24418;&#25104;&#20102;&#65306;&#19968;&#31181;&#19981;&#38656;&#35201;&#25968;&#25454;&#24211;&#30340;&#23384;&#20648;&#31995;&#32479;&#12290;FSFS&#29256;&#26412;&#24211;&#22312;&#21333;&#19968;&#25991;&#20214;&#20013;&#23384;&#20648;&#20462;&#35746;&#29256;&#26412;&#26641;&#65292;&#25152;&#20197;&#29256;&#26412;&#24211;&#20013;&#25152;&#26377;&#30340;&#20462;&#35746;&#29256;&#26412;&#37117;&#22312;&#19968;&#20010;&#23376;&#25991;&#20214;&#22841;&#20013;&#26377;&#38480;&#30340;&#20960;&#20010;&#25991;&#20214;&#37324;&#12290;&#20107;&#21153;&#22312;&#21333;&#29420;&#30340;&#23376;&#30446;&#24405;&#20013;&#34987;&#21019;&#24314;&#65292;&#21019;&#24314;&#23436;&#25104;&#21518;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#20107;&#21153;&#25991;&#20214;&#34987;&#21019;&#24314;&#24182;&#31227;&#21160;&#21040;&#20462;&#35746;&#29256;&#26412;&#30446;&#24405;&#65292;&#36825;&#20445;&#35777;&#25552;&#20132;&#26159;&#21407;&#23376;&#24615;&#30340;&#12290;&#22240;&#20026;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#25991;&#20214;&#26159;&#25345;&#20037;&#19981;&#21487;&#25913;&#21464;&#30340;&#65292;&#29256;&#26412;&#24211;&#20063;&#21487;&#20197;&#20570;&#21040;&#8220;<span class="quote">&#28909;</span>&#8221;&#22791;&#20221;&#65292;&#23601;&#35937;Berkeley DB&#29256;&#26412;&#24211;&#19968;&#26679;&#12290;</p>
          <p>The FSFS revision files describe a revision's
          directory structure, file contents, and deltas against files
          in other revision trees.  Unlike a Berkeley DB database,
          this storage format is portable across different operating
          systems and isn't sensitive to CPU architecture.  Because
          no journaling or shared-memory files are being used, the
          repository can be safely accessed over a network filesystem
          and examined in a read-only environment.  The lack of
          database overhead also means the overall repository
          size is a bit smaller.</p>
          <p>FSFS has different performance characteristics, too.
          When committing a directory with a huge number of files,
          FSFS is able to more quickly append directory entries.  On
          the other hand, FSFS writes the latest version of a file as
          a delta against an earlier version, which means that
          checking out the latest tree is a bit slower than fetching
          the full-texts stored in a Berkeley DB HEAD revision.  FSFS
          also has a longer delay when finalizing a commit, which
          could in extreme cases cause clients to time out while
          waiting for a response.</p>
          <p>&#26368;&#37325;&#35201;&#30340;&#21306;&#21035;&#26159;&#24403;&#20986;&#29616;&#38169;&#35823;&#26102;FSFS&#19981;&#20250;&#26964;&#20303;&#30340;&#33021;&#21147;&#12290;&#22914;&#26524;&#20351;&#29992;Berkeley DB&#30340;&#36827;&#31243;&#21457;&#29983;&#35768;&#21487;&#38169;&#35823;&#25110;&#31361;&#28982;&#23849;&#28291;&#65292;&#25968;&#25454;&#24211;&#20250;&#19968;&#30452;&#26080;&#27861;&#20351;&#29992;&#65292;&#30452;&#21040;&#31649;&#29702;&#21592;&#24674;&#22797;&#12290;&#20551;&#22914;&#22312;&#24212;&#29992;FSFS&#29256;&#26412;&#24211;&#26102;&#21457;&#29983;&#21516;&#26679;&#30340;&#24773;&#20917;&#65292;&#29256;&#26412;&#24211;&#19981;&#20250;&#21463;&#21040;&#20219;&#20309;&#24178;&#25200;&#65292;&#26368;&#22351;&#24773;&#20917;&#19979;&#20063;&#23601;&#26159;&#20250;&#30041;&#19979;&#19968;&#20123;&#20107;&#21153;&#25968;&#25454;&#12290;</p>
          <p>The only real argument against FSFS is its relative
          immaturity compared to Berkeley DB.  Unlike Berkeley DB,
          which has years of history, its own dedicated development
          team, and, now, Oracle's mighty name attached to it,
          <sup>[<a name="d4e4491" href="#ftn.d4e4491" class="footnote">30</a>]</sup>
          FSFS is a newer bit of engineering.  Prior to Subversion
          1.4, it was still shaking out some pretty serious data
          integrity bugs, which, while triggered in only very rare
          cases, nonetheless did occur.  That said, FSFS has quickly
          become the backend of choice for some of the largest public
          and private Subversion repositories, and it promises a lower
          barrier to entry for Subversion across the board.</p>
        </div>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e4337" href="#d4e4337" class="para">26</a>] </sup>&#26080;&#35770;&#26159;&#22312;&#24573;&#30053;&#24773;&#20917;&#19979;&#24314;&#31435;&#25110;&#24456;&#23569;&#32771;&#34385;&#36807;&#22914;&#20309;&#20135;&#29983;&#27491;&#30830;&#30340;&#36719;&#20214;&#24320;&#21457;&#30697;&#38453;&#65292;&#37117;&#19981;&#24212;&#35813;&#24858;&#34850;&#30340;&#25285;&#24515;&#20840;&#23616;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#65292;&#36825;&#19981;&#24212;&#35813;&#25104;&#20026;&#23433;&#25490;&#39033;&#30446;&#21644;&#29256;&#26412;&#24211;&#30340;&#29702;&#30001;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e4347" href="#d4e4347" class="para">27</a>] </sup>The <code class="filename">trunk</code>, <code class="filename">tags</code>, 
            and <code class="filename">branches</code> trio is sometimes referred
            to as &#8220;<span class="quote">the TTB directories.</span>&#8221;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e4381" href="#d4e4381" class="para">28</a>] </sup>&#36890;&#24120;&#35835;&#20316;&#8220;<span class="quote">fuzz-fuzz</span>&#8221;, &#22914;&#26524;Jack Repenning&#35828;&#36215;&#36825;&#20010;&#38382;&#39064;&#12290;(&#26412;&#20070;&#65292;&#20551;&#23450;&#35835;&#32773;&#35748;&#20026;&#26159;&#8220;<span class="quote">eff-ess-eff-ess</span>&#8221;&#12290;)</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e4467" href="#d4e4467" class="para">29</a>] </sup>Berkeley DB&#38656;&#35201;&#24213;&#23618;&#30340;&#25991;&#20214;&#31995;&#32479;&#23454;&#29616;&#20005;&#26684;&#30340;POSIX&#38145;&#23450;&#35821;&#27861;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#23558;&#25991;&#20214;&#30452;&#25509;&#26144;&#23556;&#21040;&#20869;&#23384;&#30340;&#33021;&#21147;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e4491" href="#d4e4491" class="para">30</a>] </sup>Oracle&#22312;2006&#24773;&#20154;&#33410;&#36141;&#20080;&#20102;Sleepycat&#21644;&#23427;&#30340;&#26071;&#33328;&#36719;&#20214;Berkeley DB&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.reposadmin.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.reposadmin.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.reposadmin.create.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;</td></tr></table></div></body></html>