<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;</title><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="svn.advanced.externals.html" title="&#22806;&#37096;&#23450;&#20041;"><link rel="next" href="svn.advanced.changelists.html" title="&#20462;&#25913;&#21015;&#34920;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.advanced.externals.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.changelists.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.pegrevs"></a>Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;</h2></div></div></div>
      
      <p>&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#25335;&#36125;&#12289;&#25913;&#21517;&#21644;&#31227;&#21160;&#33021;&#21147;&#20351;&#20320;&#21487;&#20197;&#21019;&#24314;&#19968;&#20010;&#39033;&#30446;&#65292;&#28982;&#21518;&#21024;&#38500;&#23427;&#65292;&#28982;&#21518;&#22312;&#21516;&#19968;&#20010;&#20301;&#32622;&#28155;&#21152;&#19968;&#20010;&#26032;&#30340;&#8212;&#36825;&#26159;&#22312;&#25105;&#20204;&#30340;&#35745;&#31639;&#26426;&#20013;&#32463;&#24120;&#21457;&#29983;&#30340;&#25805;&#20316;&#65292;&#32780;&#20320;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#19981;&#24212;&#35813;&#25104;&#20026;&#20320;&#36825;&#26679;&#25805;&#20316;&#30340;&#38556;&#30861;&#12290;Subversion&#30340;&#25991;&#20214;&#31649;&#29702;&#25805;&#20316;&#26159;&#36825;&#26679;&#30340;&#24320;&#25918;&#65292;&#25552;&#20379;&#20102;&#20960;&#20046;&#21644;&#26222;&#36890;&#25991;&#20214;&#19968;&#26679;&#30340;&#25805;&#20316;&#29256;&#26412;&#21270;&#25991;&#20214;&#30340;&#28789;&#27963;&#24615;&#65292;&#20294;&#26159;&#28789;&#27963;&#24847;&#21619;&#30528;&#22312;&#25972;&#20010;&#29256;&#26412;&#24211;&#30340;&#29983;&#21629;&#21608;&#26399;&#20013;&#65292;&#19968;&#20010;&#32473;&#23450;&#30340;&#29256;&#26412;&#21270;&#30340;&#36164;&#28304;&#21487;&#33021;&#20250;&#20986;&#29616;&#22312;&#35768;&#22810;&#19981;&#21516;&#30340;&#36335;&#24452;&#65292;&#19968;&#20010;&#32473;&#23450;&#30340;&#36335;&#24452;&#20250;&#23637;&#31034;&#32473;&#25105;&#20204;&#35768;&#22810;&#23436;&#20840;&#19981;&#21516;&#30340;&#29256;&#26412;&#21270;&#36164;&#28304;&#12290;&#24403;&#28982;&#36825;&#20123;&#21151;&#33021;&#20063;&#22686;&#21152;&#20102;&#20320;&#19982;&#36825;&#20123;&#36335;&#24452;&#21644;&#36164;&#28304;&#20132;&#20114;&#30340;&#38590;&#24230;&#12290;</p>
      <p>Subversion&#21487;&#20197;&#38750;&#24120;&#32874;&#26126;&#30340;&#27880;&#24847;&#21040;&#19968;&#20010;&#23545;&#35937;&#30340;&#21253;&#25324;&#19968;&#20010;&#8220;<span class="quote">&#22320;&#22336;&#25913;&#21464;</span>&#8221;&#21382;&#21490;&#21464;&#21270;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#22914;&#26524;&#20320;&#35810;&#38382;&#19968;&#20010;&#26366;&#32463;&#19978;&#21608;&#25913;&#36807;&#21517;&#30340;&#25991;&#20214;&#30340;&#25152;&#26377;&#30340;&#26085;&#24535;&#20449;&#24687;&#65292;Subversion&#20250;&#24456;&#39640;&#20852;&#25552;&#20379;&#25152;&#26377;&#30340;&#26085;&#24535;&#8212;&#37325;&#21629;&#21517;&#21457;&#29983;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#22806;&#21152;&#30456;&#20851;&#29256;&#26412;&#20043;&#21069;&#21644;&#20043;&#21518;&#30340;&#20462;&#35746;&#29256;&#26412;&#26085;&#24535;&#65292;&#25152;&#20197;&#22823;&#22810;&#25968;&#26102;&#38388;&#37324;&#65292;&#20320;&#19981;&#38656;&#35201;&#32771;&#34385;&#36825;&#20123;&#20107;&#24773;&#65292;&#20294;&#26159;&#20598;&#23572;&#65292;Subversion&#20250;&#38656;&#35201;&#20320;&#30340;&#24110;&#21161;&#26469;&#28165;&#38500;&#28151;&#28102;&#12290;</p>
      <p>&#36825;&#20010;&#26368;&#31616;&#21333;&#30340;&#20363;&#23376;&#21457;&#29983;&#22312;&#24403;&#19968;&#20010;&#30446;&#24405;&#25110;&#32773;&#25991;&#20214;&#20174;&#29256;&#26412;&#25511;&#21046;&#20013;&#21024;&#38500;&#26102;&#65292;&#28982;&#21518;&#19968;&#20010;&#26032;&#30340;&#21516;&#26679;&#21517;&#23383;&#30446;&#24405;&#25110;&#32773;&#25991;&#20214;&#28155;&#21152;&#21040;&#29256;&#26412;&#25511;&#21046;&#65292;&#26174;&#28982;&#20320;&#21024;&#38500;&#30340;&#21644;&#20320;&#21518;&#26469;&#28155;&#21152;&#30340;&#19981;&#26159;&#21516;&#26679;&#30340;&#19996;&#35199;&#65292;&#23427;&#20204;&#20165;&#20165;&#26159;&#26377;&#21516;&#26679;&#30340;&#36335;&#24452;&#65292;&#20363;&#22914;<code class="filename">/trunk/object</code>&#12290;&#20160;&#20040;&#65292;&#36825;&#24847;&#21619;&#30528;&#35810;&#38382;Subversion&#26469;&#26597;&#30475;<code class="filename">/trunk/object</code>&#30340;&#21382;&#21490;&#65311;&#20320;&#26159;&#35810;&#38382;&#24403;&#21069;&#36825;&#20010;&#20301;&#32622;&#30340;&#19996;&#35199;&#36824;&#26159;&#20320;&#22312;&#36825;&#20010;&#20301;&#32622;&#21024;&#38500;&#30340;&#37027;&#20010;&#23545;&#35937;&#65311;&#20320;&#26159;&#24076;&#26395;&#35810;&#38382;&#23545;&#36825;&#20010;&#23545;&#35937;&#30340;&#25152;&#26377;&#25805;&#20316;&#36824;&#26159;&#36825;&#20010;&#36335;&#24452;&#30340;&#25152;&#26377;&#23545;&#35937;&#65311;&#24456;&#26126;&#26174;&#65292;Subversion&#38656;&#35201;&#32447;&#32034;&#30693;&#36947;&#20320;&#30495;&#23454;&#30340;&#24819;&#27861;&#12290;</p>
      <p>And thanks to moves, versioned object history can get far
      more twisted than even that.  For example, you might have a
      directory named <code class="filename">concept</code>, containing some
      nascent software project you've been toying with.  Eventually,
      though, that project matures to the point that the idea seems to
      actually have some wings, so you do the unthinkable and decide
      to give the project a name.
      <sup>[<a name="d4e2771" href="#ftn.d4e2771" class="footnote">16</a>]</sup>
      Let's say you called your software Frabnaggilywort.  At this
      point, it makes sense to rename the directory to reflect the
      project's new name, so <code class="filename">concept</code> is renamed
      to <code class="filename">frabnaggilywort</code>.  Life goes on,
      Frabnaggilywort releases a 1.0 version and is downloaded and
      used daily by hordes of people aiming to improve their
      lives.</p>
      <p>&#36825;&#26159;&#19968;&#20010;&#32654;&#22909;&#30340;&#25925;&#20107;&#65292;&#20294;&#26159;&#27809;&#26377;&#22312;&#36825;&#37324;&#32467;&#26463;&#65292;&#20316;&#20026;&#20027;&#21150;&#20154;&#65292;&#20320;&#19968;&#23450;&#24819;&#21040;&#20102;&#21478;&#19968;&#20214;&#20107;&#65292;&#25152;&#20197;&#20320;&#21019;&#24314;&#20102;&#19968;&#20010;&#30446;&#24405;&#21483;&#20570;<code class="filename">concept</code>&#65292;&#21608;&#26399;&#37325;&#26032;&#24320;&#22987;&#12290;&#23454;&#38469;&#19978;&#65292;&#36825;&#20010;&#24490;&#29615;&#22312;&#20960;&#24180;&#37324;&#24320;&#22987;&#20102;&#22810;&#27425;&#65292;&#27599;&#19968;&#20010;&#24819;&#27861;&#20174;&#20351;&#29992;&#26087;&#30340;<code class="filename">concept</code>&#30446;&#24405;&#24320;&#22987;&#65292;&#28982;&#21518;&#26377;&#26102;&#22312;&#24819;&#27861;&#25104;&#29087;&#20043;&#21518;&#37325;&#26032;&#21629;&#21517;&#65292;&#26377;&#26102;&#20320;&#25918;&#24323;&#20102;&#36825;&#20010;&#27880;&#24847;&#32780;&#21024;&#38500;&#20102;&#36825;&#20010;&#30446;&#24405;&#12290;&#25110;&#32773;&#26356;&#21152;&#21464;&#24577;&#19968;&#28857;&#65292;&#25110;&#35768;&#20320;&#25226;<code class="filename">concept</code>&#25913;&#25104;&#20854;&#20182;&#21517;&#23383;&#20043;&#21518;&#21448;&#22240;&#20026;&#19968;&#20123;&#21407;&#22240;&#37325;&#26032;&#25913;&#22238;<code class="filename">concept</code>&#12290;</p>
      <p>In scenarios like these, attempting to instruct
      Subversion to work with these reused paths can be a little like
      instructing a motorist in Chicago's West Suburbs to drive east
      down Roosevelt Road and turn left onto Main Street.  In a mere
      20 minutes, you can cross &#8220;<span class="quote">Main Street</span>&#8221; in
      Wheaton, Glen Ellyn, and Lombard.  And no, they aren't the same
      street.  Our motorist&#8212;and our Subversion&#8212;need a
      little more detail to do the right thing.</p>
      <p>&#22312;1.1&#29256;&#26412;&#65292;Subversion&#25552;&#20379;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#35828;&#26126;&#20320;&#25152;&#25351;&#26159;&#21738;&#19968;&#20010;&#34903;&#36947;&#65292;&#21483;&#20570;<em class="firstterm">peg&#20462;&#35746;&#29256;&#26412;</em>&#65292;&#36890;&#36807;&#36825;&#20010;&#20462;&#35746;&#29256;&#26412;&#25105;&#20204;&#21487;&#20197;&#21807;&#19968;&#30830;&#23450;&#19968;&#26465;&#21382;&#21490;&#32447;&#36335;&#65292;&#22240;&#20026;&#19968;&#20010;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#20250;&#22312;&#20219;&#20309;&#26102;&#38388;&#21344;&#29992;&#26576;&#20010;&#36335;&#24452;&#8212;&#36335;&#24452;&#21644;peg&#20462;&#35746;&#29256;&#26412;&#30340;&#21512;&#24182;&#26159;&#21487;&#20197;&#25351;&#23450;&#19968;&#20010;&#21382;&#21490;&#30340;&#29305;&#23450;&#32447;&#36335;&#12290;Peg&#20462;&#35746;&#29256;&#26412;&#21487;&#20197;&#22312;Subversion&#21629;&#20196;&#34892;&#23458;&#25143;&#31471;&#20013;&#29992;<em class="firstterm">at&#35821;&#27861;</em>&#25351;&#23450;&#65292;&#20043;&#25152;&#20197;&#20351;&#29992;&#36825;&#20010;&#21517;&#31216;&#26159;&#22240;&#20026;&#20250;&#22312;&#20851;&#32852;&#30340;&#20462;&#35746;&#29256;&#26412;&#30340;&#36335;&#24452;&#21518;&#38754;&#36861;&#21152;&#19968;&#20010;&#8220;<span class="quote">at&#31526;&#21495;</span>&#8221;(<code class="literal">@</code>)&#12290;</p>
      <p>But what of the <code class="option">--revision</code>
      (<code class="option">-r</code>) of which we've spoken so much in this
      book?  That revision (or set of revisions) is called the
      <em class="firstterm">operative revision</em> (or
      <em class="firstterm">operative revision range</em>).  Once a
      particular line of history has been identified using a path and
      peg revision, Subversion performs the requested operation using
      the operative revision(s).  To map this to our Chicagoland
      streets analogy, if we are told to go to 606 N. Main Street in
      Wheaton,
      <sup>[<a name="d4e2793" href="#ftn.d4e2793" class="footnote">17</a>]</sup>
      we can think of &#8220;<span class="quote">Main Street</span>&#8221; as our path and
      &#8220;<span class="quote">Wheaton</span>&#8221; as our peg revision.  These two pieces of
      information identify a unique path that can be traveled (north or
      south on Main Street), and they keep us from traveling up and
      down the wrong Main Street in search of our destination.  Now we
      throw in &#8220;<span class="quote">606 N.</span>&#8221; as our operative revision of
      sorts, and we know <span class="emphasis"><em>exactly</em></span> where to
      go.</p>
      <div class="sidebar"><p class="title"><b>Peg &#20462;&#35746;&#29256;&#26412;&#31639;&#27861;</b></p>
        
        <p>The Subversion command-line client performs the peg revision
        algorithm any time it needs to resolve possible ambiguities in
        the paths and revisions provided to it.  Here's an example of
        such an invocation:</p>
        <pre class="screen">
$ svn <em class="replaceable"><code>command</code></em> -r <em class="replaceable"><code>OPERATIVE-REV</code></em> item@<em class="replaceable"><code>PEG-REV</code></em>
</pre>
        <p>If <em class="replaceable"><code>OPERATIVE-REV</code></em> is older than
        <em class="replaceable"><code>PEG-REV</code></em>, the algorithm is as
        follows:</p>
        <div class="orderedlist"><ol type="1"><li>
            <p>&#26469;&#21040;&#20462;&#35746;&#29256;&#26412;<em class="replaceable"><code>PEG-REV</code></em>&#65292;&#25214;&#21040;<em class="replaceable"><code>item</code></em>&#65292;&#22312;&#29256;&#26412;&#24211;&#23450;&#20301;&#21040;&#19968;&#20010;&#21807;&#19968;&#30340;&#23545;&#35937;&#12290;</p>
          </li><li>
            <p>&#36861;&#36394;&#23545;&#35937;&#30340;&#21382;&#21490;&#32972;&#26223;(&#36890;&#36807;&#20219;&#20309;&#21487;&#33021;&#30340;&#25913;&#21517;)&#26469;&#21040;&#20462;&#35746;&#29256;&#26412;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#30340;&#31062;&#20808;&#12290;</p>
          </li><li>
            <p>Perform the requested action on that ancestor,
            wherever it is located, or whatever its name might
            be or might have been at that time.</p>
          </li></ol></div>
        <p>&#20294;&#26159;&#22914;&#26524;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#27604;<em class="replaceable"><code>PEG-REV</code></em>&#26356;&#24180;&#36731;&#26102;&#20250;&#24590;&#20040;&#26679;&#65311;&#36825;&#20026;&#23450;&#20301;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#20013;&#30340;&#36335;&#24452;&#30340;&#29702;&#35770;&#38382;&#39064;&#22686;&#21152;&#20102;&#19968;&#20123;&#22797;&#26434;&#24615;&#65292;&#22240;&#20026;&#22312;<em class="replaceable"><code>PEG-REV</code></em>&#21644;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#20043;&#38388;&#65292;&#36335;&#24452;&#22312;&#21382;&#21490;&#20013;&#21487;&#20197;&#20986;&#29616;&#22810;&#27425;(&#30001;&#20110;&#25335;&#36125;&#25805;&#20316;)&#65292;&#32780;&#19988;&#37027;&#36824;&#19981;&#26159;&#20840;&#37096;&#8212;Subversion&#19981;&#20250;&#20445;&#23384;&#21521;&#21069;&#36319;&#36394;&#21382;&#21490;&#30340;&#36275;&#22815;&#20449;&#24687;&#65292;&#25152;&#20197;&#31639;&#27861;&#20250;&#26377;&#19968;&#28857;&#19981;&#21516;&#65306;</p>
        <div class="orderedlist"><ol type="1"><li>
            <p>&#26469;&#21040;&#20462;&#35746;&#29256;&#26412;<em class="replaceable"><code>PEG-REV</code></em>&#65292;&#25214;&#21040;<em class="replaceable"><code>item</code></em>&#65292;&#22312;&#29256;&#26412;&#24211;&#23450;&#20301;&#21040;&#19968;&#20010;&#21807;&#19968;&#30340;&#23545;&#35937;&#12290;</p>
          </li><li>
            <p>Trace the object's history backward (through any
            possible renames) to its ancestor in the revision
            <em class="replaceable"><code>PEG-REV</code></em>.</p>
          </li><li>
            <p>Verify that the object's location (path-wise) in
            <em class="replaceable"><code>PEG-REV</code></em> is the same as it is in
            <em class="replaceable"><code>OPERATIVE-REV</code></em>.  If that's the
            case, at least the two locations are known to be
            directly related, so perform the requested action on the
            location in <em class="replaceable"><code>OPERATIVE-REV</code></em>.
            Otherwise, relatedness was not established, so error out
            with a loud complaint that no viable location was found.
            (Someday, we expect that Subversion will be able to handle
            this usage scenario with more flexibility and
            grace.)</p>
          </li></ol></div>
        <p>&#27880;&#24847;&#65292;&#21363;&#20351;&#20320;&#27809;&#26377;&#26126;&#30830;&#25552;&#20379;peg&#20462;&#35746;&#29256;&#26412;&#25110;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#65292;&#20182;&#20204;&#20381;&#28982;&#26159;&#23384;&#22312;&#30340;&#12290;&#20026;&#20102;&#20351;&#29992;&#30340;&#31616;&#20415;&#65292;&#23545;&#20110;&#24037;&#20316;&#25335;&#36125;&#39033;&#30446;&#30340;&#32570;&#30465;peg&#20462;&#35746;&#29256;&#26412;&#26159;<code class="literal">BASE</code>&#65292;&#32780;&#29256;&#26412;&#24211;URL&#30340;&#32570;&#30465;&#20540;&#26159;<code class="literal">HEAD</code>&#12290;&#24403;&#27809;&#26377;&#25552;&#20379;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#26102;&#65292;&#32570;&#30465;&#26159;&#19982;peg&#20462;&#35746;&#29256;&#26412;&#19968;&#26679;&#12290;</p>
      </div>
      <p>Say that long ago we created our repository, and in revision 1
      we added our first <code class="filename">concept</code> directory, plus an
      <code class="filename">IDEA</code> file in that directory talking about
      the concept.  After several revisions in which real code was
      added and tweaked, we, in revision 20, renamed this directory to
      <code class="filename">frabnaggilywort</code>.  By revision 27, we had a
      new concept, a new <code class="filename">concept</code> directory to
      hold it, and a new <code class="filename">IDEA</code> file to describe
      it.  And then five years and thousands of revisions flew by,
      just like they would in any good romance story.</p>
      <p>Now, years later, we wonder what the
      <code class="filename">IDEA</code> file looked like back in revision 1.
      But Subversion needs to know whether we are asking about how the
      <span class="emphasis"><em>current</em></span> file looked back in revision 1, or
      whether we are asking for the contents of whatever file lived at
      <code class="filename">concepts/IDEA</code> in revision 1.  Certainly
      those questions have different answers, and because of peg
      revisions, you can ask those questions.  To find out how the
      current <code class="filename">IDEA</code> file looked in that old
      revision, you run:</p>
      <pre class="screen">
$ svn cat -r 1 concept/IDEA 
svn: Unable to find repository location for 'concept/IDEA' in revision 1
</pre>
      <p>&#24403;&#28982;&#65292;&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;&#24403;&#21069;&#30340;<code class="filename">IDEA</code>&#25991;&#20214;&#22312;&#20462;&#35746;&#29256;&#26412;1&#20013;&#24182;&#19981;&#23384;&#22312;&#65292;&#25152;&#20197;Subversion&#32473;&#20986;&#19968;&#20010;&#38169;&#35823;&#65292;&#36825;&#20010;&#19978;&#38754;&#30340;&#21629;&#20196;&#26159;&#38271;&#30340;peg&#20462;&#35746;&#29256;&#26412;&#21629;&#20196;&#19968;&#20010;&#32553;&#20889;&#65292;&#25193;&#23637;&#30340;&#20889;&#27861;&#26159;&#65306;</p>
      <pre class="screen">
$ svn cat -r 1 concept/IDEA@BASE
svn: Unable to find repository location for 'concept/IDEA' in revision 1
</pre>
      <p>&#24403;&#25191;&#34892;&#26102;&#65292;&#23427;&#21253;&#21547;&#26399;&#26395;&#30340;&#32467;&#26524;&#12290;</p>
      <p>The perceptive reader is probably wondering at this point whether
      the peg revision syntax causes problems for working copy paths
      or URLs that actually have at signs in them.  After
      all, how does <span class="command"><strong>svn</strong></span> know whether
      <code class="literal">news@11</code> is the name of a directory in my
      tree or just a syntax for &#8220;<span class="quote">revision 11 of
      <code class="filename">news</code></span>&#8221;?  Thankfully, while
      <span class="command"><strong>svn</strong></span> will always assume the latter, there is a
      trivial workaround.  You need only append an at sign to the
      end of the path, such as <code class="literal">news@11@</code>.
      <span class="command"><strong>svn</strong></span> cares only about the last at sign in
      the argument, and it is not considered illegal to omit a literal
      peg revision specifier after that at sign.  This workaround
      even applies to paths that end in an at sign&#8212;you would
      use <code class="literal">filename@@</code> to talk about a file named
      <code class="filename">filename@</code>.</p>
      <p>&#28982;&#21518;&#35753;&#25105;&#20204;&#35810;&#38382;&#21478;&#19968;&#20010;&#38382;&#39064;&#8212;&#22312;&#20462;&#35746;&#29256;&#26412;1 &#65292;&#21344;&#25454;<code class="filename">concepts/IDEA</code>&#36335;&#24452;&#30340;&#25991;&#20214;&#30340;&#20869;&#23481;&#21040;&#24213;&#26159;&#20160;&#20040;&#65311;&#25105;&#20204;&#20250;&#20351;&#29992;&#19968;&#20010;&#26126;&#30830;&#30340;peg&#20462;&#35746;&#29256;&#26412;&#26469;&#24110;&#21161;&#25105;&#20204;&#23436;&#25104;&#12290;</p>
      <pre class="screen">
$ svn cat concept/IDEA@1
The idea behind this project is to come up with a piece of software
that can frab a naggily wort.  Frabbing naggily worts is tricky
business, and doing it incorrectly can have serious ramifications, so
we need to employ over-the-top input validation and data verification
mechanisms.
</pre>
      <p>&#27880;&#24847;&#25105;&#20204;&#36825;&#19968;&#27425;&#27809;&#26377;&#25552;&#20379;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#65292;&#37027;&#26159;&#22240;&#20026;&#22914;&#26524;&#27809;&#26377;&#25351;&#23450;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#65292;Subversion&#20551;&#23450;&#32570;&#30465;&#30340;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#26159;peg&#20462;&#35746;&#29256;&#26412;&#12290;</p>
      <p>&#27491;&#20687;&#20320;&#30475;&#21040;&#30340;&#65292;&#36825;&#30475;&#36215;&#26469;&#26159;&#27491;&#30830;&#30340;&#36755;&#20986;&#65292;&#36825;&#20123;&#25991;&#26412;&#29978;&#33267;&#25552;&#21040;&#8220;frabbing naggily worts&#8221;&#65292;&#25152;&#20197;&#36825;&#23601;&#26159;&#29616;&#22312;&#21483;&#20570;Frabnaggilywort&#39033;&#30446;&#30340;&#37027;&#20010;&#25991;&#20214;&#65292;&#23454;&#38469;&#19978;&#65292;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#26174;&#31034;&#30340;peg&#20462;&#35746;&#29256;&#26412;&#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;&#30340;&#32452;&#21512;&#26680;&#23454;&#36825;&#19968;&#28857;&#12290;&#25105;&#20204;&#30693;&#36947;&#22312;<code class="literal">HEAD</code>&#65292;Frabnaggilywort&#39033;&#30446;&#22352;&#33853;&#22312;<code class="filename">frabnaggilywort</code>&#30446;&#24405;&#65292;&#25152;&#20197;&#25105;&#20204;&#25351;&#23450;&#25105;&#20204;&#24076;&#26395;&#30475;&#21040;<code class="literal">HEAD</code>&#30340;<code class="filename">frabnaggilywort/IDEA</code>&#36335;&#32463;&#22312;&#21382;&#21490;&#19978;&#30340;&#20462;&#35746;&#29256;&#26412;1&#30340;&#20869;&#23481;&#12290;</p>
      <pre class="screen">
$ svn cat -r 1 frabnaggilywort/IDEA@HEAD
The idea behind this project is to come up with a piece of software
that can frab a naggily wort.  Frabbing naggily worts is tricky
business, and doing it incorrectly can have serious ramifications, so
we need to employ over-the-top input validation and data verification
mechanisms.
</pre>
      <p>&#32780;&#19988;peg&#20462;&#35746;&#29256;&#26412;&#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;&#20063;&#19981;&#38656;&#35201;&#36825;&#26679;&#29712;&#30862;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#25105;&#20204;&#30340;<code class="filename">frabnaggilywort</code>&#24050;&#32463;&#22312;<code class="literal">HEAD</code>&#21024;&#38500;&#65292;&#20294;&#25105;&#20204;&#30693;&#36947;&#22312;&#20462;&#35746;&#29256;&#26412;20&#23427;&#26159;&#23384;&#22312;&#30340;&#65292;&#25105;&#20204;&#24076;&#26395;&#30693;&#36947;<code class="filename">IDEA</code>&#20174;&#20462;&#35746;&#29256;&#26412;4&#21040;10&#30340;&#21306;&#21035;&#65292;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;peg&#20462;&#35746;&#29256;&#26412;20&#21644;<code class="filename">IDEA</code>&#25991;&#20214;&#30340;&#20462;&#35746;&#29256;&#26412;20&#30340;URL&#30340;&#32452;&#21512;&#65292;&#28982;&#21518;&#20351;&#29992;4&#21040;10&#20316;&#20026;&#25105;&#20204;&#30340;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;&#33539;&#22260;&#12290;</p>
      <pre class="screen">
$ svn diff -r 4:10 http://svn.red-bean.com/projects/frabnaggilywort/IDEA@20
Index: frabnaggilywort/IDEA
===================================================================
--- frabnaggilywort/IDEA	(revision 4)
+++ frabnaggilywort/IDEA	(revision 10)
@@ -1,5 +1,5 @@
-The idea behind this project is to come up with a piece of software
-that can frab a naggily wort.  Frabbing naggily worts is tricky
-business, and doing it incorrectly can have serious ramifications, so
-we need to employ over-the-top input validation and data verification
-mechanisms.
+The idea behind this project is to come up with a piece of
+client-server software that can remotely frab a naggily wort.
+Frabbing naggily worts is tricky business, and doing it incorrectly
+can have serious ramifications, so we need to employ over-the-top
+input validation and data verification mechanisms.
</pre>
      <p>&#24184;&#36816;&#30340;&#26159;&#65292;&#20960;&#20046;&#25152;&#26377;&#30340;&#20154;&#19981;&#20250;&#38754;&#20020;&#22914;&#27492;&#22797;&#26434;&#30340;&#24773;&#24418;&#65292;&#20294;&#26159;&#22914;&#26524;&#26159;&#65292;&#35760;&#20303;peg&#20462;&#35746;&#29256;&#26412;&#26159;&#24110;&#21161;Subversion&#28165;&#38500;&#28151;&#28102;&#30340;&#39069;&#22806;&#25552;&#31034;&#12290;</p>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e2771" href="#d4e2771" class="para">16</a>] </sup>&#8220;<span class="quote">&#20320;&#19981;&#26159;&#34987;&#26399;&#26395;&#21435;&#21629;&#21517;&#23427;&#65292;&#19968;&#26086;&#20320;&#21462;&#20102;&#21517;&#23383;&#65292;&#20320;&#24320;&#22987;&#19982;&#20043;&#32852;&#31995;&#22312;&#19968;&#36215;&#12290;</span>&#8221; &#8212; Mike Wazowski</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e2793" href="#d4e2793" class="para">17</a>] </sup>&#20234;&#21033;&#35834;&#20234;&#24030;&#24800;&#39039;&#20027;&#22823;&#36947;606&#21495;&#24066;&#24800;&#39039;&#31163;&#24066;&#20013;&#24515;&#65292;&#35753;&#23427;&#20316;&#20026;&#24800;&#39039;&#30340;&#8220;<span class="quote">&#21382;&#21490;</span>&#8221;&#20013;&#24515;&#65292;&#30475;&#36215;&#26469;&#26159;&#24688;&#24403;&#30340;&#8230;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.advanced.externals.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.advanced.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.changelists.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#22806;&#37096;&#23450;&#20041;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#20462;&#25913;&#21015;&#34920;</td></tr></table></div></body></html>