<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;"><link rel="prev" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;"><link rel="next" href="svn.reposadmin.create.html" title="&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.reposadmin.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.reposadmin.create.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.reposadmin.planning"></a>&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</h2></div></div></div><p>Due largely to the simplicity of the overall design of the
      Subversion repository and the technologies on which it relies,
      creating and configuring a repository are fairly straightforward
      tasks.  There are a few preliminary decisions you'll want to
      make, but the actual work involved in any given setup of a
      Subversion repository is pretty basic, tending towards
      mindless repetition if you find yourself setting up multiples of
      these things.</p><p>&#19979;&#38754;&#26159;&#19968;&#20123;&#20320;&#38656;&#35201;&#39044;&#20808;&#32771;&#34385;&#30340;&#20107;&#24773;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#20320;&#30340;&#29256;&#26412;&#24211;&#23558;&#35201;&#23384;&#25918;&#20160;&#20040;&#25968;&#25454;(&#25110;&#22810;&#20010;&#29256;&#26412;&#24211;)&#65292;&#36825;&#20123;&#25968;&#25454;&#22914;&#20309;&#32452;&#32455;&#65311;</p></li><li><p>&#29256;&#26412;&#24211;&#23384;&#25918;&#22312;&#21738;&#37324;&#65292;&#22914;&#20309;&#34987;&#35775;&#38382;&#65311;</p></li><li><p>&#20320;&#38656;&#35201;&#20160;&#20040;&#31867;&#22411;&#30340;&#35775;&#38382;&#25511;&#21046;&#21644;&#29256;&#26412;&#24211;&#20107;&#20214;&#25253;&#21578;&#65311;</p></li><li><p>&#20320;&#24076;&#26395;&#20351;&#29992;&#21738;&#31181;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#65311;</p></li></ul></div><p>&#22312;&#26412;&#33410;&#65292;&#25105;&#20204;&#35201;&#23581;&#35797;&#24110;&#20320;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;</p><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.projects.chooselayout"></a>&#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;</h3></div></div></div><p>&#22312;Subversion&#29256;&#26412;&#24211;&#20013;&#65292;&#31227;&#21160;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#20449;&#24687;&#65292;&#29978;&#33267;&#20063;&#21487;&#20197;&#23558;&#29256;&#26412;&#24211;&#30340;&#30340;&#19968;&#32452;&#25968;&#25454;&#26080;&#25439;&#21382;&#21490;&#30340;&#31227;&#26893;&#21040;&#21478;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#20294;&#26159;&#36825;&#26679;&#19968;&#26469;&#37027;&#20123;&#32463;&#24120;&#35775;&#38382;&#29256;&#26412;&#24211;&#24182;&#19988;&#20197;&#20026;&#25991;&#20214;&#24635;&#26159;&#22312;&#21516;&#19968;&#20010;&#36335;&#24452;&#30340;&#29992;&#25143;&#21487;&#33021;&#20250;&#21463;&#21040;&#24178;&#25200;&#12290;&#20026;&#23558;&#26469;&#30528;&#24819;&#65292;&#26368;&#22909;&#39044;&#20808;&#23545;&#20320;&#30340;&#29256;&#26412;&#24211;&#24067;&#23616;&#36827;&#34892;&#35268;&#21010;&#12290;&#20197;&#19968;&#31181;&#39640;&#25928;&#30340;&#8220;<span class="quote">&#24067;&#23616;</span>&#8221;&#24320;&#22987;&#39033;&#30446;&#65292;&#21487;&#20197;&#20943;&#23569;&#23558;&#26469;&#24456;&#22810;&#19981;&#24517;&#35201;&#30340;&#40635;&#28902;&#12290;</p><p>&#20551;&#22914;&#20320;&#26159;&#19968;&#20010;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#65292;&#38656;&#35201;&#21521;&#22810;&#20010;&#39033;&#30446;&#25552;&#20379;&#29256;&#26412;&#25511;&#21046;&#25903;&#25345;&#12290;&#37027;&#20040;&#65292;&#20320;&#39318;&#20808;&#35201;&#20915;&#23450;&#30340;&#26159;&#65292;&#29992;&#19968;&#20010;&#29256;&#26412;&#24211;&#25903;&#25345;&#22810;&#20010;&#39033;&#30446;&#65292;&#36824;&#26159;&#20026;&#27599;&#20010;&#39033;&#30446;&#24314;&#31435;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#36824;&#26159;&#20004;&#31181;&#26041;&#27861;&#30340;&#28151;&#21512;&#26041;&#24335;&#12290;</p><p>There are benefits to using a single repository for
        multiple projects, most obviously the lack of duplicated
        maintenance.  A single repository means that there is one set
        of hook programs, one thing to routinely back up, one thing to
        dump and load if Subversion releases an incompatible new
        version, and so on.  Also, you can move data between projects
        easily, without losing any historical versioning
        information.</p><p>&#21333;&#19968;&#29256;&#26412;&#24211;&#30340;&#32570;&#28857;&#26159;&#65292;&#19981;&#21516;&#30340;&#39033;&#30446;&#36890;&#24120;&#37117;&#26377;&#19981;&#21516;&#30340;&#29256;&#26412;&#24211;&#35302;&#21457;&#20107;&#20214;&#38656;&#27714;&#65292;&#20363;&#22914;&#38656;&#35201;&#21457;&#36865;&#25552;&#20132;&#36890;&#30693;&#37038;&#20214;&#21040;&#19981;&#21516;&#30340;&#37038;&#20214;&#21015;&#34920;&#65292;&#38656;&#35201;&#19981;&#21516;&#30340;&#37492;&#23450;&#25552;&#20132;&#26159;&#21542;&#21512;&#27861;&#30340;&#23450;&#20041;&#12290;&#36825;&#20123;&#37117;&#19981;&#26159;&#19981;&#21487;&#36926;&#36234;&#30340;&#38382;&#39064;&#65292;&#24403;&#28982;&#8212;&#20043;&#38656;&#35201;&#20320;&#30340;&#38057;&#23376;&#31243;&#24207;&#33021;&#22815;&#23519;&#30475;&#29256;&#26412;&#24211;&#30340;&#24067;&#23616;&#65292;&#32780;&#19981;&#26159;&#20551;&#23450;&#25972;&#20010;&#29256;&#26412;&#24211;&#19982;&#21516;&#19968;&#32452;&#20154;&#20851;&#32852;&#12290;&#36824;&#26377;&#65292;&#21035;&#24536;&#20102;Subversion&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#26159;&#38024;&#23545;&#25972;&#20010;&#29256;&#26412;&#24211;&#30340;&#65292;&#36825;&#20123;&#21495;&#30721;&#27809;&#26377;&#20219;&#20309;&#39764;&#21147;&#12290;&#21363;&#20351;&#26368;&#36817;&#27809;&#26377;&#23545;&#26576;&#20010;&#39033;&#30446;&#20316;&#20986;&#20462;&#25913;&#65292;&#29256;&#26412;&#24211;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#36824;&#26159;&#20250;&#22240;&#20026;&#20854;&#23427;&#39033;&#30446;&#30340;&#20462;&#25913;&#32780;&#19981;&#20572;&#30340;&#25552;&#21319;&#65292;&#35768;&#22810;&#20154;&#24182;&#19981;&#21916;&#27426;&#36825;&#26679;&#30340;&#20107;&#23454;&#12290;<sup>[<a name="d0e9285" href="#ftn.d0e9285" class="footnote">25</a>]</sup></p><p>&#21487;&#20197;&#37319;&#29992;&#25240;&#20013;&#30340;&#21150;&#27861;&#12290;&#27604;&#22914;&#65292;&#21487;&#20197;&#25226;&#35768;&#22810;&#39033;&#30446;&#25353;&#29031;&#24444;&#27492;&#20043;&#38388;&#30340;&#20851;&#32852;&#31243;&#24230;&#21010;&#20998;&#20026;&#20960;&#20010;&#32452;&#21512;&#65292;&#28982;&#21518;&#20026;&#27599;&#19968;&#20010;&#39033;&#30446;&#32452;&#21512;&#24314;&#31435;&#19968;&#20010;&#29256;&#26412;&#24211;&#12290;&#36825;&#26679;&#65292;&#22312;&#30456;&#20851;&#39033;&#30446;&#20043;&#38388;&#20849;&#20139;&#25968;&#25454;&#20381;&#26087;&#24456;&#31616;&#21333;&#65292;&#32780;&#22914;&#26524;&#20462;&#35746;&#29256;&#26412;&#21495;&#26377;&#20102;&#21464;&#21270;&#65292;&#33267;&#23569;&#24320;&#21457;&#20154;&#21592;&#30693;&#36947;&#65292;&#25913;&#21464;&#30340;&#19996;&#35199;&#22810;&#23569;&#21644;&#20182;&#20204;&#26377;&#20123;&#20851;&#31995;&#12290;</p><p>After deciding how to organize your projects with respect
        to repositories, you'll probably want to think about directory
        hierarchies within the repositories themselves.  Because
        Subversion uses regular directory copies for branching and
        tagging (see <a class="xref" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;">&#31532;&nbsp;4&nbsp;&#31456; <i>&#20998;&#25903;&#19982;&#21512;&#24182;</i></a>), the
        Subversion community recommends that you choose a repository
        location for each <em class="firstterm">project
        root</em>&#8212;the &#8220;<span class="quote">top-most</span>&#8221; directory
        that contains data related to that project&#8212;and then
        create three subdirectories beneath that root:
        <code class="filename">trunk</code>, meaning the directory under which
        the main project development occurs;
        <code class="filename">branches</code>, which is a directory in which
        to create various named branches of the main development line;
        and <code class="filename">tags</code>, which is a collection of tree
        snapshots that are created, and perhaps destroyed, but never
        changed.
        <sup>[<a name="d0e9309" href="#ftn.d0e9309" class="footnote">26</a>]</sup>
        </p><p>&#20030;&#20010;&#20363;&#23376;&#65292;&#19968;&#20010;&#29256;&#26412;&#24211;&#21487;&#33021;&#20250;&#26377;&#22914;&#19979;&#30340;&#24067;&#23616;&#65306;</p><pre class="screen">
/
   calc/
      trunk/
      tags/
      branches/
   calendar/
      trunk/
      tags/
      branches/
   spreadsheet/
      trunk/
      tags/
      branches/
   &#8230;
</pre><p>&#39033;&#30446;&#22312;&#29256;&#26412;&#24211;&#20013;&#30340;&#26681;&#30446;&#24405;&#22320;&#22336;&#24182;&#19981;&#37325;&#35201;&#12290;&#22914;&#26524;&#27599;&#20010;&#29256;&#26412;&#24211;&#20013;&#21482;&#26377;&#19968;&#20010;&#39033;&#30446;&#65292;&#37027;&#20040;&#23601;&#21487;&#20197;&#35748;&#20026;&#39033;&#30446;&#30340;&#26681;&#30446;&#24405;&#23601;&#26159;&#29256;&#26412;&#24211;&#30340;&#26681;&#30446;&#24405;&#12290;&#22914;&#26524;&#29256;&#26412;&#24211;&#20013;&#21253;&#21547;&#22810;&#20010;&#39033;&#30446;&#65292;&#37027;&#20040;&#21487;&#20197;&#23558;&#36825;&#20123;&#39033;&#30446;&#21010;&#20998;&#25104;&#19981;&#21516;&#30340;&#32452;&#21512;(&#25353;&#29031;&#39033;&#30446;&#30340;&#30446;&#26631;&#25110;&#32773;&#26159;&#21542;&#38656;&#35201;&#20849;&#20139;&#20195;&#30721;&#29978;&#33267;&#26159;&#23383;&#27597;&#39034;&#24207;)&#20445;&#23384;&#22312;&#19981;&#21516;&#23376;&#30446;&#24405;&#20013;&#65292;&#19979;&#38754;&#30340;&#20363;&#23376;&#32473;&#20986;&#20102;&#19968;&#20010;&#31867;&#20284;&#30340;&#24067;&#23616;&#65306;</p><pre class="screen">
/
   utils/
      calc/
         trunk/
         tags/
         branches/
      calendar/
         trunk/
         tags/
         branches/
      &#8230;
   office/
      spreadsheet/
         trunk/
         tags/
         branches/
      &#8230;
</pre><p>&#25353;&#29031;&#20320;&#35748;&#20026;&#21512;&#36866;&#30340;&#26041;&#24335;&#23433;&#25490;&#29256;&#26412;&#24211;&#30340;&#24067;&#23616;&#65292;Subversion&#33258;&#36523;&#24182;&#19981;&#24378;&#21046;&#25110;&#32773;&#20559;&#22909;&#26576;&#19968;&#31181;&#24067;&#23616;&#24418;&#24335;&#65292;&#23545;&#20110;Subversion&#26469;&#35828;&#65292;&#30446;&#24405;&#23601;&#26159;&#30446;&#24405;&#12290;&#26368;&#21518;&#65292;&#22312;&#35774;&#35745;&#29256;&#26412;&#24211;&#24067;&#23616;&#30340;&#26102;&#20505;&#65292;&#19981;&#35201;&#24536;&#20102;&#32771;&#34385;&#19968;&#19979;&#39033;&#30446;&#21442;&#19982;&#32773;&#20204;&#30340;&#24847;&#35265;&#12290;</p><p>&#20026;&#20102;&#23436;&#25972;&#24615;&#65292;&#25105;&#20204;&#38656;&#35201;&#25552;&#19968;&#19979;&#21478;&#19968;&#31181;&#24120;&#35265;&#30340;&#24067;&#23616;&#65292;&#22312;&#36825;&#31181;&#24067;&#23616;&#20013;<code class="filename">trunk</code>&#12289;<code class="filename">tags</code>&#21644;<code class="filename">branches</code>&#37117;&#22312;&#26681;&#30446;&#24405;&#19979;&#65292;&#32780;&#20320;&#30340;&#39033;&#30446;&#22312;&#21508;&#20010;&#23376;&#30446;&#24405;&#19979;&#65292;&#20363;&#22914;&#65306;</p><pre class="screen">
/
   trunk/
      calc/
      calendar/
      spreadsheet/
      &#8230;
   tags/
      calc/
      calendar/
      spreadsheet/
      &#8230;
   branches/
      calc/
      calendar/
      spreadsheet/
      &#8230;
</pre><p>There's nothing particularly incorrect about such a
        layout, but it may or may not seem as intuitive for your
        users.  Especially in large, multiproject situations with
        many users, those users may tend to be familiar with only one
        or two of the projects in the repository.  But the
        projects-as-branch-siblings tends to de-emphasize project
        individuality and focus on the entire set of projects as a
        single entity.  That's a social issue though.  We like our
        originally suggested arrangement for purely practical
        reasons&#8212;it's easier to ask about (or modify, or migrate
        elsewhere) the entire history of a single project when there's
        a single repository path that holds the entire
        history&#8212;past, present, tagged, and branched&#8212;for
        that project and that project alone.</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.basics.hosting"></a>&#20915;&#23450;&#22312;&#21738;&#37324;&#19982;&#22914;&#20309;&#37096;&#32626;&#20320;&#30340;&#29256;&#26412;&#24211;</h3></div></div></div><p>Before creating your Subversion repository, an obvious
        question you'll need to answer is where the thing is going to
        live.  This is strongly connected to a myriad of other
        questions involving how the repository will be accessed (via a
        Subversion server or directly), by whom (users behind your
        corporate firewall or the whole world out on the open
        Internet), what other services you'll be providing around
        Subversion (repository browsing interfaces, email-based
        commit notification, etc.), your data backup strategy, and so
        on.</p><p>We cover server choice and configuration in <a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>, but the point we'd like to
        briefly make here is simply that the answers to some of these
        other questions might have implications that force your hand
        when deciding where your repository will live.  For example,
        certain deployment scenarios might require accessing the
        repository via a remote filesystem from multiple computers, in
        which case (as you'll read in the next section) your choice of
        a repository backend data store turns out not to be a choice
        at all because only one of the available backends will work
        in this scenario.</p><p>Addressing each possible way to deploy
        Subversion is both impossible and outside the scope of this
        book.  We simply encourage you to evaluate your options using
        these pages and other sources as your reference material and to
        plan ahead.</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.basics.backends"></a>&#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;</h3></div></div></div><p>As of version 1.1, Subversion provides two options for the
        type of underlying data store&#8212;often referred to as
        &#8220;<span class="quote">the backend</span>&#8221; or, somewhat confusingly,
        &#8220;<span class="quote">the (versioned) filesystem</span>&#8221;&#8212;that each
        repository uses.  One type of data store keeps everything in a
        Berkeley DB (or BDB) database environment; repositories that
        use this type are often referred to as being
        &#8220;<span class="quote">BDB-backed.</span>&#8221;  The other type stores data in
        ordinary flat files, using a custom format.  Subversion
        developers have adopted the habit of referring to this latter
        data storage mechanism as <em class="firstterm">FSFS</em>
        <sup>[<a name="d0e9381" href="#ftn.d0e9381" class="footnote">27</a>]</sup> 
        &#8212;a versioned filesystem implementation that uses the
        native OS filesystem directly&#8212;rather than via a database
        library or some other abstraction layer&#8212;to store data.</p><p><a class="xref" href="svn.reposadmin.planning.html#svn.reposadmin.basics.backends.tbl-1" title="&#34920;&nbsp;5.1.&nbsp;">&#34920;&nbsp;5.1 &#8220;&#8221;</a>&#20174;&#24635;&#20307;&#19978;&#27604;&#36739;&#20102;Berkeley DB&#21644;FSFS&#29256;&#26412;&#24211;&#12290;</p><div class="table"><a name="svn.reposadmin.basics.backends.tbl-1"></a><p class="title"><b>&#34920;&nbsp;5.1.&nbsp;</b></p><div class="table-contents"><table border="1"><colgroup><col width="25%"><col width="25%"><col width="25%"><col width="25%"></colgroup><thead><tr><th>&#20998;&#31867;</th><th>&#29305;&#24615;</th><th>Berkeley DB</th><th>FSFS</th></tr></thead><tbody><tr><td rowspan="2">&#21487;&#38752;&#24615;</td><td>&#25968;&#25454;&#23436;&#25972;&#24615;</td><td>When properly deployed, extremely reliable;
                Berkeley DB 4.4 brings auto-recovery.</td><td>Older versions had some rarely demonstrated, but
                data-destroying bugs.</td></tr><tr><td>&#23545;&#25805;&#20316;&#20013;&#26029;&#30340;&#25935;&#24863;</td><td>Very; crashes and permission problems can leave the
                database &#8220;<span class="quote">wedged,</span>&#8221; requiring journaled
                recovery procedures.</td><td>Quite insensitive.</td></tr><tr><td rowspan="4">&#21487;&#29992;&#24615;</td><td>&#21487;&#21482;&#35835;&#21152;&#36733;</td><td>No.</td><td>Yes.</td></tr><tr><td>&#23384;&#20648;&#24179;&#21488;&#26080;&#20851;</td><td>No.</td><td>Yes.</td></tr><tr><td>&#21487;&#20174;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#35775;&#38382;</td><td>Generally, no.</td><td>Yes.</td></tr><tr><td>&#32452;&#35775;&#38382;&#26435;&#22788;&#29702;</td><td>Sensitive to user umask problems; best if accessed
                by only one user.</td><td>Works around umask problems.</td></tr><tr><td rowspan="3">&#20280;&#32553;&#24615;</td><td>&#29256;&#26412;&#24211;&#30913;&#30424;&#20351;&#29992;&#24773;&#20917;</td><td>Larger (especially if logfiles aren't purged).</td><td>Smaller.</td></tr><tr><td>&#20462;&#35746;&#29256;&#26412;&#26641;&#30340;&#25968;&#37327;</td><td>Database; no problems.</td><td>Some older native filesystems don't scale well with
                thousands of entries in a single directory.</td></tr><tr><td>&#26377;&#24456;&#22810;&#25991;&#20214;&#30340;&#30446;&#24405;</td><td>Slower.</td><td>Faster.</td></tr><tr><td rowspan="2">&#24615;&#33021;</td><td>&#26816;&#20986;&#26368;&#26032;&#30340;&#20195;&#30721;</td><td>No meaningful difference.</td><td>No meaningful difference.</td></tr><tr><td>&#22823;&#30340;&#25552;&#20132;</td><td>Slower overall, but cost is amortized across the
                lifetime of the commit.</td><td>Faster overall, but finalization delay may cause 
                client timeouts.</td></tr></tbody></table></div></div><br class="table-break"><p>There are advantages and disadvantages to each of these
        two backend types.  Neither of them is more
        &#8220;<span class="quote">official</span>&#8221; than the other, though the newer FSFS
        is the default data store as of Subversion 1.2.  Both are
        reliable enough to trust with your versioned data.  But as you
        can see in <a class="xref" href="svn.reposadmin.planning.html#svn.reposadmin.basics.backends.tbl-1" title="&#34920;&nbsp;5.1.&nbsp;">&#34920;&nbsp;5.1 &#8220;&#8221;</a>, the FSFS
        backend provides quite a bit more flexibility in terms of its
        supported deployment scenarios.  More flexibility means you
        have to work a little harder to find ways to deploy it
        incorrectly.  Those reasons&#8212;plus the fact that not using
        Berkeley DB means there's one fewer component in the
        system&#8212;largely explain why today almost everyone uses
        the FSFS backend when creating new repositories.</p><p>Fortunately, most programs that access Subversion
        repositories are blissfully ignorant of which backend data
        store is in use.  And you aren't even necessarily stuck with
        your first choice of a data store&#8212;in the event that you
        change your mind later, Subversion provides ways of migrating
        your repository's data into another repository that uses a
        different backend data store.  We talk more about that later
        in this chapter.</p><p>The following subsections provide a more detailed look at
        the available backend data store types.</p><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.reposadmin.basics.backends.bdb"></a>Berkeley DB</h4></div></div></div><p>When the initial design phase of Subversion was in
          progress, the developers decided to use Berkeley DB for a
          variety of reasons, including its open source license,
          transaction support, reliability, performance, API
          simplicity, thread-safety, support for cursors, and so
          on.</p><p>Berkeley DB&#25552;&#20379;&#20102;&#30495;&#27491;&#30340;&#20107;&#21153;&#25903;&#25345;&#65293;&#36825;&#25110;&#35768;&#26159;&#23427;&#26368;&#24378;&#22823;&#30340;&#29305;&#24615;&#65292;&#35775;&#38382;&#20320;&#30340;Subversion&#29256;&#26412;&#24211;&#30340;&#22810;&#20010;&#36827;&#31243;&#19981;&#24517;&#25285;&#24515;&#20598;&#23572;&#20250;&#30772;&#22351;&#20854;&#20182;&#36827;&#31243;&#30340;&#25968;&#25454;&#12290;&#20107;&#21153;&#31995;&#32479;&#25552;&#20379;&#30340;&#38548;&#31163;&#23545;&#20110;&#20219;&#20309;&#32473;&#23450;&#30340;&#25805;&#20316;&#65292;Subversion&#29256;&#26412;&#24211;&#20195;&#30721;&#30475;&#21040;&#30340;&#21482;&#26159;&#25968;&#25454;&#24211;&#30340;&#38745;&#24577;&#35270;&#22270;&#65293;&#32780;&#19981;&#26159;&#19968;&#20010;&#22312;&#20854;&#20182;&#36827;&#31243;&#24433;&#21709;&#19981;&#26029;&#21464;&#21270;&#30340;&#25968;&#25454;&#24211;&#65293;&#24182;&#33021;&#22815;&#26681;&#25454;&#35813;&#35270;&#22270;&#20316;&#20986;&#20915;&#23450;&#12290;&#22914;&#26524;&#35813;&#20915;&#23450;&#27491;&#22909;&#21516;&#20854;&#20182;&#36827;&#31243;&#25152;&#20570;&#25805;&#20316;&#20914;&#31361;&#65292;&#25972;&#20010;&#25805;&#20316;&#20250;&#22238;&#28378;&#65292;&#23601;&#20687;&#20160;&#20040;&#37117;&#27809;&#26377;&#21457;&#29983;&#19968;&#26679;&#65292;&#24182;&#19988;Subversion&#20250;&#20248;&#38597;&#30340;&#20877;&#27425;&#23545;&#26356;&#26032;&#30340;&#38745;&#24577;&#35270;&#22270;&#36827;&#34892;&#25805;&#20316;&#12290;</p><p>Another great feature of Berkeley DB is <em class="firstterm">hot
          backups</em>&#8212;the ability to back up the
          database environment without taking it
          &#8220;<span class="quote">offline.</span>&#8221; We'll discuss how to back up your
          repository later in this chapter (in <a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.backup" title="&#29256;&#26412;&#24211;&#22791;&#20221;">&#8220;&#29256;&#26412;&#24211;&#22791;&#20221;&#8221;&#19968;&#33410;</a>), but the benefits
          of being able to make fully functional copies of your
          repositories without any downtime should be obvious.</p><p>Berkeley DB is also a very reliable database system when
          properly used.  Subversion uses Berkeley DB's logging
          facilities, which means that the database first writes to
          on-disk logfiles a description of any modifications it is
          about to make, and then makes the modification itself.  This
          is to ensure that if anything goes wrong, the database
          system can back up to a previous
          <em class="firstterm">checkpoint</em>&#8212;a location in the
          logfiles known not to be corrupt&#8212;and replay
          transactions until the data is restored to a usable state.
          See <a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.diskspace" title="&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;">&#8220;&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;&#8221;&#19968;&#33410;</a> later
          in this chapter for more about Berkeley DB logfiles.</p><p>But every rose has its thorn, and so we must note some
          known limitations of Berkeley DB.  First, Berkeley DB
          environments are not portable.  You cannot simply copy a
          Subversion repository that was created on a Unix system onto
          a Windows system and expect it to work.  While much of the
          Berkeley DB database format is architecture-independent,
          there are other aspects of the environment that are not.
          Secondly, Subversion uses Berkeley DB in a way that will not
          operate on Windows 95/98 systems&#8212;if you need to house
          a BDB-backed repository on a Windows machine, stick with
          Windows 2000 or newer.</p><p>&#28982;&#32780;Berkeley DB&#23545;&#20110;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#32452;&#35268;&#33539;&#65292;<sup>[<a name="d0e9539" href="#ftn.d0e9539" class="footnote">28</a>]</sup>&#22823;&#22810;&#25968;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#21644;&#24212;&#29992;&#27809;&#26377;&#23454;&#29616;&#36825;&#20010;&#35201;&#27714;&#65292;&#25152;&#20197;&#19981;&#33021;&#20801;&#35768;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#30340;BDB&#21518;&#31471;&#29256;&#26412;&#24211;&#34987;&#22810;&#20010;&#23458;&#25143;&#31471;&#21516;&#26102;&#35775;&#38382;(&#39318;&#20808;&#35201;&#30693;&#36947;&#29256;&#26412;&#24211;&#23384;&#25918;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#26159;&#38750;&#24120;&#26222;&#36941;&#30340;)&#12290;</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#35686;&#21578;</h3><p>If you attempt to use Berkeley DB on a noncompliant
            remote filesystem, the results are unpredictable&#8212;you
            may see mysterious errors right away, or it may be months
            before you discover that your repository database is
            subtly corrupted.  You should strongly consider using the
            FSFS data store for repositories that need to live on a
            network share.</p></div><p>&#26368;&#21518;&#65292;&#22240;&#20026;Berkeley DB&#30340;&#24211;&#30452;&#25509;&#38142;&#25509;&#21040;&#20102;Subversion&#20013;&#65292;&#23427;&#23545;&#20110;&#20013;&#26029;&#27604;&#20856;&#22411;&#30340;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#31995;&#32479;&#26356;&#20026;&#25935;&#24863;&#12290;&#22823;&#22810;&#25968;SQL&#31995;&#32479;&#65292;&#20030;&#20363;&#26469;&#35828;&#65292;&#26377;&#19968;&#20010;&#20027;&#26381;&#21153;&#36827;&#31243;&#26469;&#21327;&#35843;&#23545;&#25968;&#25454;&#24211;&#34920;&#30340;&#35775;&#38382;&#12290;&#22914;&#26524;&#19968;&#20010;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#31243;&#24207;&#22240;&#20026;&#26576;&#31181;&#21407;&#22240;&#20986;&#29616;&#38382;&#39064;&#65292;&#25968;&#25454;&#24211;&#23432;&#25252;&#36827;&#31243;&#23519;&#35273;&#21040;&#36830;&#25509;&#20013;&#26029;&#20250;&#20570;&#19968;&#20123;&#28165;&#29702;&#12290;&#22240;&#20026;&#25968;&#25454;&#24211;&#23432;&#25252;&#36827;&#31243;&#26159;&#21807;&#19968;&#35775;&#38382;&#25968;&#25454;&#24211;&#34920;&#30340;&#36827;&#31243;&#65292;&#24212;&#29992;&#31243;&#24207;&#19981;&#38656;&#35201;&#25285;&#24515;&#35775;&#38382;&#35768;&#21487;&#30340;&#20914;&#31361;&#12290;&#20294;&#26159;&#65292;&#36825;&#20123;&#24773;&#20917;&#19982;Berkeley DB&#19981;&#21516;&#12290;Subversion(&#21644;&#20351;&#29992;Subversion&#24211;&#30340;&#31243;&#24207;)&#30452;&#25509;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#34920;&#65292;&#36825;&#24847;&#21619;&#30528;&#22914;&#26524;&#26377;&#19968;&#20010;&#31243;&#24207;&#23849;&#28291;&#65292;&#23601;&#20250;&#20351;&#25968;&#25454;&#24211;&#22788;&#20110;&#19968;&#20010;&#26242;&#26102;&#30340;&#19981;&#19968;&#33268;&#12289;&#19981;&#21487;&#35775;&#38382;&#30340;&#29366;&#24577;&#12290;&#24403;&#36825;&#31181;&#24773;&#20917;&#21457;&#29983;&#26102;&#65292;&#31649;&#29702;&#21592;&#38656;&#35201;&#35753;Berkeley DB&#24674;&#22797;&#21040;&#19968;&#20010;&#26816;&#26597;&#28857;&#65292;&#36825;&#30340;&#30830;&#26377;&#28857;&#35752;&#21388;&#12290;&#38500;&#20102;&#23849;&#28291;&#30340;&#36827;&#31243;&#65292;&#36824;&#26377;&#19968;&#20123;&#24773;&#20917;&#33021;&#35753;&#29256;&#26412;&#24211;&#20986;&#29616;&#24322;&#24120;&#65292;&#27604;&#22914;&#31243;&#24207;&#22312;&#25968;&#25454;&#24211;&#25991;&#20214;&#30340;&#25152;&#26377;&#26435;&#25110;&#35775;&#38382;&#26435;&#38480;&#19978;&#21457;&#29983;&#20914;&#31361;&#12290;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3><p>Berkeley DB 4.4(&#23545;&#24212;Subversion 1.4&#21644;&#26356;&#39640;)&#25552;&#20379;&#20102;&#22312;&#38656;&#35201;&#24674;&#22797;&#26102;&#33258;&#21160;&#24674;&#22797;Berkeley DB&#29615;&#22659;&#30340;&#33021;&#21147;&#65292;&#24403;Subversion&#36827;&#31243;&#21457;&#29616;&#20219;&#20309;&#20197;&#21069;&#36827;&#31243;&#26410;&#28165;&#29702;&#30340;&#36830;&#25509;&#65292;&#23601;&#20250;&#25191;&#34892;&#25152;&#26377;&#21487;&#33021;&#30340;&#24674;&#22797;&#65292;&#28982;&#21518;&#23601;&#24403;&#20160;&#20040;&#37117;&#27809;&#26377;&#21457;&#29983;&#19968;&#26679;&#32487;&#32493;&#25191;&#34892;&#12290;&#36825;&#26679;&#19981;&#20250;&#23436;&#20840;&#28040;&#38500;&#29256;&#26412;&#24211;&#26964;&#20303;&#30340;&#21487;&#33021;&#65292;&#20294;&#26159;&#22823;&#22823;&#20943;&#23569;&#20102;&#20154;&#24037;&#24178;&#39044;&#24674;&#22797;&#30340;&#25968;&#37327;&#12290;</p></div><p>So while a Berkeley DB repository is quite fast and
          scalable, it's best used by a single server process running
          as one user&#8212;such as Apache's <span class="command"><strong>httpd</strong></span>
          or <span class="command"><strong>svnserve</strong></span> (see <a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>)&#8212;rather than accessing it
          as many different users via <code class="literal">file://</code> or
          <code class="literal">svn+ssh://</code> URLs.  If accessing a Berkeley
          DB repository directly as multiple users, be sure to read
          <a class="xref" href="svn.serverconfig.multimethod.html" title="&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;">&#8220;&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;&#8221;&#19968;&#33410;</a> later in this
          chapter.</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.reposadmin.basics.backends.fsfs"></a>FSFS</h4></div></div></div><p>In mid-2004, a second type of repository storage
          system&#8212;one that doesn't use a database at
          all&#8212;came into being.  An FSFS repository stores the
          changes associated with a revision in a single file, and so
          all of a repository's revisions can be found in a single
          subdirectory full of numbered files.  Transactions are
          created in separate subdirectories as individual files.
          When complete, the transaction file is renamed and moved
          into the revisions directory, thus guaranteeing that commits
          are atomic.  And because a revision file is permanent and
          unchanging, the repository also can be backed up while
          &#8220;<span class="quote">hot,</span>&#8221; just like a BDB-backed
          repository.</p><p>&#20462;&#35746;&#29256;&#26412;&#25991;&#20214;&#26684;&#24335;&#20195;&#34920;&#20102;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#30340;&#30446;&#24405;&#32467;&#26500;&#65292;&#25991;&#20214;&#20869;&#23481;&#65292;&#21644;&#20854;&#23427;&#20462;&#35746;&#29256;&#26412;&#26641;&#20013;&#30456;&#20851;&#20449;&#24687;&#12290;&#19981;&#20687;Berkeley DB&#25968;&#25454;&#24211;&#65292;&#36825;&#31181;&#23384;&#20648;&#26684;&#24335;&#21487;&#36328;&#24179;&#21488;&#24182;&#19988;&#19982;CPU&#26550;&#26500;&#26080;&#20851;&#12290;&#22240;&#20026;&#27809;&#26377;&#26085;&#24535;&#25110;&#29992;&#21040;&#20849;&#20139;&#20869;&#23384;&#30340;&#25991;&#20214;&#65292;&#25968;&#25454;&#24211;&#33021;&#34987;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#23433;&#20840;&#30340;&#35775;&#38382;&#21644;&#22312;&#21482;&#35835;&#29615;&#22659;&#19979;&#26816;&#26597;&#12290;&#32570;&#23569;&#25968;&#25454;&#24211;&#33457;&#28040;&#21516;&#26102;&#20063;&#24847;&#21619;&#30528;&#29256;&#26412;&#24211;&#30340;&#24635;&#20307;&#20307;&#31215;&#21487;&#20197;&#31245;&#23567;&#19968;&#28857;&#12290;</p><p>FSFS&#20063;&#26377;&#19968;&#31181;&#19981;&#21516;&#30340;&#24615;&#33021;&#29305;&#24615;&#12290;&#24403;&#25552;&#20132;&#22823;&#37327;&#25991;&#20214;&#26102;&#65292;FSFS&#21487;&#20197;&#26356;&#24555;&#30340;&#36861;&#21152;&#26465;&#30446;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;FSFS&#36890;&#36807;&#20889;&#20837;&#19982;&#19978;&#19968;&#20010;&#29256;&#26412;&#27604;&#36739;&#30340;&#21464;&#21270;&#26469;&#35760;&#24405;&#26032;&#29256;&#26412;&#65292;&#36825;&#20063;&#24847;&#21619;&#30528;&#33719;&#21462;&#26368;&#26032;&#20462;&#35746;&#29256;&#26412;&#26102;&#20250;&#27604;Berkeley DB&#24930;&#19968;&#28857;&#65292;&#25552;&#20132;&#26102;FSFS&#20063;&#20250;&#26377;&#19968;&#20010;&#26356;&#38271;&#30340;&#24310;&#36831;&#65292;&#22312;&#26576;&#20123;&#26497;&#31471;&#24773;&#20917;&#19979;&#20250;&#23548;&#33268;&#23458;&#25252;&#31471;&#22312;&#31561;&#24453;&#22238;&#24212;&#26102;&#36229;&#26102;&#12290;</p><p>The most important distinction, however, is FSFS's
          imperviousness to wedging when something goes wrong.  If a
          process using a Berkeley DB database runs into a permissions
          problem or suddenly crashes, the database can be left in an
          unusable state until an administrator recovers it.  If the
          same scenarios happen to a process using an FSFS repository,
          the repository isn't affected at all.  At worst, some
          transaction data is left behind.</p><p>The only real argument against FSFS is its relative
          immaturity compared to Berkeley DB.  Unlike Berkeley DB,
          which has years of history, its own dedicated development
          team, and, now, Oracle's mighty name attached to it,
          <sup>[<a name="d0e9587" href="#ftn.d0e9587" class="footnote">29</a>]</sup>
          FSFS is a newer bit of engineering.  Prior to Subversion
          1.4, it was still shaking out some pretty serious data
          integrity bugs, which, while only triggered in very rare
          cases, nonetheless did occur.  That said, FSFS has quickly
          become the backend of choice for some of the largest public
          and private Subversion repositories, and it promises a lower
          barrier to entry for Subversion across the board.</p></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d0e9285" href="#d0e9285" class="para">25</a>] </sup>&#26080;&#35770;&#26159;&#22312;&#24573;&#30053;&#24773;&#20917;&#19979;&#24314;&#31435;&#25110;&#24456;&#23569;&#32771;&#34385;&#36807;&#22914;&#20309;&#20135;&#29983;&#27491;&#30830;&#30340;&#36719;&#20214;&#24320;&#21457;&#30697;&#38453;&#65292;&#37117;&#19981;&#24212;&#35813;&#24858;&#34850;&#30340;&#25285;&#24515;&#20840;&#23616;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#65292;&#36825;&#19981;&#24212;&#35813;&#25104;&#20026;&#23433;&#25490;&#39033;&#30446;&#21644;&#29256;&#26412;&#24211;&#30340;&#29702;&#30001;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e9309" href="#d0e9309" class="para">26</a>] </sup>The <code class="filename">trunk</code>, <code class="filename">tags</code>, 
            and <code class="filename">branches</code> trio are sometimes referred
            to as &#8220;<span class="quote">the TTB directories.</span>&#8221;</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e9381" href="#d0e9381" class="para">27</a>] </sup>Often pronounced &#8220;<span class="quote">fuzz-fuzz,</span>&#8221; if Jack
            Repenning has anything to say about it.  (This book,
            however, assumes that the reader is thinking
            &#8220;<span class="quote">eff-ess-eff-ess.</span>&#8221;)</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e9539" href="#d0e9539" class="para">28</a>] </sup>Berkeley DB&#38656;&#35201;&#24213;&#23618;&#30340;&#25991;&#20214;&#31995;&#32479;&#23454;&#29616;&#20005;&#26684;&#30340;POSIX&#38145;&#23450;&#35821;&#27861;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#23558;&#25991;&#20214;&#30452;&#25509;&#26144;&#23556;&#21040;&#20869;&#23384;&#30340;&#33021;&#21147;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d0e9587" href="#d0e9587" class="para">29</a>] </sup>Oracle&#22312;2006&#24773;&#20154;&#33410;&#36141;&#20080;&#20102;Sleepycat&#21644;&#23427;&#30340;&#26071;&#33328;&#36719;&#20214;Berkeley DB&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.reposadmin.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.reposadmin.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.reposadmin.create.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;</td></tr></table></div></body></html>