<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#24120;&#29992;&#20998;&#25903;&#27169;&#24335;</title><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="svn.branchmerge.maint.html" title="&#32500;&#25252;&#20998;&#25903;"><link rel="next" href="svn.advanced.vendorbr.html" title="&#20379;&#26041;&#20998;&#25903;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24120;&#29992;&#20998;&#25903;&#27169;&#24335;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.maint.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.vendorbr.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.branchmerge.commonpatterns"></a>&#24120;&#29992;&#20998;&#25903;&#27169;&#24335;</h2></div></div></div>
      
      <p>&#20998;&#25903;&#21644;<span class="command"><strong>svn merge</strong></span>&#26377;&#24456;&#22810;&#19981;&#21516;&#30340;&#29992;&#27861;&#65292;&#36825;&#20010;&#23567;&#33410;&#25551;&#36848;&#20102;&#26368;&#24120;&#35265;&#30340;&#29992;&#27861;&#12290;</p>
      <p>&#29256;&#26412;&#25511;&#21046;&#22312;&#36719;&#20214;&#24320;&#21457;&#20013;&#24191;&#27867;&#20351;&#29992;&#65292;&#36825;&#37324;&#26159;&#22242;&#38431;&#37324;&#31243;&#24207;&#21592;&#26368;&#24120;&#29992;&#30340;&#20004;&#31181;&#20998;&#25903;/&#21512;&#24182;&#27169;&#24335;&#30340;&#20171;&#32461;&#65292;&#22914;&#26524;&#20320;&#19981;&#26159;&#20351;&#29992;Subversion&#36719;&#20214;&#24320;&#21457;&#65292;&#21487;&#38543;&#24847;&#36339;&#36807;&#26412;&#23567;&#33410;&#65292;&#22914;&#26524;&#20320;&#26159;&#31532;&#19968;&#27425;&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#30340;&#36719;&#20214;&#24320;&#21457;&#32773;&#65292;&#35831;&#26356;&#21152;&#27880;&#24847;&#65292;&#20197;&#19979;&#27169;&#24335;&#34987;&#35768;&#22810;&#32769;&#20853;&#24403;&#20316;&#26368;&#20339;&#23454;&#36341;&#65292;&#36825;&#20010;&#36807;&#31243;&#24182;&#19981;&#21482;&#26159;&#38024;&#23545;Subversion&#65292;&#22312;&#20219;&#20309;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#37117;&#19968;&#26679;&#65292;&#20294;&#26159;&#22312;&#36825;&#37324;&#20351;&#29992;Subversion&#26415;&#35821;&#20250;&#24863;&#35273;&#26356;&#26041;&#20415;&#19968;&#28857;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.commonpatterns.release"></a>&#21457;&#24067;&#20998;&#25903;</h3></div></div></div>
        
        <p>Most software has a typical life cycle: code, test,
        release, repeat.  There are two problems with this process.
        First, developers need to keep writing new features while
        quality assurance teams take time to test supposedly stable
        versions of the software.  New work cannot halt while the
        software is tested.  Second, the team almost always needs to
        support older, released versions of software; if a bug is
        discovered in the latest code, it most likely exists in
        released versions as well, and customers will want to get
        that bug fix without having to wait for a major new
        release.</p>
        <p>&#36825;&#26159;&#29256;&#26412;&#25511;&#21046;&#21487;&#20197;&#20570;&#30340;&#24110;&#21161;&#65292;&#20856;&#22411;&#30340;&#36807;&#31243;&#22914;&#19979;&#65306;</p>
        <div class="orderedlist"><ol type="1"><li>
            <p><span class="emphasis"><em>Developers commit all new work to the
              trunk.</em></span>

            Day-to-day changes are committed to
            <code class="filename">/trunk</code>: new features, bug fixes, and
            so on.</p>
          </li><li>
            <p><span class="emphasis"><em>The trunk is copied to a
              &#8220;<span class="quote">release</span>&#8221; branch.</em></span>

            When the team thinks the software is ready for release
            (say, a 1.0 release), <code class="filename">/trunk</code>
            might be copied to
            <code class="filename">/branches/1.0</code>.</p>
          </li><li>
            <p><span class="emphasis"><em>&#39033;&#30446;&#32452;&#32487;&#32493;&#24182;&#34892;&#24037;&#20316;&#65292;</em></span>&#19968;&#20010;&#23567;&#32452;&#24320;&#22987;&#23545;&#20998;&#25903;&#36827;&#34892;&#20005;&#37239;&#30340;&#27979;&#35797;&#65292;&#21516;&#26102;&#21478;&#19968;&#20010;&#23567;&#32452;&#22312;<code class="filename">/trunk</code>&#32487;&#32493;&#26032;&#30340;&#24037;&#20316;(&#22914;&#65292;&#20934;&#22791;2.0)&#65292;&#22914;&#26524;&#19968;&#20010;bug&#22312;&#20219;&#20309;&#19968;&#20010;&#20301;&#32622;&#34987;&#21457;&#29616;&#65292;&#38169;&#35823;&#20462;&#27491;&#38656;&#35201;&#26469;&#22238;&#36816;&#36865;&#12290;&#28982;&#32780;&#36825;&#20010;&#36807;&#31243;&#26377;&#26102;&#20505;&#20063;&#20250;&#32467;&#26463;&#65292;&#20363;&#22914;&#20998;&#25903;&#24050;&#32463;&#20026;&#21457;&#24067;&#21069;&#30340;&#26368;&#32456;&#27979;&#35797;&#8220;<span class="quote">&#20572;&#28382;</span>&#8221;&#20102;&#12290;</p>
          </li><li>
            <p><span class="emphasis"><em>&#20998;&#25903;&#24050;&#32463;&#20316;&#20102;&#26631;&#31614;&#24182;&#19988;&#21457;&#24067;&#65292;</em></span>&#24403;&#27979;&#35797;&#32467;&#26463;&#65292;<code class="filename">/branches/1.0</code>&#20316;&#20026;&#24341;&#29992;&#24555;&#29031;&#24050;&#32463;&#25335;&#36125;&#21040;<code class="filename">/tags/1.0.0</code>&#65292;&#36825;&#20010;&#26631;&#31614;&#34987;&#25171;&#21253;&#21457;&#24067;&#32473;&#23458;&#25143;&#12290;</p>
          </li><li>
            <p><span class="emphasis"><em>The branch is maintained over time.</em></span>

            While work continues on <code class="filename">/trunk</code> for
            version 2.0, bug fixes continue to be ported from
            <code class="filename">/trunk</code> to
            <code class="filename">/branches/1.0</code>.  When enough
            bug fixes have accumulated, management may decide to do a
            1.0.1 release: <code class="filename">/branches/1.0</code> is
            copied to <code class="filename">/tags/1.0.1</code>, and the tag
            is packaged and released.</p>
          </li></ol></div>
        <p>&#25972;&#20010;&#36807;&#31243;&#38543;&#30528;&#36719;&#20214;&#30340;&#25104;&#29087;&#19981;&#26029;&#37325;&#22797;&#65306;&#24403;2.0&#23436;&#25104;&#65292;&#19968;&#20010;&#26032;&#30340;2.0&#20998;&#25903;&#34987;&#21019;&#24314;&#65292;&#27979;&#35797;&#12289;&#25171;&#26631;&#31614;&#21644;&#26368;&#32456;&#21457;&#24067;&#65292;&#32463;&#36807;&#35768;&#22810;&#24180;&#65292;&#29256;&#26412;&#24211;&#32467;&#26463;&#20102;&#35768;&#22810;&#29256;&#26412;&#21457;&#24067;&#65292;&#36827;&#20837;&#20102;&#8220;<span class="quote">&#32500;&#25252;</span>&#8221;&#27169;&#24335;&#65292;&#35768;&#22810;&#26631;&#31614;&#20195;&#34920;&#20102;&#26368;&#32456;&#30340;&#21457;&#24067;&#29256;&#26412;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.commonpatterns.feature"></a>&#29305;&#24615;&#20998;&#25903;</h3></div></div></div>
        
        <p>A <em class="firstterm">feature branch</em> is the sort of
        branch that's been the dominant example in this chapter (the
        one you've been working on while Sally continues to work on
        <code class="filename">/trunk</code>).  It's a temporary branch created
        to work on a complex change without interfering with the
        stability of <code class="filename">/trunk</code>.  Unlike release
        branches (which may need to be supported forever), feature
        branches are born, used for a while, merged back to the trunk,
        and then ultimately deleted.  They have a finite span of
        usefulness.</p>
        <p>&#36824;&#26377;&#65292;&#20851;&#20110;&#26159;&#21542;&#21019;&#24314;&#29305;&#24615;&#20998;&#25903;&#30340;&#39033;&#30446;&#25919;&#31574;&#20063;&#21464;&#21270;&#24191;&#27867;&#65292;&#19968;&#20123;&#39033;&#30446;&#27704;&#36828;&#19981;&#20351;&#29992;&#29305;&#24615;&#20998;&#25903;&#65306;&#22823;&#23478;&#37117;&#21487;&#20197;&#25552;&#20132;&#21040;<code class="filename">/trunk</code>&#65292;&#22909;&#22788;&#26159;&#31995;&#32479;&#30340;&#31616;&#21333;&#8212;&#27809;&#26377;&#20154;&#38656;&#35201;&#30693;&#36947;&#20998;&#25903;&#21644;&#21512;&#24182;&#65292;&#22351;&#22788;&#26159;&#20027;&#24178;&#20250;&#32463;&#24120;&#19981;&#31283;&#23450;&#25110;&#32773;&#19981;&#21487;&#29992;&#65292;&#21478;&#22806;&#19968;&#20123;&#39033;&#30446;&#20351;&#29992;&#20998;&#25903;&#36798;&#21040;&#26497;&#38480;&#65306;&#27809;&#26377;&#20462;&#25913;<span class="emphasis"><em>&#26366;&#32463;</em></span>&#30452;&#25509;&#25552;&#20132;&#21040;&#20027;&#24178;&#65292;&#21363;&#20351;&#26368;&#32454;&#23567;&#30340;&#20462;&#25913;&#37117;&#35201;&#21019;&#24314;&#30701;&#26242;&#30340;&#20998;&#25903;&#65292;&#28982;&#21518;&#23567;&#24515;&#30340;&#23457;&#26680;&#21512;&#24182;&#21040;&#20027;&#24178;&#65292;&#28982;&#21518;&#21024;&#38500;&#20998;&#25903;&#65292;&#36825;&#26679;&#31995;&#32479;&#20445;&#25345;&#20027;&#24178;&#19968;&#30452;&#31283;&#23450;&#21644;&#21487;&#29992;&#65292;&#20294;&#26159;&#36896;&#25104;&#20102;&#24040;&#22823;&#30340;&#36127;&#25285;&#12290;</p>
        <p>Most projects take a middle-of-the-road approach.  They
        commonly insist that <code class="filename">/trunk</code> compile and
        pass regression tests at all times.  A feature branch is
        required only when a change requires a large number of
        destabilizing commits.  A good rule of thumb is to ask this
        question: if the developer worked for days in isolation and
        then committed the large change all at once (so that
        <code class="filename">/trunk</code> were never destabilized), would it
        be too large a change to review?  If the answer to that
        question is &#8220;<span class="quote">yes,</span>&#8221; the change should be
        developed on a feature branch.  As the developer commits
        incremental changes to the branch, they can be easily reviewed
        by peers.</p>
        <p>&#26368;&#32456;&#65292;&#26377;&#19968;&#20010;&#38382;&#39064;&#23601;&#26159;&#24590;&#26679;&#20445;&#25345;&#19968;&#20010;&#29305;&#24615;&#20998;&#25903;&#8220;<span class="quote">&#21516;&#27493;</span>&#8221;&#20110;&#24037;&#20316;&#20013;&#30340;&#20027;&#24178;&#65292;&#22312;&#21069;&#38754;&#25552;&#21040;&#36807;&#65292;&#22312;&#19968;&#20010;&#20998;&#25903;&#19978;&#24037;&#20316;&#25968;&#21608;&#25110;&#20960;&#20010;&#26376;&#26159;&#24456;&#26377;&#39118;&#38505;&#30340;&#65292;&#20027;&#24178;&#30340;&#20462;&#25913;&#20063;&#35768;&#20250;&#25345;&#32493;&#28044;&#20837;&#65292;&#22240;&#20026;&#36825;&#19968;&#28857;&#65292;&#20004;&#26465;&#32447;&#30340;&#24320;&#21457;&#20250;&#21306;&#21035;&#24040;&#22823;&#65292;&#21512;&#24182;&#20998;&#25903;&#22238;&#21040;&#20027;&#24178;&#20250;&#25104;&#20026;&#19968;&#20010;&#22121;&#26790;&#12290;</p>
        <p>This situation is best avoided by regularly merging trunk
        changes to the branch.  Make up a policy: once a week, merge
        the last week's worth of trunk changes to the branch.</p>
        <p>&#22312;&#19968;&#20123;&#26102;&#20505;&#65292;&#20320;&#24050;&#32463;&#20934;&#22791;&#22909;&#20102;&#23558;&#8220;<span class="quote">&#21516;&#27493;&#30340;</span>&#8221;&#29305;&#24615;&#20998;&#25903;&#21512;&#24182;&#22238;&#21040;&#20027;&#24178;&#65292;&#20026;&#27492;&#65292;&#24320;&#22987;&#20570;&#19968;&#27425;&#23558;&#20027;&#24178;&#26368;&#26032;&#20462;&#25913;&#21644;&#20998;&#25903;&#30340;&#26368;&#32456;&#21512;&#24182;&#65292;&#36825;&#26679;&#20197;&#21518;&#65292;&#38500;&#20102;&#20320;&#30340;&#20998;&#25903;&#20462;&#25913;&#30340;&#37096;&#20998;&#65292;&#26368;&#26032;&#30340;&#20998;&#25903;&#21644;&#20027;&#24178;&#23558;&#20250;&#32477;&#23545;&#19968;&#33268;&#65292;&#20320;&#25110;&#35768;&#38656;&#35201;&#20351;&#29992;<code class="option">--reintegrate</code>&#36873;&#39033;&#21512;&#24182;&#22238;&#21435;&#65306;</p>
        <pre class="screen">
$ cd trunk-working-copy

$ svn update
At revision 1910.

$ svn merge --reintegrate http://svn.example.com/repos/calc/branches/mybranch
--- Merging differences between repository URLs into '.':
U    real.c
U    integer.c
A    newdirectory
A    newdirectory/newfile
 U   .
&#8230;
</pre>
        <p>Another way of thinking about this pattern is that your
        weekly sync of trunk to branch is analogous to running
        <span class="command"><strong>svn update</strong></span> in a working copy, while the
        final merge step is analogous to running <span class="command"><strong>svn
          commit</strong></span> from a working copy.  After all, what else
        <span class="emphasis"><em>is</em></span> a working copy but a very shallow
        private branch?  It's a branch that's capable of
        storing only one change at a time.</p>
      </div>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.maint.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.branchmerge.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.vendorbr.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#32500;&#25252;&#20998;&#25903;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#20379;&#26041;&#20998;&#25903;</td></tr></table></div></body></html>