<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Subversion &#26159;&#20160;&#20040;&#65311;</title><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.preface.html" title="&#24207;&#35328;"><link rel="prev" href="svn.preface.acks.html" title="&#33268;&#35874;"><link rel="next" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Subversion &#26159;&#20160;&#20040;&#65311;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.preface.acks.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#24207;&#35328;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.basic.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.intro.whatis"></a>Subversion &#26159;&#20160;&#20040;&#65311;</h2></div></div></div>
      
      <p>Subversion&#26159;&#19968;&#20010;&#33258;&#30001;/&#24320;&#28304;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#22312;Subversion&#31649;&#29702;&#19979;&#65292;&#25991;&#20214;&#21644;&#30446;&#24405;&#21487;&#20197;&#36229;&#36234;&#26102;&#31354;&#12290;&#20063;&#23601;&#26159;Subversion&#20801;&#35768;&#20320;&#25968;&#25454;&#24674;&#22797;&#21040;&#26089;&#26399;&#29256;&#26412;&#65292;&#25110;&#32773;&#26159;&#26816;&#26597;&#25968;&#25454;&#20462;&#25913;&#30340;&#21382;&#21490;&#12290;&#27491;&#22240;&#20026;&#22914;&#27492;&#65292;&#35768;&#22810;&#20154;&#23558;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#24403;&#20316;&#19968;&#31181;&#31070;&#22855;&#30340;&#8220;<span class="quote">&#26102;&#38388;&#26426;&#22120;</span>&#8221;&#12290;</p>
      <p>Subversion&#30340;&#29256;&#26412;&#24211;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#65292;&#20174;&#32780;&#20351;&#29992;&#25143;&#21487;&#20197;&#22312;&#19981;&#21516;&#30340;&#30005;&#33041;&#19978;&#36827;&#34892;&#25805;&#20316;&#12290;&#20174;&#26576;&#31181;&#31243;&#24230;&#19978;&#26469;&#35828;&#65292;&#20801;&#35768;&#29992;&#25143;&#22312;&#21508;&#33258;&#30340;&#31354;&#38388;&#37324;&#20462;&#25913;&#21644;&#31649;&#29702;&#21516;&#19968;&#32452;&#25968;&#25454;&#21487;&#20197;&#20419;&#36827;&#22242;&#38431;&#21327;&#20316;&#12290;&#22240;&#20026;&#20462;&#25913;&#19981;&#20877;&#26159;&#21333;&#32447;&#36827;&#34892;&#65292;&#24320;&#21457;&#36895;&#24230;&#20250;&#26356;&#24555;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#25152;&#26377;&#30340;&#24037;&#20316;&#37117;&#24050;&#29256;&#26412;&#21270;&#65292;&#20063;&#23601;&#19981;&#24517;&#25285;&#24515;&#30001;&#20110;&#38169;&#35823;&#30340;&#26356;&#25913;&#32780;&#24433;&#21709;&#36719;&#20214;&#36136;&#37327;&#8212;&#22914;&#26524;&#20986;&#29616;&#19981;&#27491;&#30830;&#30340;&#26356;&#25913;&#65292;&#21482;&#35201;&#25764;&#38144;&#37027;&#19968;&#27425;&#26356;&#25913;&#25805;&#20316;&#21363;&#21487;&#12290;</p>
      <p>&#26576;&#20123;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#26412;&#36523;&#20063;&#26159;&#36719;&#20214;&#37197;&#32622;&#31649;&#29702;(SCM)&#31995;&#32479;&#65292;&#36825;&#31181;&#31995;&#32479;&#32463;&#36807;&#31934;&#24039;&#30340;&#35774;&#35745;&#65292;&#19987;&#38376;&#29992;&#26469;&#31649;&#29702;&#28304;&#20195;&#30721;&#26641;&#65292;&#24182;&#19988;&#20855;&#22791;&#35768;&#22810;&#19982;&#36719;&#20214;&#24320;&#21457;&#26377;&#20851;&#30340;&#29305;&#24615;&#8212;&#27604;&#22914;&#65292;&#23545;&#32534;&#31243;&#35821;&#35328;&#30340;&#25903;&#25345;&#65292;&#25110;&#32773;&#25552;&#20379;&#31243;&#24207;&#26500;&#24314;&#24037;&#20855;&#12290;&#19981;&#36807;Subversion&#24182;&#19981;&#26159;&#36825;&#26679;&#30340;&#31995;&#32479;&#12290;&#23427;&#26159;&#19968;&#20010;&#36890;&#29992;&#31995;&#32479;&#65292;&#21487;&#20197;&#31649;&#29702;<span class="emphasis"><em>&#20219;&#20309;</em></span>&#31867;&#22411;&#30340;&#25991;&#20214;&#38598;&#12290;&#23545;&#20320;&#26469;&#35828;&#65292;&#36825;&#20123;&#25991;&#20214;&#36825;&#21487;&#33021;&#26159;&#28304;&#31243;&#24207;&#8212;&#32780;&#23545;&#21035;&#20154;&#65292;&#21017;&#21487;&#33021;&#26159;&#19968;&#20010;&#36135;&#29289;&#28165;&#21333;&#25110;&#32773;&#26159;&#25968;&#23383;&#30005;&#24433;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.righttool"></a>Subversion &#26159;&#27491;&#30830;&#30340;&#24037;&#20855;&#21527;&#65311;</h3></div></div></div>
        
        <p>&#22914;&#26524;&#20320;&#26159;&#19968;&#20010;&#32771;&#34385;&#22914;&#20309;&#20351;&#29992;Subversion&#30340;&#29992;&#25143;&#25110;&#31649;&#29702;&#21592;&#65292;&#20320;&#35201;&#38382;&#33258;&#24049;&#30340;&#31532;&#19968;&#20214;&#20107;&#23601;&#26159;&#65306; "&#36825;&#26159;&#36825;&#39033;&#24037;&#20316;&#30340;&#27491;&#30830;&#24037;&#20855;&#21527;&#65311;"&#65292;Subversion&#26159;&#19968;&#20010;&#26790;&#24187;&#33324;&#30340;&#38180;&#23376;&#65292;&#20294;&#35201;&#23567;&#24515;&#19981;&#35201;&#25226;&#20219;&#20309;&#38382;&#39064;&#24403;&#20316;&#38025;&#23376;&#12290;</p>
        <p>If you need to archive old versions of files and
        directories, possibly resurrect them, or examine logs of how
        they've changed over time, then Subversion is exactly the
        right tool for you.  If you need to collaborate with people on
        documents (usually over a network) and keep track of who made
        which changes, then Subversion is also appropriate.  This is
        why Subversion is so often used in software development
        environments&#8212; working on a development team is an inherently social
        activity, and Subversion makes it easy to collaborate with
        other programmers.  Of course, there's a cost to using
        Subversion as well: administrative overhead.  You'll need to
        manage a data repository to store the information and all its
        history, and be diligent about backing it up.  When working
        with the data on a daily basis, you won't be able to copy,
        move, rename, or delete files the way you usually do.
        Instead, you'll have to do all of those things through
        Subversion.</p>
        <p>&#20551;&#23450;&#20320;&#33021;&#22815;&#25509;&#21463;&#39069;&#22806;&#30340;&#24037;&#20316;&#27969;&#31243;&#65292;&#20320;&#19968;&#23450;&#35201;&#30830;&#23450;&#19981;&#35201;&#20351;&#29992;Subversion&#26469;&#35299;&#20915;&#20854;&#20182;&#24037;&#20855;&#33021;&#22815;&#23436;&#25104;&#30340;&#24456;&#22909;&#30340;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#22240;&#20026;Subversion&#20250;&#22797;&#21046;&#25152;&#26377;&#30340;&#25968;&#25454;&#21040;&#21442;&#19982;&#32773;&#65292;&#19968;&#20010;&#24120;&#35265;&#30340;&#35823;&#29992;&#26159;&#23558;&#20854;&#20316;&#20026;&#26222;&#36890;&#30340;&#20998;&#24067;&#24335;&#31995;&#32479;&#12290;&#38382;&#39064;&#26159;&#27492;&#31867;&#25968;&#25454;&#36890;&#24120;&#24456;&#23569;&#20462;&#25913;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20351;&#29992;Subversion&#26377;&#28857;&#8220;<span class="quote">&#36807;&#20102;</span>&#8221;&#12290;<sup>[<a name="d4e325" href="#ftn.d4e325" class="footnote">2</a>]</sup>&#26377;&#19968;&#20123;&#21487;&#20197;&#22797;&#21046;&#25968;&#25454;&#26356;&#31616;&#21333;&#30340;&#24037;&#20855;&#65292;&#27809;&#26377;&#24517;&#35201;&#36807;&#24230;&#30340;&#36319;&#36394;&#21464;&#26356;&#65292;&#20363;&#22914;<span class="command"><strong>rsync</strong></span>&#25110;<span class="command"><strong>unison</strong></span>&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.history"></a>Subversion &#30340;&#21382;&#21490;</h3></div></div></div>
        
        <p>&#26089;&#22312;2000&#24180;&#65292;CollabNet, Inc. (<code class="uri">http://www.collab.net</code>)&#23601;&#24320;&#22987;&#23547;&#25214;CVS&#26367;&#20195;&#20135;&#21697;&#30340;&#24320;&#21457;&#20154;&#21592;&#12290;CollabNet&#25552;&#20379;&#20102;&#19968;&#20010;&#21517;&#20026;CollabNet&#20225;&#19994;&#29256;(CEE)&#30340;&#21327;&#20316;&#36719;&#20214;&#22871;&#20214;&#12290;&#36825;&#20010;&#36719;&#20214;&#22871;&#20214;&#30340;&#19968;&#20010;&#32452;&#25104;&#37096;&#20998;&#23601;&#26159;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#23613;&#31649;CEE&#22312;&#26368;&#21021;&#37319;&#29992;&#20102;CVS&#20316;&#20026;&#20854;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#20294;&#26159;CVS&#30340;&#23616;&#38480;&#24615;&#20174;&#19968;&#24320;&#22987;&#23601;&#24456;&#26126;&#26174;&#65292;CollabNet&#30693;&#36947;&#65292;&#36831;&#26089;&#35201;&#25214;&#21040;&#19968;&#20010;&#26356;&#22909;&#30340;&#26367;&#20195;&#21697;&#12290;&#36951;&#25022;&#30340;&#26159;&#65292;CVS&#24050;&#32463;&#25104;&#20026;&#24320;&#28304;&#19990;&#30028;&#20107;&#23454;&#19978;&#30340;&#26631;&#20934;&#65292;&#24456;&#22823;&#31243;&#24230;&#19978;&#26159;&#22240;&#20026;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#26356;&#22909;&#30340;&#26367;&#20195;&#21697;&#65292;&#33267;&#23569;&#26159;&#27809;&#26377;&#21487;&#20197;&#33258;&#30001;&#20351;&#29992;&#30340;&#26367;&#20195;&#21697;&#12290;&#25152;&#20197;CollabNet&#20915;&#23450;&#20174;&#22836;&#32534;&#20889;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#36825;&#20010;&#31995;&#32479;&#20445;&#30041;CVS&#30340;&#22522;&#26412;&#24605;&#24819;&#65292;&#20294;&#26159;&#35201;&#20462;&#27491;&#20854;&#20013;&#38169;&#35823;&#21644;&#19981;&#21512;&#29702;&#30340;&#29305;&#24615;&#12290;</p>
        <p>In February 2000, they contacted Karl Fogel, the author of
        <em class="citetitle">Open Source Development with CVS</em>
        (Coriolis, 1999), and asked if he'd like to work on this new
        project.  Coincidentally, at the time Karl was already
        discussing a design for a new version control system with his
        friend Jim Blandy.  In 1995, the two had started Cyclic
        Software, a company providing CVS support contracts, and
        although they later sold the business, they still used CVS every
        day at their jobs.  Their frustration with CVS had led Jim to
        think carefully about better ways to manage versioned data, and
        he'd already come up with not only the name
        &#8220;<span class="quote">Subversion,</span>&#8221; but also the basic design of
        the Subversion data store.  When CollabNet called, Karl
        immediately agreed to work on the project, and Jim got his
        employer, Red Hat Software, to essentially donate him to the
        project for an indefinite period of time.  CollabNet hired
        Karl and Ben Collins-Sussman, and detailed design work began
        in May 2000.  With the help of some well-placed prods from
        Brian Behlendorf and Jason Robbins of CollabNet, and from Greg
        Stein (at the time an independent developer active in the
        WebDAV/DeltaV specification process), Subversion quickly
        attracted a community of active developers.  It turned out
        that many people had encountered the same frustrating
        experiences with CVS and welcomed the chance to finally do
        something about it.</p>
        <p>&#26368;&#21021;&#30340;&#35774;&#35745;&#23567;&#32452;&#35774;&#23450;&#20102;&#31616;&#21333;&#30340;&#24320;&#21457;&#30446;&#26631;&#12290;&#20182;&#20204;&#19981;&#24819;&#22312;&#29256;&#26412;&#25511;&#21046;&#26041;&#27861;&#23398;&#20013;&#24320;&#22438;&#22788;&#22899;&#22320;&#65292;&#20182;&#20204;&#21482;&#26159;&#24076;&#26395;&#20462;&#27491;CVS&#12290;&#20182;&#20204;&#20915;&#23450;Subversion&#24212;&#31526;&#21512;CVS&#30340;&#29305;&#24615;&#65292;&#24182;&#20445;&#30041;&#30456;&#21516;&#30340;&#24320;&#21457;&#27169;&#22411;&#65292;&#20294;&#19981;&#20877;&#37325;&#22797;CVS&#30340;&#19968;&#20123;&#26174;&#33879;&#32570;&#38519;&#12290;&#23613;&#31649;Subversion&#24182;&#19981;&#38656;&#35201;&#25104;&#20026;CVS&#30340;&#23436;&#20840;&#26367;&#20195;&#21697;&#65292;&#20294;&#23427;&#24212;&#35813;&#19982;CVS&#20445;&#25345;&#36275;&#22815;&#30340;&#30456;&#20284;&#24615;&#65292;&#20197;&#20351;CVS&#29992;&#25143;&#21487;&#20197;&#36731;&#26494;&#30340;&#36716;&#31227;&#21040;Subversion&#19978;&#12290;</p>
        <p>&#32463;&#36807;14&#20010;&#26376;&#30340;&#32534;&#30721;&#65292;2001&#24180;8&#26376;31&#26085;&#65292;Subversion&#33021;&#22815;&#8220;<span class="quote">&#33258;&#24049;&#31649;&#29702;&#33258;&#24049;</span>&#8221;&#20102;&#65292;&#24320;&#21457;&#32773;&#20572;&#27490;&#20351;&#29992;CVS&#20445;&#23384;Subversion&#30340;&#20195;&#30721;&#65292;&#32780;&#20351;&#29992;Subversion&#26412;&#36523;&#12290;</p>
        <p>&#34429;&#28982;CollabNet&#21551;&#21160;&#20102;&#36825;&#20010;&#39033;&#30446;&#65292;&#24182;&#19988;&#19968;&#30452;&#25552;&#20379;&#20102;&#22823;&#37327;&#30340;&#24037;&#20316;&#25903;&#25345;(&#23427;&#20026;&#19968;&#20123;&#20840;&#32844;&#30340;Subversion&#24320;&#21457;&#32773;&#25552;&#20379;&#34218;&#27700;)&#65292;&#20294;Subversion&#20687;&#20854;&#23427;&#35768;&#22810;&#24320;&#28304;&#39033;&#30446;&#19968;&#26679;&#65292;&#34987;&#26494;&#25955;&#30340;&#12289;&#36879;&#26126;&#30340;&#35268;&#21017;&#31649;&#29702;&#30528;&#65292;&#36825;&#26679;&#30340;&#35268;&#21017;&#28608;&#21169;&#30528;&#30693;&#35782;&#30028;&#30340;&#31934;&#33521;&#20204;&#12290;CollabNet&#30340;&#29256;&#26435;&#35768;&#21487;&#35777;&#23436;&#20840;&#31526;&#21512;Debian&#30340;&#33258;&#30001;&#36719;&#20214;&#26041;&#38024;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#26681;&#25454;&#33258;&#24049;&#30340;&#24847;&#24895;&#33258;&#30001;&#30340;&#19979;&#36733;&#12289;&#20462;&#25913;&#21644;&#37325;&#26032;&#21457;&#24067;Subversion&#65292;&#19981;&#38656;&#35201;CollabNet&#25110;&#20854;&#20182;&#20154;&#30340;&#25480;&#26435;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.architecture"></a>Subversion &#30340;&#26550;&#26500;</h3></div></div></div>
        
        <p><a class="xref" href="svn.intro.whatis.html#svn.intro.architecture.dia-1" title="&#22270;&nbsp;1.&nbsp;Subversion &#30340;&#26550;&#26500;">&#22270;&nbsp;1 &#8220;Subversion &#30340;&#26550;&#26500;&#8221;</a>&#32473;&#20986;&#20102;Subversion&#35774;&#35745;&#24635;&#20307;&#19978;&#30340;&#8220;<span class="quote">&#20463;&#35270;&#22270;</span>&#8221;&#12290;</p>
        <div class="figure"><a name="svn.intro.architecture.dia-1"></a><p class="title"><b>&#22270;&nbsp;1.&nbsp;Subversion &#30340;&#26550;&#26500;</b></p><div class="figure-contents">
          
          <div class="mediaobject"><img src="images/ch01dia1.png" alt="Subversion &#30340;&#26550;&#26500;"></div>
        </div></div><br class="figure-break">
        <p>&#22270;&#20013;&#30340;&#19968;&#31471;&#26159;&#20445;&#23384;&#25152;&#26377;&#29256;&#26412;&#25968;&#25454;&#30340;Subversion&#29256;&#26412;&#24211;&#65292;&#21478;&#19968;&#31471;&#26159;Subvesion&#30340;&#23458;&#25143;&#31243;&#24207;&#65292;&#31649;&#29702;&#30528;&#25152;&#26377;&#29256;&#26412;&#25968;&#25454;&#30340;&#26412;&#22320;&#24433;&#23556;(&#31216;&#20026;&#8220;<span class="quote">&#24037;&#20316;&#25335;&#36125;</span>&#8221;)&#65292;&#22312;&#36825;&#20004;&#26497;&#20043;&#38388;&#26159;&#21508;&#31181;&#21508;&#26679;&#30340;&#29256;&#26412;&#24211;&#35775;&#38382;(RA)&#23618;&#65292;&#26576;&#20123;&#20351;&#29992;&#30005;&#33041;&#32593;&#32476;&#36890;&#36807;&#32593;&#32476;&#26381;&#21153;&#22120;&#35775;&#38382;&#29256;&#26412;&#24211;&#65292;&#26576;&#20123;&#21017;&#32469;&#36807;&#32593;&#32476;&#26381;&#21153;&#22120;&#30452;&#25509;&#35775;&#38382;&#29256;&#26412;&#24211;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.components"></a>Subversion &#30340;&#32452;&#20214;</h3></div></div></div>
        
        <p>Subversion, once installed, has a number of different
        pieces.  The following is a quick overview of what you get.
        Don't be alarmed if the brief descriptions leave you scratching
        your head&#8212;<span class="emphasis"><em>plenty</em></span> more pages
        in this book are devoted to alleviating that confusion.</p>
        <div class="variablelist"><dl><dt><span class="term">svn</span></dt><dd>
              <p>The command-line client program</p>
            </dd><dt><span class="term">svnversion</span></dt><dd>
              <p>A program for reporting the state (in terms of
              revisions of the items present) of a working copy</p>
            </dd><dt><span class="term">svnlook</span></dt><dd>
              <p>A tool for directly inspecting a Subversion repository</p>
            </dd><dt><span class="term">svnadmin</span></dt><dd>
              <p>A tool for creating, tweaking, or repairing a Subversion
              repository</p>
            </dd><dt><span class="term">mod_dav_svn</span></dt><dd>
              <p>A plug-in module for the Apache HTTP Server, used to
              make your repository available to others over a
              network</p>
            </dd><dt><span class="term">svnserve</span></dt><dd>
              <p>&#19968;&#20010;&#21333;&#29420;&#36816;&#34892;&#30340;&#26381;&#21153;&#22120;&#31243;&#24207;&#65292;&#21487;&#20197;&#20316;&#20026;&#23432;&#25252;&#36827;&#31243;&#25110;&#30001;SSH&#35843;&#29992;&#12290;&#36825;&#26159;&#21478;&#19968;&#31181;&#20351;&#29256;&#26412;&#24211;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#30340;&#26041;&#24335;&#12290;</p>
            </dd><dt><span class="term">svndumpfilter</span></dt><dd>
              <p>A program for filtering Subversion repository dump
              streams</p>
            </dd><dt><span class="term">svnsync</span></dt><dd>
              <p>A program for incrementally mirroring one
            repository to another over a network</p>
            </dd></dl></div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.whatsnew"></a>Subversion &#26377;&#20160;&#20040;&#26032;&#19996;&#35199;&#65311;</h3></div></div></div>
        
        <p>&#27492;&#20070;&#30340;&#31532;&#19968;&#29256;&#22312;2004&#24180;&#21457;&#24067;&#65292;&#20063;&#23601;&#26159;Subversion1.5&#21457;&#24067;&#21518;&#19981;&#20037;&#12290;&#32463;&#36807;4&#24180;&#65292;Subversion&#21457;&#24067;&#20102;5&#20010;&#20027;&#35201;&#30340;&#26032;&#29256;&#26412;&#65292;&#20462;&#27491;&#20102;bug&#65292;&#22686;&#21152;&#20102;&#20027;&#35201;&#30340;&#26032;&#29305;&#24615;&#12290;&#25105;&#20204;&#19968;&#30452;&#20445;&#25345;&#26412;&#20070;&#22312;&#32447;&#29256;&#26412;&#30340;&#26356;&#26032;&#65292;&#25105;&#20204;&#29616;&#22312;&#24456;&#20852;&#22859;&#30340;&#26159;O'Reilly&#23558;&#20250;&#21457;&#24067;&#21253;&#21547;Subversion&#30340;1.5&#29256;&#26412;&#30340;&#31532;&#20108;&#29256;&#65292;1.5&#29256;&#26412;&#26159;&#39033;&#30446;&#30340;&#19968;&#20010;&#20027;&#35201;&#37324;&#31243;&#30865;&#12290;&#19979;&#38754;&#26159;&#20174;Subversion 1.0&#20197;&#26469;&#20027;&#35201;&#21464;&#26356;&#30340;&#24635;&#32467;&#65292;&#27880;&#24847;&#36825;&#19981;&#26159;&#23436;&#25972;&#30340;&#21015;&#34920;&#65307;&#35814;&#32454;&#20449;&#24687;&#21487;&#20197;&#35775;&#38382;Subversion&#30340;&#32593;&#31449;<code class="uri">http://subversion.tigris.org</code>&#12290;</p>
        <div class="variablelist"><dl><dt><span class="term">Subversion 1.1 (2004&#24180;9&#26376;)</span></dt><dd>
              <p>Release 1.1 introduced FSFS, a flat-file repository
              storage option for the repository.  While the Berkeley DB
              backend is still widely used and supported, FSFS has
              since become the default choice for
              newly created repositories due to its low barrier to
              entry and minimal maintenance requirements.  Also in
              this release came the ability to put symbolic links
              under version control, auto-escaping of URLs, and a
              localized user interface.</p>
            </dd><dt><span class="term">Subversion 1.2 (2005&#24180;5&#26376;)</span></dt><dd>
              <p>Release 1.2 introduced the ability to create
              server-side locks on files, thus serializing commit
              access to certain resources.  While Subversion is still
              a fundamentally concurrent version control system,
              certain types of binary files (e.g. art assets)
              cannot be merged together.  The locking feature fulfills
              the need to version and protect such resources.  With
              locking also came a complete WebDAV auto-versioning
              implementation, allowing Subversion repositories to be
              mounted as network folders.  Finally, Subversion 1.2
              began using a new, faster binary-differencing algorithm
              to compress and retrieve old versions of files.</p>
            </dd><dt><span class="term">Subversion 1.3 (2005&#24180;12&#26376;)</span></dt><dd>
              <p>1.3&#29256;&#26412;&#20026;<span class="command"><strong>svnserve</strong></span>&#26381;&#21153;&#22120;&#24341;&#20837;&#36335;&#24452;&#20026;&#22522;&#30784;&#30340;&#25480;&#26435;&#25511;&#21046;&#65292;&#19982;Apache&#26381;&#21153;&#22120;&#23545;&#24212;&#30340;&#29305;&#24615;&#21305;&#37197;&#12290;Apache&#26381;&#21153;&#22120;&#33258;&#24049;&#20063;&#33719;&#24471;&#20102;&#26032;&#30340;&#26085;&#24535;&#29305;&#24615;&#65292;Subversion&#20854;&#20182;&#35821;&#35328;&#30340;API&#32465;&#23450;&#20063;&#21462;&#24471;&#20102;&#24040;&#22823;&#30340;&#36827;&#27493;&#12290;</p>
            </dd><dt><span class="term">&#38024;&#23545;Subversion1.4(2006&#24180;9&#26376;)</span></dt><dd>
              <p>Release 1.4 introduced a whole new
              tool&#8212;<span class="command"><strong>svnsync</strong></span>&#8212;for doing
              one-way repository replication over a network.  Major
              parts of the working copy metadata were revamped to no
              longer use XML (resulting in client-side speed gains),
              while the Berkeley DB repository backend gained the
              ability to automatically recover itself after a server
              crash.</p>
            </dd><dt><span class="term">Subversion 1.5 (2008&#24180;6&#26376;)</span></dt><dd>
              <p>Release 1.5 took much longer to finish than prior
              releases, but the headliner feature was gigantic:
              semi-automated tracking of branching and merging.  This
              was a huge boon for users, and pushed Subversion far
              beyond the abilities of CVS and into the ranks of
              commercial competitors such as Perforce and ClearCase.
              Subversion 1.5 also introduced a bevy of other
              user-focused features, such as interactive resolution of
              file conflicts, partial checkouts, client-side
              management of changelists, powerful new syntax for
              externals definitions, and SASL authentication support for
              the <span class="command"><strong>svnserve</strong></span> server.</p>
            </dd><dt><span class="term">Subversion 1.6 (???)</span></dt><dd>
              <p>???</p>
            </dd></dl></div>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e325" href="#d4e325" class="para">2</a>] </sup>&#25110;&#32773;&#20687;&#19968;&#20010;&#26379;&#21451;&#35828;&#30340;&#65292;&#8220;<span class="quote">&#29992;&#21035;&#20811;&#25293;&#33485;&#34631;&#12290;</span>&#8221;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.preface.acks.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.preface.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.basic.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#33268;&#35874;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;</td></tr></table></div></body></html>