<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#22522;&#20110;&#36335;&#24452;&#30340;&#25480;&#26435;</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;"><link rel="prev" href="svn.serverconfig.httpd.html" title="httpd, the Apache HTTP Server"><link rel="next" href="svn.serverconfig.multimethod.html" title="&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#22522;&#20110;&#36335;&#24452;&#30340;&#25480;&#26435;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.serverconfig.httpd.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.serverconfig.multimethod.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.serverconfig.pathbasedauthz"></a>&#22522;&#20110;&#36335;&#24452;&#30340;&#25480;&#26435;</h2></div></div></div><p>Apache&#21644;<span class="command"><strong>svnserve</strong></span>&#37117;&#21487;&#20197;&#32473;&#29992;&#25143;&#36171;&#20104;(&#25110;&#25298;&#32477;)&#35775;&#38382;&#35768;&#21487;&#65292;&#36890;&#24120;&#26159;&#23545;&#25972;&#20010;&#29256;&#26412;&#24211;&#65306;&#19968;&#20010;&#29992;&#25143;&#21487;&#20197;&#35835;&#29256;&#26412;&#24211;(&#25110;&#19981;)&#65292;&#32780;&#19988;&#20182;&#21487;&#20197;&#20889;&#29256;&#26412;&#24211;(&#25110;&#19981;)&#12290;&#22914;&#26524;&#21487;&#33021;&#65292;&#20063;&#21487;&#20197;&#23450;&#20041;&#32454;&#31890;&#24230;&#30340;&#35775;&#38382;&#35268;&#21017;&#12290;&#19968;&#32452;&#29992;&#25143;&#21487;&#20197;&#26377;&#29256;&#26412;&#24211;&#30340;&#19968;&#20010;&#30446;&#24405;&#30340;&#35835;&#20889;&#26435;&#38480;&#65292;&#20294;&#26159;&#27809;&#26377;&#20854;&#23427;&#30340;&#65307;&#21478;&#19968;&#20010;&#30446;&#24405;&#21487;&#20197;&#26159;&#21482;&#23545;&#19968;&#23569;&#37096;&#20998;&#29992;&#25143;&#21487;&#35835;&#12290;</p><p>Both servers use a common file format to describe these
      path-based access rules.  In the case of Apache, one needs to
      load the <span class="command"><strong>mod_authz_svn</strong></span> module and then add
      the <code class="literal">AuthzSVNAccessFile</code> directive (within
      the <code class="filename">httpd.conf</code> file) pointing to your own
      rules file.  (For a full explanation, see
      <a class="xref" href="svn.serverconfig.httpd.html#svn.serverconfig.httpd.authz.perdir" title="Per-directory access control">&#8220;Per-directory access control&#8221;&#19968;&#33410;</a>.)  If
      you're using <span class="command"><strong>svnserve</strong></span>, then you need to make
      the <code class="literal">authz-db</code> variable
      (within <code class="filename">svnserve.conf</code>) point to your
      rules file.</p><div class="sidebar"><p class="title"><b>Do You Really Need Path-based Access Control?</b></p><p>&#35768;&#22810;&#31532;&#19968;&#27425;&#35774;&#32622;Subversion&#30340;&#31649;&#29702;&#21592;&#20250;&#22312;&#26410;&#32463;&#22826;&#22810;&#30340;&#24605;&#32771;&#30340;&#24773;&#20917;&#19979;&#36731;&#26131;&#36873;&#25321;&#20351;&#29992;&#36335;&#24452;&#20026;&#22522;&#30784;&#30340;&#35775;&#38382;&#25511;&#21046;&#65292;&#31649;&#29702;&#21592;&#36890;&#24120;&#30693;&#36947;&#22242;&#38431;&#30340;&#25104;&#21592;&#24037;&#20316;&#22312;&#21738;&#20010;&#39033;&#30446;&#65292;&#25152;&#20197;&#24456;&#23481;&#26131;&#30830;&#23450;&#36171;&#20104;&#21738;&#20123;&#22242;&#38431;&#35775;&#38382;&#21738;&#20123;&#30446;&#24405;&#65292;&#19981;&#33021;&#35775;&#38382;&#21738;&#20123;&#30446;&#24405;&#12290;&#36825;&#30475;&#36215;&#26469;&#26159;&#24456;&#33258;&#28982;&#30340;&#20107;&#24773;&#65292;&#23427;&#28385;&#36275;&#20102;&#31649;&#29702;&#21592;&#32039;&#23494;&#25511;&#21046;&#29256;&#26412;&#24211;&#35775;&#38382;&#30340;&#24895;&#26395;&#12290;</p><p>&#27880;&#24847;&#65292;&#36825;&#20010;&#29305;&#24615;&#36890;&#24120;&#26377;&#19968;&#20123;&#30475;&#19981;&#35265;(&#21644;&#21487;&#35265;&#30340;)&#20195;&#20215;&#12290;&#21487;&#35265;&#30340;&#65292;&#38656;&#35201;&#26356;&#22810;&#30340;&#24037;&#20316;&#26469;&#30830;&#20449;&#29992;&#25143;&#23545;&#26576;&#20010;&#36335;&#24452;&#26377;&#35835;&#20889;&#26435;&#38480;&#65307;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#65292;&#20250;&#26159;&#38750;&#24120;&#22823;&#30340;&#24615;&#33021;&#25439;&#22833;&#12290;&#19981;&#21487;&#35265;&#30340;&#65292;&#32771;&#34385;&#20320;&#21019;&#24314;&#30340;&#25991;&#21270;&#65292;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#22240;&#20026;&#29305;&#23450;&#29992;&#25143;&#19981;&#33021;&#22815;&#22312;&#29305;&#23450;&#30446;&#24405;&#25552;&#20132;&#20462;&#25913;&#65292;&#25152;&#20197;&#31038;&#20250;&#22865;&#32422;&#19981;&#24517;&#36890;&#36807;&#25216;&#26415;&#26469;&#21152;&#24378;&#12290;&#22242;&#38431;&#26377;&#26102;&#20505;&#21487;&#20197;&#33258;&#28982;&#30340;&#20114;&#30456;&#21327;&#20316;&#65307;&#19968;&#20123;&#20154;&#20250;&#36890;&#36807;&#20026;&#20182;&#20154;&#25552;&#20132;&#19981;&#33021;&#27491;&#24120;&#24037;&#20316;&#30446;&#24405;&#30340;&#20869;&#23481;&#30340;&#26041;&#27861;&#24110;&#21161;&#21035;&#20154;&#65292;&#20320;&#35774;&#32622;&#20102;&#19968;&#31181;&#19981;&#26399;&#26395;&#20132;&#27969;&#30340;&#38556;&#30861;&#12290;&#20320;&#20063;&#35201;&#24314;&#31435;&#19968;&#22871;&#39033;&#30446;&#24320;&#21457;&#12289;&#26032;&#20154;&#21152;&#20837;&#31561;&#27963;&#21160;&#30340;&#35268;&#21017;&#65292;&#36824;&#26377;&#24456;&#22810;&#39069;&#22806;&#30340;&#24037;&#20316;&#12290;</p><p>&#35760;&#20303;&#36825;&#26159;&#19968;&#20010;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#21363;&#20351;&#19968;&#20123;&#20154;&#19981;&#23567;&#24515;&#25552;&#20132;&#20102;&#19968;&#20123;&#19981;&#35813;&#25552;&#20132;&#30340;&#19996;&#35199;&#65292;&#24456;&#23481;&#26131;&#22238;&#36864;&#20462;&#25913;&#12290;&#22914;&#26524;&#19968;&#20010;&#29992;&#25143;&#25925;&#24847;&#25552;&#20132;&#21040;&#20102;&#38169;&#35823;&#30340;&#20301;&#32622;&#65292;&#36825;&#26159;&#19968;&#20010;&#31038;&#20250;&#38382;&#39064;&#65292;&#38656;&#35201;&#22312;Subversion&#20043;&#22806;&#35299;&#20915;&#12290;</p><p>So before you begin restricting users' access rights, ask
        yourself if there's a real, honest need for this, or if it's
        just something that &#8220;<span class="quote">sounds good</span>&#8221; to an
        administrator.  Decide whether it's worth sacrificing some
        server speed for, and remember that there's very little risk
        involved; it's bad to become dependent on technology as a
        crutch for social problems.
        <sup>[<a name="d0e13905" href="#ftn.d0e13905" class="footnote">46</a>]</sup>
      </p><p>As an example to ponder, consider that the Subversion
        project itself has always had a notion of who is allowed to
        commit where, but it's always been enforced socially.  This is
        a good model of community trust, especially for open source
        projects.  Of course, sometimes there <span class="emphasis"><em>are</em></span>
        truly legitimate needs for path-based access control; within
        corporations, for example, certain types of data really can be
        sensitive, and access needs to be genuinely restricted to
        small groups of people.</p></div><p>Once your server knows where to find your rules file, it's
      time to define the rules.</p><p>The syntax of the file is the same familiar one used
      by <span class="command"><strong>svnserve.conf</strong></span> and the runtime
      configuration files.  Lines that start with a hash
      (<code class="literal">#</code>) are ignored.  In its simplest form, each
      section names a repository and path within it, as well as the
      authenticated usernames are the option names within each
      section.  The value of each option describes the user's level of
      access to the repository path: either
      <code class="literal">r</code> (read-only) or <code class="literal">rw</code>
      (read-write).  If the user is not mentioned at all, no access is
      allowed.</p><p>To be more specific: the value of the section names are
      either of the form <code class="literal">[repos-name:path]</code> or the
      form <code class="literal">[path]</code>.  If you're using the
      <code class="literal">SVNParentPath</code> directive, then it's important
      to specify the repository names in your sections.  If you omit
      them, then a section such as
      <code class="literal">[/some/dir]</code> will match the path
      <code class="filename">/some/dir</code> in <span class="emphasis"><em>every</em></span>
      repository.  If you're using the <code class="literal">SVNPath</code>
      directive, however, then it's fine to only define paths in your
      sections&#8212;after all, there's only one repository.</p><pre class="screen">
[calc:/branches/calc/bug-142]
harry = rw
sally = r
</pre><p>&#22312;&#31532;&#19968;&#20010;&#20363;&#23376;&#37324;&#65292;&#29992;&#25143;<code class="literal">harry</code>&#23545;<code class="literal">calc</code>&#29256;&#26412;&#24211;&#20013;<code class="filename">/branches/calc/bug-142</code>&#20855;&#22791;&#23436;&#20840;&#30340;&#35835;&#20889;&#26435;&#21033;&#65292;&#20294;&#26159;&#29992;&#25143;<code class="literal">sally</code>&#21482;&#26377;&#35835;&#26435;&#21033;&#65292;&#20219;&#20309;&#20854;&#20182;&#29992;&#25143;&#31105;&#27490;&#35775;&#38382;&#36825;&#20010;&#30446;&#24405;&#12290;</p><p>&#24403;&#28982;&#65292;&#35775;&#38382;&#25511;&#21046;&#26159;&#29238;&#30446;&#24405;&#20256;&#36882;&#32473;&#23376;&#30446;&#24405;&#30340;&#65292;&#36825;&#24847;&#21619;&#30528;&#25105;&#20204;&#21487;&#20197;&#20026;Sally&#25351;&#23450;&#19968;&#20010;&#23376;&#30446;&#24405;&#30340;&#19981;&#21516;&#35775;&#38382;&#31574;&#30053;&#65306;</p><pre class="screen">
[calc:/branches/calc/bug-142]
harry = rw
sally = r

# give sally write access only to the 'testing' subdir
[calc:/branches/calc/bug-142/testing]
sally = rw
</pre><p>&#29616;&#22312;Sally&#21487;&#20197;&#35835;&#21462;&#20998;&#25903;&#30340;<code class="filename">testing</code>&#23376;&#30446;&#24405;&#65292;&#20294;&#23545;&#20854;&#20182;&#37096;&#20998;&#36824;&#26159;&#21482;&#21487;&#20197;&#35835;&#65292;&#21516;&#26102;&#65292;Harry&#23545;&#25972;&#20010;&#20998;&#25903;&#36824;&#32487;&#32493;&#26377;&#23436;&#20840;&#30340;&#35835;&#20889;&#26435;&#38480;&#12290;</p><p>&#20063;&#21487;&#20197;&#36890;&#36807;&#32487;&#25215;&#35268;&#21017;&#26126;&#30830;&#30340;&#30340;&#25298;&#32477;&#26576;&#20154;&#30340;&#35775;&#38382;&#65292;&#21482;&#38656;&#35201;&#35774;&#32622;&#29992;&#25143;&#21517;&#21442;&#25968;&#20026;&#31354;&#65306;</p><pre class="screen">
[calc:/branches/calc/bug-142]
harry = rw
sally = r

[calc:/branches/calc/bug-142/secret]
harry =
</pre><p>&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;Harry&#23545;<code class="filename">bug-142</code>&#30446;&#24405;&#26641;&#26377;&#23436;&#20840;&#30340;&#35835;&#20889;&#26435;&#38480;&#65292;&#20294;&#26159;&#23545;&#20854;&#20013;&#30340;<code class="filename">secret</code>&#23376;&#30446;&#24405;&#27809;&#26377;&#20219;&#20309;&#35775;&#38382;&#26435;&#21033;&#12290;</p><div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3><p>&#38656;&#35201;&#35760;&#20303;&#30340;&#26159;&#26368;&#35814;&#32454;&#30340;&#30340;&#36335;&#24452;&#20250;&#34987;&#21305;&#37197;&#65292;&#26381;&#21153;&#22120;&#39318;&#20808;&#25214;&#21040;&#21305;&#37197;&#33258;&#24049;&#30340;&#30446;&#24405;&#65292;&#28982;&#21518;&#29238;&#30446;&#24405;&#65292;&#28982;&#21518;&#29238;&#30446;&#24405;&#30340;&#29238;&#30446;&#24405;&#65292;&#23601;&#36825;&#26679;&#32487;&#32493;&#19979;&#21435;&#65292;&#26356;&#20855;&#20307;&#30340;&#36335;&#24452;&#25511;&#21046;&#20250;&#35206;&#30422;&#25152;&#26377;&#32487;&#25215;&#19979;&#26469;&#30340;&#35775;&#38382;&#25511;&#21046;&#12290;</p></div><p>&#32570;&#30465;&#24773;&#20917;&#19979;&#65292;&#27809;&#26377;&#20154;&#23545;&#29256;&#26412;&#24211;&#26377;&#20219;&#20309;&#35775;&#38382;&#65292;&#36825;&#24847;&#21619;&#30528;&#22914;&#26524;&#20320;&#24050;&#32463;&#20174;&#19968;&#20010;&#31354;&#25991;&#20214;&#24320;&#22987;&#65292;&#20320;&#20250;&#24076;&#26395;&#32473;&#25152;&#26377;&#29992;&#25143;&#23545;&#29256;&#26412;&#24211;&#26681;&#30446;&#24405;&#20855;&#22791;&#35835;&#26435;&#38480;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#26143;&#21495;(<code class="literal">*</code>)&#23454;&#29616;&#65292;&#29992;&#26469;&#20195;&#34920;&#8220;<span class="quote">&#25152;&#26377;&#29992;&#25143;</span>&#8221;&#65306;</p><pre class="screen">
[/]
* = r
</pre><p>This is a common setup; notice that there's no repository
      name mentioned in the section name.  This makes all repositories
      world-readable to all users. Once all users have read-access to
      the repositories, you can give explicit
      <code class="literal">rw</code> permission to certain users on specific
      subdirectories within specific repositories.</p><p>The asterisk variable (<code class="literal">*</code>) is also worth
      special mention because it's the
      <span class="emphasis"><em>only</em></span> pattern that matches an anonymous
      user.  If you've configured your server block to allow a mixture
      of anonymous and authenticated access, all users start out
      accessing anonymously.  The server looks for a
      <code class="literal">*</code> value defined for the path being accessed;
      if it can't find one, then it demands real authentication from
      the client.</p><p>&#35775;&#38382;&#25991;&#20214;&#20063;&#20801;&#35768;&#20320;&#23450;&#20041;&#19968;&#32452;&#30340;&#29992;&#25143;&#65292;&#24456;&#20687;Unix&#30340;<code class="filename">/etc/group</code>&#25991;&#20214;&#65306;</p><pre class="screen">
[groups]
calc-developers = harry, sally, joe
paint-developers = frank, sally, jane
everyone = harry, sally, joe, frank, sally, jane
</pre><p>&#32452;&#21487;&#20197;&#34987;&#36171;&#20104;&#36890;&#29992;&#25143;&#19968;&#26679;&#30340;&#35775;&#38382;&#26435;&#38480;&#65292;&#20351;&#29992;&#8220;<span class="quote">at</span>&#8221;(<code class="literal">@</code>)&#21069;&#32512;&#26469;&#21152;&#20197;&#21306;&#21035;&#65306;</p><pre class="screen">
[calc:/projects/calc]
@calc-developers = rw

[paint:/projects/paint]
jane = r
@paint-developers = rw
</pre><p>Another important fact is that
    the <span class="emphasis"><em>first</em></span> matching rule is the one which gets
    applied to a user.  In the prior example, even though Jane is a
    member of the <code class="literal">paint-developers</code> group (which has
    read-write access), the <code class="literal">jane = r</code> rule will be
    discovered and matched before the group rule, thus denying Jane
    write access.</p><p>&#32452;&#20013;&#20063;&#21487;&#20197;&#23450;&#20041;&#20026;&#21253;&#21547;&#20854;&#23427;&#30340;&#32452;&#65306;</p><pre class="screen">
[groups]
calc-developers = harry, sally, joe
paint-developers = frank, sally, jane
everyone = @calc-developers, @paint-developers
</pre><div class="sidebar"><p class="title"><b>&#37096;&#20998;&#21487;&#35835;&#24615;&#21644;&#26816;&#20986;</b></p><p>If you're using Apache as your Subversion server and have
      made certain subdirectories of your repository unreadable to
      certain users, then you need to be aware of a possible
      nonoptimal behavior with <span class="command"><strong>svn checkout</strong></span>.</p><p>When the client requests a checkout or update over HTTP, it
      makes a single server request and receives a single (often
      large) server response.  When the server receives the request,
      that is the <span class="emphasis"><em>only</em></span> opportunity Apache has to
      demand user authentication.  This has some odd side effects.
      For example, if a certain subdirectory of the repository is only
      readable by user Sally, and user Harry checks out a parent
      directory, his client will respond to the initial authentication
      challenge as Harry.  As the server generates the large response,
      there's no way it can re-send an authentication challenge when
      it reaches the special subdirectory; thus the subdirectory is
      skipped altogether, rather than asking the user to
      re-authenticate as Sally at the right moment.  In a similar way,
      if the root of the repository is anonymously world-readable,
      then the entire checkout will be done without
      authentication&#8212;again, skipping the unreadable directory,
      rather than asking for authentication partway through.</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d0e13905" href="#d0e13905" class="para">46</a>] </sup>&#26412;&#20070;&#30340;&#20849;&#21516;&#20027;&#39064;&#65281;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.serverconfig.httpd.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.serverconfig.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.serverconfig.multimethod.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">httpd, the Apache HTTP Server&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;</td></tr></table></div></body></html>