<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#20379;&#26041;&#20998;&#25903;</title><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="svn.branchmerge.commonpatterns.html" title="&#24120;&#29992;&#20998;&#25903;&#27169;&#24335;"><link rel="next" href="svn.branchmerge.summary.html" title="&#24635;&#32467;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20379;&#26041;&#20998;&#25903;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.commonpatterns.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.summary.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.vendorbr"></a>&#20379;&#26041;&#20998;&#25903;</h2></div></div></div>
      
      <p>&#24403;&#24320;&#21457;&#36719;&#20214;&#26102;&#26377;&#36825;&#26679;&#19968;&#20010;&#24773;&#20917;&#65292;&#20320;&#29256;&#26412;&#25511;&#21046;&#30340;&#25968;&#25454;&#21487;&#33021;&#20851;&#32852;&#20110;&#25110;&#32773;&#26159;&#20381;&#36182;&#20110;&#20854;&#20182;&#20154;&#30340;&#25968;&#25454;&#65292;&#36890;&#24120;&#26469;&#35762;&#65292;&#20320;&#30340;&#39033;&#30446;&#30340;&#38656;&#35201;&#20250;&#35201;&#27714;&#20320;&#33258;&#24049;&#30340;&#39033;&#30446;&#23545;&#22806;&#37096;&#23454;&#20307;&#25552;&#20379;&#30340;&#25968;&#25454;&#20445;&#25345;&#23613;&#21487;&#33021;&#26368;&#26032;&#30340;&#29256;&#26412;&#65292;&#21516;&#26102;&#19981;&#20250;&#29306;&#29298;&#31283;&#23450;&#24615;&#65292;&#36825;&#31181;&#24773;&#20917;&#24635;&#26159;&#20250;&#20986;&#29616;&#8212;&#21482;&#35201;&#26576;&#20010;&#23567;&#32452;&#30340;&#20449;&#24687;&#23545;&#21478;&#19968;&#20010;&#23567;&#32452;&#30340;&#20449;&#24687;&#26377;&#30452;&#25509;&#30340;&#24433;&#21709;&#12290;</p>
      <p>For example, software developers might be working on an
      application that makes use of a third-party library.  Subversion
      has just such a relationship with the Apache Portable Runtime (APR)
      library (see <a class="xref" href="svn.developer.usingapi.html#svn.developer.usingapi.apr" title="Apache &#21487;&#31227;&#26893;&#36816;&#34892;&#24211;">&#8220;Apache &#21487;&#31227;&#26893;&#36816;&#34892;&#24211;&#8221;&#19968;&#33410;</a>).
      The Subversion source code depends on the APR library for all
      its portability needs.  In earlier stages of Subversion's
      development, the project closely tracked APR's changing API,
      always sticking to the &#8220;<span class="quote">bleeding edge</span>&#8221; of the
      library's code churn.  Now that both APR and Subversion have
      matured, Subversion attempts to synchronize with APR's library
      API only at well-tested, stable release points.</p>
      <p>Now, if your project depends on someone else's information,
      you could attempt to synchronize that information with your own
      in several ways.  Most painfully, you could issue oral or
      written instructions to all the contributors of your project,
      telling them to make sure they have the specific versions
      of that third-party information that your project needs.  If the
      third-party information is maintained in a Subversion
      repository, you could also use Subversion's externals
      definitions to effectively &#8220;<span class="quote">pin down</span>&#8221; specific
      versions of that information to some location in your own
      working copy directory (see
      <a class="xref" href="svn.advanced.externals.html" title="&#22806;&#37096;&#23450;&#20041;">&#8220;&#22806;&#37096;&#23450;&#20041;&#8221;&#19968;&#33410;</a>).</p>
      <p>&#20294;&#26159;&#26377;&#26102;&#20505;&#65292;&#20320;&#24076;&#26395;&#22312;&#20320;&#33258;&#24049;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#32500;&#25252;&#19968;&#20010;&#38024;&#23545;&#31532;&#19977;&#26041;&#25968;&#25454;&#30340;&#33258;&#23450;&#20041;&#20462;&#25913;&#65292;&#22238;&#21040;&#36719;&#20214;&#24320;&#21457;&#30340;&#20363;&#23376;&#65292;&#31243;&#24207;&#21592;&#20026;&#20102;&#20182;&#20204;&#33258;&#24049;&#30340;&#30446;&#30340;&#20250;&#38656;&#35201;&#20462;&#25913;&#31532;&#19977;&#26041;&#24211;&#65292;&#36825;&#20123;&#20462;&#25913;&#20250;&#21253;&#25324;&#26032;&#30340;&#21151;&#33021;&#21644;bug&#20462;&#27491;&#65292;&#22312;&#25104;&#20026;&#31532;&#19977;&#26041;&#24037;&#20855;&#23448;&#26041;&#21457;&#24067;&#20043;&#21069;&#65292;&#21482;&#26159;&#20869;&#37096;&#32500;&#25252;&#12290;&#25110;&#32773;&#36825;&#20123;&#20462;&#25913;&#27704;&#36828;&#19981;&#20250;&#20256;&#32473;&#24211;&#30340;&#32500;&#25252;&#32773;&#65292;&#21482;&#26159;&#20316;&#20026;&#28385;&#36275;&#36719;&#20214;&#24320;&#21457;&#38656;&#35201;&#30340;&#21333;&#29420;&#30340;&#33258;&#23450;&#20041;&#20462;&#25913;&#23384;&#22312;&#12290;</p>
      <p>Now you face an interesting situation.  Your project could
      house its custom modifications to the third-party data in some
      disjointed fashion, such as using patch files or full-fledged
      alternative versions of files and directories.  But these quickly
      become maintenance headaches, requiring some mechanism by which
      to apply your custom changes to the third-party code and
      necessitating regeneration of those changes with each successive
      version of the third-party code that you track.</p>
      <p>&#36825;&#20010;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;&#20351;&#29992;<em class="firstterm">&#20379;&#26041;&#20998;&#25903;</em>&#65292;&#19968;&#20010;&#20379;&#26041;&#20998;&#25903;&#26159;&#19968;&#20010;&#30446;&#24405;&#26641;&#20445;&#23384;&#20102;&#31532;&#19977;&#26041;&#23454;&#20307;&#25110;&#20379;&#24212;&#26041;&#30340;&#20449;&#24687;&#65292;&#27599;&#19968;&#20010;&#20379;&#24212;&#26041;&#25968;&#25454;&#30340;&#29256;&#26412;&#21560;&#25910;&#21040;&#20320;&#30340;&#39033;&#30446;&#21483;&#20570;<em class="firstterm">&#20379;&#26041;drop</em>&#12290;</p>
      <p>Vendor branches provide two benefits.  First, by storing
      the currently supported vendor drop in your own version control
      system, you ensure that the members of your project never need to question
      whether they have the right version of the vendor's data.  They
      simply receive that correct version as part of their regular
      working copy updates.  Second, because the data lives in your
      own Subversion repository, you can store your custom changes to
      it in-place&#8212;you have no more need of an automated (or
      worse, manual) method for swapping in your customizations.</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.vendorbr.general"></a>&#24120;&#35268;&#30340;&#20379;&#26041;&#20998;&#25903;&#31649;&#29702;&#36807;&#31243;</h3></div></div></div>
        
        <p>Managing vendor branches generally works like this: first,
        you create a top-level directory (such as
        <code class="filename">/vendor</code>) to hold the vendor branches.
        Then you import the third-party code into a subdirectory of
        that top-level directory.  You then copy that subdirectory
        into your main development branch (e.g.,
        <code class="filename">/trunk</code>) at the appropriate location.  You
        always make your local changes in the main development branch.
        With each new release of the code you are tracking, you bring
        it into the vendor branch and merge the changes into
        <code class="filename">/trunk</code>, resolving whatever conflicts
        occur between your local changes and the upstream
        changes.</p>
        <p>&#20063;&#35768;&#19968;&#20010;&#20363;&#23376;&#26377;&#21161;&#20110;&#25105;&#20204;&#38416;&#36848;&#36825;&#20010;&#31639;&#27861;&#65292;&#25105;&#20204;&#20250;&#20351;&#29992;&#36825;&#26679;&#19968;&#20010;&#22330;&#26223;&#65292;&#25105;&#20204;&#30340;&#24320;&#21457;&#22242;&#38431;&#27491;&#22312;&#24320;&#21457;&#19968;&#20010;&#35745;&#31639;&#22120;&#31243;&#24207;&#65292;&#19982;&#19968;&#20010;&#31532;&#19977;&#26041;&#30340;&#22797;&#26434;&#25968;&#23383;&#36816;&#31639;&#24211;libcomplex&#20851;&#32852;&#12290;&#25105;&#20204;&#20174;&#20379;&#26041;&#20998;&#25903;&#30340;&#21021;&#22987;&#21019;&#24314;&#24320;&#22987;&#65292;&#24182;&#19988;&#23548;&#20837;&#20379;&#26041;drop&#65292;&#25105;&#20204;&#20250;&#25226;&#27599;&#26666;&#20998;&#25903;&#30446;&#24405;&#21483;&#20570;<code class="filename">libcomplex</code>&#65292;&#25105;&#20204;&#30340;&#20195;&#30721;drop&#20250;&#36827;&#20837;&#21040;&#20379;&#26041;&#20998;&#25903;&#30340;&#23376;&#30446;&#24405;<code class="filename">current</code>&#65292;&#24182;&#19988;&#22240;&#20026;<span class="command"><strong>svn import</strong></span>&#21019;&#24314;&#25152;&#26377;&#30340;&#38656;&#35201;&#30340;&#20013;&#38388;&#29238;&#30446;&#24405;&#65292;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#19968;&#20010;&#21629;&#20196;&#23436;&#25104;&#36825;&#19968;&#27493;&#65306;</p>
        <pre class="screen">
$ svn import /path/to/libcomplex-1.0 \
             http://svn.example.com/repos/vendor/libcomplex/current \
             -m 'importing initial 1.0 vendor drop'
&#8230;
</pre>
        <p>&#25105;&#20204;&#29616;&#22312;&#22312;<code class="filename">/vendor/libcomplex/current</code>&#26377;&#20102;libcomplex&#24403;&#21069;&#29256;&#26412;&#30340;&#20195;&#30721;&#65292;&#29616;&#22312;&#25105;&#20204;&#20026;&#37027;&#20010;&#29256;&#26412;&#20316;&#26631;&#31614;(&#35265;<a class="xref" href="svn.branchmerge.tags.html" title="&#26631;&#31614;">&#8220;&#26631;&#31614;&#8221;&#19968;&#33410;</a>)&#65292;&#28982;&#21518;&#25335;&#36125;&#23427;&#21040;&#20027;&#35201;&#24320;&#21457;&#20998;&#25903;&#65292;&#25105;&#20204;&#30340;&#25335;&#36125;&#20250;&#22312;<code class="filename">calc</code>&#39033;&#30446;&#30446;&#24405;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#30446;&#24405;<code class="filename">libcomplex</code>&#65292;&#23427;&#26159;&#36825;&#20010;&#25105;&#20204;&#23558;&#35201;&#36827;&#34892;&#33258;&#23450;&#20041;&#30340;&#20379;&#26041;&#25968;&#25454;&#30340;&#25335;&#36125;&#29256;&#26412;&#12290;</p>
        <pre class="screen">
$ svn copy http://svn.example.com/repos/vendor/libcomplex/current  \
           http://svn.example.com/repos/vendor/libcomplex/1.0      \
           -m 'tagging libcomplex-1.0'
&#8230;
$ svn copy http://svn.example.com/repos/vendor/libcomplex/1.0  \
           http://svn.example.com/repos/calc/libcomplex        \
           -m 'bringing libcomplex-1.0 into the main branch'
&#8230;
</pre>
        <p>&#25105;&#20204;&#21462;&#20986;&#25105;&#20204;&#39033;&#30446;&#30340;&#20027;&#20998;&#25903;&#8212;&#29616;&#22312;&#21253;&#25324;&#20102;&#31532;&#19968;&#20010;&#20379;&#26041;&#37322;&#25918;&#30340;&#25335;&#36125;&#8212;&#25105;&#20204;&#24320;&#22987;&#33258;&#23450;&#20041;libcomplex&#30340;&#20195;&#30721;&#65292;&#22312;&#25105;&#20204;&#30693;&#36947;&#20043;&#21069;&#65292;&#25105;&#20204;&#30340;libcomplex&#20462;&#25913;&#29256;&#26412;&#26159;&#24050;&#32463;&#19982;&#25105;&#20204;&#30340;&#35745;&#31639;&#22120;&#31243;&#24207;&#23436;&#20840;&#38598;&#25104;&#20102;&#12290; <sup>[<a name="d4e4093" href="#ftn.d4e4093" class="footnote">24</a>]</sup></p>
        <p>&#20960;&#21608;&#20043;&#21518;&#65292;libcomplex&#24471;&#24320;&#21457;&#32773;&#21457;&#24067;&#20102;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#8212;&#29256;&#26412;1.1&#8212;&#21253;&#25324;&#20102;&#25105;&#20204;&#24456;&#38656;&#35201;&#30340;&#19968;&#20123;&#29305;&#24615;&#21644;&#21151;&#33021;&#12290;&#25105;&#20204;&#24456;&#24076;&#26395;&#21319;&#32423;&#21040;&#36825;&#20010;&#29256;&#26412;&#65292;&#20294;&#19981;&#24076;&#26395;&#22833;&#21435;&#22312;&#24403;&#21069;&#29256;&#26412;&#25152;&#20316;&#30340;&#20462;&#25913;&#12290;&#25105;&#20204;&#26412;&#36136;&#19978;&#20250;&#24076;&#26395;&#25226;&#25105;&#20204;&#24403;&#21069;&#22522;&#32447;&#29256;&#26412;&#26159;&#30340;libcomplex1.0&#30340;&#25335;&#36125;&#26367;&#25442;&#20026;libcomplex 1.1&#65292;&#28982;&#21518;&#25226;&#21069;&#38754;&#33258;&#23450;&#20041;&#30340;&#20462;&#25913;&#24212;&#29992;&#21040;&#26032;&#30340;&#29256;&#26412;&#12290;&#20294;&#26159;&#23454;&#38469;&#19978;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#30456;&#21453;&#30340;&#26041;&#21521;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#24212;&#29992;libcomplex&#20174;&#29256;&#26412;1.0&#21040;1.1&#30340;&#20462;&#25913;&#21040;&#25105;&#20204;&#20462;&#25913;&#30340;&#25335;&#36125;&#12290;</p>
        <p>&#20026;&#20102;&#25191;&#34892;&#36825;&#20010;&#21319;&#32423;&#65292;&#25105;&#20204;&#21462;&#20986;&#19968;&#20010;&#25105;&#20204;&#20379;&#26041;&#20998;&#25903;&#30340;&#25335;&#36125;&#65292;&#26367;&#25442;<code class="filename">current</code>&#30446;&#24405;&#20026;&#26032;&#30340;libcomplex 1.1&#30340;&#20195;&#30721;&#65292;&#25105;&#20204;&#21482;&#26159;&#25335;&#36125;&#26032;&#25991;&#20214;&#21040;&#23384;&#22312;&#30340;&#25991;&#20214;&#19978;&#65292;&#25110;&#32773;&#26159;&#35299;&#21387;&#32553;libcomplex 1.1&#30340;&#25171;&#21253;&#25991;&#20214;&#21040;&#25105;&#20204;&#23384;&#22312;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#12290;&#27492;&#26102;&#30340;&#30446;&#26631;&#26159;&#35753;&#25105;&#20204;&#30340;<code class="filename">current</code>&#30446;&#24405;&#21482;&#20445;&#30041;libcomplex 1.1&#30340;&#20195;&#30721;&#65292;&#24182;&#19988;&#20445;&#35777;&#25152;&#26377;&#30340;&#20195;&#30721;&#22312;&#29256;&#26412;&#25511;&#21046;&#20043;&#19979;&#65292;&#21734;&#65292;&#25105;&#20204;&#24076;&#26395;&#22312;&#26368;&#23567;&#30340;&#29256;&#26412;&#25511;&#21046;&#21382;&#21490;&#25200;&#21160;&#19979;&#23436;&#25104;&#36825;&#20214;&#20107;&#12290;</p>
        <p>&#23436;&#25104;&#20102;&#36825;&#20010;&#20174;1.0&#21040;1.1&#30340;&#20195;&#30721;&#26367;&#25442;&#65292;<span class="command"><strong>svn status</strong></span>&#20250;&#26174;&#31034;&#25991;&#20214;&#30340;&#26412;&#22320;&#20462;&#25913;&#65292;&#25110;&#35768;&#20063;&#21253;&#25324;&#20102;&#19968;&#20123;&#26410;&#29256;&#26412;&#21270;&#25110;&#32773;&#20002;&#22833;&#30340;&#25991;&#20214;&#65292;&#22914;&#26524;&#25105;&#20204;&#20570;&#20102;&#25105;&#20204;&#24212;&#35813;&#20570;&#30340;&#20107;&#24773;&#65292;&#26410;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#24212;&#35813;&#37117;&#26159;libcomplex&#22312;1.1&#26032;&#24341;&#20837;&#30340;&#25991;&#20214;&#8212;&#25105;&#20204;&#36816;&#34892;<span class="command"><strong>svn add</strong></span>&#26469;&#23558;&#23427;&#20204;&#21152;&#20837;&#21040;&#29256;&#26412;&#25511;&#21046;&#12290;&#20002;&#22833;&#30340;&#25991;&#20214;&#26159;&#23384;&#22312;&#20110;1.1&#20294;&#26159;&#19981;&#26159;&#22312;1.1&#65292;&#22312;&#36825;&#20123;&#36335;&#24452;&#25105;&#20204;&#36816;&#34892;<span class="command"><strong>svn delete</strong></span>&#12290;&#26368;&#32456;&#19968;&#26086;&#25105;&#20204;&#30340;<code class="filename">&#24403;&#21069;&#30340;</code>&#24037;&#20316;&#25335;&#36125;&#21482;&#26159;&#21253;&#25324;&#20102;libcomplex1.1&#30340;&#20195;&#30721;&#65292;&#25105;&#20204;&#21487;&#20197;&#25552;&#20132;&#36825;&#20123;&#25913;&#21464;&#30446;&#24405;&#21644;&#25991;&#20214;&#30340;&#20462;&#25913;&#12290;</p>
        <p>&#25105;&#20204;&#30340;<code class="filename">&#24403;&#21069;</code>&#20998;&#25903;&#29616;&#22312;&#20445;&#23384;&#20102;&#26032;&#30340;&#20379;&#26041;drop&#65292;&#25105;&#20204;&#20026;&#36825;&#20010;&#26032;&#30340;&#29256;&#26412;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#26631;&#31614;1.1(&#23601;&#20687;&#25105;&#20204;&#20026;1.0&#29256;&#26412;drop&#25152;&#20316;&#30340;)&#65292;&#28982;&#21518;&#21512;&#24182;&#36825;&#20174;&#20010;&#26631;&#31614;&#21069;&#19968;&#20010;&#29256;&#26412;&#30340;&#21306;&#21035;&#21040;&#20027;&#35201;&#24320;&#21457;&#20998;&#25903;&#12290;</p>
        <pre class="screen">
$ cd working-copies/calc
$ svn merge http://svn.example.com/repos/vendor/libcomplex/1.0      \
            http://svn.example.com/repos/vendor/libcomplex/current  \
            libcomplex
&#8230; # resolve all the conflicts between their changes and our changes
$ svn commit -m 'merging libcomplex-1.1 into the main branch'
&#8230;
</pre>
        <p>&#22312;&#36825;&#20010;&#29712;&#30862;&#30340;&#29992;&#20363;&#37324;&#65292;&#31532;&#19977;&#26041;&#24037;&#20855;&#30340;&#26032;&#29256;&#26412;&#20250;&#20174;&#19968;&#20010;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#23601;&#20687;&#21069;&#19968;&#20010;&#29256;&#26412;&#12290;&#27809;&#26377;&#20219;&#20309;libcomplex&#28304;&#25991;&#20214;&#20250;&#34987;&#21024;&#38500;&#12289;&#34987;&#25913;&#21517;&#25110;&#26159;&#31227;&#21160;&#21040;&#21035;&#30340;&#20301;&#32622;&#8212;&#26032;&#30340;&#29256;&#26412;&#21482;&#20250;&#20445;&#23384;&#38024;&#23545;&#19978;&#19968;&#20010;&#29256;&#26412;&#30340;&#25991;&#26412;&#20462;&#25913;&#12290;&#22312;&#23436;&#32654;&#19990;&#30028;&#65292;&#25105;&#20204;&#23545;&#21602;&#20462;&#25913;&#20250;&#24178;&#20928;&#24471;&#24212;&#29992;&#21040;&#24211;&#30340;&#26032;&#29256;&#26412;&#65292;&#19981;&#20250;&#20135;&#29983;&#20219;&#20309;&#24182;&#21457;&#21644;&#20914;&#31361;&#12290;</p>
        <p>But things aren't always that simple, and in fact it is
        quite common for source files to get moved around between
        releases of software.  This complicates the process of
        ensuring that our modifications are still valid for the new
        version of code, and things can quickly degrade into a
        situation where we have to manually re-create our
        customizations in the new version.  Once Subversion knows
        about the history of a given source file&#8212;including all
        its previous locations&#8212;the process of merging in the new
        version of the library is pretty simple.  But we are
        responsible for telling Subversion how the source file layout
        changed from vendor drop to vendor drop.</p>
      </div>
      
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.vendorbr.svn_load_dirs"></a>svn_load_dirs.pl</h3></div></div></div>
        
        <p>Vendor drops that contain more than a few deletes,
        additions, and moves complicate the process of upgrading to
        each successive version of the third-party data.  So
        Subversion supplies the <span class="command"><strong>svn_load_dirs.pl</strong></span>
        script to assist with this process.  This script automates the
        importing steps we mentioned in the general vendor branch
        management procedure to make sure mistakes are minimized.
        You will still be responsible for using the merge commands to
        merge the new versions of the third-party data into your main
        development branch, but <span class="command"><strong>svn_load_dirs.pl</strong></span>
        can help you more quickly and easily arrive at that
        stage.</p>
        <p>&#19968;&#21477;&#35805;&#65292;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#26159;&#19968;&#20010;&#22686;&#24378;&#30340;<span class="command"><strong>svn import</strong></span>&#65292;&#20855;&#22791;&#20102;&#35768;&#22810;&#37325;&#35201;&#30340;&#29305;&#24615;&#65306;</p>
        <div class="itemizedlist"><ul type="disc"><li>
            <p>&#23427;&#21487;&#20197;&#22312;&#20219;&#20309;&#26377;&#19968;&#20010;&#23384;&#22312;&#30340;&#29256;&#26412;&#24211;&#30446;&#24405;&#19982;&#19968;&#20010;&#22806;&#37096;&#30340;&#30446;&#24405;&#21305;&#37197;&#26102;&#25191;&#34892;&#65292;&#20250;&#25191;&#34892;&#25152;&#26377;&#24517;&#35201;&#30340;&#28155;&#21152;&#21644;&#21024;&#38500;&#24182;&#19988;&#21487;&#20197;&#36873;&#21017;&#25191;&#34892;&#31227;&#21160;&#12290;</p>
          </li><li>
            <p>&#23427;&#21487;&#20197;&#29992;&#26469;&#25805;&#20316;&#19968;&#31995;&#21015;&#22797;&#26434;&#30340;&#25805;&#20316;&#65292;&#22914;&#37027;&#20123;&#38656;&#35201;&#19968;&#20010;&#20013;&#38388;&#23186;&#20171;&#30340;&#25552;&#20132;&#8212;&#22914;&#22312;&#25805;&#20316;&#20043;&#21069;&#37325;&#21629;&#21517;&#19968;&#20010;&#25991;&#20214;&#25110;&#32773;&#30446;&#24405;&#20004;&#27425;&#12290;</p>
          </li><li>
            <p>&#23427;&#21487;&#20197;&#38543;&#24847;&#30340;&#20026;&#26032;&#23548;&#20837;&#30446;&#24405;&#25171;&#19978;&#26631;&#31614;&#12290;</p>
          </li><li>
            <p>&#23427;&#21487;&#20197;&#38543;&#24847;&#20026;&#31526;&#21512;&#27491;&#21017;&#34920;&#36798;&#24335;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#28155;&#21152;&#20219;&#24847;&#30340;&#23646;&#24615;&#12290;</p>
          </li></ul></div>
        <p><span class="command"><strong>svn_load_dirs.pl</strong></span> takes three mandatory
        arguments.  The first argument is the URL to the base
        Subversion directory to work in.  This argument is followed by
        the URL&#8212;relative to the first argument&#8212;into which the
        current vendor drop will be imported.  Finally, the third
        argument is the local directory to import.  Using our previous
        example, a typical run of <span class="command"><strong>svn_load_dirs.pl</strong></span>
        might look like this:</p>
        <pre class="screen">
$ svn_load_dirs.pl http://svn.example.com/repos/vendor/libcomplex \
                   current                                        \
                   /path/to/libcomplex-1.1
&#8230;
</pre>
        <p>&#20320;&#21487;&#20197;&#35828;&#26126;&#20320;&#20250;&#24076;&#26395;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#21516;&#26102;&#25171;&#19978;&#26631;&#31614;&#65292;&#36825;&#20351;&#29992;<code class="option">-t</code>&#21629;&#20196;&#34892;&#36873;&#39033;&#65292;&#38656;&#35201;&#25351;&#23450;&#19968;&#20010;&#26631;&#31614;&#21517;&#65292;&#36825;&#20010;&#26631;&#31614;&#26159;&#31532;&#19968;&#20010;&#21442;&#25968;&#30340;&#19968;&#20010;&#30456;&#23545;URL&#12290;</p>
        <pre class="screen">
$ svn_load_dirs.pl -t libcomplex-1.1                              \
                   http://svn.example.com/repos/vendor/libcomplex \
                   current                                        \
                   /path/to/libcomplex-1.1
&#8230;
</pre>
        <p>When you run <span class="command"><strong>svn_load_dirs.pl</strong></span>, it
        examines the contents of your existing &#8220;<span class="quote">current</span>&#8221;
        vendor drop and compares them with the proposed new vendor
        drop.  In the trivial case, no files will be in
        one version and not the other, and the script will perform the
        new import without incident.  If, however, there are
        discrepancies in the file layouts between versions,
        <span class="command"><strong>svn_load_dirs.pl</strong></span> will ask you how
        to resolve those differences.  For example, you
        will have the opportunity to tell the script that you know
        that the file <code class="filename">math.c</code> in version 1.0 of
        libcomplex was renamed to <code class="filename">arithmetic.c</code> in
        libcomplex 1.1.  Any discrepancies not explained by moves
        are treated as regular additions and deletions.</p>
        <p>The script also accepts a separate configuration file for
        setting properties on files and directories matching a regular
        expression that are <span class="emphasis"><em>added</em></span> to the
        repository.  This configuration file is specified to
        <span class="command"><strong>svn_load_dirs.pl</strong></span> using the
        <code class="option">-p</code> command-line option.  Each line of the
        configuration file is a whitespace-delimited set of two or
        four values: a Perl-style regular expression against which to match the
        added path, a control keyword (either
        <code class="literal">break</code> or <code class="literal">cont</code>), and then
        optionally a property name and value.</p>
        <pre class="screen">
\.png$              break   svn:mime-type   image/png
\.jpe?g$            break   svn:mime-type   image/jpeg
\.m3u$              cont    svn:mime-type   audio/x-mpegurl
\.m3u$              break   svn:eol-style   LF
.*                  break   svn:eol-style   native
</pre>
        <p>For each added path, the configured property changes whose
        regular expression matches the path are applied in order,
        unless the control specification is <code class="literal">break</code>
        (which means that no more property changes should be applied
        to that path).  If the control specification is
        <code class="literal">cont</code>&#8212;an abbreviation for
        <code class="literal">continue</code>&#8212;matching will continue
        with the next line of the configuration file.</p>
        <p>Any whitespace in the regular expression, property name,
        or property value must be surrounded by either single or
        double quotes.  You can escape quotes that
        are not used for wrapping whitespace by preceding them with a
        backslash (<code class="literal">\</code>) character.  The backslash
        escapes only quotes when parsing the configuration file, so do
        not protect any other characters beyond what is necessary for
        the regular expression.</p>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e4093" href="#d4e4093" class="para">24</a>] </sup>And is entirely bug-free, of course!</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.commonpatterns.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.branchmerge.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.summary.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#24120;&#29992;&#20998;&#25903;&#27169;&#24335;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#24635;&#32467;</td></tr></table></div></body></html>