<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#26412;&#22320;&#21270;</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="ch07.html" title="&#31532;&nbsp;7&nbsp;&#31456;&nbsp;&#23450;&#21046;&#20320;&#30340; Subversion &#29992;&#27861;"><link rel="prev" href="ch07.html" title="&#31532;&nbsp;7&nbsp;&#31456;&nbsp;&#23450;&#21046;&#20320;&#30340; Subversion &#29992;&#27861;"><link rel="next" href="ch07s03.html" title="&#20351;&#29992;&#22806;&#32622;&#27604;&#36739;&#24037;&#20855;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#26412;&#22320;&#21270;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch07.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;7&nbsp;&#31456;&nbsp;&#23450;&#21046;&#20320;&#30340; Subversion &#29992;&#27861;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch07s03.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.l10n"></a>&#26412;&#22320;&#21270;</h2></div></div></div><p><em class="firstterm">&#26412;&#22320;&#21270;</em>&#26159;&#35753;&#31243;&#24207;&#25353;&#29031;&#22320;&#21306;&#29305;&#23450;&#26041;&#24335;&#36816;&#34892;&#30340;&#34892;&#20026;&#65292;&#22914;&#26524;&#19968;&#20010;&#31243;&#24207;&#30340;&#26684;&#24335;&#12289;&#25968;&#23383;&#25110;&#32773;&#26159;&#26085;&#26399;&#26159;&#20320;&#30340;&#26412;&#22320;&#26041;&#24335;&#65292;&#25110;&#32773;&#26159;&#25171;&#21360;&#30340;&#20449;&#24687;&#65288;&#25110;&#32773;&#26159;&#25509;&#21463;&#30340;&#36755;&#20837;&#65289;&#26159;&#20320;&#26412;&#22320;&#30340;&#35821;&#35328;&#65292;&#36825;&#20010;&#31243;&#24207;&#34987;&#21483;&#20570;&#24050;&#32463;<em class="firstterm">&#26412;&#22320;&#21270;&#20102;</em>&#65292;&#36825;&#37096;&#20998;&#25551;&#36848;&#20102;&#38024;&#23545;&#26412;&#22320;&#21270;&#30340;Subversion&#30340;&#27493;&#39588;&#12290;</p><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.l10n.understanding"></a>&#29702;&#35299;&#22320;&#21306;</h3></div></div></div><p>&#35768;&#22810;&#29616;&#20195;&#25805;&#20316;&#31995;&#32479;&#37117;&#26377;&#19968;&#20010;&#8220;<span class="quote">&#24403;&#21069;&#22320;&#21306;</span>&#8221;&#30340;&#27010;&#24565;&#8212;&#20063;&#23601;&#26159;&#26412;&#22320;&#21270;&#20064;&#24815;&#26381;&#21153;&#30340;&#22269;&#23478;&#21644;&#22320;&#21306;&#12290;&#36825;&#20123;&#20064;&#24815;&#8212;&#36890;&#24120;&#26159;&#34987;&#19968;&#20123;&#36816;&#34892;&#37197;&#32622;&#26426;&#21046;&#36873;&#25321;&#8212;&#24433;&#21709;&#31243;&#24207;&#23637;&#29616;&#25968;&#25454;&#30340;&#26041;&#24335;&#65292;&#20063;&#26377;&#25509;&#21463;&#29992;&#25143;&#36755;&#20837;&#30340;&#26041;&#24335;&#12290;</p><p>On most Unix-like systems, you can check the values of the
        locale-related runtime configuration options by running the
        <span class="command"><strong>locale</strong></span> command:</p><pre class="screen">
$ locale
LANG=
LC_COLLATE="C"
LC_CTYPE="C"
LC_MESSAGES="C"
LC_MONETARY="C"
LC_NUMERIC="C"
LC_TIME="C"
LC_ALL="C"
</pre><p>The output is a list of locale-related environment
        variables and their current values.  In this example, the
        variables are all set to the default <code class="literal">C</code>
        locale, but users can set these variables to specific
        country/language code combinations.  For example, if one were
        to set the <code class="literal">LC_TIME</code> variable to
        <code class="literal">fr_CA</code>, then programs would know to present
        time and date information formatted according a
        French-speaking Canadian's expectations.  And if one were to
        set the <code class="literal">LC_MESSAGES</code> variable to
        <code class="literal">zh_TW</code>, then programs would know to present
        human-readable messages in Traditional Chinese.  Setting the
        <code class="literal">LC_ALL</code> variable has the effect of changing
        every locale variable to the same value.  The value of
        <code class="literal">LANG</code> is used as a default value for any
        locale variable that is unset.  To see the list of available
        locales on a Unix system, run the command <span class="command"><strong>locale
        -a</strong></span>.</p><p>&#22312;Windows&#65292;&#22320;&#21306;&#37197;&#32622;&#26159;&#36890;&#36807;&#8220;<span class="quote">&#22320;&#21306;&#21644;&#35821;&#35328;&#36873;&#39033;</span>&#8221;&#25511;&#21046;&#38754;&#26495;&#31649;&#29702;&#30340;&#65292;&#21487;&#20197;&#20174;&#24050;&#23384;&#22312;&#30340;&#22320;&#21306;&#26597;&#30475;&#36873;&#25321;&#65292;&#29978;&#33267;&#21487;&#20197;&#33258;&#23450;&#20041;&#65288;&#20250;&#26159;&#20010;&#24456;&#35752;&#21388;&#30340;&#22797;&#26434;&#20107;&#24773;&#65289;&#35768;&#22810;&#26174;&#31034;&#26684;&#24335;&#20064;&#24815;&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.l10n.svnuse"></a>Subversion &#23545;&#22320;&#21306;&#30340;&#25903;&#25345;</h3></div></div></div><p>The Subversion client, <span class="command"><strong>svn</strong></span>, honors the
        current locale configuration in two ways.  First, it notices
        the value of the <code class="literal">LC_MESSAGES</code> variable and
        attempts to print all messages in the specified language.  For
        example:</p><pre class="screen">
$ export LC_MESSAGES=de_DE
$ svn help cat
cat: Gibt den Inhalt der angegebenen Dateien oder URLs aus.
Aufruf: cat ZIEL[@REV]...
&#8230;
</pre><p>This behavior works identically on both Unix and Windows
        systems.  Note, though, that while your operating system might
        have support for a certain locale, the Subversion client still
        may not be able to speak the particular language.  In order to
        produce localized messages, human volunteers must provide
        translations for each language.  The translations are written
        using the GNU gettext package, which results in translation
        modules that end with the <code class="filename">.mo</code> filename
        extension.  For example, the German translation file is named
        <code class="filename">de.mo</code>.  These translation files are
        installed somewhere on your system.  On Unix, they typically
        live in <code class="filename">/usr/share/locale/</code>, while
        on Windows they're often found in the
        <code class="filename">\share\locale\</code> folder in Subversion's
        installation area.  Once installed, a module is named after
        the program it provides translations for.  For example, the
        <code class="filename">de.mo</code> file may ultimately end up
        installed as
        <code class="filename">/usr/share/locale/de/LC_MESSAGES/subversion.mo</code>.
        By browsing the installed <code class="filename">.mo</code> files, you
        can see which languages the Subversion client is able to
        speak.</p><p>The second way in which the locale is honored involves how
        <span class="command"><strong>svn</strong></span> interprets your input.  The repository
        stores all paths, filenames, and log messages in Unicode,
        encoded as UTF-8.  In that sense, the repository is
        <em class="firstterm">internationalized</em>&#8212;that is, the
        repository is ready to accept input in any human language.
        This means, however, that the Subversion client is responsible
        for sending only UTF-8 filenames and log messages into the
        repository.  In order to do this, it must convert the data
        from the native locale into UTF-8.</p><p>For example, suppose you create a file named
        <code class="filename">caff&egrave;.txt</code>, and then when committing the
        file, you write the log message as &#8220;<span class="quote">Adesso il caff&egrave; &egrave;
        pi&ugrave; forte</span>&#8221;.  Both the filename and log message contain
        non-ASCII characters, but because your locale is set to
        <code class="literal">it_IT</code>, the Subversion client knows to
        interpret them as Italian.  It uses an Italian character set
        to convert the data to UTF-8 before sending them off to the
        repository.</p><p>&#27880;&#24847;&#24403;&#29256;&#26412;&#24211;&#35201;&#27714;UTF-8&#25991;&#20214;&#21517;&#21644;&#26085;&#24535;&#20449;&#24687;&#26102;&#65292;&#23427;<span class="emphasis"><em>&#19981;&#20250;</em></span>&#27880;&#24847;&#21040;&#25991;&#20214;&#30340;&#20869;&#23481;&#65292;Subversion&#20250;&#25226;&#25991;&#20214;&#20869;&#23481;&#30475;&#20316;&#23383;&#33410;&#20018;&#65292;&#27809;&#26377;&#20219;&#20309;&#23458;&#25143;&#31471;&#21644;&#26381;&#21153;&#22120;&#20250;&#23581;&#35797;&#29702;&#35299;&#25110;&#26159;&#32534;&#30721;&#36825;&#20123;&#20869;&#23481;&#12290;</p><div class="sidebar"><p class="title"><b>&#23383;&#31526;&#38598;&#36716;&#25442;&#38169;&#35823;</b></p><p>&#24403;&#20351;&#29992;Subversion&#65292;&#20320;&#25110;&#35768;&#20250;&#30896;&#21040;&#19968;&#20010;&#23383;&#31526;&#38598;&#36716;&#21270;&#20851;&#32852;&#30340;&#38169;&#35823;&#65306;</p><pre class="screen">
svn: Can't convert string from native encoding to 'UTF-8':
&#8230;
svn: Can't convert string from 'UTF-8' to native encoding:
&#8230;
</pre><p>Errors like this typically occur when the Subversion
          client has received a UTF-8 string from the repository, but
          not all of the characters in that string can be represented
          using the encoding of the current locale.  For example, if
          your locale is <code class="literal">en_US</code> but a collaborator
          has committed a Japanese filename, you're likely to see this
          error when you receive the file during an <span class="command"><strong>svn
          update</strong></span>.</p><p>&#35299;&#20915;&#26041;&#26696;&#25110;&#32773;&#26159;&#35774;&#32622;&#20320;&#30340;&#22320;&#21306;&#20026;<span class="emphasis"><em>&#21487;&#20197;</em></span>&#34920;&#31034;&#21363;&#23558;&#21040;&#26469;&#30340;UTF-8&#25968;&#25454;&#65292;&#25110;&#32773;&#26159;&#20462;&#25913;&#29256;&#26412;&#24211;&#30340;&#25991;&#20214;&#21517;&#25110;&#20449;&#24687;&#12290;&#65288;&#19981;&#35201;&#24536;&#35760;&#21644;&#20320;&#30340;&#21512;&#20316;&#32773;&#25293;&#25293;&#25163;&#8212;&#39033;&#30446;&#24517;&#39035;&#39318;&#20808;&#20915;&#23450;&#36890;&#29992;&#30340;&#35821;&#35328;&#65292;&#36825;&#26679;&#25152;&#26377;&#30340;&#21442;&#19982;&#32773;&#20250;&#20351;&#29992;&#30456;&#21516;&#30340;&#22320;&#21306;&#35774;&#32622;&#12290;&#65289;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch07.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch07.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch07s03.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;&nbsp;7&nbsp;&#31456;&nbsp;&#23450;&#21046;&#20320;&#30340; Subversion &#29992;&#27861;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#20351;&#29992;&#22806;&#32622;&#27604;&#36739;&#24037;&#20855;</td></tr></table></div></body></html>