<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;&nbsp;8&nbsp;&#31456;&nbsp;&#23884;&#20837; Subversion</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="prev" href="ch07s03.html" title="&#20351;&#29992;&#22806;&#32622;&#27604;&#36739;&#24037;&#20855;"><link rel="next" href="ch08s02.html" title="&#36827;&#20837;&#24037;&#20316;&#25335;&#36125;&#30340;&#31649;&#29702;&#21306;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;&nbsp;8&nbsp;&#31456;&nbsp;&#23884;&#20837; Subversion</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch07s03.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch08s02.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="chapter" lang="zh-cn"><div class="titlepage"><div><div><h1 class="title"><a name="svn.developer"></a>&#23884;&#20837; Subversion</h1></div></div></div><div class="toc"><p><b>&#30446;&#24405;</b></p><dl><dt><span class="section"><a href="ch08.html#svn.developer.layerlib">&#20998;&#23618;&#30340;&#24211;&#35774;&#35745;</a></span></dt><dd><dl><dt><span class="section"><a href="ch08.html#svn.developer.layerlib.repos">&#29256;&#26412;&#24211;&#23618;</a></span></dt><dt><span class="section"><a href="ch08.html#svn.developer.layerlib.ra">&#29256;&#26412;&#24211;&#35775;&#38382;&#23618;</a></span></dt><dt><span class="section"><a href="ch08.html#svn.developer.layerlib.client">&#23458;&#25143;&#31471;&#23618;</a></span></dt></dl></dd><dt><span class="section"><a href="ch08s02.html">&#36827;&#20837;&#24037;&#20316;&#25335;&#36125;&#30340;&#31649;&#29702;&#21306;</a></span></dt><dd><dl><dt><span class="section"><a href="ch08s02.html#svn.developer.insidewc.entries">&#26465;&#30446;&#25991;&#20214;</a></span></dt><dt><span class="section"><a href="ch08s02.html#svn.developer.insidewc.base-and-props">&#21407;&#22987;&#25335;&#36125;&#21644;&#23646;&#24615;&#25991;&#20214;</a></span></dt></dl></dd><dt><span class="section"><a href="ch08s03.html">&#20351;&#29992; API</a></span></dt><dd><dl><dt><span class="section"><a href="ch08s03.html#svn.developer.usingapi.apr">Apache &#21487;&#31227;&#26893;&#36816;&#34892;&#24211;</a></span></dt><dt><span class="section"><a href="ch08s03.html#svn.developer.usingapi.urlpath">URL &#21644;&#36335;&#24452;&#38656;&#27714;</a></span></dt><dt><span class="section"><a href="ch08s03.html#svn.developer.usingapi.otherlangs">&#20351;&#29992; C &#21644; C++ &#20197;&#22806;&#30340;&#35821;&#35328;</a></span></dt><dt><span class="section"><a href="ch08s03.html#svn.developer.usingapi.codesamples">&#20195;&#30721;&#26679;&#20363;</a></span></dt></dl></dd></dl></div><p>Subversion has a modular design: it's implemented as a
    collection of libraries written in C.  Each library has a
    well-defined purpose and Application Programming Interface (API),
    and that interface is available not only for Subversion itself to
    use, but for any software that wishes to embed or otherwise
    programmatically control Subversion.  Additionally, Subversion's
    API is available not only to other C programs, but also to
    programs written in higher-level languages such as Python, Perl,
    Java, or Ruby.</p><p>&#26412;&#31456;&#26159;&#20026;&#37027;&#20123;&#24076;&#26395;&#32534;&#20889;&#20195;&#30721;&#25110;&#20854;&#20182;&#35821;&#35328;&#32465;&#23450;&#19982;Subversion&#20132;&#20114;&#30340;&#20154;&#20934;&#22791;&#30340;&#12290;&#22914;&#26524;</p><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.developer.layerlib"></a>&#20998;&#23618;&#30340;&#24211;&#35774;&#35745;</h2></div></div></div><p>Each of Subversion's core libraries can be said to exist in
      one of three main layers&#8212;the Repository Layer, the
      Repository Access (RA) Layer, or the Client Layer (see <a class="xref" href="pr02s07.html#svn.intro.architecture.dia-1" title="&#22270;&nbsp;1.&nbsp;Subversion &#30340;&#26550;&#26500;">&#22270;&nbsp;1 &#8220;Subversion &#30340;&#26550;&#26500;&#8221;</a>).  We will examine
      these layers shortly, but first, let's briefly summarize
      Subversion's various libraries.  For the sake of consistency, we
      will refer to the libraries by their extensionless Unix library
      names (libsvn_fs, libsvn_wc, mod_dav_svn, etc.).</p><div class="variablelist"><dl><dt><span class="term">libsvn_client</span></dt><dd><p>&#23458;&#25143;&#31471;&#31243;&#24207;&#30340;&#20027;&#35201;&#25509;&#21475;</p></dd><dt><span class="term">libsvn_delta</span></dt><dd><p>&#30446;&#24405;&#26641;&#21644;&#25991;&#26412;&#21306;&#21035;&#31243;&#24207;</p></dd><dt><span class="term">libsvn_diff</span></dt><dd><p>&#19978;&#19979;&#25991;&#21306;&#21035;&#21644;&#21512;&#24182;&#20363;&#31243;</p></dd><dt><span class="term">libsvn_fs</span></dt><dd><p>Subversion&#25991;&#20214;&#31995;&#32479;&#24211;&#21644;&#27169;&#22359;&#21152;&#36733;&#22120;</p></dd><dt><span class="term">libsvn_fs_base</span></dt><dd><p>Berkeley DB&#25991;&#20214;&#31995;&#32479;&#21518;&#31471;</p></dd><dt><span class="term">libsvn_fs_fs</span></dt><dd><p>&#26412;&#22320;&#25991;&#20214;&#31995;&#32479;&#65288;FSFS&#65289;&#21518;&#31471;</p></dd><dt><span class="term">libsvn_ra</span></dt><dd><p>&#29256;&#26412;&#24211;&#35775;&#38382;&#36890;&#29992;&#32452;&#20214;&#21644;&#27169;&#22359;&#35013;&#36733;&#22120;</p></dd><dt><span class="term">libsvn_ra_dav</span></dt><dd><p>WebDAV&#29256;&#26412;&#24211;&#35775;&#38382;&#27169;&#22359;</p></dd><dt><span class="term">libsvn_ra_local</span></dt><dd><p>&#26412;&#22320;&#29256;&#26412;&#24211;&#35775;&#38382;&#27169;&#22359;</p></dd><dt><span class="term">libsvn_ra_serf</span></dt><dd><p>&#21478;&#19968;&#20010;(&#23454;&#39564;&#24615;&#30340;) WebDAV &#29256;&#26412;&#24211;&#35775;&#38382;&#27169;&#22359;</p></dd><dt><span class="term">libsvn_ra_svn</span></dt><dd><p>&#19968;&#20010;&#33258;&#23450;&#20041;&#29256;&#26412;&#24211;&#35775;&#38382;&#27169;&#22359;</p></dd><dt><span class="term">libsvn_repos</span></dt><dd><p>&#29256;&#26412;&#24211;&#25509;&#21475;</p></dd><dt><span class="term">libsvn_subr</span></dt><dd><p>&#21508;&#33394;&#21508;&#26679;&#30340;&#26377;&#29992;&#30340;&#23376;&#31243;&#24207;</p></dd><dt><span class="term">libsvn_wc</span></dt><dd><p>&#24037;&#20316;&#25335;&#36125;&#31649;&#29702;&#24211;</p></dd><dt><span class="term">mod_authz_svn</span></dt><dd><p>&#20351;&#29992;WebDAV&#35775;&#38382;Subversion&#29256;&#26412;&#24211;&#30340;Apache&#25480;&#26435;&#27169;&#22359;</p></dd><dt><span class="term">mod_dav_svn</span></dt><dd><p>&#24433;&#23556;WebDAV&#25805;&#20316;&#20026;Subversion&#25805;&#20316;&#30340;Apache&#27169;&#22359;</p></dd></dl></div><p>The fact that the word &#8220;<span class="quote">miscellaneous</span>&#8221; only
      appears once in the previous list is a good sign.  The
      Subversion development team is serious about making sure that
      functionality lives in the right layer and libraries.  Perhaps
      the greatest advantage of the modular design is its lack of
      complexity from a developer's point of view.  As a developer,
      you can quickly formulate that kind of &#8220;<span class="quote">big
      picture</span>&#8221; that allows you to pinpoint the location of
      certain pieces of functionality with relative ease.</p><p>&#27169;&#22359;&#21270;&#30340;&#21478;&#19968;&#20010;&#22909;&#22788;&#26159;&#25105;&#20204;&#26377;&#33021;&#21147;&#21435;&#26500;&#36896;&#19968;&#20010;&#20840;&#26032;&#30340;&#65292;&#33021;&#22815;&#23436;&#20840;&#23454;&#29616;&#30456;&#21516;API&#21151;&#33021;&#30340;&#24211;&#65292;&#20197;&#26367;&#25442;&#25972;&#20010;&#32473;&#23450;&#30340;&#27169;&#22359;&#65292;&#32780;&#21448;&#19981;&#20250;&#24433;&#21709;&#22522;&#30784;&#20195;&#30721;&#12290;&#22312;&#26576;&#31181;&#24847;&#20041;&#19978;&#65292;Subversion&#24050;&#32463;&#36825;&#26679;&#20570;&#20102;&#12290;libsvn_ra_dav&#12289;libsvn_ra_local&#12289;libsvn_ra_serf&#21644;libsvn_ra_svn all&#37117;&#23454;&#29616;&#20102;&#30456;&#21516;&#30340;&#25509;&#21475;&#65292;&#22343;&#19982;&#29256;&#26412;&#24211;&#23618;&#36827;&#34892;&#36890;&#35759;&#8212;libsvn_ra_loca&#19982;&#29256;&#26412;&#24211;&#30452;&#25509;&#36830;&#25509;&#20854;&#20182;&#20960;&#20010;&#21017;&#36890;&#36807;&#32593;&#32476;&#12290; libsvn_fs_base&#21644;libsvn_fs_fs&#24211;&#26159;&#21478;&#22806;&#19968;&#23545;&#20197;&#19981;&#21516;&#26041;&#24335;&#23454;&#29616;&#30456;&#21516;&#21151;&#33021;&#30340;&#24211;&#8212;&#37117;&#26159;&#21487;&#20197;&#19982;libsvn_fs&#24211;&#36830;&#25509;&#12290;</p><p>The client itself also highlights the benefits of modularity
      in the Subversion design.  Subversion's libsvn_client library is
      a one-stop shop for most of the functionality necessary for
      designing a working Subversion client (see <a class="xref" href="ch08.html#svn.developer.layerlib.client" title="&#23458;&#25143;&#31471;&#23618;">&#8220;&#23458;&#25143;&#31471;&#23618;&#8221;&#19968;&#33410;</a>).  So while the
      Subversion distribution provides only the <span class="command"><strong>svn</strong></span>
      command-line client program, there are several third-party
      programs which provide various forms of graphical client UI.
      These GUIs use the same APIs that the stock command-line client
      does.  This type of modularity has played a large role in the
      proliferation of available Subversion clients and IDE
      integrations and, by extension, to the tremendous adoption rate
      of Subversion itself.</p><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.developer.layerlib.repos"></a>&#29256;&#26412;&#24211;&#23618;</h3></div></div></div><p>&#24403;&#25552;&#21040;Subversion&#29256;&#26412;&#24211;&#23618;&#26102;&#65292;&#25105;&#20204;&#36890;&#24120;&#20250;&#35752;&#35770;&#20004;&#20010;&#22522;&#26412;&#27010;&#24565;&#8212;&#29256;&#26412;&#21270;&#25991;&#20214;&#31995;&#32479;&#23454;&#29616;&#65288;&#36890;&#36807;libsvn_fs&#35775;&#38382;&#65292;libsvn_fs_base&#21644;libsvn_fs_fs&#25903;&#25345;&#65289;&#65292;&#21644;&#21253;&#35013;&#22312;&#22806;&#30340;&#65288;&#20197;libsvn_repos&#23454;&#29616;&#65289;&#29256;&#26412;&#24211;&#36923;&#36753;&#12290;&#36825;&#20123;&#24211;&#25552;&#20379;&#20102;&#29256;&#26412;&#25511;&#21046;&#25968;&#25454;&#30340;&#23384;&#20648;&#21644;&#25253;&#21578;&#26426;&#21046;&#65292;&#36825;&#20123;&#23618;&#36890;&#36807;&#29256;&#26412;&#24211;&#35775;&#38382;&#23618;&#36830;&#25509;&#23458;&#25143;&#31471;&#23618;&#65292;&#20174;Subversion&#29992;&#25143;&#30340;&#35282;&#24230;&#65292;&#36825;&#20123;&#20107;&#24773;&#22312;&#25972;&#20010;&#36807;&#31243;&#30340;&#21478;&#19968;&#31471;&#12290;</p><p>The Subversion Filesystem is not a kernel-level filesystem
        that one would install in an operating system (like the Linux
        ext2 or NTFS), but a virtual filesystem.  Rather than storing
        &#8220;<span class="quote">files</span>&#8221; and &#8220;<span class="quote">directories</span>&#8221; as real
        files and directories (as in, the kind you can navigate
        through using your favorite shell program), it uses one of two
        available abstract storage backends&#8212;either a Berkeley DB
        database environment, or a flat-file representation.  (To
        learn more about the two repository back-ends, see <a class="xref" href="ch05s02.html#svn.reposadmin.basics.backends" title="&#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;">&#8220;&#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;&#8221;&#19968;&#33410;</a>.)  There has even
        been considerable interest by the development community in
        giving future releases of Subversion the ability to use other
        back-end database systems, perhaps through a mechanism such as
        Open Database Connectivity (ODBC).  In fact, Google did
        something similar to this before launching the Google Code
        Project Hosting service:  they announced in mid-2006 that members
        of its Open Source team had written a new proprietary
        Subversion filesystem plugin which used their ultra-scalable
        Bigtable database for its storage.</p><p>libsvn_fs&#25903;&#25345;&#30340;&#25991;&#20214;&#31995;&#32479;API&#21253;&#21547;&#20102;&#25152;&#26377;&#20854;&#20182;&#25991;&#20214;&#31995;&#32479;&#30340;&#21151;&#33021;&#65306;&#20320;&#21487;&#20197;&#21019;&#24314;&#21644;&#21024;&#38500;&#25991;&#20214;&#21644;&#30446;&#24405;&#12289;&#25335;&#36125;&#21644;&#31227;&#21160;&#12289;&#20462;&#25913;&#25991;&#20214;&#20869;&#23481;&#31561;&#31561;&#12290;&#23427;&#20063;&#21253;&#21547;&#20102;&#19968;&#20123;&#19981;&#22826;&#24120;&#29992;&#30340;&#29305;&#24615;&#65292;&#22914;&#23545;&#20219;&#24847;&#25991;&#20214;&#21644;&#30446;&#24405;&#28155;&#21152;&#12289;&#20462;&#25913;&#21644;&#21024;&#38500;&#20803;&#25968;&#25454;&#65288;&#8220;<span class="quote">properties</span>&#8221;&#65289;&#30340;&#33021;&#21147;&#12290;&#27492;&#22806;&#65292;Subversion&#25991;&#20214;&#31995;&#32479;&#26159;&#19968;&#20010;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#31995;&#32479;&#65292;&#24847;&#21619;&#30528;&#20320;&#20462;&#25913;&#20320;&#30340;&#30446;&#24405;&#26641;&#26102;&#65292;Subversion&#20250;&#35760;&#20303;&#20462;&#25913;&#20197;&#21069;&#30340;&#26679;&#23376;&#12290;&#20063;&#21487;&#20197;&#22238;&#21040;&#25152;&#26377;&#21021;&#22987;&#21270;&#29256;&#26412;&#24211;&#20043;&#21518;&#65288;&#19988;&#20165;&#20165;&#20043;&#21518;&#65289;&#30340;&#29256;&#26412;&#12290;</p><p>&#25152;&#26377;&#20320;&#23545;&#30446;&#24405;&#26641;&#30340;&#20462;&#25913;&#21253;&#21547;&#22312;Subversion&#20107;&#21153;&#30340;&#19978;&#19979;&#25991;&#20013;&#65292;&#19979;&#38754;&#25551;&#36848;&#20102;&#20462;&#25913;&#25991;&#20214;&#31995;&#32479;&#30340;&#20363;&#31243;&#65306;</p><div class="orderedlist"><ol type="1"><li><p>&#24320;&#22987; Subversion &#30340;&#25552;&#20132;&#20107;&#21153;&#12290;</p></li><li><p>&#20316;&#20986;&#20462;&#25913;&#65288;&#28155;&#21152;&#12289;&#21024;&#38500;&#12289;&#23646;&#24615;&#20462;&#25913;&#31561;&#31561;&#12290;&#65289;&#12290;</p></li><li><p>&#25552;&#20132;&#20107;&#21153;&#12290;</p></li></ol></div><p>&#19968;&#26086;&#20320;&#25552;&#20132;&#20102;&#20320;&#30340;&#20107;&#21153;&#65292;&#20320;&#30340;&#25991;&#20214;&#31995;&#32479;&#20462;&#25913;&#23601;&#20250;&#27704;&#20037;&#30340;&#20316;&#20026;&#21382;&#21490;&#20445;&#23384;&#36215;&#26469;&#65292;&#27599;&#20010;&#36825;&#26679;&#30340;&#21608;&#26399;&#20250;&#20135;&#29983;&#19968;&#20010;&#26032;&#30340;&#26641;&#65292;&#25152;&#26377;&#30340;&#20462;&#35746;&#29256;&#26412;&#37117;&#26159;&#27704;&#36828;&#21487;&#20197;&#35775;&#38382;&#30340;&#19968;&#20010;&#19981;&#21464;&#30340;&#24555;&#29031;&#12290;</p><div class="sidebar"><p class="title"><b>&#20107;&#21153;&#30340;&#20854;&#23427;&#20449;&#24687;</b></p><p>Subversion&#30340;&#20107;&#21153;&#27010;&#24565;&#65292;&#29305;&#21035;&#26159;&#22312;libsvn_fs&#20013;&#30340;&#25968;&#25454;&#24211;&#38468;&#36817;&#30340;&#20195;&#30721;&#65292;&#24456;&#23481;&#26131;&#19982;&#20302;&#23618;&#25552;&#20379;&#25903;&#25345;&#30340;&#25968;&#25454;&#24211;&#20107;&#21153;&#28151;&#28102;&#12290;&#20004;&#31181;&#31867;&#22411;&#20107;&#21153;&#37117;&#25552;&#20379;&#20102;&#21407;&#23376;&#21644;&#38548;&#31163;&#25805;&#20316;&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;&#20107;&#21153;&#32473;&#20320;&#33021;&#21147;&#21487;&#20197;&#29992;&#8220;<span class="quote">&#20840;&#37096;&#25110;&#32773;&#27809;&#26377;</span>&#8221;&#26679;&#24335;&#25191;&#34892;&#19968;&#31995;&#21015;&#30340;&#21160;&#20316;&#8212;&#25152;&#26377;&#30340;&#21160;&#20316;&#37117;&#23436;&#20840;&#25104;&#21151;&#65292;&#25110;&#32773;&#26159;&#25152;&#26377;&#30340;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#21457;&#29983;&#8212;&#32780;&#19988;&#19981;&#20250;&#24178;&#25200;&#21035;&#20154;&#25805;&#20316;&#25968;&#25454;&#12290;</p><p>&#25968;&#25454;&#24211;&#20107;&#21153;&#36890;&#24120;&#22260;&#32469;&#30528;&#19968;&#20123;&#23545;&#25968;&#25454;&#24211;&#26412;&#36523;&#30340;&#25968;&#25454;&#20462;&#25913;&#30456;&#20851;&#30340;&#23567;&#25805;&#20316;&#65288;&#22914;&#20462;&#25913;&#34920;&#34892;&#30340;&#20869;&#23481;&#65289;&#65292;Subversion&#26159;&#26356;&#22823;&#33539;&#22260;&#30340;&#20107;&#21153;&#65292;&#22260;&#32469;&#30528;&#19968;&#20123;&#39640;&#19968;&#32423;&#30340;&#25805;&#20316;&#65292;&#22914;&#19979;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#25991;&#20214;&#31995;&#32479;&#30340;&#19968;&#32452;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#20462;&#25913;&#12290;&#22914;&#26524;&#36825;&#36824;&#19981;&#26159;&#24456;&#28151;&#20081;&#65292;&#32771;&#34385;&#36825;&#20010;&#65306;Subversion&#22312;&#21019;&#24314;Subversion&#20107;&#21153;&#65288;&#25152;&#20197;&#22914;&#26524;Subversion&#21019;&#24314;&#20107;&#21153;&#22833;&#36133;&#65292;&#25968;&#25454;&#24211;&#20250;&#30475;&#36215;&#26469;&#25105;&#20204;&#20174;&#26469;&#27809;&#26377;&#23581;&#35797;&#21019;&#24314;&#65289;&#26102;&#20250;&#20351;&#29992;&#19968;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#65281;</p><p>&#24456;&#24184;&#36816;&#30340;&#26159;&#29992;&#25143;&#30340;&#25991;&#20214;&#31995;&#32479;API&#65292;&#25968;&#25454;&#24211;&#25552;&#20379;&#30340;&#20107;&#21153;&#25903;&#25345;&#26412;&#36523;&#20960;&#20046;&#23436;&#20840;&#20174;&#22806;&#34920;&#38544;&#34255;&#65288;&#20063;&#26159;&#19968;&#20010;&#23436;&#20840;&#27169;&#22359;&#21270;&#30340;&#27169;&#24335;&#25152;&#24212;&#35813;&#30340;&#65289;&#12290;&#21482;&#26377;&#24403;&#20320;&#24320;&#22987;&#30740;&#31350;&#25991;&#20214;&#31995;&#32479;&#26412;&#36523;&#30340;&#23454;&#29616;&#26102;&#65292;&#36825;&#20123;&#20107;&#24773;&#25165;&#21487;&#35265;&#65288;&#25110;&#32773;&#26159;&#24320;&#22987;&#24863;&#20852;&#36259;&#65289;&#12290;</p></div><p>Most of the functionality provided by the filesystem
        interface deals with actions that occur on individual
        filesystem paths.  That is, from outside of the filesystem, the
        primary mechanism for describing and accessing the individual
        revisions of files and directories comes through the use of
        path strings like <code class="filename">/foo/bar</code>, just as if
        you were addressing files and directories through your
        favorite shell program.  You add new files and directories by
        passing their paths-to-be to the right API functions.  You
        query for information about them by the same mechanism.</p><p>&#28982;&#32780;&#65292;&#19981;&#20687;&#22823;&#22810;&#25968;&#25991;&#20214;&#31995;&#32479;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#36335;&#24452;&#19981;&#36275;&#20197;&#22312;Subversion&#23450;&#20301;&#19968;&#20010;&#25991;&#20214;&#25110;&#30446;&#24405;&#65292;&#21487;&#20197;&#25226;&#30446;&#24405;&#26641;&#30475;&#20316;&#19968;&#20010;&#20108;&#32500;&#30340;&#31995;&#32479;&#65292;&#19968;&#20010;&#33410;&#28857;&#30340;&#20804;&#24351;&#20195;&#34920;&#20102;&#19968;&#31181;&#20174;&#24038;&#21040;&#21491;&#30340;&#21160;&#20316;&#65292;&#24182;&#19988;&#36882;&#20943;&#21040;&#23376;&#30446;&#24405;&#26159;&#19968;&#20010;&#21521;&#19979;&#30340;&#21160;&#20316;&#65292;<a class="xref" href="ch08.html#svn.developer.layerlib.repos.dia-1" title="&#22270;&nbsp;8.1.&nbsp;&#20108;&#32500;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;">&#22270;&nbsp;8.1 &#8220;&#20108;&#32500;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#8221;</a>&#23637;&#31034;&#20102;&#19968;&#20010;&#20856;&#22411;&#30340;&#26641;&#30340;&#24418;&#24335;&#12290;</p><div class="figure"><a name="svn.developer.layerlib.repos.dia-1"></a><p class="title"><b>&#22270;&nbsp;8.1.&nbsp;&#20108;&#32500;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;</b></p><div class="figure-contents"><div class="mediaobject"><img src="images/ch08dia1.png"></div></div></div><br class="figure-break"><p>The difference here is that the Subversion filesystem has a
        nifty third dimension that most filesystems do not
        have&#8212;Time!
        <sup>[<a name="d0e13070" href="#ftn.d0e13070" class="footnote">50</a>]</sup>
        In the filesystem interface, nearly every function that has a
        <em class="parameter"><code>path</code></em> argument also expects a
        <em class="parameter"><code>root</code></em> argument.  This svn_fs_root_t argument describes
        either a revision or a Subversion transaction (which is simply
        a revision-in-the-making), and provides that third-dimensional
        context needed to understand the difference between
        <code class="filename">/foo/bar</code> in revision 32, and the same
        path as it exists in revision 98.  <a class="xref" href="ch08.html#svn.developer.layerlib.repos.dia-2" title="&#22270;&nbsp;8.2.&nbsp;&#29256;&#26412;&#26102;&#38388;&#8212;&#31532;&#19977;&#32500;&#65281;">&#22270;&nbsp;8.2 &#8220;&#29256;&#26412;&#26102;&#38388;&#8212;&#31532;&#19977;&#32500;&#65281;&#8221;</a> shows revision
        history as an added dimension to the Subversion filesystem
        universe.</p><div class="figure"><a name="svn.developer.layerlib.repos.dia-2"></a><p class="title"><b>&#22270;&nbsp;8.2.&nbsp;&#29256;&#26412;&#26102;&#38388;&#8212;&#31532;&#19977;&#32500;&#65281;</b></p><div class="figure-contents"><div class="mediaobject"><img src="images/ch08dia2.png"></div></div></div><br class="figure-break"><p>&#20687;&#20043;&#21069;&#25105;&#20204;&#25552;&#21040;&#30340;&#65292;libsvn_fs&#30340;API&#24863;&#35273;&#20687;&#26159;&#20854;&#23427;&#25991;&#20214;&#31995;&#32479;&#65292;&#21482;&#26159;&#26377;&#19968;&#20010;&#32654;&#22937;&#30340;&#29256;&#26412;&#21270;&#33021;&#21147;&#12290;&#23427;&#35774;&#35745;&#20026;&#20026;&#25152;&#26377;&#23545;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#31995;&#32479;&#26377;&#20852;&#36259;&#30340;&#31243;&#24207;&#20351;&#29992;&#65292;&#19981;&#26159;&#24039;&#21512;&#65292;Subversion&#26412;&#36523;&#20063;&#23545;&#36825;&#20010;&#21151;&#33021;&#24456;&#26377;&#20852;&#36259;&#12290;&#20294;&#26159;&#34429;&#28982;&#25991;&#20214;&#31995;&#32479;API&#19968;&#23450;&#24517;&#39035;&#23545;&#22522;&#26412;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#29256;&#26412;&#21270;&#25552;&#20379;&#36275;&#22815;&#30340;&#25903;&#25345;&#65292;Subversion&#38656;&#35201;&#30340;&#26356;&#22810;&#8212;&#36825;&#26159;libsvn_repos&#21040;&#26469;&#30340;&#22320;&#26041;&#12290;</p><p>Subversion&#29256;&#26412;&#24211;&#24211;&#65288;libsvn_repos&#65289;&#24314;&#31435;&#22312;&#65288;&#36923;&#36753;&#19978;&#35762;&#65289;libsvn_fs&#30340;API&#20043;&#19978;&#65292;&#19981;&#20165;&#20165;&#25552;&#20379;&#20102;&#29256;&#26412;&#21270;&#25991;&#20214;&#31995;&#32479;&#30340;&#21151;&#33021;&#65292;&#23427;&#27809;&#26377;&#21253;&#35065;&#25152;&#26377;&#30340;&#25991;&#20214;&#31995;&#32479;&#21151;&#33021;&#8212;&#21482;&#26377;&#25991;&#20214;&#31995;&#32479;&#24120;&#35268;&#21608;&#26399;&#20013;&#30340;&#20027;&#35201;&#20107;&#20214;&#20351;&#29992;&#29256;&#26412;&#24211;&#25509;&#21475;&#21253;&#35065;&#65292;&#22914;&#21253;&#25324;Subversion&#20107;&#21153;&#30340;&#21019;&#24314;&#21644;&#25552;&#20132;&#65292;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#30340;&#20462;&#25913;&#12290;&#36825;&#20123;&#29305;&#21035;&#30340;&#20107;&#20214;&#20351;&#29992;&#29256;&#26412;&#24211;&#24211;&#21253;&#35065;&#26159;&#22240;&#20026;&#23427;&#20204;&#26377;&#19968;&#20123;&#20851;&#32852;&#30340;&#38057;&#23376;&#12290;&#29256;&#26412;&#24211;&#38057;&#23376;&#31995;&#32479;&#24182;&#27809;&#26377;&#19982;&#19982;&#29256;&#26412;&#21270;&#25991;&#20214;&#31995;&#32479;&#30340;&#32039;&#23494;&#20851;&#32852;&#65292;&#25152;&#20197;&#23427;&#20204;&#23384;&#22312;&#20110;&#29256;&#26412;&#24211;&#30340;&#21253;&#35065;&#24211;&#12290;</p><p>&#38057;&#23376;&#26426;&#21046;&#38656;&#27714;&#26159;&#20174;&#25991;&#20214;&#31995;&#32479;&#20195;&#30721;&#30340;&#20854;&#23427;&#37096;&#20998;&#20013;&#25277;&#35937;&#20986;&#21333;&#29420;&#30340;&#29256;&#26412;&#24211;&#24211;&#30340;&#19968;&#20010;&#21407;&#22240;&#65292;libsvn_repos&#30340;API&#25552;&#20379;&#20102;&#35768;&#22810;&#20854;&#20182;&#26377;&#29992;&#30340;&#24037;&#20855;&#65292;&#23427;&#20204;&#21487;&#20197;&#20570;&#21040;&#65306;</p><div class="itemizedlist"><ul type="disc"><li><p>&#22312;Subversion&#29256;&#26412;&#24211;&#21644;&#29256;&#26412;&#24211;&#21253;&#25324;&#30340;&#25991;&#20214;&#31995;&#32479;&#30340;&#19978;&#21019;&#24314;&#12289;&#25171;&#24320;&#12289;&#38144;&#27585;&#21644;&#25191;&#34892;&#24674;&#22797;&#27493;&#39588;&#12290;</p></li><li><p>&#25551;&#36848;&#20004;&#20010;&#25991;&#20214;&#31995;&#32479;&#26641;&#30340;&#21306;&#21035;&#12290;</p></li><li><p>&#20851;&#20110;&#25152;&#26377;&#65288;&#25110;&#32773;&#37096;&#20998;&#65289;&#20462;&#35746;&#29256;&#26412;&#20013;&#30340;&#25991;&#20214;&#31995;&#32479;&#20013;&#30340;&#19968;&#32452;&#25991;&#20214;&#30340;&#25552;&#20132;&#26085;&#24535;&#20449;&#24687;&#30340;&#26597;&#35810;</p></li><li><p>&#20135;&#29983;&#21487;&#35835;&#30340;&#25991;&#20214;&#31995;&#32479;&#8220;<span class="quote">&#23548;&#20986;</span>&#8221;&#65292;&#19968;&#20010;&#25991;&#20214;&#31995;&#32479;&#20462;&#35746;&#29256;&#26412;&#30340;&#23436;&#25972;&#23637;&#29616;&#12290;</p></li><li><p>&#35299;&#26512;&#23548;&#20986;&#26684;&#24335;&#65292;&#21152;&#36733;&#23548;&#20986;&#30340;&#29256;&#26412;&#21040;&#19968;&#20010;&#19981;&#21516;&#30340;Subversion&#29256;&#26412;&#24211;&#12290;</p></li></ul></div><p>&#20276;&#38543;&#30528;Subversion&#30340;&#21457;&#23637;&#65292;&#29256;&#26412;&#24211;&#24211;&#20250;&#38543;&#30528;&#25991;&#20214;&#31995;&#32479;&#25552;&#20379;&#26356;&#22810;&#30340;&#21151;&#33021;&#21644;&#37197;&#32622;&#36873;&#39033;&#32780;&#19981;&#26029;&#25104;&#38271;&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.developer.layerlib.ra"></a>&#29256;&#26412;&#24211;&#35775;&#38382;&#23618;</h3></div></div></div><p>If the Subversion Repository Layer is at &#8220;<span class="quote">the other
        end of the line</span>&#8221;, the Repository Access (RA) Layer is
        the line itself.  Charged with marshaling data between the
        client libraries and the repository, this layer includes the
        libsvn_ra module loader library, the RA modules themselves
        (which currently includes libsvn_ra_dav, libsvn_ra_local,
        libsvn_ra_serf, and libsvn_ra_svn), and any additional
        libraries needed by one or more of those RA modules (such as
        the mod_dav_svn Apache module or libsvn_ra_svn's server,
        <span class="command"><strong>svnserve</strong></span>).</p><p>Since Subversion uses URLs to identify its repository
        resources, the protocol portion of the URL scheme (usually
        <code class="literal">file://</code>, <code class="literal">http://</code>,
        <code class="literal">https://</code>, <code class="literal">svn://</code>, or
        <code class="literal">svn+ssh://</code>) is used to determine which RA
        module will handle the communications.  Each module registers
        a list of the protocols it knows how to &#8220;<span class="quote">speak</span>&#8221;
        so that the RA loader can, at runtime, determine which module
        to use for the task at hand.  You can determine which RA
        modules are available to the Subversion command-line client,
        and what protocols they claim to support, by running
        <span class="command"><strong>svn --version</strong></span>:</p><pre class="screen">
$ svn --version
svn, version 1.4.3 (r23084)
   compiled Jan 18 2007, 07:47:40

Copyright (C) 2000-2006 CollabNet.
Subversion is open source software, see http://subversion.tigris.org/
This product includes software developed by CollabNet (http://www.Collab.Net/).

The following repository access (RA) modules are available:

* ra_dav : Module for accessing a repository via WebDAV (DeltaV) protocol.
  - handles 'http' scheme
  - handles 'https' scheme
* ra_svn : Module for accessing a repository using the svn network protocol.
  - handles 'svn' scheme
* ra_local : Module for accessing a repository on local disk.
  - handles 'file' scheme

$
</pre><p>The public API exported by the RA Layer contains
        functionality necessary for sending and receiving versioned
        data to and from the repository.  And each of the available RA
        plugins is able to perform that task using a specific
        protocol&#8212;libsvn_ra_dav speaks HTTP/WebDAV (optionally
        using SSL encryption) with an Apache HTTP Server that is
        running the mod_dav_svn Subversion server module;
        libsvn_ra_svn speaks a custom network protocol with the
        <span class="command"><strong>svnserve</strong></span> program; and so on.</p><p>&#23545;&#37027;&#20123;&#19968;&#30452;&#24076;&#26395;&#20351;&#29992;&#21478;&#19968;&#20010;&#21327;&#35758;&#26469;&#35775;&#38382;Subversion&#29256;&#26412;&#24211;&#30340;&#20154;&#65292;&#27491;&#22909;&#26159;&#20026;&#20160;&#20040;&#29256;&#26412;&#24211;&#35775;&#38382;&#23618;&#26159;&#27169;&#22359;&#21270;&#30340;&#65281;&#24320;&#21457;&#32773;&#21487;&#20197;&#31616;&#21333;&#30340;&#32534;&#20889;&#19968;&#20010;&#26032;&#30340;&#24211;&#26469;&#22312;&#19968;&#20391;&#23454;&#29616;RA&#25509;&#21475;&#24182;&#19988;&#19982;&#21478;&#19968;&#20391;&#30340;&#29256;&#26412;&#24211;&#36890;&#35759;&#12290;&#20320;&#30340;&#26032;&#24211;&#21487;&#20197;&#20351;&#29992;&#23384;&#22312;&#30340;&#32593;&#32476;&#21327;&#35758;&#65292;&#25110;&#32773;&#21457;&#26126;&#20320;&#33258;&#24049;&#30340;&#12290;&#20320;&#21487;&#20197;&#20351;&#29992;&#36827;&#31243;&#38388;&#30340;&#36890;&#35759;&#35843;&#29992;&#65292;&#25110;&#32773;&#8212;&#35753;&#25105;&#20204;&#21457;&#29378;&#65292;&#25105;&#20204;&#20250;&#21527;&#65311;&#8212;&#20320;&#29978;&#33267;&#21487;&#20197;&#23454;&#29616;&#19968;&#20010;&#30005;&#23376;&#37038;&#20214;&#20026;&#22522;&#30784;&#30340;&#21327;&#35758;&#65292;Subversion&#25552;&#20379;&#20102;API&#65292;&#20320;&#25552;&#20379;&#21019;&#36896;&#24615;&#12290;</p></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.developer.layerlib.client"></a>&#23458;&#25143;&#31471;&#23618;</h3></div></div></div><p>&#22312;&#23458;&#25143;&#31471;&#36825;&#19968;&#38754;&#65292;Subversion&#24037;&#20316;&#25335;&#36125;&#26159;&#25152;&#26377;&#21160;&#20316;&#21457;&#29983;&#30340;&#22320;&#26041;&#12290;&#22823;&#22810;&#25968;&#23458;&#25143;&#31471;&#24211;&#23454;&#29616;&#30340;&#21151;&#33021;&#26159;&#20026;&#20102;&#31649;&#29702;&#24037;&#20316;&#25335;&#36125;&#30340;&#30446;&#30340;&#23454;&#29616;&#30340;&#8212;&#28385;&#26159;&#25991;&#20214;&#23376;&#30446;&#24405;&#30340;&#30446;&#24405;&#26159;&#19968;&#20010;&#25110;&#22810;&#20010;&#29256;&#26412;&#24211;&#20301;&#32622;&#30340;&#21487;&#32534;&#36753;&#30340;&#26412;&#22320;&#8220;<span class="quote">&#24433;&#23556;</span>&#8221;&#8212;&#20174;&#29256;&#26412;&#24211;&#35775;&#38382;&#23618;&#26469;&#22238;&#20256;&#36882;&#20462;&#25913;&#12290;</p><p>Subversion's working copy library, libsvn_wc, is directly
        responsible for managing the data in the working copies.  To
        accomplish this, the library stores administrative information
        about each working copy directory within a special
        subdirectory.  This subdirectory, named
        <code class="filename">.svn</code>, is present in each working copy
        directory and contains various other files and directories
        which record state and provide a private workspace for
        administrative action.  For those familiar with CVS, this
        <code class="filename">.svn</code> subdirectory is similar in purpose
        to the <code class="filename">CVS</code> administrative directories
        found in CVS working copies.  For more information about the
        <code class="filename">.svn</code> administrative area, see <a class="xref" href="ch08s02.html" title="&#36827;&#20837;&#24037;&#20316;&#25335;&#36125;&#30340;&#31649;&#29702;&#21306;">&#8220;&#36827;&#20837;&#24037;&#20316;&#25335;&#36125;&#30340;&#31649;&#29702;&#21306;&#8221;&#19968;&#33410;</a>in this chapter.</p><p>The Subversion client library, libsvn_client, has the
        broadest responsibility; its job is to mingle the
        functionality of the working copy library with that of the
        Repository Access Layer, and then to provide the highest-level
        API to any application that wishes to perform general revision
        control actions.  For example, the function
        <code class="function">svn_client_checkout()</code> takes a URL as an
        argument.  It passes this URL to the RA layer and opens an
        authenticated session with a particular repository.  It then
        asks the repository for a certain tree, and sends this tree
        into the working copy library, which then writes a full
        working copy to disk (<code class="filename">.svn</code> directories
        and all).</p><p>The client library is designed to be used by any
        application.  While the Subversion source code includes a
        standard command-line client, it should be very easy to write
        any number of GUI clients on top of the client library.  New
        GUIs (or any new client, really) for Subversion need not be
        clunky wrappers around the included command-line
        client&#8212;they have full access via the libsvn_client API
        to same functionality, data, and callback mechanisms that the
        command-line client uses.  In fact, the Subversion source code
        tree contains a small C program (which can be found at
        <code class="filename">tools/examples/minimal_client.c</code> that
        exemplifies how to wield the Subversion API to create a simple
        client program</p><div class="sidebar"><p class="title"><b>&#30452;&#25509;&#32465;&#23450;&#8212;&#20851;&#20110;&#27491;&#30830;&#24615;</b></p><p>Why should your GUI program bind directly with a
          libsvn_client instead of acting as a wrapper around a
          command-line program?  Besides simply being more efficient,
          it can be more correct as well.  A
          command-line program (like the one supplied with Subversion)
          that binds to the client library needs to effectively
          translate feedback and requested data bits from C types to
          some form of human-readable output.  This type of
          translation can be lossy.  That is, the program may not
          display all of the information harvested from the API, or
          may combine bits of information for compact representation.</p><p>&#22914;&#26524;&#20320;&#24050;&#32463;&#21253;&#35065;&#20102;&#36825;&#26679;&#19968;&#20010;&#21629;&#20196;&#34892;&#31243;&#24207;&#65292;&#31532;&#20108;&#20010;&#31243;&#24207;&#21482;&#33021;&#35775;&#38382;&#24050;&#32463;&#32463;&#36807;&#35299;&#37322;&#30340;&#65288;&#22914;&#25105;&#20204;&#25552;&#21040;&#30340;&#65292;&#19981;&#23436;&#20840;&#65289;&#20449;&#24687;&#65292;&#38656;&#35201;<span class="emphasis"><em>&#20877;&#27425;</em></span>&#36716;&#21270;&#20026;<span class="emphasis"><em>&#23427;&#26412;&#36523;&#30340;</em></span>&#23637;&#31034;&#26684;&#24335;&#12290;&#30001;&#20110;&#21508;&#23618;&#30340;&#21253;&#35065;&#65292;&#21407;&#22987;&#25968;&#25454;&#30340;&#23436;&#25972;&#24615;&#36234;&#26469;&#36234;&#38590;&#20197;&#20445;&#35777;&#65292;&#32467;&#26524;&#24456;&#20687;&#23545;&#21916;&#27426;&#30340;&#24405;&#38899;&#24102;&#25110;&#24405;&#20687;&#24102;&#21453;&#22797;&#30340;&#25335;&#36125;&#65288;&#19968;&#20010;&#25335;&#36125;&#8230;&#65289;&#12290;</p><p>&#20294;&#26159;&#20851;&#20110;&#30452;&#25509;&#32465;&#23450;API&#20351;&#29992;&#65292;&#32780;&#19981;&#26159;&#21253;&#35065;&#31243;&#24207;&#65292;&#36825;&#26159;Subversion&#39033;&#30446;&#23545;&#20854;API&#20860;&#23481;&#24615;&#30340;&#25215;&#35834;&#12290;&#22312;&#23567;&#29256;&#26412;&#30340;&#21464;&#21270;&#65288;&#22914;&#20174;1.3&#21040;1.4&#65289;&#20013;API&#30340;&#19981;&#20250;&#26377;&#20989;&#25968;&#21407;&#24418;&#30340;&#25913;&#21464;&#65292;&#31616;&#21333;&#26469;&#35828;&#23601;&#26159;&#20320;&#19981;&#38656;&#35201;&#23558;&#20320;&#31243;&#24207;&#28304;&#20195;&#30721;&#21319;&#32423;&#65292;&#22240;&#20026;&#20320;&#21482;&#26159;&#21319;&#32423;&#21040;&#20102;&#19968;&#20010;&#26032;&#29256;&#26412;&#30340;Subversion&#12290;&#26576;&#20123;&#26041;&#27861;&#21487;&#33021;&#20250;&#34987;&#24223;&#24323;&#65292;&#20294;&#20381;&#28982;&#24037;&#20316;&#65292;&#36825;&#32473;&#20320;&#20102;&#32531;&#20914;&#26102;&#38388;&#26469;&#26368;&#32456;&#36866;&#24212;&#26032;API&#12290;Subversion&#30340;&#21629;&#20196;&#34892;&#36755;&#20986;&#27809;&#26377;&#36825;&#31181;&#20860;&#23481;&#24615;&#25215;&#35834;&#65292;&#21487;&#33021;&#20250;&#22312;&#27599;&#20010;&#29256;&#26412;&#26356;&#25913;&#12290;</p></div></div></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d0e13070" href="#d0e13070" class="para">50</a>] </sup>&#25105;&#20204;&#29702;&#35299;&#36825;&#19968;&#23450;&#20250;&#32473;&#31185;&#24187;&#23567;&#35828;&#36855;&#24102;&#26469;&#19968;&#20010;&#38663;&#25788;&#65292;&#20182;&#20204;&#35748;&#20026;&#26102;&#38388;&#26159;<span class="emphasis"><em>&#31532;&#22235;</em></span>&#32500;&#30340;&#65292;&#25105;&#20204;&#35201;&#20026;&#25552;&#20986;&#36825;&#26679;&#19968;&#20010;&#19981;&#21516;&#29702;&#35770;&#30340;&#26029;&#35328;&#32780;&#20260;&#23475;&#20102;&#20182;&#20204;&#30340;&#20316;&#20986;&#36947;&#27465;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch07s03.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch08s02.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20351;&#29992;&#22806;&#32622;&#27604;&#36739;&#24037;&#20855;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#36827;&#20837;&#24037;&#20316;&#25335;&#36125;&#30340;&#31649;&#29702;&#21306;</td></tr></table></div></body></html>