<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#29256;&#26412;&#27169;&#22411;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;"><link rel="prev" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;"><link rel="next" href="svn.basic.in-action.html" title="Subversion &#23454;&#36341;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29256;&#26412;&#27169;&#22411;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.basic.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.basic.in-action.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.basic.vsn-models"></a>&#29256;&#26412;&#27169;&#22411;</h2></div></div></div>
      
      <p>&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#26680;&#24515;&#20219;&#21153;&#26159;&#23454;&#29616;&#21327;&#20316;&#32534;&#36753;&#21644;&#25968;&#25454;&#20849;&#20139;&#65292;&#20294;&#26159;&#19981;&#21516;&#30340;&#31995;&#32479;&#20351;&#29992;&#19981;&#21516;&#30340;&#31574;&#30053;&#23454;&#29616;&#36825;&#20010;&#30446;&#30340;&#12290;&#25105;&#20204;&#26377;&#35768;&#22810;&#29702;&#30001;&#35201;&#21435;&#29702;&#35299;&#36825;&#20123;&#31574;&#30053;&#30340;&#21306;&#21035;&#65292;&#39318;&#20808;&#65292;&#22914;&#26524;&#20320;&#36935;&#21040;&#20102;&#20854;&#20182;&#31867;&#20284;Subversion&#30340;&#31995;&#32479;&#65292;&#21487;&#20197;&#24110;&#21161;&#20320;&#27604;&#36739;&#29616;&#26377;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#27492;&#22806;&#65292;&#21487;&#20197;&#24110;&#21161;&#20320;&#26356;&#26377;&#25928;&#30340;&#20351;&#29992;Subversion&#65292;&#22240;&#20026;Subversion&#26412;&#36523;&#25903;&#25345;&#19981;&#21516;&#30340;&#24037;&#20316;&#26041;&#24335;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.basic.vsn-models.problem-sharing"></a>&#25991;&#20214;&#20849;&#20139;&#30340;&#38382;&#39064;</h3></div></div></div>
        
        <p>&#25152;&#26377;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#37117;&#38656;&#35201;&#35299;&#20915;&#36825;&#26679;&#19968;&#20010;&#22522;&#30784;&#38382;&#39064;&#65306;&#24590;&#26679;&#35753;&#31995;&#32479;&#20801;&#35768;&#29992;&#25143;&#20849;&#20139;&#20449;&#24687;&#65292;&#32780;&#19981;&#20250;&#35753;&#20182;&#20204;&#22240;&#24847;&#22806;&#32780;&#20114;&#30456;&#24178;&#25200;&#65311;&#29256;&#26412;&#24211;&#37324;&#24847;&#22806;&#35206;&#30422;&#21035;&#20154;&#30340;&#26356;&#25913;&#38750;&#24120;&#30340;&#23481;&#26131;&#12290;</p>
        <p>&#32771;&#34385;<a class="xref" href="svn.basic.vsn-models.html#svn.basic.vsn-models.problem-sharing.dia-1" title="&#22270;&nbsp;1.2.&nbsp;&#38656;&#35201;&#36991;&#20813;&#30340;&#38382;&#39064;">&#22270;&nbsp;1.2 &#8220;&#38656;&#35201;&#36991;&#20813;&#30340;&#38382;&#39064;&#8221;</a>&#30340;&#24773;&#26223;&#65292;&#25105;&#20204;&#26377;&#20004;&#20010;&#20849;&#21516;&#24037;&#20316;&#32773;&#65292;Harry&#21644;Sally&#65292;&#20182;&#20204;&#24819;&#21516;&#26102;&#32534;&#36753;&#29256;&#26412;&#24211;&#37324;&#30340;&#21516;&#19968;&#20010;&#25991;&#20214;&#65292;&#22914;&#26524;&#39318;&#20808;Harry&#20445;&#23384;&#23427;&#30340;&#20462;&#25913;&#65292;&#36807;&#20102;&#19968;&#20250;&#65292;Sally&#21487;&#33021;&#20945;&#24039;&#29992;&#33258;&#24049;&#30340;&#29256;&#26412;&#35206;&#30422;&#20102;&#36825;&#20123;&#25991;&#20214;&#65292;Harry&#30340;&#26356;&#25913;&#19981;&#20250;&#27704;&#36828;&#28040;&#22833;(&#22240;&#20026;&#31995;&#32479;&#35760;&#24405;&#20102;&#27599;&#27425;&#20462;&#25913;)&#65292;&#20294;Harry&#25152;&#26377;&#30340;&#20462;&#25913;<span class="emphasis"><em>&#19981;&#20250;</em></span>&#20986;&#29616;&#22312;Sally&#26032;&#29256;&#26412;&#30340;&#25991;&#20214;&#20013;&#65292;&#25152;&#20197;Harry&#30340;&#24037;&#20316;&#36824;&#26159;&#20002;&#22833;&#20102;&#8212;&#33267;&#23569;&#26159;&#20174;&#26368;&#26032;&#30340;&#29256;&#26412;&#20013;&#20002;&#22833;&#20102;&#8212;&#32780;&#19988;&#21487;&#33021;&#26159;&#24847;&#22806;&#30340;&#65292;&#36825;&#23601;&#26159;&#25105;&#20204;&#35201;&#26126;&#30830;&#36991;&#20813;&#30340;&#24773;&#20917;&#65281;</p>
        <div class="figure"><a name="svn.basic.vsn-models.problem-sharing.dia-1"></a><p class="title"><b>&#22270;&nbsp;1.2.&nbsp;&#38656;&#35201;&#36991;&#20813;&#30340;&#38382;&#39064;</b></p><div class="figure-contents">
          
          <div class="mediaobject"><img src="images/ch02dia2.png" alt="&#38656;&#35201;&#36991;&#20813;&#30340;&#38382;&#39064;"></div>
        </div></div><br class="figure-break">
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.basic.vsn-models.lock-unlock"></a>&#8220;&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;&#8221;&#26041;&#26696;</h3></div></div></div>
        
        <p>&#35768;&#22810;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20351;&#29992;<em class="firstterm">&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;</em>&#26426;&#21046;&#35299;&#20915;&#36825;&#31181;&#38382;&#39064;&#65292;&#22312;&#36825;&#26679;&#30340;&#27169;&#22411;&#37324;&#65292;&#22312;&#19968;&#20010;&#26102;&#38388;&#27573;&#37324;&#29256;&#26412;&#24211;&#30340;&#19968;&#20010;&#25991;&#20214;&#21482;&#20801;&#35768;&#34987;&#19968;&#20010;&#20154;&#20462;&#25913;&#12290;&#39318;&#20808;&#22312;&#20462;&#25913;&#20043;&#21069;&#65292;Harry&#35201;&#8220;<span class="quote">&#38145;&#23450;</span>&#8221;&#20303;&#36825;&#20010;&#25991;&#20214;&#65292;&#38145;&#23450;&#24456;&#20687;&#26159;&#20174;&#22270;&#20070;&#39302;&#20511;&#19968;&#26412;&#20070;&#65292;&#22914;&#26524;Harry&#38145;&#20303;&#36825;&#20010;&#25991;&#20214;&#65292;Sally&#19981;&#33021;&#20570;&#20219;&#20309;&#20462;&#25913;&#65292;&#22914;&#26524;Sally&#24819;&#35831;&#27714;&#24471;&#21040;&#19968;&#20010;&#38145;&#65292;&#29256;&#26412;&#24211;&#20250;&#25298;&#32477;&#36825;&#20010;&#35831;&#27714;&#12290;&#22312;Harry&#32467;&#26463;&#32534;&#36753;&#24182;&#19988;&#25918;&#24320;&#36825;&#20010;&#38145;&#20043;&#21069;&#65292;&#22905;&#21482;&#21487;&#20197;&#38405;&#35835;&#25991;&#20214;&#12290;Harry&#35299;&#38145;&#21518;&#65292;&#23601;&#35201;&#25442;&#29677;&#20102;&#65292;Sally&#24471;&#21040;&#33258;&#24049;&#30340;&#36718;&#25442;&#20301;&#32622;&#65292;&#38145;&#23450;&#24182;&#19988;&#24320;&#22987;&#32534;&#36753;&#36825;&#20010;&#25991;&#20214;&#12290;<a class="xref" href="svn.basic.vsn-models.html#svn.basic.vsn-models.lock-unlock.dia-1" title="&#22270;&nbsp;1.3.&nbsp;&#8220;&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;&#8221;&#26041;&#26696;">&#22270;&nbsp;1.3 &#8220;&#8220;&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;&#8221;&#26041;&#26696;&#8221;</a>&#25551;&#36848;&#20102;&#36825;&#26679;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;</p>
        <div class="figure"><a name="svn.basic.vsn-models.lock-unlock.dia-1"></a><p class="title"><b>&#22270;&nbsp;1.3.&nbsp;&#8220;&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;&#8221;&#26041;&#26696;</b></p><div class="figure-contents">
          
          <div class="mediaobject"><img src="images/ch02dia3.png" alt="&#8220;&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;&#8221;&#26041;&#26696;"></div>
        </div></div><br class="figure-break">
        <p>&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;&#27169;&#22411;&#26377;&#19968;&#28857;&#38382;&#39064;&#23601;&#26159;&#38480;&#21046;&#22826;&#22810;&#65292;&#32463;&#24120;&#20250;&#25104;&#20026;&#29992;&#25143;&#30340;&#38556;&#30861;&#65306;</p>
        <div class="itemizedlist"><ul type="disc"><li>
            <p><span class="emphasis"><em>&#38145;&#23450;&#21487;&#33021;&#23548;&#33268;&#31649;&#29702;&#38382;&#39064;&#12290;</em></span>&#26377;&#26102;&#20505;Harry&#20250;&#38145;&#20303;&#25991;&#20214;&#28982;&#21518;&#24536;&#20102;&#27492;&#20107;&#65292;&#36825;&#23601;&#26159;&#35828;Sally&#19968;&#30452;&#31561;&#24453;&#35299;&#38145;&#26469;&#32534;&#36753;&#36825;&#20123;&#25991;&#20214;&#65292;&#22905;&#22312;&#36825;&#37324;&#20725;&#20303;&#20102;&#12290;&#28982;&#21518;Harry&#21435;&#26053;&#34892;&#20102;&#65292;&#29616;&#22312;Sally&#21482;&#22909;&#21435;&#25214;&#31649;&#29702;&#21592;&#25918;&#24320;&#38145;&#65292;&#36825;&#31181;&#24773;&#20917;&#20250;&#23548;&#33268;&#19981;&#24517;&#35201;&#30340;&#32829;&#25601;&#21644;&#26102;&#38388;&#28010;&#36153;&#12290;</p>
          </li><li>
            <p><span class="emphasis"><em>&#38145;&#23450;&#21487;&#33021;&#23548;&#33268;&#19981;&#24517;&#35201;&#30340;&#32447;&#24615;&#21270;&#24320;&#21457;&#12290;</em></span>&#22914;&#26524;Harry&#32534;&#36753;&#19968;&#20010;&#25991;&#20214;&#30340;&#24320;&#22987;&#65292;Sally&#24819;&#32534;&#36753;&#21516;&#19968;&#20010;&#25991;&#20214;&#30340;&#32467;&#23614;&#65292;&#36825;&#31181;&#20462;&#25913;&#19981;&#20250;&#20914;&#31361;&#65292;&#35774;&#24819;&#20462;&#25913;&#21487;&#20197;&#27491;&#30830;&#30340;&#21512;&#24182;&#21040;&#19968;&#36215;&#65292;&#20182;&#20204;&#21487;&#20197;&#36731;&#26494;&#30340;&#24182;&#34892;&#24037;&#20316;&#32780;&#27809;&#26377;&#22826;&#22810;&#30340;&#22351;&#22788;&#65292;&#27809;&#26377;&#24517;&#35201;&#35753;&#20182;&#20204;&#36718;&#27969;&#24037;&#20316;&#12290;</p>
          </li><li>
            <p><span class="emphasis"><em>&#38145;&#23450;&#21487;&#33021;&#23548;&#33268;&#38169;&#35823;&#30340;&#23433;&#20840;&#29366;&#24577;&#12290;</em></span>&#20551;&#35774;Harry&#38145;&#23450;&#21644;&#32534;&#36753;&#19968;&#20010;&#25991;&#20214;A&#65292;&#21516;&#26102;Sally&#38145;&#23450;&#24182;&#32534;&#36753;&#25991;&#20214;B&#65292;&#22914;&#26524;A&#21644;B&#20114;&#30456;&#20381;&#36182;&#65292;&#36825;&#31181;&#21464;&#21270;&#26159;&#24517;&#39035;&#21516;&#26102;&#20316;&#30340;&#65292;&#36825;&#26679;A&#21644;B&#19981;&#33021;&#27491;&#30830;&#30340;&#24037;&#20316;&#20102;&#65292;&#38145;&#23450;&#26426;&#21046;&#23545;&#38450;&#27490;&#27492;&#31867;&#38382;&#39064;&#23558;&#26080;&#33021;&#20026;&#21147;&#8212;&#20174;&#32780;&#20135;&#29983;&#20102;&#19968;&#31181;&#22788;&#20110;&#23433;&#20840;&#29366;&#24577;&#30340;&#20551;&#30456;&#12290;&#24456;&#23481;&#26131;&#24819;&#35937;Harry&#21644;Sally&#37117;&#20197;&#20026;&#33258;&#24049;&#38145;&#20303;&#20102;&#25991;&#20214;&#65292;&#32780;&#19988;&#20174;&#19968;&#20010;&#23433;&#20840;&#65292;&#23396;&#31435;&#30340;&#24773;&#20917;&#24320;&#22987;&#24037;&#20316;&#65292;&#22240;&#32780;&#27809;&#26377;&#23613;&#26089;&#21457;&#29616;&#20182;&#20204;&#19981;&#21305;&#37197;&#30340;&#20462;&#25913;&#12290;&#38145;&#23450;&#32463;&#24120;&#25104;&#20026;&#30495;&#27491;&#20132;&#27969;&#30340;&#26367;&#20195;&#21697;</p>
          </li></ul></div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.basic.vsn-models.copy-merge"></a>&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;</h3></div></div></div>
        
        <p>Subversion&#65292;CVS&#21644;&#19968;&#20123;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20351;&#29992;<em class="firstterm">&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;</em>&#27169;&#22411;&#65292;&#22312;&#36825;&#31181;&#27169;&#22411;&#37324;&#65292;&#27599;&#19968;&#20010;&#23458;&#25143;&#32852;&#31995;&#39033;&#30446;&#29256;&#26412;&#24211;&#24314;&#31435;&#19968;&#20010;&#20010;&#20154;<em class="firstterm">&#24037;&#20316;&#25335;&#36125;</em>&#8212;&#29256;&#26412;&#24211;&#20013;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#26412;&#22320;&#26144;&#23556;&#12290;&#29992;&#25143;&#24182;&#34892;&#24037;&#20316;&#65292;&#20462;&#25913;&#21508;&#33258;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#26368;&#32456;&#65292;&#21508;&#20010;&#31169;&#26377;&#30340;&#25335;&#36125;&#21512;&#24182;&#22312;&#19968;&#36215;&#65292;&#25104;&#20026;&#26368;&#32456;&#30340;&#29256;&#26412;&#65292;&#36825;&#31181;&#31995;&#32479;&#36890;&#24120;&#21487;&#20197;&#36741;&#21161;&#21512;&#24182;&#25805;&#20316;&#65292;&#20294;&#26159;&#26368;&#32456;&#35201;&#38752;&#20154;&#24037;&#21435;&#30830;&#23450;&#27491;&#35823;&#12290;</p>
        <p>&#36825;&#26159;&#19968;&#20010;&#20363;&#23376;&#65292;Harry&#21644;Sally&#20026;&#21516;&#19968;&#20010;&#39033;&#30446;&#21508;&#33258;&#24314;&#31435;&#20102;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#65292;&#24037;&#20316;&#26159;&#24182;&#34892;&#30340;&#65292;&#20462;&#25913;&#20102;&#21516;&#19968;&#20010;&#25991;&#20214;A&#65292;Sally&#39318;&#20808;&#20445;&#23384;&#20462;&#25913;&#21040;&#29256;&#26412;&#24211;&#65292;&#24403;Harry&#24819;&#21435;&#25552;&#20132;&#20462;&#25913;&#30340;&#26102;&#20505;&#65292;&#29256;&#26412;&#24211;&#25552;&#31034;&#25991;&#20214;A&#24050;&#32463;<em class="firstterm">&#36807;&#26399;</em>&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;A&#22312;&#20182;&#19978;&#27425;&#26356;&#26032;&#20043;&#21518;&#24050;&#32463;&#26356;&#25913;&#20102;&#65292;&#25152;&#20197;&#24403;&#20182;&#36890;&#36807;&#23458;&#25143;&#31471;&#35831;&#27714;<em class="firstterm">&#21512;&#24182;</em>&#29256;&#26412;&#24211;&#21644;&#20182;&#30340;&#24037;&#20316;&#25335;&#36125;&#20043;&#21518;&#65292;&#30896;&#24039;Sally&#30340;&#20462;&#25913;&#21644;&#20182;&#30340;&#19981;&#20914;&#31361;&#65292;&#25152;&#20197;&#19968;&#26086;&#20182;&#25226;&#25152;&#26377;&#30340;&#20462;&#25913;&#38598;&#25104;&#21040;&#19968;&#36215;&#65292;&#20182;&#21487;&#20197;&#23558;&#24037;&#20316;&#25335;&#36125;&#20445;&#23384;&#21040;&#29256;&#26412;&#24211;&#65292;<a class="xref" href="svn.basic.vsn-models.html#svn.basic.vsn-models.copy-merge.dia-1" title="&#22270;&nbsp;1.4.&nbsp;&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;">&#22270;&nbsp;1.4 &#8220;&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;&#8221;</a>&#21644;<a class="xref" href="svn.basic.vsn-models.html#svn.basic.vsn-models.copy-merge.dia-2" title="&#22270;&nbsp;1.5.&nbsp;&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;(&#32493;)">&#22270;&nbsp;1.5 &#8220;&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;(&#32493;)&#8221;</a>&#23637;&#31034;&#20102;&#36825;&#19968;&#36807;&#31243;&#12290;</p>
        <div class="figure"><a name="svn.basic.vsn-models.copy-merge.dia-1"></a><p class="title"><b>&#22270;&nbsp;1.4.&nbsp;&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;</b></p><div class="figure-contents">
          
          <div class="mediaobject"><img src="images/ch02dia4.png" alt="&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;"></div>
        </div></div><br class="figure-break">
        <div class="figure"><a name="svn.basic.vsn-models.copy-merge.dia-2"></a><p class="title"><b>&#22270;&nbsp;1.5.&nbsp;&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;(&#32493;)</b></p><div class="figure-contents">
          
          <div class="mediaobject"><img src="images/ch02dia5.png" alt="&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;(&#32493;)"></div>
        </div></div><br class="figure-break">
        <p>&#20294;&#26159;&#22914;&#26524;Sally&#21644;Harry&#30340;&#20462;&#25913;<span class="emphasis"><em>&#20132;&#36845;</em></span>&#20102;&#35813;&#24590;&#20040;&#21150;&#65311;&#36825;&#31181;&#24773;&#20917;&#21483;&#20570;<em class="firstterm">&#20914;&#31361;</em>&#65292;&#36825;&#36890;&#24120;&#19981;&#26159;&#20010;&#22823;&#38382;&#39064;&#65292;&#24403;Harry&#21578;&#35785;&#20182;&#30340;&#23458;&#25143;&#31471;&#21435;&#21512;&#24182;&#29256;&#26412;&#24211;&#30340;&#26368;&#26032;&#20462;&#25913;&#21040;&#33258;&#24049;&#30340;&#24037;&#20316;&#25335;&#36125;&#26102;&#65292;&#20182;&#30340;&#25991;&#20214;A&#23601;&#20250;&#22788;&#20110;&#20914;&#31361;&#29366;&#24577;&#65306;&#20182;&#21487;&#20197;&#30475;&#21040;&#19968;&#23545;&#20914;&#31361;&#30340;&#20462;&#25913;&#38598;&#65292;&#24182;&#25163;&#24037;&#30340;&#36873;&#25321;&#20445;&#30041;&#19968;&#32452;&#20462;&#25913;&#12290;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#36719;&#20214;&#19981;&#33021;&#33258;&#21160;&#30340;&#35299;&#20915;&#20914;&#31361;&#65292;&#21482;&#26377;&#20154;&#21487;&#20197;&#29702;&#35299;&#24182;&#20316;&#20986;&#26234;&#33021;&#30340;&#36873;&#25321;&#65292;&#19968;&#26086;Harry&#25163;&#24037;&#30340;&#35299;&#20915;&#20102;&#20914;&#31361;&#8212;&#20063;&#35768;&#38656;&#35201;&#19982;Sally&#35752;&#35770;&#8212;&#23427;&#21487;&#20197;&#23433;&#20840;&#30340;&#25226;&#21512;&#24182;&#30340;&#25991;&#20214;&#20445;&#23384;&#21040;&#29256;&#26412;&#24211;&#12290;</p>
        <p>&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#27169;&#22411;&#24863;&#35273;&#26377;&#19968;&#28857;&#28151;&#20081;&#65292;&#20294;&#22312;&#23454;&#36341;&#20013;&#65292;&#36890;&#24120;&#36816;&#34892;&#30340;&#24456;&#24179;&#31283;&#65292;&#29992;&#25143;&#21487;&#20197;&#24182;&#34892;&#30340;&#24037;&#20316;&#65292;&#19981;&#24517;&#31561;&#24453;&#21035;&#20154;&#65292;&#24403;&#24037;&#20316;&#22312;&#21516;&#19968;&#20010;&#25991;&#20214;&#19978;&#26102;&#65292;&#20063;&#24456;&#23569;&#20250;&#26377;&#20132;&#36845;&#21457;&#29983;&#65292;&#20914;&#31361;&#24182;&#19981;&#39057;&#32321;&#65292;&#22788;&#29702;&#20914;&#31361;&#30340;&#26102;&#38388;&#36828;&#27604;&#31561;&#24453;&#35299;&#38145;&#33457;&#36153;&#30340;&#26102;&#38388;&#23569;&#12290;</p>
        <p>&#26368;&#21518;&#65292;&#19968;&#20999;&#37117;&#35201;&#24402;&#32467;&#21040;&#19968;&#26465;&#37325;&#35201;&#30340;&#22240;&#32032;&#65306;&#29992;&#25143;&#20132;&#27969;&#12290;&#24403;&#29992;&#25143;&#20132;&#27969;&#36139;&#20047;&#65292;&#35821;&#27861;&#21644;&#35821;&#20041;&#30340;&#20914;&#31361;&#23601;&#20250;&#22686;&#21152;&#65292;&#27809;&#26377;&#31995;&#32479;&#21487;&#20197;&#24378;&#21046;&#29992;&#25143;&#23436;&#32654;&#30340;&#20132;&#27969;&#65292;&#27809;&#26377;&#31995;&#32479;&#21487;&#20197;&#26816;&#27979;&#35821;&#20041;&#19978;&#30340;&#20914;&#31361;&#65292;&#25152;&#20197;&#27809;&#26377;&#20219;&#20309;&#35777;&#25454;&#33021;&#22815;&#25215;&#35834;&#38145;&#23450;&#31995;&#32479;&#21487;&#20197;&#38450;&#27490;&#20914;&#31361;&#65292;&#23454;&#36341;&#20013;&#65292;&#38145;&#23450;&#38500;&#20102;&#32422;&#26463;&#20102;&#29983;&#20135;&#21147;&#65292;&#24182;&#27809;&#26377;&#20570;&#20160;&#20040;&#20107;&#12290;</p>
        <div class="sidebar"><a name="svn.basic.vsn-models.copy-merge.sb-1"></a><p class="title"><b>&#20160;&#20040;&#26102;&#20505;&#38145;&#23450;&#26159;&#24517;&#38656;&#30340;</b></p>
          
          <p>&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;&#27169;&#22411;&#34987;&#35748;&#20026;&#19981;&#21033;&#20110;&#21327;&#20316;&#65292;&#20294;&#26377;&#26102;&#20505;&#38145;&#23450;&#20250;&#26356;&#22909;&#12290;</p>
          <p>&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#27169;&#22411;&#20551;&#23450;&#25991;&#20214;&#26159;&#21487;&#20197;&#26681;&#25454;&#19978;&#19979;&#25991;&#21512;&#24182;&#30340;&#65306;&#23601;&#26159;&#29256;&#26412;&#24211;&#30340;&#25991;&#20214;&#20027;&#35201;&#26159;&#20197;&#34892;&#20026;&#22522;&#30784;&#30340;&#25991;&#26412;&#25991;&#20214;(&#20363;&#22914;&#31243;&#24207;&#28304;&#20195;&#30721;)&#12290;&#20294;&#23545;&#20110;&#20108;&#36827;&#21046;&#26684;&#24335;&#65292;&#20363;&#22914;&#33402;&#26415;&#21697;&#25110;&#22768;&#38899;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#21313;&#20998;&#26377;&#24517;&#35201;&#35753;&#29992;&#25143;&#36718;&#27969;&#20462;&#25913;&#25991;&#20214;&#65292;&#22914;&#26524;&#27809;&#26377;&#32447;&#24615;&#30340;&#35775;&#38382;&#65292;&#26377;&#20123;&#20154;&#30340;&#35768;&#22810;&#24037;&#20316;&#23601;&#26368;&#32456;&#35201;&#34987;&#25918;&#24323;&#12290;</p>
          <p>&#23613;&#31649;Subversion&#19968;&#30452;&#20027;&#35201;&#26159;&#19968;&#20010;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#31995;&#32479;&#65292;&#20294;&#26159;&#23427;&#20063;&#24847;&#35782;&#21040;&#20102;&#38656;&#35201;&#38145;&#23450;&#19968;&#20123;&#25991;&#20214;&#65292;&#24182;&#19988;&#25552;&#20379;&#36825;&#31181;&#38145;&#23450;&#26426;&#21046;&#65292;&#36825;&#20010;&#29305;&#24615;&#30340;&#35752;&#35770;&#21487;&#20197;&#35265;<a class="xref" href="svn.advanced.locking.html" title="&#38145;&#23450;">&#8220;&#38145;&#23450;&#8221;&#19968;&#33410;</a>&#12290;</p>
        </div>
      </div>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.basic.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.basic.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.basic.in-action.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;Subversion &#23454;&#36341;</td></tr></table></div></body></html>