<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#20379;&#26041;&#20998;&#25903;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="svn.branchmerge.maint.html" title="&#32500;&#25252;&#20998;&#25903;"><link rel="next" href="svn.branchmerge.summary.html" title="&#24635;&#32467;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20379;&#26041;&#20998;&#25903;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.maint.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.summary.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.vendorbr"></a>&#20379;&#26041;&#20998;&#25903;</h2></div></div></div>
      
      <p>&#24403;&#24320;&#21457;&#36719;&#20214;&#26102;&#26377;&#36825;&#26679;&#19968;&#20010;&#24773;&#20917;&#65292;&#20320;&#29256;&#26412;&#25511;&#21046;&#30340;&#25968;&#25454;&#21487;&#33021;&#20851;&#32852;&#20110;&#25110;&#32773;&#26159;&#20381;&#36182;&#20110;&#20854;&#20182;&#20154;&#30340;&#25968;&#25454;&#65292;&#36890;&#24120;&#26469;&#35762;&#65292;&#20320;&#30340;&#39033;&#30446;&#30340;&#38656;&#35201;&#20250;&#35201;&#27714;&#20320;&#33258;&#24049;&#30340;&#39033;&#30446;&#23545;&#22806;&#37096;&#23454;&#20307;&#25552;&#20379;&#30340;&#25968;&#25454;&#20445;&#25345;&#23613;&#21487;&#33021;&#26368;&#26032;&#30340;&#29256;&#26412;&#65292;&#21516;&#26102;&#19981;&#20250;&#29306;&#29298;&#31283;&#23450;&#24615;&#65292;&#36825;&#31181;&#24773;&#20917;&#24635;&#26159;&#20250;&#20986;&#29616;&#8212;&#21482;&#35201;&#26576;&#20010;&#23567;&#32452;&#30340;&#20449;&#24687;&#23545;&#21478;&#19968;&#20010;&#23567;&#32452;&#30340;&#20449;&#24687;&#26377;&#30452;&#25509;&#30340;&#24433;&#21709;&#12290;</p>
      <p>&#20030;&#20010;&#20363;&#23376;&#65292;&#36719;&#20214;&#24320;&#21457;&#32773;&#20250;&#24037;&#20316;&#22312;&#19968;&#20010;&#20351;&#29992;&#31532;&#19977;&#26041;&#24211;&#30340;&#24212;&#29992;&#65292;Subversion&#24688;&#22909;&#26159;&#21644;Apache&#30340;Portable Runtime library(&#35265;<a class="xref" href="svn.developer.usingapi.html#svn.developer.usingapi.apr" title="Apache &#21487;&#31227;&#26893;&#36816;&#34892;&#24211;">&#8220;Apache &#21487;&#31227;&#26893;&#36816;&#34892;&#24211;&#8221;&#19968;&#33410;</a>)&#26377;&#36825;&#26679;&#19968;&#20010;&#20851;&#31995;&#12290;Subversion&#28304;&#20195;&#30721;&#20381;&#36182;&#20110;APR&#24211;&#26469;&#23454;&#29616;&#21487;&#31227;&#26893;&#38656;&#27714;&#12290;&#22312;Subversion&#30340;&#26089;&#26399;&#24320;&#21457;&#38454;&#27573;&#65292;&#39033;&#30446;&#32039;&#23494;&#22320;&#36861;&#36394;APR&#30340;API&#20462;&#25913;&#65292;&#32463;&#24120;&#22312;&#24211;&#20195;&#30721;&#30340;&#8220;<span class="quote">&#27969;&#34880;&#30340;&#36793;&#32536;</span>&#8221;&#31896;&#20303;&#65292;&#29616;&#22312;APR&#21644;Subversion&#37117;&#24050;&#32463;&#25104;&#29087;&#20102;&#65292;Subversion&#21482;&#23581;&#35797;&#21516;&#27493;APR&#30340;&#32463;&#36807;&#33391;&#22909;&#27979;&#35797;&#30340;&#65292;&#31283;&#23450;&#30340;API&#24211;&#12290;</p>
      <p>&#29616;&#22312;&#65292;&#22914;&#26524;&#20320;&#30340;&#39033;&#30446;&#20381;&#36182;&#20110;&#20854;&#20182;&#20154;&#30340;&#20449;&#24687;&#65292;&#26377;&#35768;&#22810;&#26041;&#27861;&#21487;&#20197;&#29992;&#26469;&#23581;&#35797;&#21516;&#27493;&#20320;&#30340;&#20449;&#24687;&#65292;&#26368;&#30171;&#33510;&#30340;&#65292;&#20320;&#21487;&#20197;&#20026;&#39033;&#30446;&#25152;&#26377;&#30340;&#36129;&#29486;&#32773;&#21457;&#24067;&#21475;&#22836;&#25110;&#20070;&#20889;&#30340;&#25351;&#23548;&#65292;&#21578;&#35785;&#20182;&#20204;&#30830;&#20449;&#20182;&#20204;&#25317;&#26377;&#20320;&#20204;&#30340;&#39033;&#30446;&#38656;&#35201;&#30340;&#29305;&#23450;&#29256;&#26412;&#30340;&#31532;&#19977;&#26041;&#20449;&#24687;&#12290;&#22914;&#26524;&#31532;&#19977;&#26041;&#20449;&#24687;&#26159;&#29992;Subversion&#29256;&#26412;&#24211;&#32500;&#25252;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;Subversion&#30340;&#22806;&#37096;&#23450;&#20041;&#26469;&#26377;&#25928;&#30340;&#8220;<span class="quote">&#24378;&#21046;</span>&#8221;&#29305;&#23450;&#30340;&#29256;&#26412;&#30340;&#20449;&#24687;&#22312;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#30340;&#30340;&#20301;&#32622;(&#35265;<a class="xref" href="svn.advanced.externals.html" title="&#22806;&#37096;&#23450;&#20041;">&#8220;&#22806;&#37096;&#23450;&#20041;&#8221;&#19968;&#33410;</a>)&#12290;</p>
      <p>&#20294;&#26159;&#26377;&#26102;&#20505;&#65292;&#20320;&#24076;&#26395;&#22312;&#20320;&#33258;&#24049;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#32500;&#25252;&#19968;&#20010;&#38024;&#23545;&#31532;&#19977;&#26041;&#25968;&#25454;&#30340;&#33258;&#23450;&#20041;&#20462;&#25913;&#65292;&#22238;&#21040;&#36719;&#20214;&#24320;&#21457;&#30340;&#20363;&#23376;&#65292;&#31243;&#24207;&#21592;&#20026;&#20102;&#20182;&#20204;&#33258;&#24049;&#30340;&#30446;&#30340;&#20250;&#38656;&#35201;&#20462;&#25913;&#31532;&#19977;&#26041;&#24211;&#65292;&#36825;&#20123;&#20462;&#25913;&#20250;&#21253;&#25324;&#26032;&#30340;&#21151;&#33021;&#21644;bug&#20462;&#27491;&#65292;&#22312;&#25104;&#20026;&#31532;&#19977;&#26041;&#24037;&#20855;&#23448;&#26041;&#21457;&#24067;&#20043;&#21069;&#65292;&#21482;&#26159;&#20869;&#37096;&#32500;&#25252;&#12290;&#25110;&#32773;&#36825;&#20123;&#20462;&#25913;&#27704;&#36828;&#19981;&#20250;&#20256;&#32473;&#24211;&#30340;&#32500;&#25252;&#32773;&#65292;&#21482;&#26159;&#20316;&#20026;&#28385;&#36275;&#36719;&#20214;&#24320;&#21457;&#38656;&#35201;&#30340;&#21333;&#29420;&#30340;&#33258;&#23450;&#20041;&#20462;&#25913;&#23384;&#22312;&#12290;</p>
      <p>&#29616;&#22312;&#20320;&#20250;&#38754;&#23545;&#19968;&#20010;&#26377;&#36259;&#30340;&#24773;&#24418;&#65292;&#20320;&#30340;&#39033;&#30446;&#21487;&#20197;&#29992;&#26576;&#31181;&#33073;&#33410;&#30340;&#26679;&#24335;&#20445;&#25345;&#23427;&#20851;&#20110;&#31532;&#19977;&#26041;&#25968;&#25454;&#33258;&#24049;&#30340;&#20462;&#25913;&#65292;&#22914;&#20351;&#29992;&#34917;&#19969;&#25991;&#20214;&#25110;&#32773;&#26159;&#23436;&#20840;&#30340;&#21487;&#36873;&#29256;&#26412;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#12290;&#20294;&#26159;&#36825;&#24456;&#24555;&#20250;&#25104;&#20026;&#32500;&#25252;&#30340;&#22836;&#30171;&#30340;&#20107;&#24773;&#65292;&#38656;&#35201;&#19968;&#31181;&#26426;&#21046;&#26469;&#24212;&#29992;&#20320;&#23545;&#31532;&#19977;&#26041;&#25968;&#25454;&#30340;&#33258;&#23450;&#20041;&#20462;&#25913;&#65292;&#24182;&#19988;&#36843;&#20351;&#22312;&#31532;&#19977;&#26041;&#25968;&#25454;&#30340;&#21518;&#32493;&#29256;&#26412;&#37325;&#24314;&#36825;&#20123;&#20462;&#25913;&#12290;</p>
      <p>&#36825;&#20010;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;&#20351;&#29992;<em class="firstterm">&#20379;&#26041;&#20998;&#25903;</em>&#65292;&#19968;&#20010;&#20379;&#26041;&#20998;&#25903;&#26159;&#19968;&#20010;&#30446;&#24405;&#26641;&#20445;&#23384;&#20102;&#31532;&#19977;&#26041;&#23454;&#20307;&#25110;&#20379;&#24212;&#26041;&#30340;&#20449;&#24687;&#65292;&#27599;&#19968;&#20010;&#20379;&#24212;&#26041;&#25968;&#25454;&#30340;&#29256;&#26412;&#21560;&#25910;&#21040;&#20320;&#30340;&#39033;&#30446;&#21483;&#20570;<em class="firstterm">&#20379;&#26041;drop</em>&#12290;</p>
      <p>&#20379;&#26041;&#20998;&#25903;&#25552;&#20379;&#20102;&#20004;&#20010;&#20851;&#38190;&#30340;&#30410;&#22788;&#65292;&#31532;&#19968;&#65292;&#36890;&#36807;&#22312;&#25105;&#20204;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20445;&#23384;&#29616;&#22312;&#25903;&#25345;&#30340;&#20379;&#26041;drop&#65292;&#20320;&#39033;&#30446;&#30340;&#25104;&#21592;&#19981;&#38656;&#35201;&#25351;&#23548;&#20182;&#20204;&#26159;&#21542;&#26377;&#20102;&#27491;&#30830;&#29256;&#26412;&#30340;&#20379;&#26041;&#25968;&#25454;&#65292;&#20182;&#20204;&#21482;&#38656;&#35201;&#20316;&#20026;&#19981;&#21516;&#24037;&#20316;&#25335;&#36125;&#26356;&#26032;&#30340;&#19968;&#37096;&#20221;&#65292;&#31616;&#21333;&#30340;&#25509;&#21463;&#27491;&#30830;&#30340;&#29256;&#26412;&#23601;&#21487;&#20197;&#20102;&#12290;&#31532;&#20108;&#65292;&#22240;&#20026;&#25968;&#25454;&#23384;&#22312;&#20110;&#20320;&#33258;&#24049;&#30340;Subversion&#29256;&#26412;&#24211;&#65292;&#20320;&#21487;&#20197;&#22312;&#24688;&#24403;&#30340;&#20301;&#32622;&#20445;&#23384;&#20320;&#30340;&#33258;&#23450;&#20041;&#20462;&#25913;&#8212;&#20320;&#19981;&#38656;&#35201;&#19968;&#20010;&#33258;&#21160;&#30340;(&#25110;&#32773;&#26159;&#26356;&#22351;&#65292;&#25163;&#24037;&#30340;)&#26041;&#27861;&#26469;&#20132;&#25442;&#20320;&#30340;&#33258;&#23450;&#20041;&#34892;&#20026;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.vendorbr.general"></a>&#24120;&#35268;&#30340;&#20379;&#26041;&#20998;&#25903;&#31649;&#29702;&#36807;&#31243;</h3></div></div></div>
        
        <p>&#31649;&#29702;&#20379;&#26041;&#20998;&#25903;&#36890;&#24120;&#20250;&#20687;&#36825;&#20010;&#26679;&#23376;&#65292;&#20320;&#21019;&#24314;&#19968;&#20010;&#39030;&#32423;&#30340;&#30446;&#24405;(&#22914;<code class="filename">/vendor</code>)&#26469;&#20445;&#23384;&#20379;&#26041;&#20998;&#25903;&#65292;&#28982;&#21518;&#20320;&#23548;&#20837;&#31532;&#19977;&#26041;&#30340;&#20195;&#30721;&#21040;&#20320;&#30340;&#23376;&#30446;&#24405;&#12290;&#28982;&#21518;&#20320;&#23558;&#25335;&#36125;&#36825;&#20010;&#23376;&#30446;&#24405;&#21040;&#20027;&#35201;&#30340;&#24320;&#21457;&#20998;&#25903;(&#20363;&#22914;<code class="filename">/trunk</code>)&#30340;&#36866;&#24403;&#20301;&#32622;&#12290;&#20320;&#19968;&#30452;&#22312;&#20320;&#30340;&#20027;&#35201;&#24320;&#21457;&#20998;&#25903;&#19978;&#20570;&#26412;&#22320;&#20462;&#25913;&#65292;&#24403;&#20320;&#30340;&#36861;&#36394;&#30340;&#20195;&#30721;&#26377;&#20102;&#26032;&#29256;&#26412;&#65292;&#20320;&#20250;&#25226;&#24102;&#21040;&#20379;&#26041;&#20998;&#25903;&#24182;&#19988;&#25226;&#23427;&#21512;&#24182;&#21040;&#20320;&#30340;<code class="filename">/trunk</code>&#65292;&#35299;&#20915;&#20219;&#20309;&#20320;&#30340;&#26412;&#22320;&#20462;&#25913;&#21644;&#20182;&#20204;&#30340;&#20462;&#25913;&#30340;&#20914;&#31361;&#12290;</p>
        <p>&#20063;&#35768;&#19968;&#20010;&#20363;&#23376;&#26377;&#21161;&#20110;&#25105;&#20204;&#38416;&#36848;&#36825;&#20010;&#31639;&#27861;&#65292;&#25105;&#20204;&#20250;&#20351;&#29992;&#36825;&#26679;&#19968;&#20010;&#22330;&#26223;&#65292;&#25105;&#20204;&#30340;&#24320;&#21457;&#22242;&#38431;&#27491;&#22312;&#24320;&#21457;&#19968;&#20010;&#35745;&#31639;&#22120;&#31243;&#24207;&#65292;&#19982;&#19968;&#20010;&#31532;&#19977;&#26041;&#30340;&#22797;&#26434;&#25968;&#23383;&#36816;&#31639;&#24211;libcomplex&#20851;&#32852;&#12290;&#25105;&#20204;&#20174;&#20379;&#26041;&#20998;&#25903;&#30340;&#21021;&#22987;&#21019;&#24314;&#24320;&#22987;&#65292;&#24182;&#19988;&#23548;&#20837;&#20379;&#26041;drop&#65292;&#25105;&#20204;&#20250;&#25226;&#27599;&#26666;&#20998;&#25903;&#30446;&#24405;&#21483;&#20570;<code class="filename">libcomplex</code>&#65292;&#25105;&#20204;&#30340;&#20195;&#30721;drop&#20250;&#36827;&#20837;&#21040;&#20379;&#26041;&#20998;&#25903;&#30340;&#23376;&#30446;&#24405;<code class="filename">current</code>&#65292;&#24182;&#19988;&#22240;&#20026;<span class="command"><strong>svn import</strong></span>&#21019;&#24314;&#25152;&#26377;&#30340;&#38656;&#35201;&#30340;&#20013;&#38388;&#29238;&#30446;&#24405;&#65292;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#19968;&#20010;&#21629;&#20196;&#23436;&#25104;&#36825;&#19968;&#27493;&#12290;</p>
        <pre class="screen">
$ svn import /path/to/libcomplex-1.0 \
             http://svn.example.com/repos/vendor/libcomplex/current \
             -m 'importing initial 1.0 vendor drop'
&#8230;
</pre>
        <p>&#25105;&#20204;&#29616;&#22312;&#22312;<code class="filename">/vendor/libcomplex/current</code>&#26377;&#20102;libcomplex&#24403;&#21069;&#29256;&#26412;&#30340;&#20195;&#30721;&#65292;&#29616;&#22312;&#25105;&#20204;&#20026;&#37027;&#20010;&#29256;&#26412;&#20316;&#26631;&#31614;(&#35265;<a class="xref" href="svn.branchmerge.tags.html" title="&#26631;&#31614;">&#8220;&#26631;&#31614;&#8221;&#19968;&#33410;</a>)&#65292;&#28982;&#21518;&#25335;&#36125;&#23427;&#21040;&#20027;&#35201;&#24320;&#21457;&#20998;&#25903;&#65292;&#25105;&#20204;&#30340;&#25335;&#36125;&#20250;&#22312;<code class="filename">calc</code>&#39033;&#30446;&#30446;&#24405;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#30446;&#24405;<code class="filename">libcomplex</code>&#65292;&#23427;&#26159;&#36825;&#20010;&#25105;&#20204;&#23558;&#35201;&#36827;&#34892;&#33258;&#23450;&#20041;&#30340;&#20379;&#26041;&#25968;&#25454;&#30340;&#25335;&#36125;&#29256;&#26412;&#12290;</p>
        <pre class="screen">
$ svn copy http://svn.example.com/repos/vendor/libcomplex/current  \
           http://svn.example.com/repos/vendor/libcomplex/1.0      \
           -m 'tagging libcomplex-1.0'
&#8230;
$ svn copy http://svn.example.com/repos/vendor/libcomplex/1.0  \
           http://svn.example.com/repos/calc/libcomplex        \
           -m 'bringing libcomplex-1.0 into the main branch'
&#8230;
</pre>
        <p>&#25105;&#20204;&#21462;&#20986;&#25105;&#20204;&#39033;&#30446;&#30340;&#20027;&#20998;&#25903;&#8212;&#29616;&#22312;&#21253;&#25324;&#20102;&#31532;&#19968;&#20010;&#20379;&#26041;&#37322;&#25918;&#30340;&#25335;&#36125;&#8212;&#25105;&#20204;&#24320;&#22987;&#33258;&#23450;&#20041;libcomplex&#30340;&#20195;&#30721;&#65292;&#22312;&#25105;&#20204;&#30693;&#36947;&#20043;&#21069;&#65292;&#25105;&#20204;&#30340;libcomplex&#20462;&#25913;&#29256;&#26412;&#26159;&#24050;&#32463;&#19982;&#25105;&#20204;&#30340;&#35745;&#31639;&#22120;&#31243;&#24207;&#23436;&#20840;&#38598;&#25104;&#20102;&#12290; <sup>[<a name="d4e3444" href="#ftn.d4e3444" class="footnote">23</a>]</sup></p>
        <p>&#20960;&#21608;&#20043;&#21518;&#65292;libcomplex&#24471;&#24320;&#21457;&#32773;&#21457;&#24067;&#20102;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#8212;&#29256;&#26412;1.1&#8212;&#21253;&#25324;&#20102;&#25105;&#20204;&#24456;&#38656;&#35201;&#30340;&#19968;&#20123;&#29305;&#24615;&#21644;&#21151;&#33021;&#12290;&#25105;&#20204;&#24456;&#24076;&#26395;&#21319;&#32423;&#21040;&#36825;&#20010;&#29256;&#26412;&#65292;&#20294;&#19981;&#24076;&#26395;&#22833;&#21435;&#22312;&#24403;&#21069;&#29256;&#26412;&#25152;&#20316;&#30340;&#20462;&#25913;&#12290;&#25105;&#20204;&#26412;&#36136;&#19978;&#20250;&#24076;&#26395;&#25226;&#25105;&#20204;&#24403;&#21069;&#22522;&#32447;&#29256;&#26412;&#26159;&#30340;libcomplex1.0&#30340;&#25335;&#36125;&#26367;&#25442;&#20026;libcomplex 1.1&#65292;&#28982;&#21518;&#25226;&#21069;&#38754;&#33258;&#23450;&#20041;&#30340;&#20462;&#25913;&#24212;&#29992;&#21040;&#26032;&#30340;&#29256;&#26412;&#12290;&#20294;&#26159;&#23454;&#38469;&#19978;&#25105;&#20204;&#36890;&#36807;&#19968;&#20010;&#30456;&#21453;&#30340;&#26041;&#21521;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#24212;&#29992;libcomplex&#20174;&#29256;&#26412;1.0&#21040;1.1&#30340;&#20462;&#25913;&#21040;&#25105;&#20204;&#20462;&#25913;&#30340;&#25335;&#36125;&#12290;</p>
        <p>&#20026;&#20102;&#25191;&#34892;&#36825;&#20010;&#21319;&#32423;&#65292;&#25105;&#20204;&#21462;&#20986;&#19968;&#20010;&#25105;&#20204;&#20379;&#26041;&#20998;&#25903;&#30340;&#25335;&#36125;&#65292;&#26367;&#25442;<code class="filename">current</code>&#30446;&#24405;&#20026;&#26032;&#30340;libcomplex 1.1&#30340;&#20195;&#30721;&#65292;&#25105;&#20204;&#21482;&#26159;&#25335;&#36125;&#26032;&#25991;&#20214;&#21040;&#23384;&#22312;&#30340;&#25991;&#20214;&#19978;&#65292;&#25110;&#32773;&#26159;&#35299;&#21387;&#32553;libcomplex 1.1&#30340;&#25171;&#21253;&#25991;&#20214;&#21040;&#25105;&#20204;&#23384;&#22312;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#12290;&#27492;&#26102;&#30340;&#30446;&#26631;&#26159;&#35753;&#25105;&#20204;&#30340;<code class="filename">current</code>&#30446;&#24405;&#21482;&#20445;&#30041;libcomplex 1.1&#30340;&#20195;&#30721;&#65292;&#24182;&#19988;&#20445;&#35777;&#25152;&#26377;&#30340;&#20195;&#30721;&#22312;&#29256;&#26412;&#25511;&#21046;&#20043;&#19979;&#65292;&#21734;&#65292;&#25105;&#20204;&#24076;&#26395;&#22312;&#26368;&#23567;&#30340;&#29256;&#26412;&#25511;&#21046;&#21382;&#21490;&#25200;&#21160;&#19979;&#23436;&#25104;&#36825;&#20214;&#20107;&#12290;</p>
        <p>&#23436;&#25104;&#20102;&#36825;&#20010;&#20174;1.0&#21040;1.1&#30340;&#20195;&#30721;&#26367;&#25442;&#65292;<span class="command"><strong>svn status</strong></span>&#20250;&#26174;&#31034;&#25991;&#20214;&#30340;&#26412;&#22320;&#20462;&#25913;&#65292;&#25110;&#35768;&#20063;&#21253;&#25324;&#20102;&#19968;&#20123;&#26410;&#29256;&#26412;&#21270;&#25110;&#32773;&#20002;&#22833;&#30340;&#25991;&#20214;&#65292;&#22914;&#26524;&#25105;&#20204;&#20570;&#20102;&#25105;&#20204;&#24212;&#35813;&#20570;&#30340;&#20107;&#24773;&#65292;&#26410;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#24212;&#35813;&#37117;&#26159;libcomplex&#22312;1.1&#26032;&#24341;&#20837;&#30340;&#25991;&#20214;&#8212;&#25105;&#20204;&#36816;&#34892;<span class="command"><strong>svn add</strong></span>&#26469;&#23558;&#23427;&#20204;&#21152;&#20837;&#21040;&#29256;&#26412;&#25511;&#21046;&#12290;&#20002;&#22833;&#30340;&#25991;&#20214;&#26159;&#23384;&#22312;&#20110;1.1&#20294;&#26159;&#19981;&#26159;&#22312;1.1&#65292;&#22312;&#36825;&#20123;&#36335;&#24452;&#25105;&#20204;&#36816;&#34892;<span class="command"><strong>svn delete</strong></span>&#12290;&#26368;&#32456;&#19968;&#26086;&#25105;&#20204;&#30340;<code class="filename">current</code>&#24037;&#20316;&#25335;&#36125;&#21482;&#26159;&#21253;&#25324;&#20102;libcomplex1.1&#30340;&#20195;&#30721;&#65292;&#25105;&#20204;&#21487;&#20197;&#25552;&#20132;&#36825;&#20123;&#25913;&#21464;&#30446;&#24405;&#21644;&#25991;&#20214;&#30340;&#20462;&#25913;&#12290;</p>
        <p>&#25105;&#20204;&#30340;<code class="filename">current</code>&#20998;&#25903;&#29616;&#22312;&#20445;&#23384;&#20102;&#26032;&#30340;&#20379;&#26041;drop&#65292;&#25105;&#20204;&#20026;&#36825;&#20010;&#26032;&#30340;&#29256;&#26412;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#26631;&#31614;(&#23601;&#20687;&#25105;&#20204;&#20026;1.0&#29256;&#26412;drop&#25152;&#20316;&#30340;)&#65292;&#28982;&#21518;&#21512;&#24182;&#36825;&#20174;&#20010;&#26631;&#31614;&#21069;&#19968;&#20010;&#29256;&#26412;&#30340;&#21306;&#21035;&#21040;&#20027;&#35201;&#24320;&#21457;&#20998;&#25903;&#12290;</p>
        <pre class="screen">
$ cd working-copies/calc
$ svn merge http://svn.example.com/repos/vendor/libcomplex/1.0      \
            http://svn.example.com/repos/vendor/libcomplex/current  \
            libcomplex
&#8230; # resolve all the conflicts between their changes and our changes
$ svn commit -m 'merging libcomplex-1.1 into the main branch'
&#8230;
</pre>
        <p>&#22312;&#36825;&#20010;&#29712;&#30862;&#30340;&#29992;&#20363;&#37324;&#65292;&#31532;&#19977;&#26041;&#24037;&#20855;&#30340;&#26032;&#29256;&#26412;&#20250;&#20174;&#19968;&#20010;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#23601;&#20687;&#21069;&#19968;&#20010;&#29256;&#26412;&#12290;&#27809;&#26377;&#20219;&#20309;libcomplex&#28304;&#25991;&#20214;&#20250;&#34987;&#21024;&#38500;&#12289;&#34987;&#25913;&#21517;&#25110;&#26159;&#31227;&#21160;&#21040;&#21035;&#30340;&#20301;&#32622;&#8212;&#26032;&#30340;&#29256;&#26412;&#21482;&#20250;&#20445;&#23384;&#38024;&#23545;&#19978;&#19968;&#20010;&#29256;&#26412;&#30340;&#25991;&#26412;&#20462;&#25913;&#12290;&#22312;&#23436;&#32654;&#19990;&#30028;&#65292;&#25105;&#20204;&#23545;&#21602;&#20462;&#25913;&#20250;&#24178;&#20928;&#24471;&#24212;&#29992;&#21040;&#24211;&#30340;&#26032;&#29256;&#26412;&#65292;&#19981;&#20250;&#20135;&#29983;&#20219;&#20309;&#24182;&#21457;&#21644;&#20914;&#31361;&#12290;</p>
        <p>&#20294;&#26159;&#20107;&#24773;&#24635;&#19981;&#26159;&#36825;&#26679;&#31616;&#21333;&#65292;&#23454;&#38469;&#19978;&#28304;&#25991;&#20214;&#22312;&#19981;&#21516;&#30340;&#29256;&#26412;&#38388;&#30340;&#31227;&#21160;&#26159;&#24456;&#24120;&#35265;&#30340;&#65292;&#36825;&#31181;&#36807;&#31243;&#22797;&#26434;&#24615;&#21487;&#20197;&#30830;&#20445;&#25105;&#20204;&#30340;&#20462;&#25913;&#20250;&#19968;&#30452;&#23545;&#26032;&#30340;&#29256;&#26412;&#20195;&#30721;&#26377;&#25928;&#65292;&#21487;&#20197;&#24456;&#24555;&#20351;&#24418;&#21183;&#36864;&#21270;&#21040;&#25105;&#20204;&#38656;&#35201;&#22312;&#26032;&#29256;&#26412;&#25163;&#24037;&#30340;&#37325;&#26032;&#21019;&#24314;&#25105;&#20204;&#30340;&#33258;&#23450;&#20041;&#20462;&#25913;&#12290;&#19968;&#26086;Subversion&#30693;&#36947;&#20102;&#32473;&#23450;&#25991;&#20214;&#30340;&#21382;&#21490;&#8212;&#21253;&#25324;&#20102;&#25152;&#26377;&#20197;&#21069;&#30340;&#20301;&#32622;&#8212;&#21512;&#24182;&#21040;&#26032;&#29256;&#26412;&#30340;&#36827;&#31243;&#23601;&#20250;&#24456;&#31616;&#21333;&#65292;&#20294;&#26159;&#25105;&#20204;&#38656;&#35201;&#36127;&#36131;&#21578;&#35785;Subversion&#20379;&#26041;drop&#20043;&#38388;&#28304;&#25991;&#20214;&#24067;&#23616;&#30340;&#25913;&#21464;&#12290;</p>
      </div>
      
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.vendorbr.svn_load_dirs"></a>
            <span class="command"><strong>svn_load_dirs.pl</strong></span>
          </h3></div></div></div>
        
        <p>&#19981;&#20165;&#20165;&#21253;&#21547;&#19968;&#20123;&#21024;&#38500;&#12289;&#28155;&#21152;&#21644;&#31227;&#21160;&#30340;&#20379;&#26041;drops&#20351;&#24471;&#21319;&#32423;&#31532;&#19977;&#26041;&#25968;&#25454;&#21518;&#32493;&#29256;&#26412;&#30340;&#36807;&#31243;&#21464;&#24471;&#22797;&#26434;&#65292;&#25152;&#20197;Subversion&#25552;&#20379;&#20102;&#19968;&#20010;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#33050;&#26412;&#26469;&#36741;&#21161;&#36825;&#20010;&#36807;&#31243;&#65292;&#36825;&#20010;&#33050;&#26412;&#33258;&#21160;&#36827;&#34892;&#25105;&#20204;&#21069;&#38754;&#25552;&#21040;&#30340;&#24120;&#35268;&#20379;&#26041;&#20998;&#25903;&#31649;&#29702;&#36807;&#31243;&#30340;&#23548;&#20837;&#27493;&#39588;&#65292;&#20174;&#32780;&#20351;&#24471;&#38169;&#35823;&#26368;&#23567;&#21270;&#12290;&#20320;&#20173;&#35201;&#36127;&#36131;&#20351;&#29992;&#21512;&#24182;&#21629;&#20196;&#21512;&#24182;&#31532;&#19977;&#26041;&#30340;&#26032; &#29256;&#26412;&#25968;&#25454;&#21512;&#24182;&#21040;&#20027;&#35201;&#24320;&#21457;&#20998;&#25903;&#65292;&#20294;&#26159;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#24110;&#21161;&#20320;&#24555;&#36895;&#21040;&#36798;&#36825;&#19968;&#27493;&#39588;&#12290;</p>
        <p>&#19968;&#21477;&#35805;&#65292;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#26159;&#19968;&#20010;&#22686;&#24378;&#30340;<span class="command"><strong>svn import</strong></span>&#65292;&#20855;&#22791;&#20102;&#35768;&#22810;&#37325;&#35201;&#30340;&#29305;&#24615;&#65306;</p>
        <div class="itemizedlist"><ul type="disc"><li>
            <p>&#23427;&#21487;&#20197;&#22312;&#20219;&#20309;&#26377;&#19968;&#20010;&#23384;&#22312;&#30340;&#29256;&#26412;&#24211;&#30446;&#24405;&#19982;&#19968;&#20010;&#22806;&#37096;&#30340;&#30446;&#24405;&#21305;&#37197;&#26102;&#25191;&#34892;&#65292;&#20250;&#25191;&#34892;&#25152;&#26377;&#24517;&#35201;&#30340;&#28155;&#21152;&#21644;&#21024;&#38500;&#24182;&#19988;&#21487;&#20197;&#36873;&#21017;&#25191;&#34892;&#31227;&#21160;&#12290;</p>
          </li><li>
            <p>&#23427;&#21487;&#20197;&#29992;&#26469;&#25805;&#20316;&#19968;&#31995;&#21015;&#22797;&#26434;&#30340;&#25805;&#20316;&#65292;&#22914;&#37027;&#20123;&#38656;&#35201;&#19968;&#20010;&#20013;&#38388;&#23186;&#20171;&#30340;&#25552;&#20132;&#8212;&#22914;&#22312;&#25805;&#20316;&#20043;&#21069;&#37325;&#21629;&#21517;&#19968;&#20010;&#25991;&#20214;&#25110;&#32773;&#30446;&#24405;&#20004;&#27425;&#12290;</p>
          </li><li>
            <p>&#23427;&#21487;&#20197;&#38543;&#24847;&#30340;&#20026;&#26032;&#23548;&#20837;&#30446;&#24405;&#25171;&#19978;&#26631;&#31614;&#12290;</p>
          </li><li>
            <p>&#23427;&#21487;&#20197;&#38543;&#24847;&#20026;&#31526;&#21512;&#27491;&#21017;&#34920;&#36798;&#24335;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#28155;&#21152;&#20219;&#24847;&#30340;&#23646;&#24615;&#12290;</p>
          </li></ul></div>
        <p><span class="command"><strong>svn_load_dirs.pl</strong></span>&#21033;&#29992;&#19977;&#20010;&#24378;&#21046;&#30340;&#21442;&#25968;&#65292;&#31532;&#19968;&#20010;&#21442;&#25968;&#26159;Subversion&#24037;&#20316;&#30340;&#22522;&#26412;&#30446;&#24405;URL&#65292;&#31532;&#20108;&#20010;&#21442;&#25968;&#22312;URL&#20043;&#21518;&#8212;&#30456;&#23545;&#20110;&#31532;&#19968;&#20010;&#21442;&#25968;&#8212;&#25351;&#21521;&#24403;&#21069;&#30340;&#20379;&#26041;&#20998;&#25903;&#23558;&#20250;&#23548;&#20837;&#30340;&#30446;&#24405;&#65292;&#26368;&#21518;&#65292;&#31532;&#19977;&#20010;&#21442;&#25968;&#26159;&#19968;&#20010;&#38656;&#35201;&#23548;&#20837;&#30340;&#26412;&#22320;&#30446;&#24405;&#65292;&#20351;&#29992;&#21069;&#38754;&#30340;&#20363;&#23376;&#65292;&#19968;&#20010;&#20856;&#22411;&#30340;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#35843;&#29992;&#30475;&#36215;&#26469;&#22914;&#19979;&#65306;</p>
        <pre class="screen">
$ svn_load_dirs.pl http://svn.example.com/repos/vendor/libcomplex \
                   current                                        \
                   /path/to/libcomplex-1.1
&#8230;
</pre>
        <p>&#20320;&#21487;&#20197;&#35828;&#26126;&#20320;&#20250;&#24076;&#26395;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#21516;&#26102;&#25171;&#19978;&#26631;&#31614;&#65292;&#36825;&#20351;&#29992;<code class="option">-t</code>&#21629;&#20196;&#34892;&#36873;&#39033;&#65292;&#38656;&#35201;&#25351;&#23450;&#19968;&#20010;&#26631;&#31614;&#21517;&#65292;&#36825;&#20010;&#26631;&#31614;&#26159;&#31532;&#19968;&#20010;&#21442;&#25968;&#30340;&#19968;&#20010;&#30456;&#23545;URL&#12290;</p>
        <pre class="screen">
$ svn_load_dirs.pl -t libcomplex-1.1                              \
                   http://svn.example.com/repos/vendor/libcomplex \
                   current                                        \
                   /path/to/libcomplex-1.1
&#8230;
</pre>
        <p>&#24403;&#20320;&#36816;&#34892;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#65292;&#23427;&#20250;&#26816;&#39564;&#20320;&#30340;&#23384;&#22312;&#30340;&#8220;<span class="quote">current</span>&#8221;&#20379;&#26041;drop&#65292;&#24182;&#19988;&#19982;&#25552;&#35758;&#30340;&#26032;&#20379;&#26041;drop&#27604;&#36739;&#65292;&#22312;&#36825;&#20010;&#29712;&#30862;&#30340;&#20363;&#23376;&#37324;&#65292;&#27809;&#26377;&#25991;&#20214;&#21482;&#20986;&#29616;&#22312;&#19968;&#20010;&#29256;&#26412;&#37324;&#65292;&#33050;&#26412;&#25191;&#34892;&#26032;&#30340;&#23548;&#20837;&#32780;&#19981;&#20250;&#21457;&#29983;&#24847;&#22806;&#12290;&#28982;&#32780;&#22914;&#26524;&#29256;&#26412;&#20043;&#38388;&#26377;&#20102;&#25991;&#20214;&#24067;&#23616;&#30340;&#21306;&#21035;&#65292;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#20250;&#35810;&#38382;&#20320;&#22914;&#20309;&#35299;&#20915;&#36825;&#20010;&#21306;&#21035;&#65292;&#20363;&#22914;&#20320;&#20250;&#26377;&#26426;&#20250;&#21578;&#35785;&#33050;&#26412;libcomplex&#29256;&#26412;1.0&#30340;<code class="filename">math.c</code>&#25991;&#20214;&#22312;1.1&#24050;&#32463;&#37325;&#21629;&#21517;&#20026;<code class="filename">arithmetic.c</code>&#65292;&#20219;&#20309;&#27809;&#26377;&#35299;&#37322;&#20026;&#31227;&#21160;&#30340;&#24046;&#24322;&#37117;&#20250;&#34987;&#30475;&#20316;&#26159;&#24120;&#35268;&#30340;&#28155;&#21152;&#21644;&#21024;&#38500;&#12290;</p>
        <p>&#36825;&#20010;&#33050;&#26412;&#20063;&#25509;&#21463;&#21333;&#29420;&#37197;&#32622;&#25991;&#20214;&#29992;&#26469;&#20026;<span class="emphasis"><em>&#28155;&#21152;&#21040;</em></span>&#29256;&#26412;&#24211;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#35774;&#32622;&#21305;&#37197;&#27491;&#21017;&#34920;&#36798;&#24335;&#30340;&#23646;&#24615;&#12290;&#37197;&#32622;&#25991;&#20214;&#36890;&#36807;<span class="command"><strong>svn_load_dirs.pl</strong></span>&#30340;<code class="option">-p</code>&#21629;&#20196;&#34892;&#36873;&#39033;&#25351;&#23450;&#65292;&#36825;&#20010;&#37197;&#32622;&#25991;&#20214;&#30340;&#27599;&#19968;&#34892;&#37117;&#26159;&#19968;&#20010;&#31354;&#30333;&#20998;&#21106;&#30340;&#20004;&#21015;&#25110;&#32773;&#22235;&#21015;&#20540;&#65306;&#19968;&#20010;Perl&#26679;&#24335;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#26469;&#21305;&#37197;&#28155;&#21152;&#30340;&#36335;&#24452;&#12289;&#19968;&#20010;&#25511;&#21046;&#20851;&#38190;&#23383;(<code class="literal">break</code>&#25110;&#32773;&#26159;<code class="literal">cont</code>)&#21644;&#21487;&#36873;&#30340;&#23646;&#24615;&#21517;&#21644;&#20540;&#12290;</p>
        <pre class="screen">
\.png$              break   svn:mime-type   image/png
\.jpe?g$            break   svn:mime-type   image/jpeg
\.m3u$              cont    svn:mime-type   audio/x-mpegurl
\.m3u$              break   svn:eol-style   LF
.*                  break   svn:eol-style   native
</pre>
        <p>&#23545;&#27599;&#19968;&#20010;&#28155;&#21152;&#30340;&#36335;&#24452;&#65292;&#20250;&#25353;&#29031;&#39034;&#24207;&#20026;&#21305;&#37197;&#27491;&#21017;&#34920;&#36798;&#24335;&#30340;&#25991;&#20214;&#37197;&#32622;&#23646;&#24615;&#65292;&#38500;&#38750;&#25511;&#21046;&#26631;&#24535;&#26159;<code class="literal">break</code>(&#24847;&#21619;&#30528;&#19981;&#38656;&#35201;&#26356;&#22810;&#30340;&#36335;&#24452;&#21305;&#37197;&#24212;&#29992;&#21040;&#36825;&#20010;&#36335;&#24452;)&#12290;&#22914;&#26524;&#25511;&#21046;&#35828;&#26126;&#26159;<code class="literal">cont</code>&#8212;<code class="literal">continue</code>&#30340;&#32553;&#20889;&#8212;&#28982;&#21518;&#21305;&#37197;&#24037;&#20316;&#20250;&#32487;&#32493;&#21040;&#37197;&#32622;&#25991;&#20214;&#30340;&#19979;&#19968;&#34892;&#12290;</p>
        <p>&#20219;&#20309;&#27491;&#21017;&#34920;&#36798;&#24335;&#65292;&#23646;&#24615;&#21517;&#25110;&#32773;&#23646;&#24615;&#20540;&#30340;&#31354;&#26684;&#24517;&#39035;&#20351;&#29992;&#21333;&#24341;&#21495;&#25110;&#32773;&#21452;&#24341;&#21495;&#29615;&#32469;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#21453;&#26012;&#26464;(<code class="literal">\</code>)&#25442;&#30721;&#31526;&#26469;&#22238;&#36991;&#24341;&#21495;&#65292;&#21453;&#26012;&#26464;&#21482;&#20250;&#22312;&#35299;&#26512;&#37197;&#32622;&#25991;&#20214;&#26102;&#22238;&#36991;&#24341;&#21495;&#65292;&#25152;&#20197;&#19981;&#33021;&#20445;&#25252;&#24517;&#35201;&#27491;&#21017;&#34920;&#36798;&#24335;&#23383;&#31526;&#20043;&#22806;&#30340;&#30340;&#20854;&#23427;&#23383;&#31526;&#12290;</p>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e3444" href="#d4e3444" class="para">23</a>] </sup>&#32780;&#19988;&#23436;&#20840;&#27809;&#26377;bug&#65292;&#24403;&#28982;&#65281;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.maint.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.branchmerge.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.summary.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#32500;&#25252;&#20998;&#25903;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#24635;&#32467;</td></tr></table></div></body></html>