<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#24120;&#35265;&#29992;&#20363;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="svn.branchmerge.copychanges.html" title="&#22312;&#20998;&#25903;&#38388;&#22797;&#21046;&#20462;&#25913;"><link rel="next" href="svn.branchmerge.switchwc.html" title="&#20351;&#29992;&#20998;&#25903;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#24120;&#35265;&#29992;&#20363;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.copychanges.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.switchwc.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.branchmerge.commonuses"></a>&#24120;&#35265;&#29992;&#20363;</h2></div></div></div>
      
      <p>&#20998;&#25903;&#21644;<span class="command"><strong>svn merge</strong></span>&#26377;&#24456;&#22810;&#19981;&#21516;&#30340;&#29992;&#27861;&#65292;&#36825;&#20010;&#23567;&#33410;&#25551;&#36848;&#20102;&#26368;&#24120;&#35265;&#30340;&#29992;&#27861;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.commonuses.wholebr"></a>&#21512;&#24182;&#20998;&#25903;&#21040;&#21478;&#19968;&#20998;&#25903;</h3></div></div></div>
        
        <p>&#20026;&#20102;&#23436;&#25104;&#36825;&#20010;&#20363;&#23376;&#65292;&#25105;&#20204;&#23558;&#26102;&#38388;&#24448;&#21069;&#25512;&#36827;&#65292;&#20551;&#23450;&#24050;&#32463;&#36807;&#20102;&#20960;&#22825;&#65292;&#22312;&#20027;&#24178;&#21644;&#20320;&#30340;&#20998;&#25903;&#19978;&#37117;&#26377;&#35768;&#22810;&#26356;&#25913;&#65292;&#20551;&#23450;&#20320;&#23436;&#25104;&#20102;&#20998;&#25903;&#19978;&#30340;&#24037;&#20316;&#65292;&#24050;&#32463;&#23436;&#25104;&#20102;&#29305;&#24615;&#25110;bug&#20462;&#27491;&#65292;&#20320;&#24819;&#21512;&#24182;&#25152;&#26377;&#20998;&#25903;&#30340;&#20462;&#25913;&#21040;&#20027;&#24178;&#19978;&#65292;&#35753;&#21035;&#20154;&#20063;&#21487;&#20197;&#20351;&#29992;&#12290;</p>
        <p>&#36825;&#31181;&#22330;&#26223;&#19979;&#22914;&#20309;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#65311;&#35760;&#20303;&#36825;&#20010;&#21629;&#20196;&#27604;&#36739;&#20004;&#20010;&#30446;&#24405;&#26641;&#65292;&#28982;&#21518;&#24212;&#29992;&#27604;&#36739;&#32467;&#26524;&#21040;&#24037;&#20316;&#25335;&#36125;&#65292;&#25152;&#20197;&#35201;&#25509;&#21463;&#36825;&#31181;&#21464;&#21270;&#65292;&#20320;&#38656;&#35201;&#20027;&#24178;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#25105;&#20204;&#20551;&#35774;&#20320;&#26377;&#19968;&#20010;&#26368;&#21021;&#30340;&#20027;&#24178;&#24037;&#20316;&#25335;&#36125;(&#23436;&#20840;&#26356;&#26032;)&#65292;&#25110;&#32773;&#26159;&#20320;&#26368;&#36817;&#21462;&#20986;&#20102;<code class="filename">/calc/trunk</code>&#30340;&#19968;&#20010;&#24178;&#20928;&#30340;&#24037;&#20316;&#25335;&#36125;&#12290;</p>
        <p>&#20294;&#26159;&#35201;&#21738;&#20004;&#20010;&#26641;&#36827;&#34892;&#27604;&#36739;&#21602;&#65311;&#20045;&#19968;&#30475;&#65292;&#22238;&#31572;&#24456;&#26126;&#30830;&#65292;&#21482;&#35201;&#27604;&#36739;&#26368;&#26032;&#30340;&#20027;&#24178;&#19982;&#20998;&#25903;&#12290;&#20294;&#26159;&#20320;&#35201;&#24847;&#35782;&#21040;&#8212;&#36825;&#20010;&#24819;&#27861;&#26159;<span class="emphasis"><em>&#38169;&#35823;&#30340;</em></span>&#65292;&#20260;&#23475;&#20102;&#35768;&#22810;&#26032;&#29992;&#25143;&#65281;&#22240;&#20026;<span class="command"><strong>svn merge</strong></span>&#30340;&#25805;&#20316;&#24456;&#20687;<span class="command"><strong>svn diff</strong></span>&#65292;&#27604;&#36739;&#26368;&#26032;&#30340;&#20027;&#24178;&#21644;&#20998;&#25903;&#26641;&#19981;&#20165;&#20165;&#20250;&#25551;&#36848;&#20320;&#22312;&#20998;&#25903;&#19978;&#25152;&#20316;&#30340;&#20462;&#25913;&#65292;&#36825;&#26679;&#30340;&#27604;&#36739;&#20250;&#23637;&#31034;&#22826;&#22810;&#30340;&#19981;&#21516;&#65292;&#19981;&#20165;&#21253;&#25324;&#20998;&#25903;&#19978;&#30340;&#22686;&#21152;&#65292;&#20063;&#21253;&#25324;&#20102;&#20027;&#24178;&#19978;&#30340;&#21024;&#38500;&#25805;&#20316;&#65292;&#32780;&#36825;&#20123;&#21024;&#38500;&#26681;&#26412;&#23601;&#27809;&#26377;&#22312;&#20998;&#25903;&#19978;&#21457;&#29983;&#36807;&#12290;</p>
        <p>&#20026;&#20102;&#34920;&#31034;&#20320;&#30340;&#20998;&#25903;&#19978;&#30340;&#20462;&#25913;&#65292;&#20320;&#21482;&#38656;&#35201;&#27604;&#36739;&#20998;&#25903;&#30340;&#21021;&#22987;&#29366;&#24577;&#19982;&#26368;&#32456;&#29366;&#24577;&#65292;&#22312;&#20320;&#30340;&#20998;&#25903;&#19978;&#20351;&#29992;<span class="command"><strong>svn log</strong></span>&#21629;&#20196;&#65292;&#20320;&#21487;&#20197;&#30475;&#21040;&#20320;&#30340;&#20998;&#25903;&#22312;341&#29256;&#26412;&#24314;&#31435;&#65292;&#20320;&#30340;&#20998;&#25903;&#26368;&#32456;&#30340;&#29366;&#24577;&#29992;<code class="literal">HEAD</code>&#29256;&#26412;&#34920;&#31034;&#65292;&#36825;&#24847;&#21619;&#30528;&#20320;&#24076;&#26395;&#33021;&#22815;&#27604;&#36739;&#29256;&#26412;341&#21644;<code class="literal">HEAD</code>&#30340;&#20998;&#25903;&#30446;&#24405;&#65292;&#28982;&#21518;&#24212;&#29992;&#36825;&#20123;&#20998;&#25903;&#30340;&#20462;&#25913;&#21040;&#20027;&#24178;&#30446;&#24405;&#30340;&#24037;&#20316;&#25335;&#36125;&#12290;</p>
        <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
          <p>&#26597;&#25214;&#20998;&#25903;&#20135;&#29983;&#30340;&#29256;&#26412;(&#20998;&#25903;&#30340;&#8220;<span class="quote">&#22522;&#20934;</span>&#8221;)&#30340;&#26368;&#22909;&#26041;&#27861;&#26159;&#22312;<span class="command"><strong>svn log</strong></span>&#20013;&#20351;&#29992;<code class="option">--stop-on-copy</code>&#36873;&#39033;&#65292;log&#23376;&#21629;&#20196;&#36890;&#24120;&#20250;&#26174;&#31034;&#25152;&#26377;&#20851;&#20110;&#20998;&#25903;&#30340;&#21464;&#21270;&#65292;&#21253;&#25324;&#21019;&#24314;&#20998;&#25903;&#30340;&#36807;&#31243;&#65292;&#23601;&#22909;&#20687;&#20320;&#22312;&#20027;&#24178;&#19978;&#19968;&#26679;&#65292;<code class="option">--stop-on-copy</code>&#20250;&#22312;<span class="command"><strong>svn log</strong></span>&#26816;&#27979;&#21040;&#30446;&#26631;&#25335;&#36125;&#25110;&#32773;&#25913;&#21517;&#26102;&#20013;&#27490;&#26085;&#24535;&#36755;&#20986;&#12290;</p>
          <p>&#25152;&#20197;&#65292;&#22312;&#25105;&#20204;&#30340;&#20363;&#23376;&#37324;&#65292;</p>
          <pre class="screen">
$ svn log -v --stop-on-copy \
          http://svn.example.com/repos/calc/branches/my-calc-branch
&#8230;
------------------------------------------------------------------------
r341 | user | 2002-11-03 15:27:56 -0600 (Thu, 07 Nov 2002) | 2 lines
Changed paths:
   A /calc/branches/my-calc-branch (from /calc/trunk:340)

$
</pre>
          <p>&#27491;&#22914;&#25152;&#26009;&#65292;&#26368;&#21518;&#25171;&#21360;&#20986;&#30340;&#29256;&#26412;&#27491;&#26159;&#30001;<code class="filename">my-calc-branch</code>&#25335;&#36125;&#29983;&#25104;&#30340;&#29256;&#26412;&#12290;</p>
        </div>
        <p>&#22914;&#19979;&#26159;&#26368;&#32456;&#30340;&#21512;&#24182;&#36807;&#31243;&#65292;&#28982;&#21518;&#65306;</p>
        <pre class="screen">
$ cd calc/trunk
$ svn update
At revision 405.

$ svn merge -r 341:405 http://svn.example.com/repos/calc/branches/my-calc-branch
U   integer.c
U   button.c
U   Makefile

$ svn status
M   integer.c
M   button.c
M   Makefile

# ...examine the diffs, compile, test, etc...

$ svn commit -m "Merged my-calc-branch changes r341:405 into the trunk."
Sending        integer.c
Sending        button.c
Sending        Makefile
Transmitting file data ...
Committed revision 406.
</pre>
        <p>&#20877;&#27425;&#35828;&#26126;&#65292;&#26085;&#24535;&#20449;&#24687;&#20013;&#35814;&#32454;&#25551;&#36848;&#20102;&#21512;&#24182;&#21040;&#20027;&#24178;&#30340;&#30340;&#20462;&#25913;&#33539;&#22260;&#65292;&#35760;&#20303;&#19968;&#23450;&#35201;&#36825;&#20040;&#20570;&#65292;&#36825;&#26159;&#20320;&#20197;&#21518;&#38656;&#35201;&#30340;&#37325;&#35201;&#20449;&#24687;&#12290;</p>
        <p>&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#24076;&#26395;&#22312;&#20998;&#25903;&#19978;&#32487;&#32493;&#24037;&#20316;&#19968;&#21608;&#65292;&#26469;&#36827;&#19968;&#27493;&#21152;&#24378;&#20320;&#30340;&#20462;&#27491;&#65292;&#36825;&#26102;&#29256;&#26412;&#24211;&#30340;<code class="literal">HEAD</code>&#29256;&#26412;&#26159;480&#65292;&#20320;&#20934;&#22791;&#22909;&#20102;&#21478;&#19968;&#27425;&#21512;&#24182;&#65292;&#20294;&#26159;&#25105;&#20204;&#22312;<a class="xref" href="svn.branchmerge.copychanges.html#svn.branchmerge.copychanges.bestprac" title="&#21512;&#24182;&#30340;&#26368;&#20339;&#23454;&#36341;">&#8220;&#21512;&#24182;&#30340;&#26368;&#20339;&#23454;&#36341;&#8221;&#19968;&#33410;</a>&#25552;&#21040;&#36807;&#65292;&#20320;&#19981;&#24819;&#21512;&#24182;&#24050;&#32463;&#21512;&#24182;&#30340;&#20869;&#23481;&#65292;&#20320;&#21482;&#24819;&#21512;&#24182;&#26032;&#30340;&#19996;&#35199;&#65292;&#25216;&#24039;&#23601;&#26159;&#25351;&#20986;&#20160;&#20040;&#26159;&#8220;<span class="quote">&#26032;</span>&#8221;&#30340;&#12290;</p>
        <p>&#31532;&#19968;&#27493;&#26159;&#22312;&#20027;&#24178;&#19978;&#36816;&#34892;<span class="command"><strong>svn log</strong></span>&#23519;&#30475;&#26368;&#21518;&#19968;&#27425;&#19982;&#20998;&#25903;&#21512;&#24182;&#30340;&#26085;&#24535;&#20449;&#24687;&#65306;</p>
        <pre class="screen">
$ cd calc/trunk
$ svn log
&#8230;
------------------------------------------------------------------------
r406 | user | 2004-02-08 11:17:26 -0600 (Sun, 08 Feb 2004) | 1 line

Merged my-calc-branch changes r341:405 into the trunk.
------------------------------------------------------------------------
&#8230;
</pre>
        <p>&#38463;&#21704;&#65281;&#22240;&#20026;&#20998;&#25903;&#19978;341&#21040;405&#20043;&#38388;&#30340;&#25152;&#26377;&#20462;&#25913;&#24050;&#32463;&#22312;&#29256;&#26412;406&#21512;&#24182;&#20102;&#65292;&#29616;&#22312;&#20320;&#21482;&#38656;&#35201;&#21512;&#24182;&#20998;&#25903;&#22312;&#27492;&#20043;&#21518;&#30340;&#20462;&#25913;&#8212;&#36890;&#36807;&#27604;&#36739;406&#21644;<code class="literal">HEAD</code>&#12290;</p>
        <pre class="screen">
$ cd calc/trunk
$ svn update
At revision 480.

# We notice that HEAD is currently 480, so we use it to do the merge:

$ svn merge -r 406:480 http://svn.example.com/repos/calc/branches/my-calc-branch
U   integer.c
U   button.c
U   Makefile

$ svn commit -m "Merged my-calc-branch changes r406:480 into the trunk."
Sending        integer.c
Sending        button.c
Sending        Makefile
Transmitting file data ...
Committed revision 481.
</pre>
        <p>&#29616;&#22312;&#20027;&#24178;&#26377;&#20102;&#20998;&#25903;&#19978;&#31532;&#20108;&#27874;&#20462;&#25913;&#30340;&#23436;&#20840;&#32467;&#26524;&#65292;&#27492;&#21051;&#65292;&#20320;&#21487;&#20197;&#21024;&#38500;&#20320;&#30340;&#20998;&#25903;(&#25105;&#20204;&#20250;&#22312;&#20197;&#21518;&#35752;&#35770;)&#65292;&#25110;&#26159;&#32487;&#32493;&#22312;&#20320;&#20998;&#25903;&#19978;&#24037;&#20316;&#65292;&#37325;&#22797;&#36825;&#20010;&#27493;&#39588;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.commonuses.undo"></a>&#21462;&#28040;&#20462;&#25913;</h3></div></div></div>
        
        <p><span class="command"><strong>svn merge</strong></span>&#21478;&#19968;&#20010;&#24120;&#29992;&#30340;&#20570;&#27861;&#26159;&#21462;&#28040;&#24050;&#32463;&#20570;&#24471;&#25552;&#20132;&#65292;&#20551;&#35774;&#20320;&#24841;&#24555;&#30340;&#22312;<code class="filename">/calc/trunk</code>&#24037;&#20316;&#65292;&#20320;&#21457;&#29616;303&#29256;&#26412;&#23545;<code class="filename">integer.c</code>&#30340;&#20462;&#25913;&#23436;&#20840;&#38169;&#20102;&#65292;&#23427;&#19981;&#24212;&#35813;&#34987;&#25552;&#20132;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#26469;&#8220;<span class="quote">&#21462;&#28040;</span>&#8221;&#36825;&#20010;&#24037;&#20316;&#25335;&#36125;&#19978;&#25152;&#20316;&#30340;&#25805;&#20316;&#65292;&#28982;&#21518;&#25552;&#20132;&#26412;&#22320;&#20462;&#25913;&#21040;&#29256;&#26412;&#24211;&#65292;&#20320;&#35201;&#20570;&#24471;&#21482;&#26159;&#25351;&#23450;&#19968;&#20010;&#30456;&#21453;&#30340;&#21306;&#21035;&#12290;(&#20320;&#21487;&#20197;&#36890;&#36807;&#25351;&#23450;<code class="option">--revision 303:302--change -303</code></p>
        <pre class="screen">
$ svn merge -c -303 http://svn.example.com/repos/calc/trunk
U  integer.c

$ svn status
M  integer.c

$ svn diff
&#8230;
# verify that the change is removed
&#8230;

$ svn commit -m "Undoing change committed in r303."
Sending        integer.c
Transmitting file data .
Committed revision 350.
</pre>
        <p>&#25105;&#20204;&#21487;&#20197;&#25226;&#29256;&#26412;&#24211;&#20462;&#35746;&#29256;&#26412;&#24819;&#35937;&#25104;&#19968;&#32452;&#20462;&#25913;(&#19968;&#20123;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#21483;&#20570;<em class="firstterm">&#20462;&#25913;&#38598;</em>)&#65292;&#36890;&#36807;<code class="option">-r</code>&#36873;&#39033;&#65292;&#20320;&#21487;&#20197;&#21578;&#35785;<span class="command"><strong>svn merge</strong></span>&#26469;&#24212;&#29992;&#20462;&#25913;&#38598;&#25110;&#26159;&#19968;&#20010;&#20462;&#25913;&#38598;&#33539;&#22260;&#21040;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#22312;&#25105;&#20204;&#30340;&#24773;&#20917;&#20363;&#23376;&#37324;&#65292;&#25105;&#20204;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#21512;&#24182;&#20462;&#25913;&#38598;#303&#21040;&#24037;&#20316;&#25335;&#36125;&#12290;</p>
        <div class="sidebar"><p class="title"><b>Subversion &#19982;&#20462;&#25913;&#38598;</b></p>
          
          <p>&#27599;&#19968;&#20010;&#20154;&#23545;&#20110;&#8220;<span class="quote">&#20462;&#25913;&#38598;</span>&#8221;&#30340;&#27010;&#24565;&#37117;&#26377;&#20123;&#19981;&#19968;&#26679;&#65292;&#33267;&#23569;&#23545;&#20110;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#8220;<span class="quote">&#20462;&#25913;&#38598;&#29305;&#24615;</span>&#8221;&#36825;&#19968;&#27010;&#24565;&#26377;&#30528;&#19981;&#21516;&#30340;&#26399;&#26395;&#65292;&#26681;&#25454;&#25105;&#20204;&#30340;&#29992;&#36884;&#65292;&#21487;&#20197;&#35828;&#20462;&#25913;&#38598;&#21482;&#26159;&#19968;&#20010;&#26377;&#21807;&#19968;&#21517;&#23383;&#30340;&#19968;&#31995;&#21015;&#20462;&#25913;&#38598;&#21512;&#65292;&#20462;&#25913;&#20063;&#35768;&#21253;&#25324;&#25991;&#20214;&#20869;&#23481;&#30340;&#20462;&#25913;&#65292;&#30446;&#24405;&#26641;&#32467;&#26500;&#30340;&#20462;&#25913;&#65292;&#25110;&#26159;&#20803;&#25968;&#25454;&#30340;&#35843;&#25972;&#65292;&#26356;&#36890;&#24120;&#30340;&#35828;&#27861;&#65292;&#19968;&#20010;&#20462;&#25913;&#38598;&#23601;&#26159;&#25105;&#20204;&#21487;&#20197;&#24341;&#29992;&#30340;&#26377;&#21517;&#23383;&#30340;&#34917;&#19969;&#12290;</p>
          <p>&#22312;Subversion&#37324;&#65292;&#19968;&#20010;&#20840;&#23616;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;N&#26631;&#31034;&#19968;&#20010;&#29256;&#26412;&#24211;&#20013;&#30340;&#26641;&#65306;&#23427;&#20195;&#34920;&#29256;&#26412;&#24211;&#22312;N&#27425;&#25552;&#20132;&#21518;&#30340;&#26679;&#23376;&#65292;&#23427;&#20063;&#26159;&#19968;&#20010;&#20462;&#25913;&#38598;&#30340;&#38544;&#21547;&#21517;&#31216;&#65306;&#22914;&#26524;&#20320;&#27604;&#36739;&#26641;N&#19982;&#26641;N-1&#65292;&#20320;&#21487;&#20197;&#24471;&#21040;&#20320;&#25552;&#20132;&#30340;&#34917;&#19969;&#12290;&#20986;&#20110;&#36825;&#20010;&#21407;&#22240;&#65292;&#24819;&#35937;&#8220;<span class="quote">&#29256;&#26412;N</span>&#8221;&#24182;&#19981;&#21482;&#26159;&#19968;&#26869;&#26641;&#65292;&#20063;&#26159;&#19968;&#20010;&#20462;&#25913;&#38598;&#12290;&#22914;&#26524;&#20320;&#20351;&#29992;&#19968;&#20010;&#38382;&#39064;&#36861;&#36394;&#24037;&#20855;&#26469;&#31649;&#29702;bug&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#29256;&#26412;&#21495;&#26469;&#34920;&#31034;&#29305;&#23450;&#30340;&#34917;&#19969;&#20462;&#27491;&#20102;bug&#8212;&#20030;&#20010;&#20363;&#23376;&#65292;&#8220;<span class="quote">&#36825;&#20010;&#38382;&#39064;&#26159;&#22312;&#29256;&#26412;9238&#20462;&#27491;&#30340;</span>&#8221;&#65292;&#28982;&#21518;&#20854;&#20182;&#20154;&#21487;&#20197;&#36816;&#34892;<span class="command"><strong>svn log -r9238</strong></span>&#26469;&#26597;&#30475;&#20462;&#27491;&#36825;&#20010;bug&#30340;&#20462;&#25913;&#38598;&#65292;&#25110;&#32773;&#20351;&#29992;<span class="command"><strong>svn diff -r9237:9238</strong></span>&#26469;&#30475;&#34917;&#19969;&#26412;&#36523;&#12290;Subversion&#30340;<code class="literal">&#21512;&#24182;</code>&#21629;&#20196;&#20063;&#20351;&#29992;&#29256;&#26412;&#21495;&#20316;&#20026;&#21442;&#25968;&#65292;&#21487;&#20197;&#23558;&#29305;&#23450;&#20462;&#25913;&#38598;&#20174;&#19968;&#20010;&#20998;&#25903;&#21512;&#21040;&#21478;&#19968;&#20010;&#20998;&#25903;&#65306;<span class="command"><strong>svn merge -r9237:9238</strong></span>&#23558;&#20250;&#21512;&#24182;&#20462;&#25913;&#38598;#9238&#21040;&#26412;&#22320;&#25335;&#36125;&#12290;</p>
        </div>
        <p>&#35760;&#20303;&#22238;&#28378;&#20462;&#25913;&#21644;&#20219;&#20309;&#19968;&#20010;<span class="command"><strong>svn merge</strong></span>&#21629;&#20196;&#37117;&#19968;&#26679;&#65292;&#25152;&#20197;&#20320;&#24212;&#35813;&#20351;&#29992;<span class="command"><strong>svn status</strong></span>&#25110;&#26159;<span class="command"><strong>svn diff</strong></span>&#26469;&#30830;&#23450;&#20320;&#30340;&#24037;&#20316;&#22788;&#20110;&#26399;&#26395;&#30340;&#29366;&#24577;&#20013;&#65292;&#28982;&#21518;&#20351;&#29992;<span class="command"><strong>svn commit</strong></span>&#26469;&#25552;&#20132;&#65292;&#25552;&#20132;&#20043;&#21518;&#65292;&#36825;&#20010;&#29305;&#23450;&#20462;&#25913;&#38598;&#19981;&#20250;&#21453;&#26144;&#21040;<code class="literal">HEAD</code>&#29256;&#26412;&#20102;&#12290;</p>
        <p>&#32487;&#32493;&#65292;&#20320;&#20063;&#35768;&#20250;&#24819;&#65306;&#22909;&#21543;&#65292;&#36825;&#19981;&#26159;&#30495;&#30340;&#21462;&#28040;&#25552;&#20132;&#21543;&#65281;&#26159;&#21543;&#65311;&#29256;&#26412;303&#36824;&#20381;&#28982;&#23384;&#22312;&#30528;&#20462;&#25913;&#65292;&#22914;&#26524;&#20219;&#20309;&#20154;&#21462;&#20986;<code class="filename">calc</code>&#30340;303-349&#29256;&#26412;&#65292;&#20182;&#36824;&#20250;&#24471;&#21040;&#38169;&#35823;&#30340;&#20462;&#25913;&#65292;&#23545;&#21543;&#65311;</p>
        <p>&#26159;&#30340;&#65292;&#36825;&#26159;&#23545;&#30340;&#12290;&#24403;&#25105;&#20204;&#35828;&#8220;<span class="quote">&#21024;&#38500;</span>&#8221;&#19968;&#20010;&#20462;&#25913;&#26102;&#65292;&#25105;&#20204;&#21482;&#26159;&#35828;&#20174;<code class="literal">HEAD</code>&#21024;&#38500;&#65292;&#21407;&#22987;&#30340;&#20462;&#25913;&#36824;&#20445;&#23384;&#22312;&#29256;&#26412;&#24211;&#21382;&#21490;&#20013;&#65292;&#22312;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#36825;&#26159;&#36275;&#22815;&#22909;&#30340;&#12290;&#22823;&#22810;&#25968;&#20154;&#21482;&#26159;&#23545;&#36861;&#36394;<code class="literal">HEAD</code>&#29256;&#26412;&#24863;&#20852;&#36259;&#65292;&#22312;&#19968;&#20123;&#29305;&#23450;&#24773;&#20917;&#19979;&#65292;&#20320;&#20063;&#35768;&#24076;&#26395;&#27585;&#25481;&#25152;&#26377;&#25552;&#20132;&#30340;&#35777;&#25454;(&#25110;&#35768;&#26576;&#20010;&#20154;&#25552;&#20132;&#20102;&#19968;&#20010;&#31192;&#23494;&#25991;&#20214;)&#65292;&#36825;&#19981;&#26159;&#24456;&#23481;&#26131;&#30340;&#65292;&#22240;&#20026;Subversion&#35774;&#35745;&#29992;&#26469;&#19981;&#20002;&#22833;&#20219;&#20309;&#20449;&#24687;&#65292;&#27599;&#20010;&#20462;&#35746;&#29256;&#26412;&#37117;&#26159;&#20381;&#36182;&#20854;&#23427;&#20462;&#35746;&#29256;&#26412;&#30340;&#19981;&#21487;&#21464;&#30446;&#24405;&#26641; &#65292;&#20174;&#21382;&#21490;&#21024;&#38500;&#19968;&#20010;&#29256;&#26412;&#20250;&#23548;&#33268;&#22810;&#31859;&#35834;&#25928;&#24212;&#65292;&#20250;&#22312;&#21518;&#38754;&#30340;&#29256;&#26412;&#23548;&#33268;&#28151;&#20081;&#29978;&#33267;&#20250;&#24433;&#21709;&#25152;&#26377;&#30340;&#24037;&#20316;&#25335;&#36125;&#12290; <sup>[<a name="d4e3123" href="#ftn.d4e3123" class="footnote">22</a>]</sup></p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.commonuses.resurrect"></a>&#25214;&#22238;&#21024;&#38500;&#30340;&#39033;&#30446;</h3></div></div></div>
        
        <p>&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#38750;&#24120;&#37325;&#35201;&#30340;&#19968;&#20010;&#29305;&#24615;&#23601;&#26159;&#23427;&#30340;&#20449;&#24687;&#20174;&#19981;&#20002;&#22833;&#65292;&#21363;&#20351;&#24403;&#20320;&#21024;&#38500;&#20102;&#25991;&#20214;&#25110;&#30446;&#24405;&#65292;&#23427;&#20063;&#35768;&#20174;<code class="literal">HEAD</code>&#29256;&#26412;&#28040;&#22833;&#20102; &#65292;&#20294;&#36825;&#20010;&#23545;&#35937;&#20381;&#28982;&#23384;&#22312;&#20110;&#21382;&#21490;&#30340;&#26089;&#26399;&#29256;&#26412; &#65292;&#19968;&#20010;&#26032;&#25163;&#32463;&#24120;&#38382;&#21040;&#30340;&#38382;&#39064;&#26159;&#8220;<span class="quote">&#24590;&#26679;&#25214;&#22238;&#25105;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#65311;</span>&#8221;&#12290;</p>
        <p>&#31532;&#19968;&#27493;&#39318;&#20808;&#35201;&#30693;&#36947;&#38656;&#35201;&#25327;&#25937;&#30340;&#39033;&#30446;&#26159;<span class="bold"><strong>&#20160;&#20040;</strong></span>&#65292;&#36825;&#37324;&#26377;&#20010;&#24456;&#26377;&#29992;&#30340;&#27604;&#21947;&#65306;&#20320;&#21487;&#20197;&#35748;&#20026;&#20219;&#20309;&#23384;&#22312;&#20110;&#29256;&#26412;&#24211;&#30340;&#23545;&#35937;&#29983;&#27963;&#22312;&#19968;&#20010;&#20108;&#32500;&#30340;&#22352;&#26631;&#31995;&#32479;&#37324;&#65292;&#31532;&#19968;&#32500;&#26159;&#19968;&#20010;&#29305;&#23450;&#30340;&#29256;&#26412;&#26641;&#65292;&#31532;&#20108;&#32500;&#26159;&#22312;&#26641;&#20013;&#30340;&#36335;&#24452;&#65292;&#25152;&#20197;&#20320;&#30340;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#20219;&#20309;&#29256;&#26412;&#21487;&#20197;&#36890;&#36807;&#36825;&#26679;&#19968;&#23545;&#22352;&#26631;&#23450;&#20041;&#12290;(&#35760;&#20303;&#24120;&#35265;&#30340;&#8220;<span class="quote">peg&#20462;&#35746;&#29256;&#26412;</span>&#8221;&#35821;&#27861;&#8212; foo.c@224 &#8212; &#22312;&#21069;&#38754;&#30340;<a class="xref" href="svn.advanced.pegrevs.html" title="Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;">&#8220;Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;&#8221;&#19968;&#33410;</a>&#25552;&#21040;&#36807;&#12290; )</p>
        <p>&#39318;&#20808;&#65292;&#20320;&#38656;&#35201;<span class="command"><strong>svn log</strong></span>&#26469;&#23519;&#30475;&#20320;&#38656;&#35201;&#25214;&#22238;&#30340;&#22352;&#26631;&#23545;&#65292;&#19968;&#20010;&#22909;&#30340;&#31574;&#30053;&#26159;&#20351;&#29992;<span class="command"><strong>svn log --verbose</strong></span>&#26469;&#23519;&#30475;&#21253;&#21547;&#21024;&#38500;&#39033;&#30446;&#30340;&#30446;&#24405;&#65292;--verbose&#36873;&#39033;&#26174;&#31034;&#25152;&#26377;&#25913;&#21464;&#30340;&#39033;&#30446;&#30340;&#27599;&#19968;&#20010;&#29256;&#26412; &#65292;&#20320;&#21482;&#38656;&#35201;&#25214;&#20986;&#20320;&#21024;&#38500;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#37027;&#19968;&#20010;&#29256;&#26412;&#12290;&#20320;&#21487;&#20197;&#36890;&#36807;&#30446;&#27979;&#25214;&#20986;&#36825;&#20010;&#29256;&#26412;&#65292;&#20063;&#21487;&#20197;&#20351;&#29992;&#21478;&#19968;&#31181;&#24037;&#20855;&#26469;&#26816;&#26597;&#26085;&#24535;&#30340;&#36755;&#20986; (&#36890;&#36807;<span class="command"><strong>grep</strong></span>&#25110;&#26159;&#22312;&#32534;&#36753;&#22120;&#37324;&#22686;&#37327;&#26597;&#25214;)&#12290;</p>
        <pre class="screen">
$ cd parent-dir
$ svn log -v
&#8230;
------------------------------------------------------------------------
r808 | joe | 2003-12-26 14:29:40 -0600 (Fri, 26 Dec 2003) | 3 lines
Changed paths:
   D /calc/trunk/real.c
   M /calc/trunk/integer.c

Added fast fourier transform functions to integer.c.
Removed real.c because code now in double.c.
&#8230;
</pre>
        <p>&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;&#20320;&#21487;&#20197;&#20551;&#23450;&#20320;&#27491;&#22312;&#25214;&#24050;&#32463;&#21024;&#38500;&#20102;&#30340;&#25991;&#20214;<code class="filename">real.c</code>&#65292;&#36890;&#36807;&#26597;&#25214;&#29238;&#30446;&#24405;&#30340;&#21382;&#21490; &#65292;&#20320;&#30693;&#36947;&#36825;&#20010;&#25991;&#20214;&#22312;808&#29256;&#26412;&#34987;&#21024;&#38500;&#65292;&#25152;&#20197;&#23384;&#22312;&#36825;&#20010;&#23545;&#35937;&#30340;&#29256;&#26412;&#22312;&#27492;&#20043;&#21069; &#12290;&#32467;&#35770;&#65306;&#20320;&#24819;&#20174;&#29256;&#26412;807&#25214;&#22238;<code class="filename">/calc/trunk/real.c</code>&#12290;</p>
        <p>&#20197;&#19978;&#26159;&#26368;&#37325;&#35201;&#30340;&#37096;&#20998;&#8212;&#37325;&#26032;&#25214;&#21040;&#20320;&#38656;&#35201;&#24674;&#22797;&#30340;&#23545;&#35937;&#12290;&#29616;&#22312;&#20320;&#24050;&#32463;&#30693;&#36947;&#35813;&#24674;&#22797;&#30340;&#25991;&#20214;&#65292;&#32780;&#20320;&#26377;&#20004;&#31181;&#36873;&#25321;&#12290;</p>
        <p>&#19968;&#31181;&#26159;&#23545;&#29256;&#26412;&#21453;&#21521;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#21040;808(&#25105;&#20204;&#24050;&#32463;&#23398;&#20250;&#20102;&#22914;&#20309;&#21462;&#28040;&#20462;&#25913;&#65292;&#35265;<a class="xref" href="svn.branchmerge.commonuses.html#svn.branchmerge.commonuses.undo" title="&#21462;&#28040;&#20462;&#25913;">&#8220;&#21462;&#28040;&#20462;&#25913;&#8221;&#19968;&#33410;</a>)&#65292;&#36825;&#26679;&#20250;&#37325;&#26032;&#28155;&#21152;<code class="filename">real.c</code>&#65292;&#36825;&#20010;&#25991;&#20214;&#20250;&#21015;&#20837;&#22686;&#21152;&#30340;&#35745;&#21010;&#65292;&#32463;&#36807;&#19968;&#27425;&#25552;&#20132;&#65292;&#36825;&#20010;&#25991;&#20214;&#37325;&#26032;&#22238;&#21040;<code class="literal">HEAD</code>&#12290;</p>
        <p>&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;&#36825;&#19981;&#26159;&#19968;&#20010;&#22909;&#30340;&#31574;&#30053;&#65292;&#36825;&#26679;&#20570;&#19981;&#20165;&#25226;<code class="filename">real.c</code>&#21152;&#20837;&#28155;&#21152;&#21040;&#35745;&#21010;&#65292;&#20063;&#21462;&#28040;&#20102;&#23545;<code class="filename">integer.c</code>&#30340;&#20462;&#25913;&#65292;&#32780;&#36825;&#19981;&#26159;&#20320;&#26399;&#26395;&#30340;&#12290;&#30830;&#23454;&#65292;&#20320;&#21487;&#20197;&#24674;&#22797;&#21040;&#29256;&#26412;808&#65292;&#28982;&#21518;&#23545;<code class="filename">integer.c</code>&#25191;&#34892;&#21462;&#28040;<span class="command"><strong>svn revert</strong></span>&#25805;&#20316;&#65292;&#20294;&#36825;&#26679;&#30340;&#25805;&#20316;&#26080;&#27861;&#25193;&#22823;&#20351;&#29992;&#65292;&#22240;&#20026;&#22914;&#26524;&#20174;&#29256;&#26412;808&#20462;&#25913;&#20102;90&#20010;&#25991;&#20214;&#24590;&#20040;&#21150;&#65311;</p>
        <p>&#25152;&#20197;&#31532;&#20108;&#20010;&#26041;&#27861;&#19981;&#26159;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#65292;&#32780;&#26159;&#20351;&#29992;<span class="command"><strong>svn copy</strong></span>&#21629;&#20196;&#65292;&#31934;&#30830;&#30340;&#25335;&#36125;&#29256;&#26412;&#21644;&#36335;&#24452;&#8220;<span class="quote">&#22352;&#26631;&#23545;</span>&#8221;&#21040;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65306;</p>
        <pre class="screen">
$ svn copy -r 807 \
           http://svn.example.com/repos/calc/trunk/real.c ./real.c

$ svn status
A  +   real.c

$ svn commit -m "Resurrected real.c from revision 807, /calc/trunk/real.c."
Adding         real.c
Transmitting file data .
Committed revision 1390.
</pre>
        <p>&#21152;&#21495;&#26631;&#24535;&#34920;&#26126;&#36825;&#20010;&#39033;&#30446;&#19981;&#20165;&#20165;&#26159;&#35745;&#21010;&#22686;&#21152;&#20013;&#65292;&#32780;&#19988;&#36824;&#21253;&#21547;&#20102;&#21382;&#21490;&#65292;Subversion&#35760;&#20303;&#20102;&#23427;&#26159;&#20174;&#21738;&#20010;&#25335;&#36125;&#36807;&#26469;&#30340;&#12290;&#22312;&#23558;&#26469;&#65292;&#23545;&#36825;&#20010;&#25991;&#20214;&#36816;&#34892;<span class="command"><strong>svn log</strong></span>&#20250;&#30475;&#21040;&#36825;&#20010;&#25991;&#20214;&#22312;&#29256;&#26412;807&#20043;&#21069;&#30340;&#21382;&#21490;&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;<code class="filename">real.c</code>&#19981;&#26159;&#26032;&#30340;&#65292;&#32780;&#26159;&#21407;&#20808;&#21024;&#38500;&#30340;&#37027;&#19968;&#20010;&#30340;&#21518;&#20195;&#12290;</p>
        <p>&#23613;&#31649;&#25105;&#20204;&#30340;&#20363;&#23376;&#21578;&#35785;&#25105;&#20204;&#22914;&#20309;&#25214;&#22238;&#25991;&#20214;&#65292;&#23545;&#20110;&#24674;&#22797;&#21024;&#38500;&#30340;&#30446;&#24405;&#20063;&#26159;&#19968;&#26679;&#30340;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.commonuses.patterns"></a>&#24120;&#29992;&#20998;&#25903;&#27169;&#24335;</h3></div></div></div>
        
        <p>&#29256;&#26412;&#25511;&#21046;&#22312;&#36719;&#20214;&#24320;&#21457;&#20013;&#24191;&#27867;&#20351;&#29992;&#65292;&#36825;&#37324;&#26159;&#22242;&#38431;&#37324;&#31243;&#24207;&#21592;&#26368;&#24120;&#29992;&#30340;&#20004;&#31181;&#20998;&#25903;/&#21512;&#24182;&#27169;&#24335;&#30340;&#20171;&#32461;&#65292;&#22914;&#26524;&#20320;&#19981;&#26159;&#20351;&#29992;Subversion&#36719;&#20214;&#24320;&#21457;&#65292;&#21487;&#38543;&#24847;&#36339;&#36807;&#26412;&#23567;&#33410;&#65292;&#22914;&#26524;&#20320;&#26159;&#31532;&#19968;&#27425;&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#30340;&#36719;&#20214;&#24320;&#21457;&#32773;&#65292;&#35831;&#26356;&#21152;&#27880;&#24847;&#65292;&#20197;&#19979;&#27169;&#24335;&#34987;&#35768;&#22810;&#32769;&#20853;&#24403;&#20316;&#26368;&#20339;&#23454;&#36341;&#65292;&#36825;&#20010;&#36807;&#31243;&#24182;&#19981;&#21482;&#26159;&#38024;&#23545;Subversion&#65292;&#22312;&#20219;&#20309;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#37117;&#19968;&#26679;&#65292;&#20294;&#26159;&#22312;&#36825;&#37324;&#20351;&#29992;Subversion&#26415;&#35821;&#20250;&#24863;&#35273;&#26356;&#26041;&#20415;&#19968;&#28857;&#12290;</p>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.branchmerge.commonuses.patterns.release"></a>&#21457;&#24067;&#20998;&#25903;</h4></div></div></div>
          
          <p>&#22823;&#22810;&#25968;&#36719;&#20214;&#23384;&#22312;&#36825;&#26679;&#19968;&#20010;&#29983;&#21629;&#21608;&#26399;&#65306;&#32534;&#30721;&#12289;&#27979;&#35797;&#12289;&#21457;&#24067;&#65292;&#28982;&#21518;&#37325;&#22797;&#12290;&#36825;&#26679;&#26377;&#20004;&#20010;&#38382;&#39064;&#65292;&#31532;&#19968;&#65292;&#24320;&#21457;&#32773;&#38656;&#35201;&#22312;&#36136;&#37327;&#20445;&#35777;&#23567;&#32452;&#27979;&#35797;&#20551;&#23450;&#31283;&#23450;&#29256;&#26412;&#26102;&#32487;&#32493;&#24320;&#21457;&#26032;&#29305;&#24615;&#65292;&#26032;&#24037;&#20316;&#22312;&#36719;&#20214;&#27979;&#35797;&#26102;&#19981;&#21487;&#20197;&#20013;&#26029;&#65292;&#31532;&#20108;&#65292;&#23567;&#32452;&#24517;&#39035;&#19968;&#30452;&#25903;&#25345;&#32769;&#30340;&#21457;&#24067;&#29256;&#26412;&#21644;&#36719;&#20214;&#65307;&#22914;&#26524;&#19968;&#20010;bug&#22312;&#26368;&#26032;&#30340;&#20195;&#30721;&#20013;&#21457;&#29616;&#65292;&#23427;&#19968;&#23450;&#20063;&#23384;&#22312;&#24050;&#21457;&#24067;&#30340;&#29256;&#26412;&#20013;&#65292;&#23458;&#25143;&#24076;&#26395;&#31435;&#21051;&#24471;&#21040;&#38169;&#35823;&#20462;&#27491;&#32780;&#19981;&#24517;&#31561;&#21040;&#26032;&#29256;&#26412;&#21457;&#24067;&#12290;</p>
          <p>&#36825;&#26159;&#29256;&#26412;&#25511;&#21046;&#21487;&#20197;&#20570;&#30340;&#24110;&#21161;&#65292;&#20856;&#22411;&#30340;&#36807;&#31243;&#22914;&#19979;&#65306;</p>
          <div class="itemizedlist"><ul type="disc"><li>
              <p><span class="emphasis"><em>&#24320;&#21457;&#32773;&#25552;&#20132;&#25152;&#26377;&#30340;&#26032;&#29305;&#24615;&#21040;&#20027;&#24178;&#12290;</em></span> &#27599;&#26085;&#30340;&#20462;&#25913;&#25552;&#20132;&#21040;<code class="filename">/trunk</code>&#65306;&#26032;&#29305;&#24615;&#65292;bug&#20462;&#27491;&#21644;&#20854;&#20182;&#12290;</p>
            </li><li>
              <p><span class="emphasis"><em>&#36825;&#20010;&#20027;&#24178;&#34987;&#25335;&#36125;&#21040;&#8220;<span class="quote">&#21457;&#24067;</span>&#8221;&#20998;&#25903;&#12290;</em></span> &#24403;&#23567;&#32452;&#35748;&#20026;&#36719;&#20214;&#24050;&#32463;&#20570;&#22909;&#21457;&#24067;&#30340;&#20934;&#22791;(&#22914;&#65292;&#29256;&#26412;1.0)&#28982;&#21518;<code class="filename">/trunk</code>&#20250;&#34987;&#25335;&#36125;&#21040;<code class="filename">/branches/1.0</code>&#12290;</p>
            </li><li>
              <p><span class="emphasis"><em>&#39033;&#30446;&#32452;&#32487;&#32493;&#24182;&#34892;&#24037;&#20316;&#65292;</em></span>&#19968;&#20010;&#23567;&#32452;&#24320;&#22987;&#23545;&#20998;&#25903;&#36827;&#34892;&#20005;&#37239;&#30340;&#27979;&#35797;&#65292;&#21516;&#26102;&#21478;&#19968;&#20010;&#23567;&#32452;&#22312;<code class="filename">/trunk</code>&#32487;&#32493;&#26032;&#30340;&#24037;&#20316;(&#22914;&#65292;&#20934;&#22791;2.0)&#65292;&#22914;&#26524;&#19968;&#20010;bug&#22312;&#20219;&#20309;&#19968;&#20010;&#20301;&#32622;&#34987;&#21457;&#29616;&#65292;&#38169;&#35823;&#20462;&#27491;&#38656;&#35201;&#26469;&#22238;&#36816;&#36865;&#12290;&#28982;&#32780;&#36825;&#20010;&#36807;&#31243;&#26377;&#26102;&#20505;&#20063;&#20250;&#32467;&#26463;&#65292;&#20363;&#22914;&#20998;&#25903;&#24050;&#32463;&#20026;&#21457;&#24067;&#21069;&#30340;&#26368;&#32456;&#27979;&#35797;&#8220;<span class="quote">&#20572;&#28382;</span>&#8221;&#20102;&#12290;</p>
            </li><li>
              <p><span class="emphasis"><em>&#20998;&#25903;&#24050;&#32463;&#20316;&#20102;&#26631;&#31614;&#24182;&#19988;&#21457;&#24067;&#65292;</em></span>&#24403;&#27979;&#35797;&#32467;&#26463;&#65292;<code class="filename">/branches/1.0</code>&#20316;&#20026;&#24341;&#29992;&#24555;&#29031;&#24050;&#32463;&#25335;&#36125;&#21040;<code class="filename">/tags/1.0.0</code>&#65292;&#36825;&#20010;&#26631;&#31614;&#34987;&#25171;&#21253;&#21457;&#24067;&#32473;&#23458;&#25143;&#12290;</p>
            </li><li>
              <p><span class="emphasis"><em>&#20998;&#25903;&#22810;&#27425;&#32500;&#25252;&#12290;</em></span>&#24403;&#32487;&#32493;&#22312;<code class="filename">/trunk</code>&#19978;&#20026;&#29256;&#26412;2.0&#24037;&#20316;&#65292;bug&#20462;&#27491;&#32487;&#32493;&#20174;<code class="filename">/trunk</code>&#36816;&#36865;&#21040;<code class="filename">/branches/1.0</code>&#65292;&#22914;&#26524;&#31215;&#32047;&#20102;&#36275;&#22815;&#30340;bug&#20462;&#27491;&#65292;&#31649;&#29702;&#37096;&#38376;&#20915;&#23450;&#21457;&#24067;1.0.1&#29256;&#26412;&#65306;&#25335;&#36125;<code class="filename">/branches/1.0</code>&#21040;<code class="filename">/tags/1.0.1</code>&#65292;&#26631;&#31614;&#34987;&#25171;&#21253;&#21457;&#24067;&#12290;</p>
            </li></ul></div>
          <p>&#25972;&#20010;&#36807;&#31243;&#38543;&#30528;&#36719;&#20214;&#30340;&#25104;&#29087;&#19981;&#26029;&#37325;&#22797;&#65306;&#24403;2.0&#23436;&#25104;&#65292;&#19968;&#20010;&#26032;&#30340;2.0&#20998;&#25903;&#34987;&#21019;&#24314;&#65292;&#27979;&#35797;&#12289;&#25171;&#26631;&#31614;&#21644;&#26368;&#32456;&#21457;&#24067;&#65292;&#32463;&#36807;&#35768;&#22810;&#24180;&#65292;&#29256;&#26412;&#24211;&#32467;&#26463;&#20102;&#35768;&#22810;&#29256;&#26412;&#21457;&#24067;&#65292;&#36827;&#20837;&#20102;&#8220;<span class="quote">&#32500;&#25252;</span>&#8221;&#27169;&#24335;&#65292;&#35768;&#22810;&#26631;&#31614;&#20195;&#34920;&#20102;&#26368;&#32456;&#30340;&#21457;&#24067;&#29256;&#26412;&#12290;</p>
        </div>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.branchmerge.commonuses.patterns.feature"></a>&#29305;&#24615;&#20998;&#25903;</h4></div></div></div>
          
          <p>&#19968;&#20010;<em class="firstterm">&#29305;&#24615;&#20998;&#25903;</em>&#26159;&#26412;&#31456;&#20013;&#37027;&#20010;&#37325;&#35201;&#20363;&#23376;&#20013;&#30340;&#20998;&#25903;&#65292;&#20320;&#27491;&#22312;&#37027;&#20010;&#20998;&#25903;&#19978;&#24037;&#20316;&#65292;&#32780;Sally&#36824;&#22312;<code class="filename">/trunk</code>&#32487;&#32493;&#24037;&#20316;&#65292;&#36825;&#26159;&#19968;&#20010;&#20020;&#26102;&#20998;&#25903;&#65292;&#29992;&#26469;&#20316;&#22797;&#26434;&#30340;&#20462;&#25913;&#32780;&#19981;&#20250;&#24178;&#25200;<code class="filename">/trunk</code>&#30340;&#31283;&#23450;&#24615;&#65292;&#19981;&#35937;&#21457;&#24067;&#20998;&#25903;(&#20063;&#35768;&#35201;&#27704;&#36828;&#25903;&#25345;)&#65292;&#29305;&#24615;&#20998;&#25903;&#20986;&#29983;&#65292;&#20351;&#29992;&#20102;&#19968;&#27573;&#26102;&#38388;&#65292;&#21512;&#24182;&#21040;&#20027;&#24178;&#65292;&#28982;&#21518;&#26368;&#32456;&#34987;&#21024;&#38500;&#25481;&#65292;&#23427;&#20204;&#22312;&#26377;&#38480;&#30340;&#26102;&#38388;&#37324;&#26377;&#29992;&#12290;</p>
          <p>&#36824;&#26377;&#65292;&#20851;&#20110;&#26159;&#21542;&#21019;&#24314;&#29305;&#24615;&#20998;&#25903;&#30340;&#39033;&#30446;&#25919;&#31574;&#20063;&#21464;&#21270;&#24191;&#27867;&#65292;&#19968;&#20123;&#39033;&#30446;&#27704;&#36828;&#19981;&#20351;&#29992;&#29305;&#24615;&#20998;&#25903;&#65306;&#22823;&#23478;&#37117;&#21487;&#20197;&#25552;&#20132;&#21040;<code class="filename">/trunk</code>&#65292;&#22909;&#22788;&#26159;&#31995;&#32479;&#30340;&#31616;&#21333;&#8212;&#27809;&#26377;&#20154;&#38656;&#35201;&#30693;&#36947;&#20998;&#25903;&#21644;&#21512;&#24182;&#65292;&#22351;&#22788;&#26159;&#20027;&#24178;&#20250;&#32463;&#24120;&#19981;&#31283;&#23450;&#25110;&#32773;&#19981;&#21487;&#29992;&#65292;&#21478;&#22806;&#19968;&#20123;&#39033;&#30446;&#20351;&#29992;&#20998;&#25903;&#36798;&#21040;&#26497;&#38480;&#65306;&#27809;&#26377;&#20462;&#25913;<span class="emphasis"><em>&#26366;&#32463;</em></span>&#30452;&#25509;&#25552;&#20132;&#21040;&#20027;&#24178;&#65292;&#21363;&#20351;&#26368;&#32454;&#23567;&#30340;&#20462;&#25913;&#37117;&#35201;&#21019;&#24314;&#30701;&#26242;&#30340;&#20998;&#25903;&#65292;&#28982;&#21518;&#23567;&#24515;&#30340;&#23457;&#26680;&#21512;&#24182;&#21040;&#20027;&#24178;&#65292;&#28982;&#21518;&#21024;&#38500;&#20998;&#25903;&#65292;&#36825;&#26679;&#31995;&#32479;&#20445;&#25345;&#20027;&#24178;&#19968;&#30452;&#31283;&#23450;&#21644;&#21487;&#29992;&#65292;&#20294;&#26159;&#36896;&#25104;&#20102;&#24040;&#22823;&#30340;&#36127;&#25285;&#12290;</p>
          <p>&#35768;&#22810;&#39033;&#30446;&#37319;&#29992;&#25240;&#20013;&#30340;&#26041;&#24335;&#65292;&#22362;&#25345;&#27599;&#27425;&#32534;&#35793;<code class="filename">/trunk</code>&#24182;&#36827;&#34892;&#22238;&#24402;&#27979;&#35797;&#65292;&#21482;&#26377;&#38656;&#35201;&#22810;&#27425;&#19981;&#31283;&#23450;&#25552;&#20132;&#26102;&#25165;&#38656;&#35201;&#19968;&#20010;&#29305;&#24615;&#20998;&#25903;&#65292;&#36825;&#20010;&#35268;&#21017;&#21487;&#20197;&#29992;&#36825;&#26679;&#19968;&#20010;&#38382;&#39064;&#26816;&#39564;&#65306;&#22914;&#26524;&#24320;&#21457;&#32773;&#22312;&#22909;&#20960;&#22825;&#37324;&#29420;&#31435;&#24037;&#20316;&#65292;&#19968;&#27425;&#25552;&#20132;&#22823;&#37327;&#20462;&#25913;(&#36825;&#26679;<code class="filename">/trunk</code>&#23601;&#19981;&#20250;&#19981;&#31283;&#23450;&#12290;)&#65292;&#26159;&#21542;&#20250;&#26377;&#22826;&#22810;&#30340;&#20462;&#25913;&#35201;&#26469;&#22238;&#39038;&#65311;&#22914;&#26524;&#31572;&#26696;&#26159;&#8220;<span class="quote">&#26159;</span>&#8221;&#65292;&#36825;&#20123;&#20462;&#25913;&#24212;&#35813;&#22312;&#29305;&#24615;&#20998;&#25903;&#19978;&#36827;&#34892;&#65292;&#22240;&#20026;&#24320;&#21457;&#32773;&#22686;&#37327;&#30340;&#25552;&#20132;&#20462;&#25913;&#65292;&#20320;&#21487;&#20197;&#23481;&#26131;&#30340;&#22238;&#22836;&#26816;&#26597;&#12290;</p>
          <p>&#26368;&#32456;&#65292;&#26377;&#19968;&#20010;&#38382;&#39064;&#23601;&#26159;&#24590;&#26679;&#20445;&#25345;&#19968;&#20010;&#29305;&#24615;&#20998;&#25903;&#8220;<span class="quote">&#21516;&#27493;</span>&#8221;&#20110;&#24037;&#20316;&#20013;&#30340;&#20027;&#24178;&#65292;&#22312;&#21069;&#38754;&#25552;&#21040;&#36807;&#65292;&#22312;&#19968;&#20010;&#20998;&#25903;&#19978;&#24037;&#20316;&#25968;&#21608;&#25110;&#20960;&#20010;&#26376;&#26159;&#24456;&#26377;&#39118;&#38505;&#30340;&#65292;&#20027;&#24178;&#30340;&#20462;&#25913;&#20063;&#35768;&#20250;&#25345;&#32493;&#28044;&#20837;&#65292;&#22240;&#20026;&#36825;&#19968;&#28857;&#65292;&#20004;&#26465;&#32447;&#30340;&#24320;&#21457;&#20250;&#21306;&#21035;&#24040;&#22823;&#65292;&#21512;&#24182;&#20998;&#25903;&#22238;&#21040;&#20027;&#24178;&#20250;&#25104;&#20026;&#19968;&#20010;&#22121;&#26790;&#12290;</p>
          <p>&#36825;&#31181;&#24773;&#20917;&#26368;&#22909;&#36890;&#36807;&#26377;&#35268;&#24459;&#30340;&#23558;&#20027;&#24178;&#21512;&#24182;&#21040;&#20998;&#25903;&#26469;&#36991;&#20813;&#65292;&#21046;&#23450;&#36825;&#26679;&#19968;&#20010;&#25919;&#31574;&#65306;&#27599;&#21608;&#23558;&#19978;&#21608;&#30340;&#20462;&#25913;&#21512;&#24182;&#21040;&#20998;&#25903;&#65292;&#27880;&#24847;&#36825;&#26679;&#20570;&#26102;&#38656;&#35201;&#23567;&#24515;&#65292;&#38656;&#35201;&#25163;&#24037;&#35760;&#24405;&#21512;&#24182;&#30340;&#36807;&#31243;&#65292;&#20197;&#36991;&#20813;&#37325;&#22797;&#30340;&#21512;&#24182;(&#22312;<a class="xref" href="svn.branchmerge.copychanges.html#svn.branchmerge.copychanges.bestprac.track" title="&#25163;&#24037;&#36319;&#36394;&#21512;&#24182;">&#8220;&#25163;&#24037;&#36319;&#36394;&#21512;&#24182;&#8221;&#19968;&#33410;</a>&#25551;&#36848;&#36807;)&#65292;&#20320;&#38656;&#35201;&#23567;&#24515;&#30340;&#25776;&#20889;&#21512;&#24182;&#30340;&#26085;&#24535;&#20449;&#24687;&#65292;&#31934;&#30830;&#30340;&#25551;&#36848;&#21512;&#24182;&#21253;&#25324;&#30340;&#33539;&#22260;(&#22312;<a class="xref" href="svn.branchmerge.commonuses.html#svn.branchmerge.commonuses.wholebr" title="&#21512;&#24182;&#20998;&#25903;&#21040;&#21478;&#19968;&#20998;&#25903;">&#8220;&#21512;&#24182;&#20998;&#25903;&#21040;&#21478;&#19968;&#20998;&#25903;&#8221;&#19968;&#33410;</a>&#20013;&#25551;&#36848;&#36807;)&#65292;&#36825;&#30475;&#36215;&#26469;&#20687;&#26159;&#32961;&#36843;&#65292;&#21487;&#26159;&#23454;&#38469;&#19978;&#26159;&#23481;&#26131;&#20570;&#21040;&#30340;&#12290;</p>
          <p>&#22312;&#19968;&#20123;&#26102;&#20505;&#65292;&#20320;&#24050;&#32463;&#20934;&#22791;&#22909;&#20102;&#23558;&#8220;<span class="quote">&#21516;&#27493;&#30340;</span>&#8221;&#29305;&#24615;&#20998;&#25903;&#21512;&#24182;&#22238;&#21040;&#20027;&#24178;&#65292;&#20026;&#27492;&#65292;&#24320;&#22987;&#20570;&#19968;&#27425;&#23558;&#20027;&#24178;&#26368;&#26032;&#20462;&#25913;&#21644;&#20998;&#25903;&#30340;&#26368;&#32456;&#21512;&#24182;&#65292;&#36825;&#26679;&#20197;&#21518;&#65292;&#38500;&#20102;&#20320;&#30340;&#20998;&#25903;&#20462;&#25913;&#30340;&#37096;&#20998;&#65292;&#26368;&#26032;&#30340;&#20998;&#25903;&#21644;&#20027;&#24178;&#23558;&#20250;&#32477;&#23545;&#19968;&#33268;&#65292;&#25152;&#20197;&#22312;&#36825;&#20010;&#29305;&#21035;&#30340;&#20363;&#23376;&#37324;&#65292;&#20320;&#20250;&#36890;&#36807;&#30452;&#25509;&#27604;&#36739;&#20998;&#25903;&#21644;&#20027;&#24178;&#26469;&#36827;&#34892;&#21512;&#24182;&#65306;</p>
          <pre class="screen">
$ cd trunk-working-copy

$ svn update
At revision 1910.

$ svn merge http://svn.example.com/repos/calc/trunk@1910 \
            http://svn.example.com/repos/calc/branches/mybranch@1910
U  real.c
U  integer.c
A  newdirectory
A  newdirectory/newfile
&#8230;
</pre>
          <p>&#36890;&#36807;&#27604;&#36739;<code class="literal">HEAD</code>&#20462;&#35746;&#29256;&#26412;&#30340;&#20027;&#24178;&#21644;<code class="literal">HEAD</code>&#20462;&#35746;&#29256;&#26412;&#30340;&#20998;&#25903;&#65292;&#20320;&#30830;&#23450;&#20102;&#21482;&#22312;&#20998;&#25903;&#19978;&#30340;&#22686;&#37327;&#20449;&#24687;&#65292;&#20004;&#26465;&#24320;&#21457;&#32447;&#37117;&#26377;&#20102;&#20998;&#26525;&#30340;&#20462;&#25913;&#12290;</p>
          <p>&#21487;&#20197;&#29992;&#21478;&#19968;&#31181;&#32771;&#34385;&#36825;&#31181;&#27169;&#24335;&#65292;&#20320;&#27599;&#21608;&#25353;&#26102;&#21516;&#27493;&#20998;&#25903;&#21040;&#20027;&#24178;&#65292;&#31867;&#20284;&#20110;&#22312;&#24037;&#20316;&#25335;&#36125;&#25191;&#34892;<span class="command"><strong>svn update</strong></span>&#30340;&#21629;&#20196;&#65292;&#26368;&#32456;&#30340;&#21512;&#24182;&#25805;&#20316;&#31867;&#20284;&#20110;&#22312;&#24037;&#20316;&#25335;&#36125;&#36816;&#34892;<span class="command"><strong>svn commit</strong></span>&#65292;&#27605;&#31455;&#65292;&#24037;&#20316;&#25335;&#36125;&#19981;&#23601;&#26159;&#19968;&#20010;&#38750;&#24120;&#27973;&#30340;&#20998;&#25903;&#21527;&#65311;&#21482;&#26159;&#23427;&#19968;&#27425;&#21482;&#21487;&#20197;&#20445;&#23384;&#19968;&#20010;&#20462;&#25913;&#12290;</p>
        </div>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e3123" href="#d4e3123" class="para">22</a>] </sup>Subversion&#39033;&#30446;&#26377;&#35745;&#21010;&#65292;&#19981;&#31649;&#29992;&#20160;&#20040;&#26041;&#24335;&#65292;&#20250;&#26377;&#19968;&#22825;&#35201;&#23454;&#29616;<span class="command"><strong>svnadmin obliterate</strong></span>&#21629;&#20196;&#26469;&#36827;&#34892;&#27704;&#20037;&#21024;&#38500;&#25805;&#20316;&#65292;&#32780;&#27492;&#26102;&#21487;&#20197;&#30475;<a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.tk.svndumpfilter" title="svndumpfilter">&#8220;svndumpfilter&#8221;&#19968;&#33410;</a>&#25214;&#21040;&#21487;&#34892;&#30340;&#26041;&#26696;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.copychanges.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.branchmerge.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.switchwc.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#22312;&#20998;&#25903;&#38388;&#22797;&#21046;&#20462;&#25913;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#20351;&#29992;&#20998;&#25903;</td></tr></table></div></body></html>