<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="svn.advanced.externals.html" title="&#22806;&#37096;&#23450;&#20041;"><link rel="next" href="svn.serverconfig.netmodel.html" title="&#32593;&#32476;&#27169;&#22411;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.advanced.externals.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.serverconfig.netmodel.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.pegrevs"></a>Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;</h2></div></div></div>
      
      <p>&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#25335;&#36125;&#12289;&#25913;&#21517;&#21644;&#31227;&#21160;&#33021;&#21147;&#20351;&#20320;&#21487;&#20197;&#21019;&#24314;&#19968;&#20010;&#39033;&#30446;&#65292;&#28982;&#21518;&#21024;&#38500;&#23427;&#65292;&#28982;&#21518;&#22312;&#21516;&#19968;&#20010;&#20301;&#32622;&#28155;&#21152;&#19968;&#20010;&#26032;&#30340;&#8212;&#36825;&#26159;&#22312;&#25105;&#20204;&#30340;&#35745;&#31639;&#26426;&#20013;&#32463;&#24120;&#21457;&#29983;&#30340;&#25805;&#20316;&#65292;&#32780;&#20320;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#19981;&#24212;&#35813;&#25104;&#20026;&#20320;&#36825;&#26679;&#25805;&#20316;&#30340;&#38556;&#30861;&#12290;Subversion&#30340;&#25991;&#20214;&#31649;&#29702;&#25805;&#20316;&#26159;&#36825;&#26679;&#30340;&#24320;&#25918;&#65292;&#25552;&#20379;&#20102;&#20960;&#20046;&#21644;&#26222;&#36890;&#25991;&#20214;&#19968;&#26679;&#30340;&#25805;&#20316;&#29256;&#26412;&#21270;&#25991;&#20214;&#30340;&#28789;&#27963;&#24615;&#65292;&#20294;&#26159;&#28789;&#27963;&#24847;&#21619;&#30528;&#22312;&#25972;&#20010;&#29256;&#26412;&#24211;&#30340;&#29983;&#21629;&#21608;&#26399;&#20013;&#65292;&#19968;&#20010;&#32473;&#23450;&#30340;&#29256;&#26412;&#21270;&#30340;&#36164;&#28304;&#21487;&#33021;&#20250;&#20986;&#29616;&#22312;&#35768;&#22810;&#19981;&#21516;&#30340;&#36335;&#24452;&#65292;&#19968;&#20010;&#32473;&#23450;&#30340;&#36335;&#24452;&#20250;&#23637;&#31034;&#32473;&#25105;&#20204;&#35768;&#22810;&#23436;&#20840;&#19981;&#21516;&#30340;&#29256;&#26412;&#21270;&#36164;&#28304;&#12290;&#24403;&#28982;&#36825;&#20123;&#21151;&#33021;&#20063;&#22686;&#21152;&#20102;&#20320;&#19982;&#36825;&#20123;&#36335;&#24452;&#21644;&#36164;&#28304;&#20132;&#20114;&#30340;&#38590;&#24230;&#12290;</p>
      <p>Subversion&#21487;&#20197;&#38750;&#24120;&#32874;&#26126;&#30340;&#27880;&#24847;&#21040;&#19968;&#20010;&#23545;&#35937;&#30340;&#21253;&#25324;&#19968;&#20010;&#8220;<span class="quote">&#22320;&#22336;&#25913;&#21464;</span>&#8221;&#21382;&#21490;&#21464;&#21270;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#22914;&#26524;&#20320;&#35810;&#38382;&#19968;&#20010;&#26366;&#32463;&#19978;&#21608;&#25913;&#36807;&#21517;&#30340;&#25991;&#20214;&#30340;&#25152;&#26377;&#30340;&#26085;&#24535;&#20449;&#24687;&#65292;Subversion&#20250;&#24456;&#39640;&#20852;&#25552;&#20379;&#25152;&#26377;&#30340;&#26085;&#24535;&#8212;&#37325;&#21629;&#21517;&#21457;&#29983;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#22806;&#21152;&#30456;&#20851;&#29256;&#26412;&#20043;&#21069;&#21644;&#20043;&#21518;&#30340;&#20462;&#35746;&#29256;&#26412;&#26085;&#24535;&#65292;&#25152;&#20197;&#22823;&#22810;&#25968;&#26102;&#38388;&#37324;&#65292;&#20320;&#19981;&#38656;&#35201;&#32771;&#34385;&#36825;&#20123;&#20107;&#24773;&#65292;&#20294;&#26159;&#20598;&#23572;&#65292;Subversion&#20250;&#38656;&#35201;&#20320;&#30340;&#24110;&#21161;&#26469;&#28165;&#38500;&#28151;&#28102;&#12290;</p>
      <p>&#36825;&#20010;&#26368;&#31616;&#21333;&#30340;&#20363;&#23376;&#21457;&#29983;&#22312;&#24403;&#19968;&#20010;&#30446;&#24405;&#25110;&#32773;&#25991;&#20214;&#20174;&#29256;&#26412;&#25511;&#21046;&#20013;&#21024;&#38500;&#26102;&#65292;&#28982;&#21518;&#19968;&#20010;&#26032;&#30340;&#21516;&#26679;&#21517;&#23383;&#30446;&#24405;&#25110;&#32773;&#25991;&#20214;&#28155;&#21152;&#21040;&#29256;&#26412;&#25511;&#21046;&#65292;&#26174;&#28982;&#20320;&#21024;&#38500;&#30340;&#21644;&#20320;&#21518;&#26469;&#28155;&#21152;&#30340;&#19981;&#26159;&#21516;&#26679;&#30340;&#19996;&#35199;&#65292;&#23427;&#20204;&#20165;&#20165;&#26159;&#26377;&#21516;&#26679;&#30340;&#36335;&#24452;&#65292;&#20363;&#22914;<code class="filename">/trunk/object</code>&#12290;&#20160;&#20040;&#65292;&#36825;&#24847;&#21619;&#30528;&#35810;&#38382;Subversion&#26469;&#26597;&#30475;<code class="filename">/trunk/object</code>&#30340;&#21382;&#21490;&#65311;&#20320;&#26159;&#35810;&#38382;&#24403;&#21069;&#36825;&#20010;&#20301;&#32622;&#30340;&#19996;&#35199;&#36824;&#26159;&#20320;&#22312;&#36825;&#20010;&#20301;&#32622;&#21024;&#38500;&#30340;&#37027;&#20010;&#23545;&#35937;&#65311;&#20320;&#26159;&#24076;&#26395;&#35810;&#38382;&#23545;&#36825;&#20010;&#23545;&#35937;&#30340;&#25152;&#26377;&#25805;&#20316;&#36824;&#26159;&#36825;&#20010;&#36335;&#24452;&#30340;&#25152;&#26377;&#23545;&#35937;&#65311;&#24456;&#26126;&#26174;&#65292;Subversion&#38656;&#35201;&#32447;&#32034;&#30693;&#36947;&#20320;&#30495;&#23454;&#30340;&#24819;&#27861;&#12290;</p>
      <p>&#30001;&#20110;&#31227;&#21160;&#65292;&#29256;&#26412;&#21270;&#23545;&#35937;&#30340;&#21382;&#21490;&#20250;&#21464;&#24471;&#38750;&#24120;&#25197;&#26354;&#12290;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#20250;&#26377;&#19968;&#20010;&#30446;&#24405;&#21483;&#20570;<code class="filename">concept</code>&#65292;&#20445;&#23384;&#20102;&#19968;&#20123;&#20320;&#29992;&#26469;&#35797;&#39564;&#30340;&#21021;&#29983;&#30340;&#36719;&#20214;&#39033;&#30446;&#65292;&#26368;&#32456;&#65292;&#36825;&#20010;&#39033;&#30446;&#21464;&#24471;&#36275;&#22815;&#25104;&#29087;&#65292;&#35828;&#26126;&#36825;&#20010;&#27880;&#24847;&#30830;&#23454;&#38656;&#35201;&#19968;&#20123;&#32709;&#33152;&#20102;&#65292;&#25152;&#20197;&#20320;&#20915;&#23450;&#32473;&#36825;&#20010;&#39033;&#30446;&#19968;&#20010;&#21517;&#23383;&#12290; <sup>[<a name="d4e2432" href="#ftn.d4e2432" class="footnote">18</a>]</sup>&#20551;&#23450;&#20320;&#21483;&#20320;&#30340;&#36719;&#20214;&#20026;Frabnaggilywort&#65292;&#27492;&#21051;&#65292;&#25226;&#20320;&#30340;&#30446;&#24405;&#21629;&#21517;&#20026;&#21453;&#26144;&#39033;&#30446;&#21517;&#31216;&#30340;&#21517;&#23383;&#26159;&#26377;&#24847;&#20041;&#30340;&#65292;&#25152;&#20197;<code class="filename">concept</code>&#25913;&#21517;&#20026;<code class="filename">frabnaggilywort</code>&#12290;&#29983;&#27963;&#36824;&#22312;&#32487;&#32493;&#65292;Frabnaggilywort&#21457;&#24067;&#20102;1.0&#29256;&#26412;&#65292;&#24182;&#19988;&#34987;&#35768;&#22810;&#24076;&#26395;&#25913;&#36827;&#20182;&#20204;&#29983;&#27963;&#30340;&#20998;&#25955;&#29992;&#25143;&#22825;&#22825;&#20351;&#29992;&#12290;</p>
      <p>&#36825;&#26159;&#19968;&#20010;&#32654;&#22909;&#30340;&#25925;&#20107;&#65292;&#20294;&#26159;&#27809;&#26377;&#22312;&#36825;&#37324;&#32467;&#26463;&#65292;&#20316;&#20026;&#20027;&#21150;&#20154;&#65292;&#20320;&#19968;&#23450;&#24819;&#21040;&#20102;&#21478;&#19968;&#20214;&#20107;&#65292;&#25152;&#20197;&#20320;&#21019;&#24314;&#20102;&#19968;&#20010;&#30446;&#24405;&#21483;&#20570;<code class="filename">concept</code>&#65292;&#21608;&#26399;&#37325;&#26032;&#24320;&#22987;&#12290;&#23454;&#38469;&#19978;&#65292;&#36825;&#20010;&#24490;&#29615;&#22312;&#20960;&#24180;&#37324;&#24320;&#22987;&#20102;&#22810;&#27425;&#65292;&#27599;&#19968;&#20010;&#24819;&#27861;&#20174;&#20351;&#29992;&#26087;&#30340;<code class="filename">concept</code>&#30446;&#24405;&#24320;&#22987;&#65292;&#28982;&#21518;&#26377;&#26102;&#22312;&#24819;&#27861;&#25104;&#29087;&#20043;&#21518;&#37325;&#26032;&#21629;&#21517;&#65292;&#26377;&#26102;&#20320;&#25918;&#24323;&#20102;&#36825;&#20010;&#27880;&#24847;&#32780;&#21024;&#38500;&#20102;&#36825;&#20010;&#30446;&#24405;&#12290;&#25110;&#32773;&#26356;&#21152;&#21464;&#24577;&#19968;&#28857;&#65292;&#25110;&#35768;&#20320;&#25226;<code class="filename">concept</code>&#25913;&#25104;&#20854;&#20182;&#21517;&#23383;&#20043;&#21518;&#21448;&#22240;&#20026;&#19968;&#20123;&#21407;&#22240;&#37325;&#26032;&#25913;&#22238;<code class="filename">concept</code>&#12290;</p>
      <p>&#24403;&#36825;&#26679;&#30340;&#24773;&#26223;&#21457;&#29983;&#26102;&#65292;&#25351;&#23548;Subversion&#24037;&#20316;&#22312;&#37325;&#26032;&#20351;&#29992;&#30340;&#36335;&#24452;&#19978;&#30340;&#23581;&#35797;&#23601;&#20687;&#25351;&#23548;&#19968;&#20010;&#33437;&#21152;&#21733;&#35199;&#37066;&#30340;&#20056;&#23458;&#39550;&#36710;&#21040;&#19996;&#38754;&#30340;&#32599;&#26031;&#31119;&#36335;&#24182;&#19988;&#24038;&#36716;&#21040;&#20027;&#22823;&#36947;&#12290;&#20165;&#20165;20&#20998;&#38047;&#65292;&#20320;&#21487;&#20197;&#31359;&#36807;&#24800;&#39039;&#12289;&#26684;&#20262;&#22467;&#26519;&#20309;&#26391;&#20271;&#24503;&#30340;&#8220;<span class="quote">&#20027;&#22823;&#36947;</span>&#8221;&#65292;&#20294;&#26159;&#23427;&#20204;&#19981;&#26159;&#19968;&#26679;&#30340;&#34903;&#36947;&#65292;&#25105;&#20204;&#30340;&#20056;&#23458;&#8212;&#21644;&#25105;&#20204;&#30340;Subversion&#8212;&#38656;&#35201;&#26356;&#22810;&#30340;&#32454;&#33410;&#26469;&#20570;&#27491;&#30830;&#30340;&#20107;&#24773;&#12290;</p>
      <p>&#22312;1.1&#29256;&#26412;&#65292;Subversion&#25552;&#20379;&#20102;&#19968;&#31181;&#26041;&#27861;&#26469;&#35828;&#26126;&#20320;&#25152;&#25351;&#26159;&#21738;&#19968;&#20010;&#34903;&#36947;&#65292;&#21483;&#20570;<em class="firstterm">peg&#20462;&#35746;&#29256;&#26412;</em>&#65292;&#36890;&#36807;&#36825;&#20010;&#20462;&#35746;&#29256;&#26412;&#25105;&#20204;&#21487;&#20197;&#21807;&#19968;&#30830;&#23450;&#19968;&#26465;&#21382;&#21490;&#32447;&#36335;&#65292;&#22240;&#20026;&#19968;&#20010;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#20250;&#22312;&#20219;&#20309;&#26102;&#38388;&#21344;&#29992;&#26576;&#20010;&#36335;&#24452;&#8212;&#36335;&#24452;&#21644;peg&#20462;&#35746;&#29256;&#26412;&#30340;&#21512;&#24182;&#26159;&#21487;&#20197;&#25351;&#23450;&#19968;&#20010;&#21382;&#21490;&#30340;&#29305;&#23450;&#32447;&#36335;&#12290;Peg&#20462;&#35746;&#29256;&#26412;&#21487;&#20197;&#22312;Subversion&#21629;&#20196;&#34892;&#23458;&#25143;&#31471;&#20013;&#29992;<em class="firstterm">at&#35821;&#27861;</em>&#25351;&#23450;&#65292;&#20043;&#25152;&#20197;&#20351;&#29992;&#36825;&#20010;&#21517;&#31216;&#26159;&#22240;&#20026;&#20250;&#22312;&#20851;&#32852;&#30340;&#20462;&#35746;&#29256;&#26412;&#30340;&#36335;&#24452;&#21518;&#38754;&#36861;&#21152;&#19968;&#20010;&#8220;<span class="quote">at&#31526;&#21495;</span>&#8221;(<code class="literal">@</code>)&#12290;</p>
      <p>&#20294;&#26159;&#25105;&#20204;&#22312;&#26412;&#20070;&#22810;&#27425;&#25552;&#21040;&#30340;<code class="option">--revision (-r)</code>&#21040;&#24213;&#26159;&#20160;&#20040;&#65311;&#20462;&#35746;&#29256;&#26412;(&#25110;&#32773;&#26159;&#20462;&#35746;&#29256;&#26412;&#38598;)&#21483;&#20570;<em class="firstterm">&#23454;&#26045;&#30340;&#20462;&#35746;&#29256;&#26412;</em>(&#25110;&#32773;&#21483;&#20570;<em class="firstterm">&#23454;&#26045;&#30340;&#20462;&#35746;&#29256;&#26412;&#33539;&#22260;</em>)&#65292;&#19968;&#26086;&#19968;&#20010;&#29305;&#23450;&#21382;&#21490;&#32447;&#36335;&#36890;&#36807;&#19968;&#20010;&#36335;&#24452;&#21644;peg&#20462;&#35746;&#29256;&#26412;&#25351;&#23450;&#65292;Subversion&#20250;&#20351;&#29992;&#23454;&#26045;&#30340;&#20462;&#35746;&#29256;&#26412;&#25191;&#34892;&#35201;&#27714;&#30340;&#25805;&#20316;&#12290;&#31867;&#20284;&#30340;&#65292;&#20026;&#20102;&#25351;&#20986;&#36825;&#20010;&#21040;&#25105;&#20204;&#33437;&#21152;&#21733;&#30340;&#36947;&#36335;&#65292;&#22914;&#26524;&#25105;&#20204;&#34987;&#21578;&#30693;&#21040;&#24800;&#39039;&#20027;&#22823;&#36947;606&#21495;&#65292; <sup>[<a name="d4e2453" href="#ftn.d4e2453" class="footnote">19</a>]</sup> &#25105;&#20204;&#21487;&#20197;&#25226;&#8220;<span class="quote">&#20027;&#22823;&#36947;</span>&#8221;&#30475;&#20316;&#36335;&#24452;&#65292;&#25226;&#8220;<span class="quote">&#24800;&#39039;</span>&#8221;&#24403;&#20316;&#25105;&#20204;&#30340;peg&#20462;&#35746;&#29256;&#26412;&#12290;&#36825;&#20004;&#27573;&#20449;&#24687;&#30830;&#35748;&#20102;&#25105;&#20204;&#21487;&#20197;&#26053;&#34892;(&#20027;&#22823;&#36947;&#30340;&#21271;&#26041;&#25110;&#21335;&#26041;)&#30340;&#21807;&#19968;&#36335;&#24452;&#65292;&#20063;&#20250;&#20445;&#25345;&#25105;&#20204;&#19981;&#20250;&#22312;&#21069;&#21069;&#21518;&#21518;&#23547;&#25214;&#30446;&#26631;&#26102;&#36208;&#21040;&#38169;&#35823;&#30340;&#20027;&#22823;&#36947;&#12290;&#29616;&#22312;&#25105;&#20204;&#25226;&#8220;<span class="quote">606 N.</span>&#8221;&#20316;&#20026;&#25105;&#20204;&#23454;&#26045;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#25105;&#20204;<span class="emphasis"><em>&#31934;&#30830;&#30340;</em></span>&#30693;&#36947;&#21040;&#21738;&#37324;&#12290;</p>
      <div class="sidebar"><p class="title"><b>Peg &#29256;&#26412;&#31639;&#27861;</b></p>
        
        <p>Subversion&#21629;&#20196;&#34892;&#22312;&#35299;&#20915;&#36335;&#24452;&#21644;&#20462;&#35746;&#29256;&#26412;&#28151;&#28102;&#26102;&#38656;&#35201;peg&#20462;&#35746;&#29256;&#26412;&#31639;&#27861;&#65292;&#36825;&#37324;&#26159;&#19968;&#20010;&#29992;&#20197;&#35828;&#26126;&#30340;&#20363;&#23376;&#65306;</p>
        <pre class="screen">
$ svn <em class="replaceable"><code>command</code></em> -r <em class="replaceable"><code>OPERATIVE-REV</code></em> item@<em class="replaceable"><code>PEG-REV</code></em>
</pre>
        <p>&#22914;&#26524;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#27604;<em class="replaceable"><code>PEG-REV</code></em>&#26356;&#32769;&#65292;&#21017;&#31639;&#27861;&#22914;&#19979;&#65306;</p>
        <div class="itemizedlist"><ul type="disc"><li>
            <p>&#26469;&#21040;&#20462;&#35746;&#29256;&#26412;<em class="replaceable"><code>PEG-REV</code></em>&#65292;&#25214;&#21040;<em class="replaceable"><code>item</code></em>&#65292;&#22312;&#29256;&#26412;&#24211;&#23450;&#20301;&#21040;&#19968;&#20010;&#21807;&#19968;&#30340;&#23545;&#35937;&#12290;</p>
          </li><li>
            <p>&#36861;&#36394;&#23545;&#35937;&#30340;&#21382;&#21490;&#32972;&#26223;(&#36890;&#36807;&#20219;&#20309;&#21487;&#33021;&#30340;&#25913;&#21517;)&#26469;&#21040;&#20462;&#35746;&#29256;&#26412;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#30340;&#31062;&#20808;&#12290;</p>
          </li><li>
            <p>&#23545;&#37027;&#20010;&#31062;&#20808;&#25191;&#34892;&#35831;&#27714;&#30340;&#21160;&#20316;&#65292;&#26080;&#35770;&#23427;&#30340;&#20301;&#32622;&#65292;&#26080;&#35770;&#23427;&#26159;&#20160;&#20040;&#21517;&#23383;&#65292;&#26080;&#35770;&#24403;&#26102;&#26159;&#21542;&#23384;&#22312;&#12290;</p>
          </li></ul></div>
        <p>&#20294;&#26159;&#22914;&#26524;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#27604;<em class="replaceable"><code>PEG-REV</code></em>&#26356;&#24180;&#36731;&#26102;&#20250;&#24590;&#20040;&#26679;&#65311;&#36825;&#20026;&#23450;&#20301;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#20013;&#30340;&#36335;&#24452;&#30340;&#29702;&#35770;&#38382;&#39064;&#22686;&#21152;&#20102;&#19968;&#20123;&#22797;&#26434;&#24615;&#65292;&#22240;&#20026;&#22312;<em class="replaceable"><code>PEG-REV</code></em>&#21644;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#20043;&#38388;&#65292;&#36335;&#24452;&#22312;&#21382;&#21490;&#20013;&#21487;&#20197;&#20986;&#29616;&#22810;&#27425;(&#30001;&#20110;&#25335;&#36125;&#25805;&#20316;)&#65292;&#32780;&#19988;&#37027;&#36824;&#19981;&#26159;&#20840;&#37096;&#8212;Subversion&#19981;&#20250;&#20445;&#23384;&#21521;&#21069;&#36319;&#36394;&#21382;&#21490;&#30340;&#36275;&#22815;&#20449;&#24687;&#65292;&#25152;&#20197;&#31639;&#27861;&#20250;&#26377;&#19968;&#28857;&#19981;&#21516;&#65306;</p>
        <div class="itemizedlist"><ul type="disc"><li>
            <p>&#26469;&#21040;&#20462;&#35746;&#29256;&#26412;<em class="replaceable"><code>PEG-REV</code></em>&#65292;&#25214;&#21040;<em class="replaceable"><code>item</code></em>&#65292;&#22312;&#29256;&#26412;&#24211;&#23450;&#20301;&#21040;&#19968;&#20010;&#21807;&#19968;&#30340;&#23545;&#35937;&#12290;</p>
          </li><li>
            <p>&#36861;&#36394;&#23545;&#35937;&#30340;&#21382;&#21490;&#32972;&#26223;(&#36890;&#36807;&#20219;&#20309;&#21487;&#33021;&#30340;&#25913;&#21517;)&#26469;&#21040;&#20462;&#35746;&#29256;&#26412;<em class="replaceable"><code>PEG-REV</code></em>&#30340;&#31062;&#20808;&#12290;</p>
          </li><li>
            <p>&#22312;<em class="replaceable"><code>PEG-REV</code></em>&#20013;&#26816;&#39564;&#23545;&#35937;&#30340;&#20301;&#32622;(&#39034;&#24207;)&#19982;&#22312;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#20013;&#30456;&#21516;&#65292;&#22914;&#26524;&#37027;&#26159;&#38382;&#39064;&#65292;&#21017;&#33267;&#23569;&#20004;&#20010;&#20301;&#32622;&#26159;&#30452;&#25509;&#20851;&#32852;&#30340;&#65292;&#25152;&#20197;&#22312;<em class="replaceable"><code>OPERATIVE-REV</code></em>&#30340;&#20301;&#32622;&#25191;&#34892;&#35831;&#27714;&#21160;&#20316;&#12290;&#21542;&#21017;&#65292;&#20851;&#32852;&#27809;&#26377;&#24314;&#31435;&#65292;&#25152;&#20197;&#20250;&#25253;&#21578;&#27809;&#26377;&#21487;&#29992;&#20301;&#32622;&#30340;&#38169;&#35823;&#12290;(&#26377;&#19968;&#22825;&#65292;&#25105;&#20204;&#24076;&#26395;Subversion&#21487;&#20197;&#26356;&#28789;&#27963;&#21644;&#20248;&#38597;&#30340;&#22788;&#29702;&#36825;&#31181;&#22330;&#26223;&#12290;)</p>
          </li></ul></div>
        <p>&#27880;&#24847;&#65292;&#21363;&#20351;&#20320;&#27809;&#26377;&#26126;&#30830;&#25552;&#20379;peg&#20462;&#35746;&#29256;&#26412;&#25110;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#65292;&#20182;&#20204;&#20381;&#28982;&#26159;&#23384;&#22312;&#30340;&#12290;&#20026;&#20102;&#20351;&#29992;&#30340;&#31616;&#20415;&#65292;&#23545;&#20110;&#24037;&#20316;&#25335;&#36125;&#39033;&#30446;&#30340;&#32570;&#30465;peg&#20462;&#35746;&#29256;&#26412;&#26159;<code class="literal">BASE</code>&#65292;&#32780;&#29256;&#26412;&#24211;URL&#30340;&#32570;&#30465;&#20540;&#26159;<code class="literal">HEAD</code>&#12290;&#24403;&#27809;&#26377;&#25552;&#20379;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#26102;&#65292;&#32570;&#30465;&#26159;&#19982;peg&#20462;&#35746;&#29256;&#26412;&#19968;&#26679;&#12290;</p>
      </div>
      <p>&#20063;&#23601;&#26159;&#35828;&#24456;&#20037;&#20197;&#21069;&#25105;&#20204;&#21019;&#24314;&#20102;&#25105;&#20204;&#30340;&#29256;&#26412;&#24211;&#65292;&#22312;&#20462;&#35746;&#29256;&#26412;1&#28155;&#21152;&#25105;&#20204;&#31532;&#19968;&#20010;<code class="filename">concept</code>&#30446;&#24405;&#65292;&#24182;&#19988;&#22312;&#36825;&#20010;&#30446;&#24405;&#22686;&#21152;&#19968;&#20010;<code class="filename">IDEA</code>&#25991;&#20214;&#19982;concept&#30456;&#20851;&#65292;&#22312;&#20960;&#20010;&#20462;&#35746;&#29256;&#26412;&#20043;&#21518;&#65292;&#30495;&#23454;&#30340;&#20195;&#30721;&#34987;&#28155;&#21152;&#21644;&#20462;&#25913;&#65292;&#25105;&#20204;&#22312;&#20462;&#35746;&#29256;&#26412;20&#65292;&#20462;&#25913;&#36825;&#20010;&#30446;&#24405;&#20026;<code class="filename">frabnaggilywort</code>&#12290;&#36890;&#36807;&#20462;&#35746;&#29256;&#26412;27&#65292;&#25105;&#20204;&#26377;&#20102;&#19968;&#20010;&#26032;&#30340;&#27010;&#24565;&#65292;&#25152;&#20197;&#19968;&#20010;&#26032;&#30340;<code class="filename">concept</code>&#30446;&#24405;&#29992;&#26469;&#20445;&#23384;&#36825;&#20123;&#19996;&#35199;&#65292;&#19968;&#20010;&#26032;&#30340;<code class="filename">IDEA</code>&#25991;&#20214;&#26469;&#25551;&#36848;&#36825;&#20010;&#27010;&#24565;&#65292;&#28982;&#21518;&#32463;&#36807;5&#24180;20000&#20010;&#20462;&#35746;&#29256;&#26412;&#65292;&#23601;&#20687;&#20182;&#20204;&#37117;&#26377;&#19968;&#20010;&#38750;&#24120;&#28010;&#28459;&#30340;&#21382;&#21490;&#12290;</p>
      <p>&#29616;&#22312;&#65292;&#19968;&#24180;&#20043;&#21518;&#65292;&#25105;&#20204;&#24819;&#30693;&#36947;<code class="filename">IDEA</code>&#22312;&#20462;&#35746;&#29256;&#26412;1&#26102;&#26159;&#20160;&#20040;&#26679;&#23376;&#65292;&#20294;&#26159;Subversion&#38656;&#35201;&#30693;&#36947;&#25105;&#20204;&#26159;&#24819;&#35810;&#38382;<span class="emphasis"><em>&#24403;&#21069;</em></span>&#25991;&#20214;&#22312;&#20462;&#35746;&#29256;&#26412;1&#26102;&#30340;&#26679;&#23376;&#65292;&#36824;&#26159;&#24076;&#26395;&#30693;&#36947;<code class="filename">concepts/IDEA</code>&#22312;&#20462;&#35746;&#29256;&#26412;1&#26102;&#30340;&#37027;&#20010;&#25991;&#20214;&#65311;&#30830;&#23450;&#36825;&#20123;&#38382;&#39064;&#26377;&#19981;&#21516;&#30340;&#31572;&#26696;&#65292;&#24182;&#19988;&#22240;&#20026;peg&#20462;&#35746;&#29256;&#26412;&#65292;&#20320;&#21487;&#20197;&#29992;&#20004;&#31181;&#26041;&#24335;&#35810;&#38382;&#12290;&#20026;&#20102;&#30693;&#36947;&#24403;&#21069;&#30340;<code class="filename">IDEA</code>&#25991;&#20214;&#22312;&#26087;&#29256;&#26412;&#30340;&#26679;&#23376;&#65292;&#25105;&#20204;&#21487;&#20197;&#36816;&#34892;&#65306;</p>
      <pre class="screen">
$ svn cat -r 1 concept/IDEA 
svn: Unable to find repository location for 'concept/IDEA' in revision 1
</pre>
      <p>&#24403;&#28982;&#65292;&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;&#24403;&#21069;&#30340;<code class="filename">IDEA</code>&#25991;&#20214;&#22312;&#20462;&#35746;&#29256;&#26412;1&#20013;&#24182;&#19981;&#23384;&#22312;&#65292;&#25152;&#20197;Subversion&#32473;&#20986;&#19968;&#20010;&#38169;&#35823;&#65292;&#36825;&#20010;&#19978;&#38754;&#30340;&#21629;&#20196;&#26159;&#38271;&#30340;peg&#20462;&#35746;&#29256;&#26412;&#21629;&#20196;&#19968;&#20010;&#32553;&#20889;&#65292;&#25193;&#23637;&#30340;&#20889;&#27861;&#26159;&#65306;</p>
      <pre class="screen">
$ svn cat -r 1 concept/IDEA@BASE
svn: Unable to find repository location for 'concept/IDEA' in revision 1
</pre>
      <p>&#24403;&#25191;&#34892;&#26102;&#65292;&#23427;&#21253;&#21547;&#26399;&#26395;&#30340;&#32467;&#26524;&#12290;</p>
      <p>&#22914;&#26524;&#24037;&#20316;&#25335;&#36125;&#36335;&#24452;&#25110;URL&#20013;&#30830;&#23454;&#26377;&#19968;&#20010;at&#35760;&#21495;&#65292;peg&#20462;&#35746;&#29256;&#26412;&#35821;&#27861;&#26159;&#21542;&#20250;&#23548;&#33268;&#38382;&#39064;&#65311;&#28145;&#21051;&#29702;&#35299;&#30340;&#35835;&#32773;&#21487;&#33021;&#20250;&#20135;&#29983;&#36825;&#26679;&#30340;&#30097;&#38382;&#12290;&#27605;&#31455;&#65292;<span class="command"><strong>svn</strong></span>&#26159;&#22914;&#20309;&#30693;&#36947;<code class="literal">news@11</code>&#26159;&#25105;&#30340;&#30446;&#24405;&#26641;&#20013;&#30340;&#19968;&#20010;&#30446;&#24405;&#65292;&#36824;&#26159;&#20462;&#35746;&#29256;&#26412;11&#30340;<code class="filename">news</code>&#25991;&#20214;&#65311;&#24184;&#22909;&#65292;<span class="command"><strong>svn</strong></span>&#20250;&#19968;&#30452;&#20551;&#23450;&#21518;&#32773;&#12290;&#20320;&#21482;&#38656;&#35201;&#22312;&#36335;&#24452;&#26368;&#21518;&#28155;&#21152;&#19968;&#20010;at&#31526;&#21495;&#65292;&#20363;&#22914;<code class="literal">news@11@</code>&#65292;<span class="command"><strong>svn</strong></span>&#21482;&#20851;&#24515;&#26368;&#21518;&#19968;&#20010;at&#26631;&#35760;&#65292;&#22914;&#26524;&#36951;&#28431;&#20102;&#26368;&#21518;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#65292;&#19981;&#20250;&#35748;&#20026;&#19981;&#21512;&#27861;&#12290;&#36825;&#20010;&#27861;&#21017;&#29978;&#33267;&#21487;&#20197;&#24212;&#29992;&#21040;&#20197;at&#32467;&#23614;&#30340;&#36335;&#24452;&#8212;&#20320;&#21487;&#20197;&#20351;&#29992;<code class="literal">filename@@</code>&#26469;&#24341;&#29992;<code class="filename">filename@</code>&#12290;</p>
      <p>&#28982;&#21518;&#35753;&#25105;&#20204;&#35810;&#38382;&#21478;&#19968;&#20010;&#38382;&#39064;&#8212;&#22312;&#20462;&#35746;&#29256;&#26412;1 &#65292;&#21344;&#25454;<code class="filename">concepts/IDEA</code>&#36335;&#24452;&#30340;&#25991;&#20214;&#30340;&#20869;&#23481;&#21040;&#24213;&#26159;&#20160;&#20040;&#65311;&#25105;&#20204;&#20250;&#20351;&#29992;&#19968;&#20010;&#26126;&#30830;&#30340;peg&#20462;&#35746;&#29256;&#26412;&#26469;&#24110;&#21161;&#25105;&#20204;&#23436;&#25104;&#12290;</p>
      <pre class="screen">
$ svn cat concept/IDEA@1
The idea behind this project is to come up with a piece of software
that can frab a naggily wort.  Frabbing naggily worts is tricky
business, and doing it incorrectly can have serious ramifications, so
we need to employ over-the-top input validation and data verification
mechanisms.
</pre>
      <p>&#27880;&#24847;&#25105;&#20204;&#36825;&#19968;&#27425;&#27809;&#26377;&#25552;&#20379;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#65292;&#37027;&#26159;&#22240;&#20026;&#22914;&#26524;&#27809;&#26377;&#25351;&#23450;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#65292;Subversion&#20551;&#23450;&#32570;&#30465;&#30340;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#26159;peg&#20462;&#35746;&#29256;&#26412;&#12290;</p>
      <p>&#27491;&#20687;&#20320;&#30475;&#21040;&#30340;&#65292;&#36825;&#30475;&#36215;&#26469;&#26159;&#27491;&#30830;&#30340;&#36755;&#20986;&#65292;&#36825;&#20123;&#25991;&#26412;&#29978;&#33267;&#25552;&#21040;&#8220;frabbing naggily worts&#8221;&#65292;&#25152;&#20197;&#36825;&#23601;&#26159;&#29616;&#22312;&#21483;&#20570;Frabnaggilywort&#39033;&#30446;&#30340;&#37027;&#20010;&#25991;&#20214;&#65292;&#23454;&#38469;&#19978;&#65292;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#26174;&#31034;&#30340;peg&#20462;&#35746;&#29256;&#26412;&#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;&#30340;&#32452;&#21512;&#26680;&#23454;&#36825;&#19968;&#28857;&#12290;&#25105;&#20204;&#30693;&#36947;&#22312;<code class="literal">HEAD</code>&#65292;Frabnaggilywort&#39033;&#30446;&#22352;&#33853;&#22312;<code class="filename">frabnaggilywort</code>&#30446;&#24405;&#65292;&#25152;&#20197;&#25105;&#20204;&#25351;&#23450;&#25105;&#20204;&#24076;&#26395;&#30475;&#21040;<code class="literal">HEAD</code>&#30340;<code class="filename">frabnaggilywort/IDEA</code>&#36335;&#32463;&#22312;&#21382;&#21490;&#19978;&#30340;&#20462;&#35746;&#29256;&#26412;1&#30340;&#20869;&#23481;&#12290;</p>
      <pre class="screen">
$ svn cat -r 1 frabnaggilywort/IDEA@HEAD
The idea behind this project is to come up with a piece of software
that can frab a naggily wort.  Frabbing naggily worts is tricky
business, and doing it incorrectly can have serious ramifications, so
we need to employ over-the-top input validation and data verification
mechanisms.
</pre>
      <p>&#32780;&#19988;peg&#20462;&#35746;&#29256;&#26412;&#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;&#20063;&#19981;&#38656;&#35201;&#36825;&#26679;&#29712;&#30862;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#25105;&#20204;&#30340;<code class="filename">frabnaggilywort</code>&#24050;&#32463;&#22312;<code class="literal">HEAD</code>&#21024;&#38500;&#65292;&#20294;&#25105;&#20204;&#30693;&#36947;&#22312;&#20462;&#35746;&#29256;&#26412;20&#23427;&#26159;&#23384;&#22312;&#30340;&#65292;&#25105;&#20204;&#24076;&#26395;&#30693;&#36947;<code class="filename">IDEA</code>&#20174;&#20462;&#35746;&#29256;&#26412;4&#21040;10&#30340;&#21306;&#21035;&#65292;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;peg&#20462;&#35746;&#29256;&#26412;20&#21644;<code class="filename">IDEA</code>&#25991;&#20214;&#30340;&#20462;&#35746;&#29256;&#26412;20&#30340;URL&#30340;&#32452;&#21512;&#65292;&#28982;&#21518;&#20351;&#29992;4&#21040;10&#20316;&#20026;&#25105;&#20204;&#30340;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;&#33539;&#22260;&#12290;</p>
      <pre class="screen">
$ svn diff -r 4:10 http://svn.red-bean.com/projects/frabnaggilywort/IDEA@20
Index: frabnaggilywort/IDEA
===================================================================
--- frabnaggilywort/IDEA	(revision 4)
+++ frabnaggilywort/IDEA	(revision 10)
@@ -1,5 +1,5 @@
-The idea behind this project is to come up with a piece of software
-that can frab a naggily wort.  Frabbing naggily worts is tricky
-business, and doing it incorrectly can have serious ramifications, so
-we need to employ over-the-top input validation and data verification
-mechanisms.
+The idea behind this project is to come up with a piece of
+client-server software that can remotely frab a naggily wort.
+Frabbing naggily worts is tricky business, and doing it incorrectly
+can have serious ramifications, so we need to employ over-the-top
+input validation and data verification mechanisms.
</pre>
      <p>&#24184;&#36816;&#30340;&#26159;&#65292;&#20960;&#20046;&#25152;&#26377;&#30340;&#20154;&#19981;&#20250;&#38754;&#20020;&#22914;&#27492;&#22797;&#26434;&#30340;&#24773;&#24418;&#65292;&#20294;&#26159;&#22914;&#26524;&#26159;&#65292;&#35760;&#20303;peg&#20462;&#35746;&#29256;&#26412;&#26159;&#24110;&#21161;Subversion&#28165;&#38500;&#28151;&#28102;&#30340;&#39069;&#22806;&#25552;&#31034;&#12290;</p>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e2432" href="#d4e2432" class="para">18</a>] </sup>&#8220;<span class="quote">&#20320;&#19981;&#26159;&#34987;&#26399;&#26395;&#21435;&#21629;&#21517;&#23427;&#65292;&#19968;&#26086;&#20320;&#21462;&#20102;&#21517;&#23383;&#65292;&#20320;&#24320;&#22987;&#19982;&#20043;&#32852;&#31995;&#22312;&#19968;&#36215;&#12290;</span>&#8221; &#8212; Mike Wazowski</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e2453" href="#d4e2453" class="para">19</a>] </sup>&#20234;&#21033;&#35834;&#20234;&#24030;&#24800;&#39039;&#20027;&#22823;&#36947;606&#21495;&#24066;&#24800;&#39039;&#31163;&#24066;&#20013;&#24515;&#65292;&#35753;&#23427;&#20316;&#20026;&#8212;&#8220;<span class="quote">&#21382;&#21490;&#20013;&#24515;</span>&#8221;&#65311;&#30475;&#36215;&#26469;&#26159;&#24688;&#24403;&#30340;&#8230;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.advanced.externals.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.advanced.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.serverconfig.netmodel.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#22806;&#37096;&#23450;&#20041;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#32593;&#32476;&#27169;&#22411;</td></tr></table></div></body></html>