<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#32500;&#25252;&#20998;&#25903;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="svn.branchmerge.tags.html" title="&#26631;&#31614;"><link rel="next" href="svn.advanced.vendorbr.html" title="&#20379;&#26041;&#20998;&#25903;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#32500;&#25252;&#20998;&#25903;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.tags.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.vendorbr.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.branchmerge.maint"></a>&#32500;&#25252;&#20998;&#25903;</h2></div></div></div>
      
      <p>&#20320;&#19968;&#23450;&#27880;&#24847;&#21040;&#20102;Subversion&#26497;&#24230;&#30340;&#28789;&#27963;&#24615;&#65292;&#22240;&#20026;&#23427;&#29992;&#30456;&#21516;&#30340;&#24213;&#23618;&#26426;&#21046;(&#30446;&#24405;&#25335;&#36125;)&#23454;&#29616;&#20102;&#20998;&#25903;&#21644;&#26631;&#31614;&#65292;&#22240;&#20026;&#20998;&#25903;&#21644;&#26631;&#31614;&#26159;&#20316;&#20026;&#26222;&#36890;&#30340;&#25991;&#20214;&#31995;&#32479;&#20986;&#29616;&#65292;&#20250;&#35753;&#20154;&#20204;&#24863;&#21040;&#23475;&#24597;&#65292;&#22240;&#20026;&#23427;<span class="emphasis"><em>&#22826;</em></span>&#28789;&#27963;&#20102;&#65292;&#22312;&#36825;&#20010;&#23567;&#33410;&#37324;&#65292;&#25105;&#20204;&#20250;&#25552;&#20379;&#23433;&#25490;&#21644;&#31649;&#29702;&#25968;&#25454;&#30340;&#19968;&#20123;&#24314;&#35758;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.maint.layout"></a>&#29256;&#26412;&#24211;&#24067;&#23616;</h3></div></div></div>
        
        <p>&#26377;&#19968;&#20123;&#26631;&#20934;&#30340;&#65292;&#25512;&#33616;&#30340;&#32452;&#32455;&#29256;&#26412;&#24211;&#30340;&#26041;&#24335;&#65292;&#35768;&#22810;&#20154;&#21019;&#24314;&#19968;&#20010;<code class="filename">trunk</code>&#30446;&#24405;&#26469;&#20445;&#23384;&#24320;&#21457;&#30340;&#8220;<span class="quote">&#20027;&#32447;</span>&#8221;&#65292;&#19968;&#20010;<code class="filename">branches</code>&#30446;&#24405;&#23384;&#25918;&#20998;&#25903;&#25335;&#36125;&#65292;&#19968;&#20010;<code class="filename">tags</code>&#30446;&#24405;&#20445;&#23384;&#26631;&#31614;&#25335;&#36125;&#65292;&#22914;&#26524;&#19968;&#20010;&#29256;&#26412;&#24211;&#21482;&#26159;&#23384;&#25918;&#19968;&#20010;&#39033;&#30446;&#65292;&#20154;&#20204;&#20250;&#22312;&#39030;&#32423;&#30446;&#24405;&#21019;&#24314;&#36825;&#20123;&#30446;&#24405;&#65306;</p>
        <pre class="screen">
/trunk
/branches
/tags
</pre>
        <p>&#22914;&#26524;&#19968;&#20010;&#29256;&#26412;&#24211;&#20445;&#23384;&#20102;&#22810;&#20010;&#39033;&#30446;&#65292;&#31649;&#29702;&#21592;&#20250;&#36890;&#36807;&#39033;&#30446;&#26469;&#24067;&#23616;(&#35265;<a class="xref" href="svn.reposadmin.planning.html#svn.reposadmin.projects.chooselayout" title="&#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;">&#8220;&#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;&#8221;&#19968;&#33410;</a>&#20851;&#20110;&#8220;<span class="quote">&#39033;&#30446;&#26681;&#30446;&#24405;</span>&#8221;)&#65306;</p>
        <pre class="screen">
/paint/trunk
/paint/branches
/paint/tags
/calc/trunk
/calc/branches
/calc/tags
</pre>
        <p>&#24403;&#28982;&#65292;&#20320;&#21487;&#20197;&#33258;&#30001;&#30340;&#24573;&#30053;&#36825;&#20123;&#36890;&#24120;&#30340;&#24067;&#23616;&#26041;&#24335;&#65292;&#20320;&#21487;&#20197;&#21019;&#24314;&#20219;&#24847;&#30340;&#21464;&#21270;&#65292;&#21482;&#35201;&#26159;&#23545;&#20320;&#21644;&#20320;&#30340;&#39033;&#30446;&#26377;&#30410;&#65292;&#35760;&#20303;&#26080;&#35770;&#20320;&#36873;&#25321;&#20160;&#20040;&#65292;&#36825;&#19981;&#20250;&#26159;&#19968;&#31181;&#27704;&#20037;&#30340;&#25215;&#35834;&#65292;&#20320;&#21487;&#20197;&#38543;&#26102;&#37325;&#26032;&#32452;&#32455;&#20320;&#30340;&#29256;&#26412;&#24211;&#12290;&#22240;&#20026;&#20998;&#25903;&#21644;&#26631;&#31614;&#37117;&#26159;&#26222;&#36890;&#30340;&#30446;&#24405;&#65292;<span class="command"><strong>svn move</strong></span>&#21629;&#20196;&#21487;&#20197;&#20219;&#24847;&#30340;&#25913;&#21517;&#21644;&#31227;&#21160;&#23427;&#20204;&#65292;&#20174;&#19968;&#31181;&#24067;&#23616;&#21040;&#21478;&#19968;&#31181;&#22823;&#27010;&#21482;&#26159;&#19968;&#31995;&#21015;&#26381;&#21153;&#22120;&#31471;&#30340;&#31227;&#21160;&#65292;&#22914;&#26524;&#20320;&#19981;&#21916;&#27426;&#29256;&#26412;&#24211;&#30340;&#32452;&#32455;&#26041;&#24335;&#65292;&#20320;&#21487;&#20197;&#20219;&#24847;&#20462;&#25913;&#30446;&#24405;&#32467;&#26500;&#12290;</p>
        <p>&#35760;&#20303;&#65292;&#23613;&#31649;&#31227;&#21160;&#30446;&#24405;&#38750;&#24120;&#23481;&#26131;&#65292;&#20320;&#24517;&#39035;&#20307;&#35845;&#20320;&#30340;&#29992;&#25143;&#65292;&#20320;&#30340;&#20462;&#25913;&#20250;&#35753;&#20320;&#30340;&#29992;&#25143;&#24863;&#21040;&#36855;&#24785;&#65292;&#22914;&#26524;&#19968;&#20010;&#29992;&#25143;&#30340;&#25317;&#26377;&#19968;&#20010;&#29256;&#26412;&#24211;&#30446;&#24405;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#20320;&#30340;<span class="command"><strong>svn move</strong></span>&#21629;&#20196;&#20063;&#35768;&#20250;&#21024;&#38500;&#26368;&#26032;&#30340;&#29256;&#26412;&#30340;&#36825;&#20010;&#36335;&#24452;&#65292;&#24403;&#29992;&#25143;&#36816;&#34892;<span class="command"><strong>svn update</strong></span>&#65292;&#20250;&#34987;&#21578;&#30693;&#36825;&#20010;&#24037;&#20316;&#25335;&#36125;&#24341;&#29992;&#30340;&#36335;&#24452;&#24050;&#32463;&#19981;&#20877;&#23384;&#22312;&#65292;&#29992;&#25143;&#38656;&#35201;&#24378;&#21046;&#20351;&#29992;<span class="command"><strong>svn switch</strong></span>&#36716;&#21040;&#26032;&#30340;&#20301;&#32622;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.maint.lifetime"></a>&#25968;&#25454;&#30340;&#29983;&#21629;&#21608;&#26399;</h3></div></div></div>
        
        <p>&#21478;&#19968;&#20010;Subversion&#27169;&#22411;&#30340;&#21487;&#29233;&#29305;&#24615;&#26159;&#20998;&#25903;&#21644;&#26631;&#31614;&#21487;&#20197;&#26377;&#26377;&#38480;&#30340;&#29983;&#21629;&#21608;&#26399;&#65292;&#23601;&#20687;&#20854;&#23427;&#30340;&#29256;&#26412;&#21270;&#30340;&#39033;&#30446;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#20551;&#23450;&#20320;&#26368;&#32456;&#23436;&#25104;&#20102;<code class="filename">calc</code>&#39033;&#30446;&#20320;&#30340;&#20010;&#20154;&#20998;&#25903;&#19978;&#30340;&#25152;&#26377;&#24037;&#20316;&#65292;&#22312;&#21512;&#24182;&#20102;&#20320;&#30340;&#25152;&#26377;&#20462;&#25913;&#21040;<code class="filename">/calc/trunk</code>&#21518;&#65292;&#27809;&#26377;&#24517;&#35201;&#32487;&#32493;&#20445;&#30041;&#20320;&#30340;&#31169;&#26377;&#20998;&#25903;&#30446;&#24405;&#65306;</p>
        <pre class="screen">
$ svn delete http://svn.example.com/repos/calc/branches/my-calc-branch \
             -m "Removing obsolete branch of calc project."

Committed revision 375.
</pre>
        <p>&#20320;&#30340;&#20998;&#25903;&#24050;&#32463;&#28040;&#22833;&#20102;&#65292;&#24403;&#28982;&#19981;&#26159;&#30495;&#30340;&#28040;&#22833;&#20102;&#65306;&#36825;&#20010;&#30446;&#24405;&#21482;&#26159;&#22312;<code class="literal">HEAD</code>&#20462;&#35746;&#29256;&#26412;&#37324;&#28040;&#22833;&#20102;&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;<span class="command"><strong>svn checkout</strong></span>&#12289;<span class="command"><strong>svn switch</strong></span>&#25110;&#32773;<span class="command"><strong>svn list</strong></span>&#26469;&#26816;&#26597;&#19968;&#20010;&#26087;&#30340;&#29256;&#26412;&#65292;&#20320;&#20173;&#20250;&#35265;&#21040;&#36825;&#20010;&#26087;&#30340;&#20998;&#25903;&#12290;</p>
        <p>&#22914;&#26524;&#27983;&#35272;&#20320;&#21024;&#38500;&#30340;&#30446;&#24405;&#36824;&#19981;&#36275;&#22815;&#65292;&#20320;&#21487;&#20197;&#25226;&#23427;&#25214;&#22238;&#26469;&#65292;&#24674;&#22797;&#25968;&#25454;&#23545;Subversion&#26469;&#35828;&#24456;&#31616;&#21333;&#65292;&#22914;&#26524;&#20320;&#24076;&#26395;&#24674;&#22797;&#19968;&#20010;&#24050;&#32463;&#21024;&#38500;&#30340;&#30446;&#24405;(&#25110;&#25991;&#20214;)&#21040;<code class="literal">HEAD</code>&#65292;&#20165;&#38656;&#35201;&#20351;&#29992;<span class="command"><strong>svn copy -r</strong></span>&#26469;&#20174;&#26087;&#30340;&#29256;&#26412;&#25335;&#36125;&#20986;&#26469;&#65306;</p>
        <pre class="screen">
$ svn copy -r 374 http://svn.example.com/repos/calc/branches/my-calc-branch \
                  http://svn.example.com/repos/calc/branches/my-calc-branch

Committed revision 376.
</pre>
        <p>&#22312;&#25105;&#20204;&#30340;&#20363;&#23376;&#37324;&#65292;&#20320;&#30340;&#20010;&#20154;&#20998;&#25903;&#21482;&#26377;&#19968;&#20010;&#30456;&#23545;&#30701;&#30340;&#29983;&#21629;&#21608;&#26399;&#65306;&#20320;&#20250;&#20026;&#20462;&#22797;&#19968;&#20010;Bug&#25110;&#23454;&#29616;&#19968;&#20010;&#23567;&#30340;&#29305;&#24615;&#26469;&#21019;&#24314;&#23427;&#65292;&#24403;&#20219;&#21153;&#23436;&#25104;&#65292;&#20998;&#25903;&#20063;&#35813;&#32467;&#26463;&#20102;&#12290;&#22312;&#36719;&#20214;&#24320;&#21457;&#36807;&#31243;&#20013;&#65292;&#26377;&#20004;&#20010;&#8220;<span class="quote">&#20027;&#35201;&#30340;</span>&#8221;&#20998;&#25903;&#19968;&#30452;&#23384;&#22312;&#24456;&#38271;&#30340;&#26102;&#38388;&#20063;&#26159;&#24456;&#24120;&#35265;&#30340;&#24773;&#20917;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#20551;&#23450;&#25105;&#20204;&#26159;&#21457;&#24067;&#19968;&#20010;&#31283;&#23450;&#30340;<code class="filename">calc</code>&#39033;&#30446;&#30340;&#26102;&#20505;&#20102;&#65292;&#20294;&#25105;&#20204;&#20173;&#20250;&#38656;&#35201;&#20960;&#20010;&#26376;&#30340;&#26102;&#38388;&#26469;&#20462;&#22797;Bug&#65292;&#20320;&#19981;&#24076;&#26395;&#28155;&#21152;&#26032;&#30340;&#29305;&#24615;&#65292;&#20294;&#20320;&#19981;&#24076;&#26395;&#21578;&#35785;&#24320;&#21457;&#32773;&#20572;&#27490;&#24320;&#21457;&#65292;&#25152;&#20197;&#20316;&#20026;&#26367;&#20195;&#65292;&#20320;&#20026;&#36719;&#20214;&#21019;&#24314;&#20102;&#19968;&#20010;&#8220;<span class="quote">&#20998;&#25903;</span>&#8221;&#65292;&#36825;&#20010;&#20998;&#25903;&#26356;&#25913;&#19981;&#20250;&#24456;&#22810;&#65306;</p>
        <pre class="screen">
$ svn copy http://svn.example.com/repos/calc/trunk \
         http://svn.example.com/repos/calc/branches/stable-1.0 \
         -m "Creating stable branch of calc project."

Committed revision 377.
</pre>
        <p>&#32780;&#19988;&#24320;&#21457;&#32773;&#21487;&#20197;&#33258;&#30001;&#30340;&#32487;&#32493;&#28155;&#21152;&#26032;&#30340;(&#35797;&#39564;&#30340;)&#29305;&#24615;&#21040;<code class="filename">/calc/trunk</code>&#65292;&#20320;&#21487;&#20197;&#23459;&#24067;&#36825;&#26679;&#19968;&#31181;&#25919;&#31574;&#65292;&#21482;&#26377;bug&#20462;&#27491;&#25552;&#20132;&#21040;<code class="filename">/calc/branches/stable-1.0</code>&#65292;&#36825;&#26679;&#30340;&#35805;&#65292;&#20154;&#20204;&#32487;&#32493;&#22312;&#20027;&#24178;&#19978;&#24037;&#20316;&#65292;&#26576;&#20010;&#20154;&#20250;&#36873;&#25321;&#22312;&#31283;&#23450;&#20998;&#25903;&#19978;&#20570;&#20986;&#19968;&#20123;Bug&#20462;&#27491;&#65292;&#29978;&#33267;&#22312;&#31283;&#23450;&#29256;&#26412;&#21457;&#24067;&#20043;&#21518;&#12290;&#20320;&#25110;&#35768;&#20250;&#22312;&#36825;&#20010;&#32500;&#25252;&#20998;&#25903;&#19978;&#24037;&#20316;&#24456;&#38271;&#26102;&#38388;&#8212;&#20063;&#23601;&#26159;&#35828;&#65292;&#20320;&#20250;&#19968;&#30452;&#32487;&#32493;&#20026;&#23458;&#25143;&#25552;&#20379;&#36825;&#20010;&#29256;&#26412;&#30340;&#25903;&#25345;&#12290;</p>
      </div>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.tags.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.branchmerge.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.vendorbr.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#26631;&#31614;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#20379;&#26041;&#20998;&#25903;</td></tr></table></div></body></html>