<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;"><link rel="prev" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;"><link rel="next" href="svn.reposadmin.create.html" title="&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.reposadmin.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.reposadmin.create.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.reposadmin.planning"></a>&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</h2></div></div></div>
      
      <p>&#22240;&#20026;Subversion&#29256;&#26412;&#24211;&#26412;&#36523;&#21644;&#25152;&#20381;&#36182;&#25216;&#26415;&#35774;&#35745;&#30340;&#31616;&#21333;&#24615;&#65292;&#21019;&#24314;&#21644;&#37197;&#32622;&#29256;&#26412;&#24211;&#26159;&#19968;&#20214;&#30456;&#23545;&#30452;&#25509;&#30340;&#20219;&#21153;&#12290;&#38656;&#35201;&#20570;&#19968;&#20123;&#30340;&#39044;&#22791;&#20915;&#23450;&#65292;&#20294;&#26159;&#35774;&#32622;Subversion&#29256;&#26412;&#24211;&#30340;&#23454;&#38469;&#24037;&#20316;&#38750;&#24120;&#30452;&#25509;&#65292;&#22312;&#20570;&#36807;&#20960;&#27425;&#20043;&#21518;&#23601;&#20250;&#21457;&#29616;&#19981;&#24517;&#36153;&#22826;&#22810;&#24515;&#24605;&#21435;&#20570;&#36825;&#20214;&#20107;&#12290;</p>
      <p>&#19979;&#38754;&#26159;&#19968;&#20123;&#20320;&#38656;&#35201;&#39044;&#20808;&#32771;&#34385;&#30340;&#20107;&#24773;&#65306;</p>
      <div class="itemizedlist"><ul type="disc"><li>
          <p>&#20320;&#30340;&#29256;&#26412;&#24211;&#23558;&#35201;&#23384;&#25918;&#20160;&#20040;&#25968;&#25454;(&#25110;&#22810;&#20010;&#29256;&#26412;&#24211;)&#65292;&#36825;&#20123;&#25968;&#25454;&#22914;&#20309;&#32452;&#32455;&#65311;</p>
        </li><li>
          <p>&#29256;&#26412;&#24211;&#23384;&#25918;&#22312;&#21738;&#37324;&#65292;&#22914;&#20309;&#34987;&#35775;&#38382;&#65311;</p>
        </li><li>
          <p>&#20320;&#38656;&#35201;&#20160;&#20040;&#31867;&#22411;&#30340;&#35775;&#38382;&#25511;&#21046;&#21644;&#29256;&#26412;&#24211;&#20107;&#20214;&#25253;&#21578;&#65311;</p>
        </li><li>
          <p>&#20320;&#24076;&#26395;&#20351;&#29992;&#21738;&#31181;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#65311;</p>
        </li></ul></div>
      <p>&#22312;&#26412;&#33410;&#65292;&#25105;&#20204;&#35201;&#23581;&#35797;&#24110;&#20320;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.projects.chooselayout"></a>&#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;</h3></div></div></div>
        
        <p>&#22312;Subversion&#29256;&#26412;&#24211;&#20013;&#65292;&#31227;&#21160;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#20449;&#24687;&#65292;&#29978;&#33267;&#20063;&#21487;&#20197;&#23558;&#29256;&#26412;&#24211;&#30340;&#30340;&#19968;&#32452;&#25968;&#25454;&#26080;&#25439;&#21382;&#21490;&#30340;&#31227;&#26893;&#21040;&#21478;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#20294;&#26159;&#36825;&#26679;&#19968;&#26469;&#37027;&#20123;&#32463;&#24120;&#35775;&#38382;&#29256;&#26412;&#24211;&#24182;&#19988;&#20197;&#20026;&#25991;&#20214;&#24635;&#26159;&#22312;&#21516;&#19968;&#20010;&#36335;&#24452;&#30340;&#29992;&#25143;&#21487;&#33021;&#20250;&#21463;&#21040;&#24178;&#25200;&#12290;&#20026;&#23558;&#26469;&#30528;&#24819;&#65292;&#26368;&#22909;&#39044;&#20808;&#23545;&#20320;&#30340;&#29256;&#26412;&#24211;&#24067;&#23616;&#36827;&#34892;&#35268;&#21010;&#12290;&#20197;&#19968;&#31181;&#39640;&#25928;&#30340;&#8220;<span class="quote">&#24067;&#23616;</span>&#8221;&#24320;&#22987;&#39033;&#30446;&#65292;&#21487;&#20197;&#20943;&#23569;&#23558;&#26469;&#24456;&#22810;&#19981;&#24517;&#35201;&#30340;&#40635;&#28902;&#12290;</p>
        <p>&#20551;&#22914;&#20320;&#26159;&#19968;&#20010;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#65292;&#38656;&#35201;&#21521;&#22810;&#20010;&#39033;&#30446;&#25552;&#20379;&#29256;&#26412;&#25511;&#21046;&#25903;&#25345;&#12290;&#37027;&#20040;&#65292;&#20320;&#39318;&#20808;&#35201;&#20915;&#23450;&#30340;&#26159;&#65292;&#29992;&#19968;&#20010;&#29256;&#26412;&#24211;&#25903;&#25345;&#22810;&#20010;&#39033;&#30446;&#65292;&#36824;&#26159;&#20026;&#27599;&#20010;&#39033;&#30446;&#24314;&#31435;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#36824;&#26159;&#20004;&#31181;&#26041;&#27861;&#30340;&#28151;&#21512;&#26041;&#24335;&#12290;</p>
        <p>&#20351;&#29992;&#19968;&#20010;&#29256;&#26412;&#24211;&#25903;&#25345;&#22810;&#20010;&#39033;&#30446;&#26377;&#24456;&#22810;&#22909;&#22788;&#65292;&#26368;&#26126;&#26174;&#30340;&#26080;&#36807;&#20110;&#19981;&#38656;&#35201;&#32500;&#25252;&#22909;&#20960;&#20010;&#29256;&#26412;&#24211;&#12290;&#21333;&#19968;&#29256;&#26412;&#24211;&#23601;&#24847;&#21619;&#30528;&#21482;&#26377;&#19968;&#20010;&#38057;&#23376;&#31243;&#24207;&#65292;&#21482;&#38656;&#35201;&#22791;&#20221;&#19968;&#20010;&#25968;&#25454;&#24211;&#65292;&#24403;Subversion&#36827;&#34892;&#19981;&#20860;&#23481;&#21319;&#32423;&#26102;&#65292;&#21482;&#38656;&#35201;&#19968;&#27425;&#36716;&#20648;&#21644;&#35013;&#36733;&#25805;&#20316;&#65292;&#31561;&#31561;&#12290;&#36824;&#26377;&#65292;&#20320;&#21487;&#20197;&#36731;&#26131;&#30340;&#22312;&#39033;&#30446;&#20043;&#38388;&#31227;&#21160;&#25968;&#25454;&#65292;&#36824;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#21382;&#21490;&#29256;&#26412;&#20449;&#24687;&#12290;</p>
        <p>&#21333;&#19968;&#29256;&#26412;&#24211;&#30340;&#32570;&#28857;&#26159;&#65292;&#19981;&#21516;&#30340;&#39033;&#30446;&#36890;&#24120;&#37117;&#26377;&#19981;&#21516;&#30340;&#29256;&#26412;&#24211;&#35302;&#21457;&#20107;&#20214;&#38656;&#27714;&#65292;&#20363;&#22914;&#38656;&#35201;&#21457;&#36865;&#25552;&#20132;&#36890;&#30693;&#37038;&#20214;&#21040;&#19981;&#21516;&#30340;&#37038;&#20214;&#21015;&#34920;&#65292;&#38656;&#35201;&#19981;&#21516;&#30340;&#37492;&#23450;&#25552;&#20132;&#26159;&#21542;&#21512;&#27861;&#30340;&#23450;&#20041;&#12290;&#36825;&#20123;&#37117;&#19981;&#26159;&#19981;&#21487;&#36926;&#36234;&#30340;&#38382;&#39064;&#65292;&#24403;&#28982;&#8212;&#20043;&#38656;&#35201;&#20320;&#30340;&#38057;&#23376;&#31243;&#24207;&#33021;&#22815;&#23519;&#30475;&#29256;&#26412;&#24211;&#30340;&#24067;&#23616;&#65292;&#32780;&#19981;&#26159;&#20551;&#23450;&#25972;&#20010;&#29256;&#26412;&#24211;&#19982;&#21516;&#19968;&#32452;&#20154;&#20851;&#32852;&#12290;&#36824;&#26377;&#65292;&#21035;&#24536;&#20102;Subversion&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#26159;&#38024;&#23545;&#25972;&#20010;&#29256;&#26412;&#24211;&#30340;&#65292;&#36825;&#20123;&#21495;&#30721;&#27809;&#26377;&#20219;&#20309;&#39764;&#21147;&#12290;&#21363;&#20351;&#26368;&#36817;&#27809;&#26377;&#23545;&#26576;&#20010;&#39033;&#30446;&#20316;&#20986;&#20462;&#25913;&#65292;&#29256;&#26412;&#24211;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#36824;&#26159;&#20250;&#22240;&#20026;&#20854;&#23427;&#39033;&#30446;&#30340;&#20462;&#25913;&#32780;&#19981;&#20572;&#30340;&#25552;&#21319;&#65292;&#35768;&#22810;&#20154;&#24182;&#19981;&#21916;&#27426;&#36825;&#26679;&#30340;&#20107;&#23454;&#12290;<sup>[<a name="d4e3591" href="#ftn.d4e3591" class="footnote">25</a>]</sup></p>
        <p>&#21487;&#20197;&#37319;&#29992;&#25240;&#20013;&#30340;&#21150;&#27861;&#12290;&#27604;&#22914;&#65292;&#21487;&#20197;&#25226;&#35768;&#22810;&#39033;&#30446;&#25353;&#29031;&#24444;&#27492;&#20043;&#38388;&#30340;&#20851;&#32852;&#31243;&#24230;&#21010;&#20998;&#20026;&#20960;&#20010;&#32452;&#21512;&#65292;&#28982;&#21518;&#20026;&#27599;&#19968;&#20010;&#39033;&#30446;&#32452;&#21512;&#24314;&#31435;&#19968;&#20010;&#29256;&#26412;&#24211;&#12290;&#36825;&#26679;&#65292;&#22312;&#30456;&#20851;&#39033;&#30446;&#20043;&#38388;&#20849;&#20139;&#25968;&#25454;&#20381;&#26087;&#24456;&#31616;&#21333;&#65292;&#32780;&#22914;&#26524;&#20462;&#35746;&#29256;&#26412;&#21495;&#26377;&#20102;&#21464;&#21270;&#65292;&#33267;&#23569;&#24320;&#21457;&#20154;&#21592;&#30693;&#36947;&#65292;&#25913;&#21464;&#30340;&#19996;&#35199;&#22810;&#23569;&#21644;&#20182;&#20204;&#26377;&#20123;&#20851;&#31995;&#12290;</p>
        <p>&#22312;&#20915;&#23450;&#20102;&#22914;&#20309;&#29992;&#29256;&#26412;&#24211;&#32452;&#32455;&#39033;&#30446;&#20197;&#21518;&#65292;&#23601;&#35813;&#20915;&#23450;&#22914;&#20309;&#35774;&#32622;&#29256;&#26412;&#24211;&#30340;&#30446;&#24405;&#23618;&#27425;&#20102;&#12290;&#30001;&#20110;Subversion&#25353;&#26222;&#36890;&#30340;&#30446;&#24405;&#22797;&#21046;&#26041;&#24335;&#23436;&#25104;&#20998;&#25903;&#21644;&#26631;&#31614;&#25805;&#20316;(&#21442;&#35265;<a class="xref" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;">&#31532;&nbsp;4&nbsp;&#31456; <i>&#20998;&#25903;&#19982;&#21512;&#24182;</i></a>)&#65292;Subversion&#31038;&#21306;&#24314;&#35758;&#20026;&#27599;&#19968;&#20010;&#39033;&#30446;&#24314;&#31435;&#19968;&#20010;<em class="firstterm">&#39033;&#30446;&#26681;&#30446;&#24405;</em>&#8212;&#39033;&#30446;&#30340;&#8220;<span class="quote">&#39030;&#32423;</span>&#8221;&#30446;&#24405;&#8212;&#28982;&#21518;&#22312;&#26681;&#30446;&#24405;&#19979;&#24314;&#31435;&#19977;&#20010;&#23376;&#30446;&#24405;&#65306;<code class="filename">trunk</code>&#65292;&#20445;&#23384;&#39033;&#30446;&#30340;&#24320;&#21457;&#20027;&#32447;&#65307;<code class="filename">branches</code>&#65292;&#20445;&#23384;&#39033;&#30446;&#30340;&#21508;&#31181;&#24320;&#21457;&#20998;&#25903;&#65307;<code class="filename">tags</code>&#65292;&#20445;&#23384;&#39033;&#30446;&#30340;&#26631;&#31614;&#65292;&#20063;&#23601;&#26159;&#21019;&#24314;&#21518;&#27704;&#36828;&#19981;&#20250;&#20462;&#25913;&#30340;&#20998;&#25903;(&#21487;&#33021;&#20250;&#21024;&#38500;)&#12290; <sup>[<a name="d4e3601" href="#ftn.d4e3601" class="footnote">26</a>]</sup></p>
        <p>&#20030;&#20010;&#20363;&#23376;&#65292;&#19968;&#20010;&#29256;&#26412;&#24211;&#21487;&#33021;&#20250;&#26377;&#22914;&#19979;&#30340;&#24067;&#23616;&#65306;</p>
        <pre class="screen">
/
   calc/
      trunk/
      tags/
      branches/
   calendar/
      trunk/
      tags/
      branches/
   spreadsheet/
      trunk/
      tags/
      branches/
   &#8230;
</pre>
        <p>&#39033;&#30446;&#22312;&#29256;&#26412;&#24211;&#20013;&#30340;&#26681;&#30446;&#24405;&#22320;&#22336;&#24182;&#19981;&#37325;&#35201;&#12290;&#22914;&#26524;&#27599;&#20010;&#29256;&#26412;&#24211;&#20013;&#21482;&#26377;&#19968;&#20010;&#39033;&#30446;&#65292;&#37027;&#20040;&#23601;&#21487;&#20197;&#35748;&#20026;&#39033;&#30446;&#30340;&#26681;&#30446;&#24405;&#23601;&#26159;&#29256;&#26412;&#24211;&#30340;&#26681;&#30446;&#24405;&#12290;&#22914;&#26524;&#29256;&#26412;&#24211;&#20013;&#21253;&#21547;&#22810;&#20010;&#39033;&#30446;&#65292;&#37027;&#20040;&#21487;&#20197;&#23558;&#36825;&#20123;&#39033;&#30446;&#21010;&#20998;&#25104;&#19981;&#21516;&#30340;&#32452;&#21512;(&#25353;&#29031;&#39033;&#30446;&#30340;&#30446;&#26631;&#25110;&#32773;&#26159;&#21542;&#38656;&#35201;&#20849;&#20139;&#20195;&#30721;&#29978;&#33267;&#26159;&#23383;&#27597;&#39034;&#24207;)&#20445;&#23384;&#22312;&#19981;&#21516;&#23376;&#30446;&#24405;&#20013;&#65292;&#19979;&#38754;&#30340;&#20363;&#23376;&#32473;&#20986;&#20102;&#19968;&#20010;&#31867;&#20284;&#30340;&#24067;&#23616;&#65306;</p>
        <pre class="screen">
/
   utils/
      calc/
         trunk/
         tags/
         branches/
      calendar/
         trunk/
         tags/
         branches/
      &#8230;
   office/
      spreadsheet/
         trunk/
         tags/
         branches/
      &#8230;
</pre>
        <p>&#25353;&#29031;&#20320;&#35748;&#20026;&#21512;&#36866;&#30340;&#26041;&#24335;&#23433;&#25490;&#29256;&#26412;&#24211;&#30340;&#24067;&#23616;&#65292;Subversion&#33258;&#36523;&#24182;&#19981;&#24378;&#21046;&#25110;&#32773;&#20559;&#22909;&#26576;&#19968;&#31181;&#24067;&#23616;&#24418;&#24335;&#65292;&#23545;&#20110;Subversion&#26469;&#35828;&#65292;&#30446;&#24405;&#23601;&#26159;&#30446;&#24405;&#12290;&#26368;&#21518;&#65292;&#22312;&#35774;&#35745;&#29256;&#26412;&#24211;&#24067;&#23616;&#30340;&#26102;&#20505;&#65292;&#19981;&#35201;&#24536;&#20102;&#32771;&#34385;&#19968;&#19979;&#39033;&#30446;&#21442;&#19982;&#32773;&#20204;&#30340;&#24847;&#35265;&#12290;</p>
        <p>&#20026;&#20102;&#23436;&#25972;&#24615;&#65292;&#25105;&#20204;&#38656;&#35201;&#25552;&#19968;&#19979;&#21478;&#19968;&#31181;&#24120;&#35265;&#30340;&#24067;&#23616;&#65292;&#22312;&#36825;&#31181;&#24067;&#23616;&#20013;<code class="filename">trunk</code>&#12289;<code class="filename">tags</code>&#21644;<code class="filename">branches</code>&#37117;&#22312;&#26681;&#30446;&#24405;&#19979;&#65292;&#32780;&#20320;&#30340;&#39033;&#30446;&#22312;&#21508;&#20010;&#23376;&#30446;&#24405;&#19979;&#65292;&#20363;&#22914;&#65306;</p>
        <pre class="screen">
/
   trunk/
      calc/
      calendar/
      spreadsheet/
      &#8230;
   tags/
      calc/
      calendar/
      spreadsheet/
      &#8230;
   branches/
      calc/
      calendar/
      spreadsheet/
      &#8230;
</pre>
        <p>&#36825;&#31181;&#24067;&#23616;&#27809;&#26377;&#20160;&#20040;&#19981;&#23545;&#30340;&#65292;&#20294;&#26159;&#23427;&#21482;&#26159;&#25110;&#19981;&#26159;&#20320;&#30340;&#29992;&#25143;&#30340;&#30452;&#35273;&#12290;&#29305;&#21035;&#26159;&#22312;&#22823;&#30340;&#65292;&#26377;&#35768;&#22810;&#29992;&#25143;&#30340;&#22810;&#39033;&#30446;&#24773;&#20917;&#19979;&#65292;&#29992;&#25143;&#21487;&#33021;&#21482;&#29087;&#24713;&#29256;&#26412;&#24211;&#20013;&#19968;&#20004;&#20010;&#39033;&#30446;&#12290;&#20294;&#26159;&#39033;&#30446;&#20316;&#20026;&#20998;&#25903;&#30340;&#26041;&#24335;&#21487;&#20197;&#40723;&#21169;&#39033;&#30446;&#30340;&#20010;&#24615;&#21644;&#23558;&#27880;&#24847;&#21147;&#38598;&#20013;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#23454;&#20307;&#12290;&#23613;&#31649;&#36825;&#20063;&#26159;&#19968;&#20010;&#31038;&#20250;&#38382;&#39064;&#65292;&#22240;&#20026;&#23454;&#36341;&#30340;&#21407;&#22240;&#65292;&#25105;&#20204;&#24456;&#24895;&#24847;&#23545;&#23433;&#25490;&#25552;&#20986;&#19968;&#20123;&#24314;&#35758;&#8212;&#24403;&#19968;&#20010;&#39033;&#30446;&#30340;&#21382;&#21490;&#37117;&#22312;&#19968;&#20010;&#30446;&#24405;&#37324;&#26102;&#65292;&#24456;&#23481;&#26131;&#26597;&#35810;(&#25110;&#26159;&#20462;&#25913;&#12289;&#31227;&#26893;)&#21333;&#20010;&#39033;&#30446;&#30340;&#21382;&#21490;&#8212;&#36807;&#21435;&#12289;&#29616;&#22312;&#12289;&#26631;&#31614;&#21644;&#20998;&#25903;&#8212;&#21333;&#29420;&#20026;&#37027;&#20010;&#39033;&#30446;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.basics.hosting"></a>&#20915;&#23450;&#22312;&#21738;&#37324;&#19982;&#22914;&#20309;&#37096;&#32626;&#20320;&#30340;&#29256;&#26412;&#24211;</h3></div></div></div>
        
        <p>&#22312;&#21019;&#24314;Subversion&#29256;&#26412;&#24211;&#20043;&#21069;&#65292;&#19968;&#20010;&#26126;&#26174;&#30340;&#38382;&#39064;&#26159;&#25152;&#26377;&#30340;&#19996;&#35199;&#35201;&#23384;&#25918;&#22312;&#20160;&#20040;&#22320;&#26041;&#65292;&#36825;&#19982;&#24456;&#22810;&#38382;&#39064;&#20851;&#32852;&#65292;&#21253;&#25324;&#29256;&#26412;&#24211;&#22914;&#20309;&#35775;&#38382;(&#36890;&#36807;Subversion&#26381;&#21153;&#22120;&#25110;&#30452;&#25509;&#35775;&#38382;)&#12289;&#34987;&#35841;&#35775;&#38382;(&#38450;&#28779;&#22681;&#21518;&#30340;&#29992;&#25143;&#25110;&#20840;&#37096;&#26159;&#22312;Internet&#19978;)&#12289;&#20320;&#23558;&#22260;&#32469;Subversion&#25552;&#20379;&#21738;&#20123;&#26381;&#21153;(&#29256;&#26412;&#24211;&#27983;&#35272;&#25509;&#21475;&#65292;e-mail&#20026;&#22522;&#30784;&#30340;&#25552;&#20132;&#36890;&#30693;&#31561;)&#12289;&#20320;&#30340;&#25968;&#25454;&#22791;&#20221;&#31574;&#30053;&#65292;&#31561;&#31561;&#12290;</p>
        <p>&#25105;&#20204;&#22312;<a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>&#35206;&#30422;&#20102;&#26381;&#21153;&#22120;&#30340;&#36873;&#25321;&#21644;&#37197;&#32622;&#65292;&#25105;&#20204;&#20063;&#25552;&#20379;&#19968;&#20123;&#21487;&#33021;&#20250;&#20351;&#20320;&#24517;&#39035;&#20915;&#23450;&#20351;&#29992;&#26576;&#31181;&#26381;&#21153;&#22120;&#30340;&#38382;&#39064;&#30340;&#31572;&#26696;&#12290;&#20363;&#22914;&#65292;&#29305;&#23450;&#30340;&#37096;&#32626;&#31574;&#30053;&#21487;&#33021;&#20250;&#38656;&#35201;&#20174;&#22810;&#20010;&#35745;&#31639;&#26426;&#36890;&#36807;&#36828;&#31243;&#25991;&#20214;&#31995;&#32479;&#35775;&#38382;&#29256;&#26412;&#24211;&#65292;&#36825;&#20010;&#24773;&#20917;&#19979;(&#19979;&#19968;&#23567;&#33410;&#20250;&#35835;&#21040;)&#35201;&#27714;&#20320;&#19981;&#33021;&#36873;&#25321;&#19968;&#31181;&#29256;&#26412;&#24211;&#21518;&#31471;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#65292;&#22240;&#20026;&#21482;&#26377;&#19968;&#31181;&#21518;&#31471;&#22312;&#36825;&#31181;&#22330;&#26223;&#19979;&#21487;&#20197;&#24037;&#20316;&#12290;</p>
        <p>&#21015;&#20986;&#25152;&#26377;&#30340;Subversion&#21487;&#33021;&#30340;&#37096;&#32626;&#26041;&#27861;&#26159;&#19981;&#21487;&#33021;&#30340;&#65292;&#36229;&#20986;&#20102;&#26412;&#20070;&#30340;&#33539;&#22260;&#65292;&#25105;&#20204;&#21482;&#26159;&#31616;&#21333;&#30340;&#40723;&#21169;&#20320;&#20351;&#29992;&#36825;&#37096;&#20998;&#20869;&#23481;&#21644;&#21442;&#32771;&#26448;&#26009;&#39564;&#35777;&#20320;&#30340;&#24819;&#27861;&#65292;&#24182;&#24448;&#21069;&#35745;&#21010;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.basics.backends"></a>&#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;</h3></div></div></div>
        
        <p>&#22312;Subversion1.1&#20013;&#65292;&#29256;&#26412;&#24211;&#20013;&#26377;&#20004;&#31181;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#8212;&#36890;&#24120;&#21483;&#20570;&#8220;<span class="quote">&#21518;&#31471;</span>&#8221;&#25110;&#20854;&#20182;&#23481;&#26131;&#28151;&#28102;&#30340;&#21517;&#23383;&#65292;&#22914;&#8220;<span class="quote">(&#29256;&#26412;&#21270;&#30340;) &#25991;&#20214;&#31995;&#32479;</span>&#8221;&#65292;&#27599;&#19968;&#20010;&#29256;&#26412;&#24211;&#37117;&#20250;&#20351;&#29992;&#19968;&#31181;&#12290;&#19968;&#31181;&#26159;&#22312;Berkeley DB&#25968;&#25454;&#24211;&#20013;&#23384;&#20648;&#25968;&#25454;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;&#8220;<span class="quote">BDB&#21518;&#31471;</span>&#8221;&#65307;&#21478;&#19968;&#31181;&#26159;&#20351;&#29992;&#26222;&#36890;&#30340;&#25991;&#20214;&#65292;&#33258;&#23450;&#20041;&#26684;&#24335;&#65292;Subversion&#24320;&#21457;&#32773;&#26681;&#25454;&#20064;&#24815;&#31216;&#20043;&#20026;<em class="firstterm">FSFS</em><sup>[<a name="d4e3635" href="#ftn.d4e3635" class="footnote">27</a>]</sup> &#8212;&#19968;&#31181;&#20351;&#29992;&#26412;&#22320;&#25805;&#20316;&#31995;&#32479;&#25991;&#20214;&#23384;&#20648;&#25968;&#25454;&#30340;&#29256;&#26412;&#21270;&#25991;&#20214;&#31995;&#32479;&#30452;&#25509;&#23454;&#29616;&#8212;&#32780;&#19981;&#26159;&#36890;&#36807;&#26576;&#20010;&#25968;&#25454;&#24211;&#23618;&#25110;&#20854;&#20182;&#25277;&#35937;&#23618;&#26469;&#20445;&#23384;&#25968;&#25454;&#12290;</p>
        <p><a class="xref" href="svn.reposadmin.planning.html#svn.reposadmin.basics.backends.tbl-1" title="&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;">&#34920;&nbsp;5.1 &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;&#8221;</a>&#20174;&#24635;&#20307;&#19978;&#27604;&#36739;&#20102;Berkeley DB&#21644;FSFS&#29256;&#26412;&#24211;&#12290;</p>
        <div class="table"><a name="svn.reposadmin.basics.backends.tbl-1"></a><p class="title"><b>&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;</b></p><div class="table-contents">
          
          <table summary="&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;" border="1"><colgroup><col width="25%"><col width="25%"><col width="25%"><col width="25%"></colgroup><thead><tr><th>&#20998;&#31867;</th><th>&#29305;&#24615;</th><th>Berkeley DB</th><th>FSFS</th></tr></thead><tbody><tr><td rowspan="2">&#21487;&#38752;&#24615;</td><td>&#25968;&#25454;&#23436;&#25972;&#24615;</td><td>&#24403;&#27491;&#30830;&#37096;&#32626;&#65292;&#38750;&#24120;&#21487;&#38752;&#65307;Berkeley DB 4.4&#25903;&#25345;&#33258;&#21160;&#24674;&#22797;</td><td>&#36739;&#32769;&#30340;&#29256;&#26412;&#36739;&#23569;&#34987;&#25551;&#36848;&#65292;&#20294;&#26159;&#26377;&#25968;&#25454;&#27585;&#22351;bug</td></tr><tr><td>&#23545;&#25805;&#20316;&#20013;&#26029;&#30340;&#25935;&#24863;</td><td>&#24456;&#25935;&#24863;&#65307;&#31995;&#32479;&#23849;&#28291;&#25110;&#32773;&#26435;&#38480;&#38382;&#39064;&#20250;&#23548;&#33268;&#25968;&#25454;&#24211;&#8220;<span class="quote">&#22622;&#20303;</span>&#8221;&#65292;&#38656;&#35201;&#23450;&#26399;&#36827;&#34892;&#24674;&#22797;&#12290;</td><td>&#21313;&#20998;&#25935;&#24863;</td></tr><tr><td rowspan="4">&#21487;&#29992;&#24615;</td><td>&#21487;&#21482;&#35835;&#21152;&#36733;</td><td>&#19981;&#33021;</td><td>&#21487;&#20197;</td></tr><tr><td>&#23384;&#20648;&#24179;&#21488;&#26080;&#20851;</td><td>&#19981;&#33021;</td><td>&#21487;&#20197;</td></tr><tr><td>&#21487;&#20174;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#35775;&#38382;</td><td>&#36890;&#24120;&#65292;&#19981;</td><td>&#21487;&#20197;</td></tr><tr><td>&#32452;&#35775;&#38382;&#26435;&#22788;&#29702;</td><td>&#23545;&#20110;&#29992;&#25143;&#30340;umask&#35774;&#32622;&#21313;&#20998;&#25935;&#24863;&#65292;&#26368;&#22909;&#21482;&#30001;&#19968;&#20010;&#29992;&#25143;&#35775;&#38382;&#12290;</td><td>&#23545;umask&#35774;&#32622;&#19981;&#25935;&#24863;</td></tr><tr><td rowspan="3">&#20280;&#32553;&#24615;</td><td>&#29256;&#26412;&#24211;&#30913;&#30424;&#20351;&#29992;&#24773;&#20917;</td><td>&#36739;&#22823;(&#29305;&#21035;&#26159;&#27809;&#26377;&#28165;&#38500;&#26085;&#24535;&#26102;)</td><td>&#36739;&#23567;</td></tr><tr><td>&#20462;&#35746;&#29256;&#26412;&#26641;&#30340;&#25968;&#37327;</td><td>&#25968;&#25454;&#24211;&#65292;&#27809;&#26377;&#38480;&#21046;</td><td>&#35768;&#22810;&#21476;&#32769;&#30340;&#26412;&#22320;&#25991;&#20214;&#31995;&#32479;&#22312;&#22788;&#29702;&#21333;&#19968;&#30446;&#24405;&#21253;&#21547;&#19978;&#21315;&#20010;&#26465;&#30446;&#26102;&#20986;&#29616;&#38382;&#39064;&#12290;</td></tr><tr><td>&#26377;&#24456;&#22810;&#25991;&#20214;&#30340;&#30446;&#24405;</td><td>&#36739;&#24930;</td><td>&#36739;&#24555;</td></tr><tr><td rowspan="2">&#24615;&#33021;</td><td>&#26816;&#20986;&#26368;&#26032;&#30340;&#20195;&#30721;</td><td>&#27809;&#26377;&#26377;&#24847;&#20041;&#30340;&#21306;&#21035;</td><td>&#27809;&#26377;&#26377;&#24847;&#20041;&#30340;&#21306;&#21035;</td></tr><tr><td>&#22823;&#30340;&#25552;&#20132;</td><td>&#25972;&#20307;&#36739;&#24930;&#65292;&#20294;&#26159;&#22312;&#25972;&#20010;&#25552;&#20132;&#21608;&#26399;&#20013;&#28040;&#32791;&#34987;&#20998;&#25674;</td><td>&#36739;&#24555;&#65292;&#20294;&#26159;&#26368;&#21518;&#36739;&#38271;&#30340;&#24310;&#26102;&#21487;&#33021;&#20250;&#23548;&#33268;&#23458;&#25143;&#31471;&#25805;&#20316;&#36229;&#26102;</td></tr></tbody></table>
        </div></div><br class="table-break">
        <p>&#20004;&#31181;&#21518;&#31471;&#37117;&#26377;&#20248;&#28857;&#21644;&#32570;&#28857;&#65292;&#27809;&#26377;&#19968;&#31181;&#26356;&#21152;&#8220;<span class="quote">&#27491;&#24335;</span>&#8221;&#65292;&#23613;&#31649;&#26032;&#30340;FSFS&#22312;Subversion1.2&#25104;&#20026;&#32570;&#30465;&#25968;&#25454;&#23384;&#20648;&#65292;&#20004;&#32773;&#29992;&#26469;&#23384;&#20648;&#29256;&#26412;&#21270;&#25968;&#25454;&#37117;&#26159;&#21487;&#38752;&#30340;&#12290;&#20294;&#26159;&#23601;&#35937;&#20320;&#22312;<a class="xref" href="svn.reposadmin.planning.html#svn.reposadmin.basics.backends.tbl-1" title="&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;">&#34920;&nbsp;5.1 &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;&#8221;</a>&#30475;&#21040;&#30340;&#65292;FSFS&#21518;&#31471;&#22312;&#37096;&#32626;&#22330;&#26223;&#20013;&#25552;&#20379;&#20102;&#26356;&#22810;&#30340;&#28789;&#27963;&#24615;&#65292;&#26356;&#28789;&#27963;&#24847;&#21619;&#30528;&#20320;&#24456;&#38590;&#38169;&#35823;&#30340;&#37197;&#32622;&#12290;&#37027;&#20123;&#21407;&#22240;&#8212;&#21152;&#19978;&#19981;&#20351;&#29992;Berkeley DB&#24847;&#21619;&#30528;&#22312;&#36825;&#20010;&#31995;&#32479;&#26377;&#26356;&#23569;&#30340;&#32452;&#20214;&#8212;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#20170;&#22825;&#20960;&#20046;&#25152;&#26377;&#30340;&#20154;&#37117;&#20351;&#29992;FSFS&#26469;&#21019;&#24314;&#26032;&#30340;&#29256;&#26412;&#24211;&#12290;</p>
        <p>&#24184;&#36816;&#30340;&#26159;&#65292;&#22823;&#22810;&#25968;&#35775;&#38382;Subversion&#30340;&#31243;&#24207;&#19981;&#20250;&#22312;&#24847;&#20854;&#25152;&#29992;&#30340;&#21518;&#31471;&#25968;&#25454;&#23384;&#20648;&#12290;&#32780;&#19988;&#20320;&#19981;&#24517;&#19968;&#23450;&#35201;&#20351;&#29992;&#20320;&#26368;&#21021;&#30340;&#25968;&#25454;&#23384;&#20648;&#26041;&#27861;&#8212;&#22914;&#26524;&#21518;&#26469;&#20320;&#25913;&#21464;&#20102;&#20027;&#24847;&#65292;Subversion&#25552;&#20379;&#20102;&#31227;&#26893;&#29256;&#26412;&#24211;&#25968;&#25454;&#21040;&#21478;&#19968;&#20010;&#29256;&#26412;&#24211;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#20250;&#22312;&#21518;&#38754;&#35814;&#32454;&#35752;&#35770;&#12290;</p>
        <p>&#19979;&#38754;&#30340;&#23567;&#33410;&#25552;&#20379;&#20102;&#25968;&#25454;&#23384;&#20648;&#31867;&#22411;&#26356;&#21152;&#35814;&#32454;&#30340;&#20171;&#32461;&#12290;</p>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.reposadmin.basics.backends.bdb"></a>Berkeley DB</h4></div></div></div>
          
          <p>&#22312;Subversion&#30340;&#21021;&#22987;&#35774;&#35745;&#38454;&#27573;&#65292;&#24320;&#21457;&#32773;&#22240;&#20026;&#22810;&#31181;&#21407;&#22240;&#32780;&#20915;&#23450;&#37319;&#29992;Berkeley DB&#65292;&#27604;&#22914;&#23427;&#30340;&#24320;&#28304;&#21327;&#35758;&#12289;&#20107;&#21153;&#25903;&#25345;&#12289;&#21487;&#38752;&#24615;&#12289;&#24615;&#33021;&#12289;&#31616;&#21333;&#30340;API&#12289;&#32447;&#31243;&#23433;&#20840;&#12289;&#25903;&#25345;&#28216;&#26631;&#31561;&#12290;</p>
          <p>Berkeley DB&#25552;&#20379;&#20102;&#30495;&#27491;&#30340;&#20107;&#21153;&#25903;&#25345;&#65293;&#36825;&#25110;&#35768;&#26159;&#23427;&#26368;&#24378;&#22823;&#30340;&#29305;&#24615;&#65292;&#35775;&#38382;&#20320;&#30340;Subversion&#29256;&#26412;&#24211;&#30340;&#22810;&#20010;&#36827;&#31243;&#19981;&#24517;&#25285;&#24515;&#20598;&#23572;&#20250;&#30772;&#22351;&#20854;&#20182;&#36827;&#31243;&#30340;&#25968;&#25454;&#12290;&#20107;&#21153;&#31995;&#32479;&#25552;&#20379;&#30340;&#38548;&#31163;&#23545;&#20110;&#20219;&#20309;&#32473;&#23450;&#30340;&#25805;&#20316;&#65292;Subversion&#29256;&#26412;&#24211;&#20195;&#30721;&#30475;&#21040;&#30340;&#21482;&#26159;&#25968;&#25454;&#24211;&#30340;&#38745;&#24577;&#35270;&#22270;&#65293;&#32780;&#19981;&#26159;&#19968;&#20010;&#22312;&#20854;&#20182;&#36827;&#31243;&#24433;&#21709;&#19981;&#26029;&#21464;&#21270;&#30340;&#25968;&#25454;&#24211;&#65293;&#24182;&#33021;&#22815;&#26681;&#25454;&#35813;&#35270;&#22270;&#20316;&#20986;&#20915;&#23450;&#12290;&#22914;&#26524;&#35813;&#20915;&#23450;&#27491;&#22909;&#21516;&#20854;&#20182;&#36827;&#31243;&#25152;&#20570;&#25805;&#20316;&#20914;&#31361;&#65292;&#25972;&#20010;&#25805;&#20316;&#20250;&#22238;&#28378;&#65292;&#23601;&#20687;&#20160;&#20040;&#37117;&#27809;&#26377;&#21457;&#29983;&#19968;&#26679;&#65292;&#24182;&#19988;Subversion&#20250;&#20248;&#38597;&#30340;&#20877;&#27425;&#23545;&#26356;&#26032;&#30340;&#38745;&#24577;&#35270;&#22270;&#36827;&#34892;&#25805;&#20316;&#12290;</p>
          <p>Berkeley DB&#21478;&#19968;&#20010;&#24378;&#22823;&#30340;&#29305;&#24615;&#26159;&#28909;&#22791;&#20221;&#65293;&#19981;&#24517;&#8220;<span class="quote">&#33073;&#26426;</span>&#8221;&#23601;&#21487;&#20197;&#22791;&#20221;&#25968;&#25454;&#24211;&#29615;&#22659;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#23558;&#20250;&#22312;<a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.backup" title="&#29256;&#26412;&#24211;&#22791;&#20221;">&#8220;&#29256;&#26412;&#24211;&#22791;&#20221;&#8221;&#19968;&#33410;</a>&#35752;&#35770;&#22914;&#20309;&#22791;&#20221;&#20320;&#30340;&#29256;&#26412;&#24211;&#65292;&#33021;&#22815;&#19981;&#20572;&#27490;&#31995;&#32479;&#23545;&#29256;&#26412;&#24211;&#20570;&#20840;&#38754;&#22791;&#20221;&#30340;&#22909;&#22788;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#12290;</p>
          <p>Berkeley DB&#21516;&#26102;&#26159;&#19968;&#20010;&#21487;&#20449;&#36182;&#30340;&#25968;&#25454;&#24211;&#31995;&#32479;&#12290;Subversion&#21033;&#29992;&#20102;Berkeley DB&#21487;&#20197;&#35760;&#26085;&#24535;&#30340;&#20415;&#21033;&#65292;&#36825;&#24847;&#21619;&#30528;&#25968;&#25454;&#24211;&#20808;&#22312;&#30913;&#30424;&#19978;&#20889;&#19968;&#20010;&#26085;&#24535;&#25991;&#20214;&#65292;&#25551;&#36848;&#23427;&#23558;&#35201;&#20570;&#30340;&#20462;&#25913;&#65292;&#28982;&#21518;&#20877;&#20570;&#36825;&#20123;&#20462;&#25913;&#12290;&#36825;&#26159;&#20026;&#20102;&#30830;&#20445;&#22914;&#26524;&#22914;&#26524;&#20219;&#20309;&#22320;&#26041;&#20986;&#20102;&#24046;&#38169;&#65292;&#25968;&#25454;&#24211;&#31995;&#32479;&#33021;&#24674;&#22797;&#21040;&#20808;&#21069;&#30340;<em class="firstterm">&#26816;&#26597;&#28857;</em>&#8212;&#19968;&#20010;&#26085;&#24535;&#25991;&#20214;&#35748;&#20026;&#27809;&#26377;&#38169;&#35823;&#30340;&#20301;&#32622;&#65292;&#37325;&#26032;&#24320;&#22987;&#20107;&#21153;&#30452;&#21040;&#25968;&#25454;&#24674;&#22797;&#20026;&#19968;&#20010;&#21487;&#29992;&#30340;&#29366;&#24577;&#12290;&#20851;&#20110;Berkeley DB&#26085;&#24535;&#25991;&#20214;&#30340;&#26356;&#22810;&#20449;&#24687;&#35831;&#26597;&#30475;<a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.diskspace" title="&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;">&#8220;&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;&#8221;&#19968;&#33410;</a>&#12290;</p>
          <p>&#20294;&#26159;&#27599;&#26421;&#29611;&#29808;&#37117;&#26377;&#21050;&#65292;&#25105;&#20204;&#20063;&#24517;&#39035;&#35760;&#24405;&#19968;&#20123;Berkeley DB&#24050;&#30693;&#30340;&#32570;&#38519;&#12290;&#39318;&#20808;&#65292;Berkeley DB&#29615;&#22659;&#19981;&#26159;&#36328;&#24179;&#21488;&#30340;&#12290;&#20320;&#19981;&#33021;&#31616;&#21333;&#30340;&#25335;&#36125;&#19968;&#20010;&#22312;Unix&#19978;&#21019;&#24314;&#30340;Subversion&#29256;&#26412;&#24211;&#21040;&#19968;&#20010;Windows&#31995;&#32479;&#24182;&#26399;&#26395;&#23427;&#33021;&#22815;&#27491;&#24120;&#24037;&#20316;&#12290;&#23613;&#31649;Berkeley DB&#25968;&#25454;&#24211;&#30340;&#22823;&#37096;&#20998;&#26684;&#24335;&#26159;&#19981;&#21463;&#26550;&#26500;&#32422;&#26463;&#30340;&#65292;&#20294;&#29615;&#22659;&#36824;&#26159;&#26377;&#19968;&#20123;&#26041;&#38754;&#27809;&#26377;&#29420;&#31435;&#20986;&#26469;&#12290;&#20854;&#27425;&#65292;&#20351;&#29992;Berkeley DB&#30340;Subversion&#19981;&#33021;&#22312;95/98&#31995;&#32479;&#19978;&#36816;&#34892;&#8212;&#22914;&#26524;&#20320;&#38656;&#35201;&#23558;&#29256;&#26412;&#24211;&#24314;&#22312;&#19968;&#20010;Windows&#26426;&#22120;&#19978;&#65292;&#35831;&#35013;&#21040;Windows2000&#25110;WindowsXP&#19978;&#12290;</p>
          <p>&#28982;&#32780;Berkeley DB&#23545;&#20110;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#32452;&#35268;&#33539;&#65292;<sup>[<a name="d4e3721" href="#ftn.d4e3721" class="footnote">28</a>]</sup>&#22823;&#22810;&#25968;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#21644;&#24212;&#29992;&#27809;&#26377;&#23454;&#29616;&#36825;&#20010;&#35201;&#27714;&#65292;&#25152;&#20197;&#19981;&#33021;&#20801;&#35768;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#30340;BDB&#21518;&#31471;&#29256;&#26412;&#24211;&#34987;&#22810;&#20010;&#23458;&#25143;&#31471;&#21516;&#26102;&#35775;&#38382;(&#39318;&#20808;&#35201;&#30693;&#36947;&#29256;&#26412;&#24211;&#23384;&#25918;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#26159;&#38750;&#24120;&#26222;&#36941;&#30340;)&#12290;</p>
          <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#35686;&#21578;</h3>
            <p>&#22914;&#26524;&#20320;&#23581;&#35797;&#22312;&#19981;&#39034;&#20174;&#30340;&#36828;&#31243;&#25991;&#20214;&#31995;&#32479;&#19978;&#20351;&#29992;Berkeley DB&#65292;&#32467;&#26524;&#26159;&#19981;&#21487;&#39044;&#30693;&#30340;&#8212;&#20320;&#20250;&#31435;&#21051;&#30475;&#21040;&#31070;&#31192;&#30340;&#38169;&#35823;&#65292;&#25110;&#32773;&#26159;&#22312;&#21457;&#29983;&#38544;&#21547;&#38169;&#35823;&#20043;&#21518;&#20960;&#20010;&#26376;&#20043;&#21518;&#25165;&#21457;&#29616;&#12290;&#20320;&#24517;&#39035;&#35748;&#30495;&#32771;&#34385;&#22312;&#32593;&#32476;&#20849;&#20139;&#24773;&#20917;&#19979;&#20351;&#29992;FSFS&#25968;&#25454;&#23384;&#20648;&#12290;</p>
          </div>
          <p>&#26368;&#21518;&#65292;&#22240;&#20026;Berkeley DB&#30340;&#24211;&#30452;&#25509;&#38142;&#25509;&#21040;&#20102;Subversion&#20013;&#65292;&#23427;&#23545;&#20110;&#20013;&#26029;&#27604;&#20856;&#22411;&#30340;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#31995;&#32479;&#26356;&#20026;&#25935;&#24863;&#12290;&#22823;&#22810;&#25968;SQL&#31995;&#32479;&#65292;&#20030;&#20363;&#26469;&#35828;&#65292;&#26377;&#19968;&#20010;&#20027;&#26381;&#21153;&#36827;&#31243;&#26469;&#21327;&#35843;&#23545;&#25968;&#25454;&#24211;&#34920;&#30340;&#35775;&#38382;&#12290;&#22914;&#26524;&#19968;&#20010;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#31243;&#24207;&#22240;&#20026;&#26576;&#31181;&#21407;&#22240;&#20986;&#29616;&#38382;&#39064;&#65292;&#25968;&#25454;&#24211;&#23432;&#25252;&#36827;&#31243;&#23519;&#35273;&#21040;&#36830;&#25509;&#20013;&#26029;&#20250;&#20570;&#19968;&#20123;&#28165;&#29702;&#12290;&#22240;&#20026;&#25968;&#25454;&#24211;&#23432;&#25252;&#36827;&#31243;&#26159;&#21807;&#19968;&#35775;&#38382;&#25968;&#25454;&#24211;&#34920;&#30340;&#36827;&#31243;&#65292;&#24212;&#29992;&#31243;&#24207;&#19981;&#38656;&#35201;&#25285;&#24515;&#35775;&#38382;&#35768;&#21487;&#30340;&#20914;&#31361;&#12290;&#20294;&#26159;&#65292;&#36825;&#20123;&#24773;&#20917;&#19982;Berkeley DB&#19981;&#21516;&#12290;Subversion(&#21644;&#20351;&#29992;Subversion&#24211;&#30340;&#31243;&#24207;)&#30452;&#25509;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#34920;&#65292;&#36825;&#24847;&#21619;&#30528;&#22914;&#26524;&#26377;&#19968;&#20010;&#31243;&#24207;&#23849;&#28291;&#65292;&#23601;&#20250;&#20351;&#25968;&#25454;&#24211;&#22788;&#20110;&#19968;&#20010;&#26242;&#26102;&#30340;&#19981;&#19968;&#33268;&#12289;&#19981;&#21487;&#35775;&#38382;&#30340;&#29366;&#24577;&#12290;&#24403;&#36825;&#31181;&#24773;&#20917;&#21457;&#29983;&#26102;&#65292;&#31649;&#29702;&#21592;&#38656;&#35201;&#35753;Berkeley DB&#24674;&#22797;&#21040;&#19968;&#20010;&#26816;&#26597;&#28857;&#65292;&#36825;&#30340;&#30830;&#26377;&#28857;&#35752;&#21388;&#12290;&#38500;&#20102;&#23849;&#28291;&#30340;&#36827;&#31243;&#65292;&#36824;&#26377;&#19968;&#20123;&#24773;&#20917;&#33021;&#35753;&#29256;&#26412;&#24211;&#20986;&#29616;&#24322;&#24120;&#65292;&#27604;&#22914;&#31243;&#24207;&#22312;&#25968;&#25454;&#24211;&#25991;&#20214;&#30340;&#25152;&#26377;&#26435;&#25110;&#35775;&#38382;&#26435;&#38480;&#19978;&#21457;&#29983;&#20914;&#31361;&#12290;</p>
          <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3>
            <p>Berkeley DB 4.4(&#23545;&#24212;Subversion 1.4&#21644;&#26356;&#39640;)&#25552;&#20379;&#20102;&#22312;&#38656;&#35201;&#24674;&#22797;&#26102;&#33258;&#21160;&#24674;&#22797;Berkeley DB&#29615;&#22659;&#30340;&#33021;&#21147;&#65292;&#24403;Subversion&#36827;&#31243;&#21457;&#29616;&#20219;&#20309;&#20197;&#21069;&#36827;&#31243;&#26410;&#28165;&#29702;&#30340;&#36830;&#25509;&#65292;&#23601;&#20250;&#25191;&#34892;&#25152;&#26377;&#21487;&#33021;&#30340;&#24674;&#22797;&#65292;&#28982;&#21518;&#23601;&#24403;&#20160;&#20040;&#37117;&#27809;&#26377;&#21457;&#29983;&#19968;&#26679;&#32487;&#32493;&#25191;&#34892;&#12290;&#36825;&#26679;&#19981;&#20250;&#23436;&#20840;&#28040;&#38500;&#29256;&#26412;&#24211;&#26964;&#20303;&#30340;&#21487;&#33021;&#65292;&#20294;&#26159;&#22823;&#22823;&#20943;&#23569;&#20102;&#20154;&#24037;&#24178;&#39044;&#24674;&#22797;&#30340;&#25968;&#37327;&#12290;</p>
          </div>
          <p>&#22240;&#20026;Berkeley DB&#26159;&#36825;&#26679;&#24555;&#36895;&#21644;&#21487;&#20280;&#32553;&#65292;&#26368;&#22909;&#26159;&#20351;&#29992;&#26576;&#31181;&#21333;&#29992;&#25143;&#21333;&#26381;&#21153;&#36827;&#31243;&#26041;&#24335;&#22788;&#29702;&#8212;&#20363;&#22914;Apache&#30340;<span class="command"><strong>httpd</strong></span>&#25110;<span class="command"><strong>svnserve</strong></span>(&#35265;<a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>)&#8212;&#32780;&#26368;&#22909;&#19981;&#35201;&#20351;&#29992;&#35768;&#22810;&#19981;&#21516;&#30340;&#29992;&#25143;&#36890;&#36807;<code class="literal">file://</code>&#25110;<code class="literal">svn+ssh://</code>&#30340;URL&#35775;&#38382;&#30340;&#26041;&#27861;&#12290;&#22914;&#26524;&#20351;&#29992;&#22810;&#20010;&#29992;&#25143;&#30452;&#25509;&#35775;&#38382;Berkeley DB&#29256;&#26412;&#24211;&#30340;&#65292;&#35831;&#30830;&#23450;&#35201;&#35835;<a class="xref" href="svn.serverconfig.multimethod.html" title="&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;">&#8220;&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;&#8221;&#19968;&#33410;</a>&#12290;</p>
        </div>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.reposadmin.basics.backends.fsfs"></a>FSFS</h4></div></div></div>
          
          <p>&#22312;2004&#24180;&#20013;&#26399;&#65292;&#21478;&#19968;&#31181;&#29256;&#26412;&#24211;&#23384;&#20648;&#31995;&#32479;&#24930;&#24930;&#24418;&#25104;&#20102;&#65306;&#19968;&#31181;&#19981;&#38656;&#35201;&#25968;&#25454;&#24211;&#30340;&#23384;&#20648;&#31995;&#32479;&#12290;FSFS&#29256;&#26412;&#24211;&#22312;&#21333;&#19968;&#25991;&#20214;&#20013;&#23384;&#20648;&#20462;&#35746;&#29256;&#26412;&#26641;&#65292;&#25152;&#20197;&#29256;&#26412;&#24211;&#20013;&#25152;&#26377;&#30340;&#20462;&#35746;&#29256;&#26412;&#37117;&#22312;&#19968;&#20010;&#23376;&#25991;&#20214;&#22841;&#20013;&#26377;&#38480;&#30340;&#20960;&#20010;&#25991;&#20214;&#37324;&#12290;&#20107;&#21153;&#22312;&#21333;&#29420;&#30340;&#23376;&#30446;&#24405;&#20013;&#34987;&#21019;&#24314;&#65292;&#21019;&#24314;&#23436;&#25104;&#21518;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#20107;&#21153;&#25991;&#20214;&#34987;&#21019;&#24314;&#24182;&#31227;&#21160;&#21040;&#20462;&#35746;&#29256;&#26412;&#30446;&#24405;&#65292;&#36825;&#20445;&#35777;&#25552;&#20132;&#26159;&#21407;&#23376;&#24615;&#30340;&#12290;&#22240;&#20026;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#25991;&#20214;&#26159;&#25345;&#20037;&#19981;&#21487;&#25913;&#21464;&#30340;&#65292;&#29256;&#26412;&#24211;&#20063;&#21487;&#20197;&#20570;&#21040;&#8220;<span class="quote">&#28909;</span>&#8221;&#22791;&#20221;&#65292;&#23601;&#35937;Berkeley DB&#29256;&#26412;&#24211;&#19968;&#26679;&#12290;</p>
          <p>&#20462;&#35746;&#29256;&#26412;&#25991;&#20214;&#26684;&#24335;&#20195;&#34920;&#20102;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#30340;&#30446;&#24405;&#32467;&#26500;&#65292;&#25991;&#20214;&#20869;&#23481;&#65292;&#21644;&#20854;&#23427;&#20462;&#35746;&#29256;&#26412;&#26641;&#20013;&#30456;&#20851;&#20449;&#24687;&#12290;&#19981;&#20687;Berkeley DB&#25968;&#25454;&#24211;&#65292;&#36825;&#31181;&#23384;&#20648;&#26684;&#24335;&#21487;&#36328;&#24179;&#21488;&#24182;&#19988;&#19982;CPU&#26550;&#26500;&#26080;&#20851;&#12290;&#22240;&#20026;&#27809;&#26377;&#26085;&#24535;&#25110;&#29992;&#21040;&#20849;&#20139;&#20869;&#23384;&#30340;&#25991;&#20214;&#65292;&#25968;&#25454;&#24211;&#33021;&#34987;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#23433;&#20840;&#30340;&#35775;&#38382;&#21644;&#22312;&#21482;&#35835;&#29615;&#22659;&#19979;&#26816;&#26597;&#12290;&#32570;&#23569;&#25968;&#25454;&#24211;&#33457;&#28040;&#21516;&#26102;&#20063;&#24847;&#21619;&#30528;&#29256;&#26412;&#24211;&#30340;&#24635;&#20307;&#20307;&#31215;&#21487;&#20197;&#31245;&#23567;&#19968;&#28857;&#12290;</p>
          <p>FSFS&#20063;&#26377;&#19968;&#31181;&#19981;&#21516;&#30340;&#24615;&#33021;&#29305;&#24615;&#12290;&#24403;&#25552;&#20132;&#22823;&#37327;&#25991;&#20214;&#26102;&#65292;FSFS&#21487;&#20197;&#26356;&#24555;&#30340;&#36861;&#21152;&#26465;&#30446;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;FSFS&#36890;&#36807;&#20889;&#20837;&#19982;&#19978;&#19968;&#20010;&#29256;&#26412;&#27604;&#36739;&#30340;&#21464;&#21270;&#26469;&#35760;&#24405;&#26032;&#29256;&#26412;&#65292;&#36825;&#20063;&#24847;&#21619;&#30528;&#33719;&#21462;&#26368;&#26032;&#20462;&#35746;&#29256;&#26412;&#26102;&#20250;&#27604;Berkeley DB&#24930;&#19968;&#28857;&#65292;&#25552;&#20132;&#26102;FSFS&#20063;&#20250;&#26377;&#19968;&#20010;&#26356;&#38271;&#30340;&#24310;&#36831;&#65292;&#22312;&#26576;&#20123;&#26497;&#31471;&#24773;&#20917;&#19979;&#20250;&#23548;&#33268;&#23458;&#25252;&#31471;&#22312;&#31561;&#24453;&#22238;&#24212;&#26102;&#36229;&#26102;&#12290;</p>
          <p>&#26368;&#37325;&#35201;&#30340;&#21306;&#21035;&#26159;&#24403;&#20986;&#29616;&#38169;&#35823;&#26102;FSFS&#19981;&#20250;&#26964;&#20303;&#30340;&#33021;&#21147;&#12290;&#22914;&#26524;&#20351;&#29992;Berkeley DB&#30340;&#36827;&#31243;&#21457;&#29983;&#35768;&#21487;&#38169;&#35823;&#25110;&#31361;&#28982;&#23849;&#28291;&#65292;&#25968;&#25454;&#24211;&#20250;&#19968;&#30452;&#26080;&#27861;&#20351;&#29992;&#65292;&#30452;&#21040;&#31649;&#29702;&#21592;&#24674;&#22797;&#12290;&#20551;&#22914;&#22312;&#24212;&#29992;FSFS&#29256;&#26412;&#24211;&#26102;&#21457;&#29983;&#21516;&#26679;&#30340;&#24773;&#20917;&#65292;&#29256;&#26412;&#24211;&#19981;&#20250;&#21463;&#21040;&#20219;&#20309;&#24178;&#25200;&#65292;&#26368;&#22351;&#24773;&#20917;&#19979;&#20063;&#23601;&#26159;&#20250;&#30041;&#19979;&#19968;&#20123;&#20107;&#21153;&#25968;&#25454;&#12290;</p>
          <p>FSFS&#30340;&#21807;&#19968;&#30495;&#23454;&#30340;&#20105;&#35758;&#26159;&#20854;&#30456;&#23545;&#20110;Berkeley DB&#30340;&#19981;&#25104;&#29087;&#65292;&#19981;&#20687;Berkeley DB&#26377;&#30528;&#22810;&#24180;&#21382;&#21490;&#30340;&#65292;&#32780;&#19988;&#26377;&#19987;&#38376;&#30340;&#24320;&#21457;&#22242;&#38431;&#65292;&#24378;&#22823;&#30340;Oracle&#20250;&#25552;&#20379;&#25903;&#25345;&#12290;<sup>[<a name="d4e3745" href="#ftn.d4e3745" class="footnote">29</a>]</sup>FSFS&#22312;&#24037;&#31243;&#19978;&#26356;&#26032;&#19968;&#28857;&#65292;&#22312;Subversion1.4&#20043;&#21069;&#65292;&#25105;&#20204;&#36824;&#26410;&#19968;&#20123;&#30830;&#23454;&#24456;&#20005;&#37325;&#30340;&#25968;&#25454;&#19968;&#33268;&#24615;&#38382;&#39064;&#39076;&#25238;&#65292;&#23613;&#31649;&#21482;&#22312;&#38750;&#24120;&#32597;&#35265;&#30340;&#24773;&#20917;&#19979;&#21457;&#29983;&#65292;&#28982;&#32780;&#36824;&#26159;&#21457;&#29983;&#20102;&#12290;&#20294;&#26159;&#65292;FSFS&#36824;&#26159;&#24456;&#24555;&#34987;&#19968;&#20123;&#26368;&#22823;&#30340;&#24320;&#25918;&#21644;&#31169;&#26377;Subversion&#29256;&#26412;&#24211;&#25152;&#37319;&#29992;&#65292;&#24182;&#19988;&#25215;&#35834;&#20102;&#22312;&#36328;&#24179;&#21488;&#26102;&#30340;&#26377;&#36739;&#23569;&#30340;&#40635;&#28902;&#12290;</p>
        </div>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e3591" href="#d4e3591" class="para">25</a>] </sup>&#26080;&#35770;&#26159;&#22312;&#24573;&#30053;&#24773;&#20917;&#19979;&#24314;&#31435;&#25110;&#24456;&#23569;&#32771;&#34385;&#36807;&#22914;&#20309;&#20135;&#29983;&#27491;&#30830;&#30340;&#36719;&#20214;&#24320;&#21457;&#30697;&#38453;&#65292;&#37117;&#19981;&#24212;&#35813;&#24858;&#34850;&#30340;&#25285;&#24515;&#20840;&#23616;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#65292;&#36825;&#19981;&#24212;&#35813;&#25104;&#20026;&#23433;&#25490;&#39033;&#30446;&#21644;&#29256;&#26412;&#24211;&#30340;&#29702;&#30001;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e3601" href="#d4e3601" class="para">26</a>] </sup><code class="filename">trunk</code>&#12289;<code class="filename">tags</code>&#21644;<code class="filename">branches</code>&#21487;&#20197;&#20351;&#29992;&#8220;<span class="quote">TTB&#30446;&#24405;</span>&#8221;&#26469;&#34920;&#31034;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e3635" href="#d4e3635" class="para">27</a>] </sup>&#36890;&#24120;&#35835;&#20316;&#8220;<span class="quote">fuzz-fuzz</span>&#8221;, &#22914;&#26524;Jack Repenning&#35828;&#36215;&#36825;&#20010;&#38382;&#39064;&#12290;(&#26412;&#20070;&#65292;&#20551;&#23450;&#35835;&#32773;&#35748;&#20026;&#26159;&#8220;<span class="quote">eff-ess-eff-ess</span>&#8221;&#12290;)</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e3721" href="#d4e3721" class="para">28</a>] </sup>Berkeley DB&#38656;&#35201;&#24213;&#23618;&#30340;&#25991;&#20214;&#31995;&#32479;&#23454;&#29616;&#20005;&#26684;&#30340;POSIX&#38145;&#23450;&#35821;&#27861;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#23558;&#25991;&#20214;&#30452;&#25509;&#26144;&#23556;&#21040;&#20869;&#23384;&#30340;&#33021;&#21147;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e3745" href="#d4e3745" class="para">29</a>] </sup>Oracle&#22312;2006&#24773;&#20154;&#33410;&#36141;&#20080;&#20102;Sleepycat&#21644;&#23427;&#30340;&#26071;&#33328;&#36719;&#20214;Berkeley DB&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.reposadmin.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.reposadmin.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.reposadmin.create.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;</td></tr></table></div></body></html>