<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#22522;&#20110;&#36335;&#24452;&#30340;&#25480;&#26435;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;"><link rel="prev" href="svn.serverconfig.httpd.html" title="httpd&#65292;Apache&#30340;HTTP&#26381;&#21153;&#22120;"><link rel="next" href="svn.serverconfig.multimethod.html" title="&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#22522;&#20110;&#36335;&#24452;&#30340;&#25480;&#26435;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.serverconfig.httpd.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.serverconfig.multimethod.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.serverconfig.pathbasedauthz"></a>&#22522;&#20110;&#36335;&#24452;&#30340;&#25480;&#26435;</h2></div></div></div>
      
      <p>Apache&#21644;<span class="command"><strong>svnserve</strong></span>&#37117;&#21487;&#20197;&#32473;&#29992;&#25143;&#36171;&#20104;(&#25110;&#25298;&#32477;)&#35775;&#38382;&#35768;&#21487;&#65292;&#36890;&#24120;&#26159;&#23545;&#25972;&#20010;&#29256;&#26412;&#24211;&#65306;&#19968;&#20010;&#29992;&#25143;&#21487;&#20197;&#35835;&#29256;&#26412;&#24211;(&#25110;&#19981;)&#65292;&#32780;&#19988;&#20182;&#21487;&#20197;&#20889;&#29256;&#26412;&#24211;(&#25110;&#19981;)&#12290;&#22914;&#26524;&#21487;&#33021;&#65292;&#20063;&#21487;&#20197;&#23450;&#20041;&#32454;&#31890;&#24230;&#30340;&#35775;&#38382;&#35268;&#21017;&#12290;&#19968;&#32452;&#29992;&#25143;&#21487;&#20197;&#26377;&#29256;&#26412;&#24211;&#30340;&#19968;&#20010;&#30446;&#24405;&#30340;&#35835;&#20889;&#26435;&#38480;&#65292;&#20294;&#26159;&#27809;&#26377;&#20854;&#23427;&#30340;&#65307;&#21478;&#19968;&#20010;&#30446;&#24405;&#21487;&#20197;&#26159;&#21482;&#23545;&#19968;&#23569;&#37096;&#20998;&#29992;&#25143;&#21487;&#35835;&#12290;</p>
      <p>&#20004;&#31181;&#26381;&#21153;&#22120;&#37117;&#20351;&#29992;&#21516;&#26679;&#30340;&#25991;&#20214;&#26684;&#24335;&#25551;&#36848;&#36335;&#24452;&#20026;&#22522;&#30784;&#30340;&#35268;&#21017;&#65292;&#22914;&#26524;&#26159;Apache&#65292;&#38656;&#35201;&#21152;&#36733;<span class="command"><strong>mod_authz_svn</strong></span>&#27169;&#22359;&#65292;&#28982;&#21518;&#28155;&#21152;<code class="literal">AuthzSVNAccessFile</code>&#25351;&#31034;(&#22312;&#25991;&#20214;<code class="filename">httpd.conf</code>&#20013;)&#25351;&#26126;&#20320;&#30340;&#35268;&#21017;&#25991;&#20214;&#12290;(&#23436;&#20840;&#35299;&#37322;&#21487;&#20197;&#30475;<a class="xref" href="svn.serverconfig.httpd.html#svn.serverconfig.httpd.authz.perdir" title="&#27599;&#30446;&#24405;&#35775;&#38382;&#25511;&#21046;">&#8220;&#27599;&#30446;&#24405;&#35775;&#38382;&#25511;&#21046;&#8221;&#19968;&#33410;</a>&#12290;)&#22914;&#26524;&#20320;&#22312;&#20351;&#29992;<span class="command"><strong>svnserve</strong></span>&#65292;&#20320;&#38656;&#35201;&#35753;&#20320;&#30340;<code class="literal">authz-db</code>&#21464;&#37327;(&#22312;<code class="filename">svnserve.conf</code>&#20013;)&#25351;&#21521;&#35268;&#21017;&#25991;&#20214;&#12290;</p>
      <div class="sidebar"><p class="title"><b>&#20320;&#30495;&#30340;&#38656;&#35201;&#22522;&#20110;&#36335;&#24452;&#30340;&#35775;&#38382;&#25511;&#21046;&#21527;&#65311;</b></p>
        
        <p>&#35768;&#22810;&#31532;&#19968;&#27425;&#35774;&#32622;Subversion&#30340;&#31649;&#29702;&#21592;&#20250;&#22312;&#26410;&#32463;&#22826;&#22810;&#30340;&#24605;&#32771;&#30340;&#24773;&#20917;&#19979;&#36731;&#26131;&#36873;&#25321;&#20351;&#29992;&#36335;&#24452;&#20026;&#22522;&#30784;&#30340;&#35775;&#38382;&#25511;&#21046;&#65292;&#31649;&#29702;&#21592;&#36890;&#24120;&#30693;&#36947;&#22242;&#38431;&#30340;&#25104;&#21592;&#24037;&#20316;&#22312;&#21738;&#20010;&#39033;&#30446;&#65292;&#25152;&#20197;&#24456;&#23481;&#26131;&#30830;&#23450;&#36171;&#20104;&#21738;&#20123;&#22242;&#38431;&#35775;&#38382;&#21738;&#20123;&#30446;&#24405;&#65292;&#19981;&#33021;&#35775;&#38382;&#21738;&#20123;&#30446;&#24405;&#12290;&#36825;&#30475;&#36215;&#26469;&#26159;&#24456;&#33258;&#28982;&#30340;&#20107;&#24773;&#65292;&#23427;&#28385;&#36275;&#20102;&#31649;&#29702;&#21592;&#32039;&#23494;&#25511;&#21046;&#29256;&#26412;&#24211;&#35775;&#38382;&#30340;&#24895;&#26395;&#12290;</p>
        <p>&#27880;&#24847;&#65292;&#36825;&#20010;&#29305;&#24615;&#36890;&#24120;&#26377;&#19968;&#20123;&#30475;&#19981;&#35265;(&#21644;&#21487;&#35265;&#30340;)&#20195;&#20215;&#12290;&#21487;&#35265;&#30340;&#65292;&#38656;&#35201;&#26356;&#22810;&#30340;&#24037;&#20316;&#26469;&#30830;&#20449;&#29992;&#25143;&#23545;&#26576;&#20010;&#36335;&#24452;&#26377;&#35835;&#20889;&#26435;&#38480;&#65307;&#22312;&#19968;&#20123;&#24773;&#20917;&#19979;&#65292;&#20250;&#26159;&#38750;&#24120;&#22823;&#30340;&#24615;&#33021;&#25439;&#22833;&#12290;&#19981;&#21487;&#35265;&#30340;&#65292;&#32771;&#34385;&#20320;&#21019;&#24314;&#30340;&#25991;&#21270;&#65292;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#22240;&#20026;&#29305;&#23450;&#29992;&#25143;&#19981;&#33021;&#22815;&#22312;&#29305;&#23450;&#30446;&#24405;&#25552;&#20132;&#20462;&#25913;&#65292;&#25152;&#20197;&#31038;&#20250;&#22865;&#32422;&#19981;&#24517;&#36890;&#36807;&#25216;&#26415;&#26469;&#21152;&#24378;&#12290;&#22242;&#38431;&#26377;&#26102;&#20505;&#21487;&#20197;&#33258;&#28982;&#30340;&#20114;&#30456;&#21327;&#20316;&#65307;&#19968;&#20123;&#20154;&#20250;&#36890;&#36807;&#20026;&#20182;&#20154;&#25552;&#20132;&#19981;&#33021;&#27491;&#24120;&#24037;&#20316;&#30446;&#24405;&#30340;&#20869;&#23481;&#30340;&#26041;&#27861;&#24110;&#21161;&#21035;&#20154;&#65292;&#20320;&#35774;&#32622;&#20102;&#19968;&#31181;&#19981;&#26399;&#26395;&#20132;&#27969;&#30340;&#38556;&#30861;&#12290;&#20320;&#20063;&#35201;&#24314;&#31435;&#19968;&#22871;&#39033;&#30446;&#24320;&#21457;&#12289;&#26032;&#20154;&#21152;&#20837;&#31561;&#27963;&#21160;&#30340;&#35268;&#21017;&#65292;&#36824;&#26377;&#24456;&#22810;&#39069;&#22806;&#30340;&#24037;&#20316;&#12290;</p>
        <p>&#35760;&#20303;&#36825;&#26159;&#19968;&#20010;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#21363;&#20351;&#19968;&#20123;&#20154;&#19981;&#23567;&#24515;&#25552;&#20132;&#20102;&#19968;&#20123;&#19981;&#35813;&#25552;&#20132;&#30340;&#19996;&#35199;&#65292;&#24456;&#23481;&#26131;&#22238;&#36864;&#20462;&#25913;&#12290;&#22914;&#26524;&#19968;&#20010;&#29992;&#25143;&#25925;&#24847;&#25552;&#20132;&#21040;&#20102;&#38169;&#35823;&#30340;&#20301;&#32622;&#65292;&#36825;&#26159;&#19968;&#20010;&#31038;&#20250;&#38382;&#39064;&#65292;&#38656;&#35201;&#22312;Subversion&#20043;&#22806;&#35299;&#20915;&#12290;</p>
        <p>&#25152;&#20197;&#22312;&#24320;&#22987;&#38480;&#21046;&#29992;&#25143;&#30340;&#35775;&#38382;&#26435;&#38480;&#20043;&#21069;&#65292;&#20320;&#35201;&#38382;&#20320;&#33258;&#24049;&#26159;&#21542;&#26377;&#19968;&#20010;&#30495;&#27491;&#30340;&#12289;&#27491;&#30452;&#30340;&#38656;&#35201;&#65292;&#25110;&#20165;&#20165;&#26159;&#20026;&#20102;&#23545;&#19968;&#20010;&#31649;&#29702;&#21592;&#26469;&#35828;&#36825;&#26679;&#8220;<span class="quote">&#21548;&#36215;&#26469;&#19981;&#38169;</span>&#8221;&#12290;&#20915;&#23450;&#26159;&#21542;&#20540;&#24471;&#24433;&#21709;&#26381;&#21153;&#22120;&#30340;&#36895;&#24230;&#65292;&#24517;&#39035;&#35760;&#20303;&#21482;&#26377;&#24456;&#23567;&#30340;&#39118;&#38505;&#65307;&#20381;&#38752;&#25216;&#26415;&#25163;&#27573;&#35299;&#20915;&#31038;&#20250;&#38382;&#39064;&#24182;&#19981;&#22909;&#12290;<sup>[<a name="d4e5425" href="#ftn.d4e5425" class="footnote">44</a>]</sup>&#12290;</p>
        <p>&#20316;&#20026;&#19968;&#20010;&#24605;&#32771;&#30340;&#20363;&#23376;&#65292;&#32771;&#34385;Subversion&#39033;&#30446;&#26412;&#36523;&#26377;&#20801;&#35768;&#26576;&#20010;&#29992;&#25143;&#21487;&#20197;&#22312;&#37027;&#20010;&#30446;&#24405;&#25552;&#20132;&#30340;&#35774;&#32622;&#65292;&#32780;&#21482;&#26159;&#36890;&#36807;&#31038;&#20132;&#26041;&#24335;&#35268;&#23450;&#12290;&#36825;&#26159;&#19968;&#20010;&#31038;&#21306;&#20449;&#20219;&#30340;&#22909;&#27169;&#22411;&#65292;&#29305;&#21035;&#26159;&#23545;&#24320;&#28304;&#39033;&#30446;&#12290;&#24403;&#28982;&#65292;&#26377;&#26102;&#20505;&#38656;&#35201;&#27491;&#32479;&#30340;&#36335;&#24452;&#20026;&#22522;&#30784;&#30340;&#35775;&#38382;&#25511;&#21046;&#65307;&#22312;&#20844;&#21496;&#20013;&#65292;&#20363;&#22914;&#65292;&#21482;&#26377;&#37096;&#20998;&#25968;&#25454;&#26159;&#25935;&#24863;&#30340;&#65292;&#21482;&#20801;&#35768;&#20197;&#23567;&#32452;&#20154;&#21487;&#20197;&#35775;&#38382;&#12290;</p>
      </div>
      <p>&#24403;&#20320;&#30340;&#26381;&#21153;&#22120;&#30693;&#36947;&#21435;&#26597;&#25214;&#35268;&#21017;&#25991;&#20214;&#26102;&#65292;&#23601;&#26159;&#38656;&#35201;&#23450;&#20041;&#35268;&#21017;&#30340;&#26102;&#20505;&#20102;&#12290;</p>
      <p>&#35775;&#38382;&#25991;&#20214;&#30340;&#35821;&#27861;&#19982;<span class="command"><strong>svnserve.conf</strong></span>&#21644;&#36816;&#34892;&#20013;&#37197;&#32622;&#25991;&#20214;&#38750;&#24120;&#30456;&#20284;&#65292;&#20197;(<code class="literal">#</code>)&#24320;&#22836;&#30340;&#34892;&#20250;&#34987;&#24573;&#30053;&#65292;&#22312;&#23427;&#30340;&#31616;&#21333;&#24418;&#24335;&#37324;&#65292;&#27599;&#19968;&#23567;&#33410;&#21629;&#21517;&#19968;&#20010;&#29256;&#26412;&#24211;&#21644;&#19968;&#20010;&#37324;&#38754;&#30340;&#36335;&#24452;&#65292;&#35748;&#35777;&#29992;&#25143;&#21517;&#26159;&#22312;&#27599;&#20010;&#23567;&#33410;&#20013;&#30340;&#36873;&#39033;&#21517;&#65292;&#27599;&#20010;&#36873;&#39033;&#30340;&#20540;&#25551;&#36848;&#20102;&#29992;&#25143;&#35775;&#38382;&#29256;&#26412;&#24211;&#30340;&#32423;&#21035;&#65306;<code class="literal">r</code>(&#21482;&#35835;)&#25110;&#32773;<code class="literal">rw</code>(&#35835;&#20889;)&#65292;&#22914;&#26524;&#29992;&#25143;&#27809;&#26377;&#25552;&#21040;&#65292;&#35775;&#38382;&#26159;&#19981;&#20801;&#35768;&#30340;&#12290;</p>
      <p>&#20855;&#20307;&#19968;&#28857;&#65306;&#36825;&#20010;&#23567;&#33410;&#30340;&#21517;&#31216;&#26159;<code class="literal">[repos-name:path]</code>&#25110;&#32773;<code class="literal">[path]</code>&#30340;&#24418;&#24335;&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;<code class="literal">SVNParentPath</code>&#25351;&#31034;&#65292;&#25351;&#23450;&#29256;&#26412;&#24211;&#30340;&#21517;&#23383;&#26159;&#24456;&#37325;&#35201;&#30340;&#65292;&#22914;&#26524;&#20320;&#28431;&#25481;&#20102;&#20182;&#20204;&#65292;<code class="literal">[/some/dir]</code>&#37096;&#20998;&#23601;&#20250;&#19982;<code class="filename">/some/dir</code>&#30340;&#25152;&#26377;&#29256;&#26412;&#24211;&#21305;&#37197;&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;<code class="literal">SVNPath</code>&#25351;&#31034;&#65292;&#22240;&#27492;&#22312;&#20320;&#30340;&#23567;&#33410;&#20013;&#21482;&#26159;&#23450;&#20041;&#36335;&#24452;&#20063;&#24456;&#22909;&#8212;&#27605;&#31455;&#21482;&#26377;&#19968;&#20010;&#29256;&#26412;&#24211;&#12290;</p>
      <pre class="screen">
[calc:/branches/calc/bug-142]
harry = rw
sally = r
</pre>
      <p>&#22312;&#31532;&#19968;&#20010;&#20363;&#23376;&#37324;&#65292;&#29992;&#25143;<code class="literal">harry</code>&#23545;<code class="literal">calc</code>&#29256;&#26412;&#24211;&#20013;<code class="filename">/branches/calc/bug-142</code>&#20855;&#22791;&#23436;&#20840;&#30340;&#35835;&#20889;&#26435;&#21033;&#65292;&#20294;&#26159;&#29992;&#25143;<code class="literal">sally</code>&#21482;&#26377;&#35835;&#26435;&#21033;&#65292;&#20219;&#20309;&#20854;&#20182;&#29992;&#25143;&#31105;&#27490;&#35775;&#38382;&#36825;&#20010;&#30446;&#24405;&#12290;</p>
      <p>&#24403;&#28982;&#65292;&#35775;&#38382;&#25511;&#21046;&#26159;&#29238;&#30446;&#24405;&#20256;&#36882;&#32473;&#23376;&#30446;&#24405;&#30340;&#65292;&#36825;&#24847;&#21619;&#30528;&#25105;&#20204;&#21487;&#20197;&#20026;Sally&#25351;&#23450;&#19968;&#20010;&#23376;&#30446;&#24405;&#30340;&#19981;&#21516;&#35775;&#38382;&#31574;&#30053;&#65306;</p>
      <pre class="screen">
[calc:/branches/calc/bug-142]
harry = rw
sally = r

# give sally write access only to the 'testing' subdir
[calc:/branches/calc/bug-142/testing]
sally = rw
</pre>
      <p>&#29616;&#22312;Sally&#21487;&#20197;&#35835;&#21462;&#20998;&#25903;&#30340;<code class="filename">testing</code>&#23376;&#30446;&#24405;&#65292;&#20294;&#23545;&#20854;&#20182;&#37096;&#20998;&#36824;&#26159;&#21482;&#21487;&#20197;&#35835;&#65292;&#21516;&#26102;&#65292;Harry&#23545;&#25972;&#20010;&#20998;&#25903;&#36824;&#32487;&#32493;&#26377;&#23436;&#20840;&#30340;&#35835;&#20889;&#26435;&#38480;&#12290;</p>
      <p>&#20063;&#21487;&#20197;&#36890;&#36807;&#32487;&#25215;&#35268;&#21017;&#26126;&#30830;&#30340;&#30340;&#25298;&#32477;&#26576;&#20154;&#30340;&#35775;&#38382;&#65292;&#21482;&#38656;&#35201;&#35774;&#32622;&#29992;&#25143;&#21517;&#21442;&#25968;&#20026;&#31354;&#65306;</p>
      <pre class="screen">
[calc:/branches/calc/bug-142]
harry = rw
sally = r

[calc:/branches/calc/bug-142/secret]
harry =
</pre>
      <p>&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;Harry&#23545;<code class="filename">bug-142</code>&#30446;&#24405;&#26641;&#26377;&#23436;&#20840;&#30340;&#35835;&#20889;&#26435;&#38480;&#65292;&#20294;&#26159;&#23545;&#20854;&#20013;&#30340;<code class="filename">secret</code>&#23376;&#30446;&#24405;&#27809;&#26377;&#20219;&#20309;&#35775;&#38382;&#26435;&#21033;&#12290;</p>
      <p>&#38656;&#35201;&#35760;&#20303;&#30340;&#26159;&#26368;&#35814;&#32454;&#30340;&#30340;&#36335;&#24452;&#20250;&#34987;&#21305;&#37197;&#65292;&#26381;&#21153;&#22120;&#39318;&#20808;&#25214;&#21040;&#21305;&#37197;&#33258;&#24049;&#30340;&#30446;&#24405;&#65292;&#28982;&#21518;&#29238;&#30446;&#24405;&#65292;&#28982;&#21518;&#29238;&#30446;&#24405;&#30340;&#29238;&#30446;&#24405;&#65292;&#23601;&#36825;&#26679;&#32487;&#32493;&#19979;&#21435;&#65292;&#26356;&#20855;&#20307;&#30340;&#36335;&#24452;&#25511;&#21046;&#20250;&#35206;&#30422;&#25152;&#26377;&#32487;&#25215;&#19979;&#26469;&#30340;&#35775;&#38382;&#25511;&#21046;&#12290;</p>
      <p>&#32570;&#30465;&#24773;&#20917;&#19979;&#65292;&#27809;&#26377;&#20154;&#23545;&#29256;&#26412;&#24211;&#26377;&#20219;&#20309;&#35775;&#38382;&#65292;&#36825;&#24847;&#21619;&#30528;&#22914;&#26524;&#20320;&#24050;&#32463;&#20174;&#19968;&#20010;&#31354;&#25991;&#20214;&#24320;&#22987;&#65292;&#20320;&#20250;&#24076;&#26395;&#32473;&#25152;&#26377;&#29992;&#25143;&#23545;&#29256;&#26412;&#24211;&#26681;&#30446;&#24405;&#20855;&#22791;&#35835;&#26435;&#38480;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#26143;&#21495;(<code class="literal">*</code>)&#23454;&#29616;&#65292;&#29992;&#26469;&#20195;&#34920;&#8220;<span class="quote">&#25152;&#26377;&#29992;&#25143;</span>&#8221;&#65306;</p>
      <pre class="screen">
[/]
* = r
</pre>
      <p>&#36825;&#26159;&#19968;&#20010;&#26222;&#36890;&#30340;&#35774;&#32622;&#65307;&#27880;&#24847;&#22312;&#23567;&#33410;&#21517;&#20013;&#27809;&#26377;&#25552;&#21040;&#29256;&#26412;&#24211;&#21517;&#31216;&#65292;&#36825;&#35753;&#25152;&#26377;&#29256;&#26412;&#24211;&#23545;&#25152;&#26377;&#30340;&#29992;&#25143;&#21487;&#35835;&#12290;&#24403;&#25152;&#26377;&#29992;&#25143;&#23545;&#29256;&#26412;&#24211;&#26377;&#20102;&#35835;&#26435;&#21033;&#65292;&#20320;&#21487;&#20197;&#36171;&#20104;&#29305;&#23450;&#29992;&#25143;&#23545;&#29305;&#23450;&#23376;&#30446;&#24405;&#30340;<code class="literal">rw</code>&#26435;&#38480;&#12290;</p>
      <p>&#26143;&#21495;(<code class="literal">*</code>)&#21442;&#25968;&#38656;&#35201;&#22312;&#36825;&#37324;&#35814;&#32454;&#24378;&#35843;&#65306;&#36825;&#26159;&#21305;&#37197;&#21311;&#21517;&#29992;&#25143;&#30340;<span class="emphasis"><em>&#21807;&#19968;</em></span>&#27169;&#24335;&#65292;&#22914;&#26524;&#20320;&#24050;&#32463;&#37197;&#32622;&#20102;&#20320;&#30340;<code class="literal">Location</code>&#21306;&#22359;&#20801;&#35768;&#21311;&#21517;&#21644;&#35748;&#35777;&#29992;&#25143;&#30340;&#28151;&#21512;&#35775;&#38382;&#65292;&#25152;&#26377;&#29992;&#25143;&#20316;&#20026;Apache&#21311;&#21517;&#29992;&#25143;&#24320;&#22987;&#35775;&#38382;&#65292;<span class="command"><strong>mod_authz_svn</strong></span>&#20250;&#22312;&#35201;&#35775;&#38382;&#36335;&#24452;&#30340;&#23450;&#20041;&#20013;&#26597;&#25214;<code class="literal">*</code>&#20540;&#65307;&#22914;&#26524;&#25214;&#19981;&#21040;&#65292;Apache&#23601;&#20250;&#35201;&#27714;&#30495;&#23454;&#30340;&#23458;&#25143;&#31471;&#35748;&#35777;&#12290;</p>
      <p>&#35775;&#38382;&#25991;&#20214;&#20063;&#20801;&#35768;&#20320;&#23450;&#20041;&#19968;&#32452;&#30340;&#29992;&#25143;&#65292;&#24456;&#20687;Unix&#30340;<code class="filename">/etc/group</code>&#25991;&#20214;&#65306;</p>
      <pre class="screen">
[groups]
calc-developers = harry, sally, joe
paint-developers = frank, sally, jane
everyone = harry, sally, joe, frank, sally, jane
</pre>
      <p>&#32452;&#21487;&#20197;&#34987;&#36171;&#20104;&#36890;&#29992;&#25143;&#19968;&#26679;&#30340;&#35775;&#38382;&#26435;&#38480;&#65292;&#20351;&#29992;&#8220;<span class="quote">at</span>&#8221;(<code class="literal">@</code>)&#21069;&#32512;&#26469;&#21152;&#20197;&#21306;&#21035;&#65306;</p>
      <pre class="screen">
[calc:/projects/calc]
@calc-developers = rw

[paint:/projects/paint]
@paint-developers = rw
jane = r
</pre>
      <p>&#32452;&#20013;&#20063;&#21487;&#20197;&#23450;&#20041;&#20026;&#21253;&#21547;&#20854;&#23427;&#30340;&#32452;&#65306;</p>
      <pre class="screen">
[groups]
calc-developers = harry, sally, joe
paint-developers = frank, sally, jane
everyone = @calc-developers, @paint-developers
</pre>
      
      <div class="sidebar"><p class="title"><b>&#37096;&#20998;&#21487;&#35835;&#24615;&#21644;&#26816;&#20986;</b></p>
        
        <p>&#22914;&#26524;&#20320;&#20351;&#29992;Apache&#20316;&#20026;Subversion&#26381;&#21153;&#22120;&#65292;&#24182;&#35753;&#29256;&#26412;&#24211;&#30340;&#26576;&#20123;&#23376;&#30446;&#24405;&#23545;&#29305;&#23450;&#29992;&#25143;&#19981;&#21487;&#35835;&#65292;&#28982;&#21518;&#20320;&#38656;&#35201;&#30693;&#36947;<span class="command"><strong>svn checkout</strong></span>&#20250;&#26377;&#19968;&#20010;&#19981;&#29702;&#24819;&#30340;&#25191;&#34892;&#26041;&#24335;&#12290;</p>
        <p>&#24403;&#23458;&#25143;&#31471;&#36890;&#36807;HTTP&#35831;&#27714;&#26816;&#20986;&#25110;&#26356;&#26032;&#26102;&#65292;&#23427;&#20250;&#20570;&#20986;&#19968;&#20010;&#21333;&#29420;&#30340;&#26381;&#21153;&#22120;&#35831;&#27714;&#65292;&#24182;&#25509;&#25910;&#19968;&#20010;&#21333;&#29420;&#30340;(&#36890;&#24120;&#24456;&#22823;)&#26381;&#21153;&#22120;&#21709;&#24212;&#65292;&#24403;&#26381;&#21153;&#22120;&#25509;&#25910;&#21040;&#35831;&#27714;&#65292;&#36825;&#26159;Apache&#26381;&#21153;&#22120;&#35201;&#27714;&#29992;&#25143;&#35748;&#35777;&#30340;<span class="emphasis"><em>&#21807;&#19968;</em></span>&#26426;&#20250;&#65292;&#36825;&#26377;&#19968;&#20123;&#21103;&#20316;&#29992;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#29256;&#26412;&#24211;&#30340;&#19968;&#20010;&#29305;&#23450;&#23376;&#30446;&#24405;&#21482;&#23545;&#29992;&#25143;Sally&#21487;&#35835;&#65292;&#29992;&#25143;Harry&#26816;&#20986;&#29238;&#30446;&#24405;&#65292;&#20182;&#30340;&#23458;&#25143;&#31471;&#20250;&#22312;&#25910;&#21040;&#35748;&#35777;&#35201;&#27714;&#26102;&#36820;&#22238;&#29992;&#25143;&#21517;Harry&#65292;&#22240;&#20026;&#26381;&#21153;&#22120;&#29983;&#25104;&#30340;&#21709;&#24212;&#24456;&#22823;&#65292;&#26080;&#27861;&#22312;&#36798;&#21040;&#29305;&#21035;&#23376;&#30446;&#24405;&#26102;&#37325;&#26032;&#21457;&#36865;&#35748;&#35777;&#35831;&#27714;&#65307;&#22240;&#27492;&#23376;&#30446;&#24405;&#20250;&#34987;&#19968;&#36215;&#30053;&#36807;&#65292;&#32780;&#19981;&#20250;&#35810;&#38382;&#29992;&#25143;&#26159;&#21542;&#20351;&#29992;Sally&#37325;&#26032;&#35748;&#35777;&#12290;&#22914;&#26524;&#29256;&#26412;&#24211;&#26159;&#21311;&#21517;&#21487;&#35775;&#38382;&#30340;&#65292;&#21017;&#25972;&#20010;&#26816;&#20986;&#23558;&#19981;&#38656;&#35201;&#35748;&#35777;&#8212;&#20877;&#19968;&#27425;&#65292;&#30053;&#36807;&#19981;&#21487;&#35835;&#30340;&#30446;&#24405;&#65292;&#32780;&#19981;&#20250;&#20013;&#36884;&#35201;&#27714;&#35748;&#35777;&#12290;</p>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e5425" href="#d4e5425" class="para">44</a>] </sup>&#26412;&#20070;&#30340;&#20849;&#21516;&#20027;&#39064;&#65281;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.serverconfig.httpd.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.serverconfig.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.serverconfig.multimethod.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">httpd&#65292;Apache&#30340;HTTP&#26381;&#21153;&#22120;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;</td></tr></table></div></body></html>