<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Subversion&#26159;&#20160;&#20040;&#65311;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.preface.html" title="&#24207;&#35328;"><link rel="prev" href="svn.preface.acks.html" title="&#33268;&#35874;"><link rel="next" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Subversion&#26159;&#20160;&#20040;&#65311;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.preface.acks.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#24207;&#35328;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.basic.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.intro.whatis"></a>Subversion&#26159;&#20160;&#20040;&#65311;</h2></div></div></div>
      
      <p>Subversion&#26159;&#19968;&#20010;&#33258;&#30001;/&#24320;&#28304;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#22312;Subversion&#31649;&#29702;&#19979;&#65292;&#25991;&#20214;&#21644;&#30446;&#24405;&#21487;&#20197;&#36229;&#36234;&#26102;&#31354;&#12290;&#20063;&#23601;&#26159;Subversion&#20801;&#35768;&#20320;&#25968;&#25454;&#24674;&#22797;&#21040;&#26089;&#26399;&#29256;&#26412;&#65292;&#25110;&#32773;&#26159;&#26816;&#26597;&#25968;&#25454;&#20462;&#25913;&#30340;&#21382;&#21490;&#12290;&#27491;&#22240;&#20026;&#22914;&#27492;&#65292;&#35768;&#22810;&#20154;&#23558;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#24403;&#20316;&#19968;&#31181;&#31070;&#22855;&#30340;&#8220;<span class="quote">&#26102;&#38388;&#26426;&#22120;</span>&#8221;&#12290;</p>
      <p>Subversion&#30340;&#29256;&#26412;&#24211;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#65292;&#20174;&#32780;&#20351;&#29992;&#25143;&#21487;&#20197;&#22312;&#19981;&#21516;&#30340;&#30005;&#33041;&#19978;&#36827;&#34892;&#25805;&#20316;&#12290;&#20174;&#26576;&#31181;&#31243;&#24230;&#19978;&#26469;&#35828;&#65292;&#20801;&#35768;&#29992;&#25143;&#22312;&#21508;&#33258;&#30340;&#31354;&#38388;&#37324;&#20462;&#25913;&#21644;&#31649;&#29702;&#21516;&#19968;&#32452;&#25968;&#25454;&#21487;&#20197;&#20419;&#36827;&#22242;&#38431;&#21327;&#20316;&#12290;&#22240;&#20026;&#20462;&#25913;&#19981;&#20877;&#26159;&#21333;&#32447;&#36827;&#34892;&#65292;&#24320;&#21457;&#36895;&#24230;&#20250;&#26356;&#24555;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#25152;&#26377;&#30340;&#24037;&#20316;&#37117;&#24050;&#29256;&#26412;&#21270;&#65292;&#20063;&#23601;&#19981;&#24517;&#25285;&#24515;&#30001;&#20110;&#38169;&#35823;&#30340;&#26356;&#25913;&#32780;&#24433;&#21709;&#36719;&#20214;&#36136;&#37327;&#8212;&#22914;&#26524;&#20986;&#29616;&#19981;&#27491;&#30830;&#30340;&#26356;&#25913;&#65292;&#21482;&#35201;&#25764;&#38144;&#37027;&#19968;&#27425;&#26356;&#25913;&#25805;&#20316;&#21363;&#21487;&#12290;</p>
      <p>&#26576;&#20123;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#26412;&#36523;&#20063;&#26159;&#36719;&#20214;&#37197;&#32622;&#31649;&#29702;(SCM)&#31995;&#32479;&#65292;&#36825;&#31181;&#31995;&#32479;&#32463;&#36807;&#31934;&#24039;&#30340;&#35774;&#35745;&#65292;&#19987;&#38376;&#29992;&#26469;&#31649;&#29702;&#28304;&#20195;&#30721;&#26641;&#65292;&#24182;&#19988;&#20855;&#22791;&#35768;&#22810;&#19982;&#36719;&#20214;&#24320;&#21457;&#26377;&#20851;&#30340;&#29305;&#24615;&#8212;&#27604;&#22914;&#65292;&#23545;&#32534;&#31243;&#35821;&#35328;&#30340;&#25903;&#25345;&#65292;&#25110;&#32773;&#25552;&#20379;&#31243;&#24207;&#26500;&#24314;&#24037;&#20855;&#12290;&#19981;&#36807;Subversion&#24182;&#19981;&#26159;&#36825;&#26679;&#30340;&#31995;&#32479;&#12290;&#23427;&#26159;&#19968;&#20010;&#36890;&#29992;&#31995;&#32479;&#65292;&#21487;&#20197;&#31649;&#29702;<span class="emphasis"><em>&#20219;&#20309;</em></span>&#31867;&#22411;&#30340;&#25991;&#20214;&#38598;&#12290;&#23545;&#20320;&#26469;&#35828;&#65292;&#36825;&#20123;&#25991;&#20214;&#36825;&#21487;&#33021;&#26159;&#28304;&#31243;&#24207;&#8212;&#32780;&#23545;&#21035;&#20154;&#65292;&#21017;&#21487;&#33021;&#26159;&#19968;&#20010;&#36135;&#29289;&#28165;&#21333;&#25110;&#32773;&#26159;&#25968;&#23383;&#30005;&#24433;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.history"></a>Subversion &#30340;&#21382;&#21490;</h3></div></div></div>
        
        <p>&#26089;&#22312;2000&#24180;&#65292;CollabNet, Inc. (<code class="uri">http://www.collab.net</code>)&#23601;&#24320;&#22987;&#23547;&#25214;CVS&#26367;&#20195;&#20135;&#21697;&#30340;&#24320;&#21457;&#20154;&#21592;&#12290;CollabNet&#25552;&#20379;&#20102;&#19968;&#20010;&#21517;&#20026;CollabNet&#20225;&#19994;&#29256;(CEE)&#30340;&#21327;&#20316;&#36719;&#20214;&#22871;&#20214;&#12290;&#36825;&#20010;&#36719;&#20214;&#22871;&#20214;&#30340;&#19968;&#20010;&#32452;&#25104;&#37096;&#20998;&#23601;&#26159;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#23613;&#31649;CEE&#22312;&#26368;&#21021;&#37319;&#29992;&#20102;CVS&#20316;&#20026;&#20854;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#20294;&#26159;CVS&#30340;&#23616;&#38480;&#24615;&#20174;&#19968;&#24320;&#22987;&#23601;&#24456;&#26126;&#26174;&#65292;CollabNet&#30693;&#36947;&#65292;&#36831;&#26089;&#35201;&#25214;&#21040;&#19968;&#20010;&#26356;&#22909;&#30340;&#26367;&#20195;&#21697;&#12290;&#36951;&#25022;&#30340;&#26159;&#65292;CVS&#24050;&#32463;&#25104;&#20026;&#24320;&#28304;&#19990;&#30028;&#20107;&#23454;&#19978;&#30340;&#26631;&#20934;&#65292;&#24456;&#22823;&#31243;&#24230;&#19978;&#26159;&#22240;&#20026;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#26356;&#22909;&#30340;&#26367;&#20195;&#21697;&#65292;&#33267;&#23569;&#26159;&#27809;&#26377;&#21487;&#20197;&#33258;&#30001;&#20351;&#29992;&#30340;&#26367;&#20195;&#21697;&#12290;&#25152;&#20197;CollabNet&#20915;&#23450;&#20174;&#22836;&#32534;&#20889;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#36825;&#20010;&#31995;&#32479;&#20445;&#30041;CVS&#30340;&#22522;&#26412;&#24605;&#24819;&#65292;&#20294;&#26159;&#35201;&#20462;&#27491;&#20854;&#20013;&#38169;&#35823;&#21644;&#19981;&#21512;&#29702;&#30340;&#29305;&#24615;&#12290;</p>
        <p>2000&#24180;2&#26376;&#65292;&#20182;&#20204;&#32852;&#31995;&#21040;<em class="citetitle">Open Source Development with CVS</em>(Coriolis, 1999)&#30340;&#20316;&#32773;Karl Fogel&#65292;&#24182;&#19988;&#35810;&#38382;&#20182;&#26159;&#21542;&#24076;&#26395;&#20026;&#36825;&#20010;&#26032;&#39033;&#30446;&#24037;&#20316;&#12290;&#24039;&#21512;&#30340;&#26159;&#65292;&#24403;&#26102;Karl&#27491;&#22312;&#19982;&#26379;&#21451;Jim Blandy&#35752;&#35770;&#35774;&#35745;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;1995&#24180;&#26102;&#65292;&#20182;&#20204;&#20004;&#20154;&#26366;&#32463;&#24320;&#21150;&#20102;&#19968;&#20010;&#25552;&#20379;CVS&#25903;&#25345;&#30340;&#20844;&#21496;Cyclic Software&#65292;&#23613;&#31649;&#20182;&#20204;&#26368;&#32456;&#21334;&#25481;&#20102;&#20844;&#21496;&#65292;&#20294;&#36824;&#26159;&#22825;&#22825;&#20351;&#29992;CVS&#36827;&#34892;&#26085;&#24120;&#24037;&#20316;&#12290;&#20351;&#29992;CVS&#26102;&#30340;&#25387;&#25240;&#20419;&#20351;Jim&#35748;&#30495;&#30340;&#24605;&#32771;&#22914;&#20309;&#31649;&#29702;&#29256;&#26412;&#21270;&#30340;&#25968;&#25454;&#65292;&#24182;&#19988;&#20182;&#24403;&#26102;&#19981;&#20165;&#20351;&#29992;&#20102;&#8220;<span class="quote">Subversion</span>&#8221;&#36825;&#20010;&#21517;&#23383;&#65292;&#24182;&#19988;&#24050;&#32463;&#23436;&#25104;&#20102;Subversion&#29256;&#26412;&#24211;&#30340;&#26368;&#21021;&#35774;&#35745;&#12290;&#25152;&#20197;&#24403;CollabNet&#25552;&#20986;&#36992;&#35831;&#30340;&#26102;&#20505;&#65292;Karl&#39532;&#19978;&#21516;&#24847;&#20026;&#36825;&#20010;&#39033;&#30446;&#24037;&#20316;&#65292;&#21516;&#26102;Jim&#20063;&#25214;&#21040;&#20102;&#20182;&#30340;&#38599;&#20027;&#8212;Red Hat&#36719;&#20214;&#20844;&#21496;&#8212;&#20801;&#35768;&#20182;&#21040;&#36825;&#20010;&#39033;&#30446;&#24037;&#20316;&#65292;&#24182;&#19988;&#27809;&#26377;&#38480;&#23450;&#26368;&#32456;&#30340;&#26399;&#38480;&#12290;CollabNet&#38599;&#20323;&#20102;Karl&#21644;Ben Collins Sussman&#65292;&#35814;&#32454;&#35774;&#35745;&#24037;&#20316;&#20174;&#19977;&#26376;&#24320;&#22987;&#65292;&#22312;Behlendorf &#12289;CollabNet&#12289;Jason Robbins&#21644;Greg Stein(&#24403;&#26102;&#26159;&#19968;&#20010;&#29420;&#31435;&#24320;&#21457;&#32773;&#65292;&#27963;&#36291;&#22312;WebDAV/DeltaV&#31995;&#32479;&#35268;&#33539;&#21046;&#35746;&#24037;&#20316;&#20013;)&#24688;&#21040;&#22909;&#22788;&#30340;&#28608;&#21169;&#19979;&#65292;Subversion&#24456;&#24555;&#21560;&#24341;&#20102;&#35768;&#22810;&#27963;&#36291;&#30340;&#24320;&#21457;&#32773;&#65292;&#32467;&#26524;&#26159;&#35768;&#22810;&#23545;CVS&#26377;&#36807;&#22833;&#26395;&#32463;&#21382;&#30340;&#20154;&#24456;&#20048;&#20110;&#20026;&#36825;&#20010;&#39033;&#30446;&#20570;&#20123;&#20107;&#24773;&#12290;</p>
        <p>&#26368;&#21021;&#30340;&#35774;&#35745;&#23567;&#32452;&#35774;&#23450;&#20102;&#31616;&#21333;&#30340;&#24320;&#21457;&#30446;&#26631;&#12290;&#20182;&#20204;&#19981;&#24819;&#22312;&#29256;&#26412;&#25511;&#21046;&#26041;&#27861;&#23398;&#20013;&#24320;&#22438;&#22788;&#22899;&#22320;&#65292;&#20182;&#20204;&#21482;&#26159;&#24076;&#26395;&#20462;&#27491;CVS&#12290;&#20182;&#20204;&#20915;&#23450;Subversion&#24212;&#31526;&#21512;CVS&#30340;&#29305;&#24615;&#65292;&#24182;&#20445;&#30041;&#30456;&#21516;&#30340;&#24320;&#21457;&#27169;&#22411;&#65292;&#20294;&#19981;&#20877;&#37325;&#22797;CVS&#30340;&#19968;&#20123;&#26174;&#33879;&#32570;&#38519;&#12290;&#23613;&#31649;Subversion&#24182;&#19981;&#38656;&#35201;&#25104;&#20026;CVS&#30340;&#23436;&#20840;&#26367;&#20195;&#21697;&#65292;&#20294;&#23427;&#24212;&#35813;&#19982;CVS&#20445;&#25345;&#36275;&#22815;&#30340;&#30456;&#20284;&#24615;&#65292;&#20197;&#20351;CVS&#29992;&#25143;&#21487;&#20197;&#36731;&#26494;&#30340;&#36716;&#31227;&#21040;Subversion&#19978;&#12290;</p>
        <p>&#32463;&#36807;14&#20010;&#26376;&#30340;&#32534;&#30721;&#65292;2001&#24180;8&#26376;31&#26085;&#65292;Subversion&#33021;&#22815;&#8220;<span class="quote">&#33258;&#24049;&#31649;&#29702;&#33258;&#24049;</span>&#8221;&#20102;&#65292;&#24320;&#21457;&#32773;&#20572;&#27490;&#20351;&#29992;CVS&#20445;&#23384;Subversion&#30340;&#20195;&#30721;&#65292;&#32780;&#20351;&#29992;Subversion&#26412;&#36523;&#12290;</p>
        <p>&#34429;&#28982;CollabNet&#21551;&#21160;&#20102;&#36825;&#20010;&#39033;&#30446;&#65292;&#24182;&#19988;&#19968;&#30452;&#25552;&#20379;&#20102;&#22823;&#37327;&#30340;&#24037;&#20316;&#25903;&#25345;(&#23427;&#20026;&#19968;&#20123;&#20840;&#32844;&#30340;Subversion&#24320;&#21457;&#32773;&#25552;&#20379;&#34218;&#27700;)&#65292;&#20294;Subversion&#20687;&#20854;&#23427;&#35768;&#22810;&#24320;&#28304;&#39033;&#30446;&#19968;&#26679;&#65292;&#34987;&#26494;&#25955;&#30340;&#12289;&#36879;&#26126;&#30340;&#35268;&#21017;&#31649;&#29702;&#30528;&#65292;&#36825;&#26679;&#30340;&#35268;&#21017;&#28608;&#21169;&#30528;&#30693;&#35782;&#30028;&#30340;&#31934;&#33521;&#20204;&#12290;CollabNet&#30340;&#29256;&#26435;&#35768;&#21487;&#35777;&#23436;&#20840;&#31526;&#21512;Debian&#30340;&#33258;&#30001;&#36719;&#20214;&#26041;&#38024;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#26681;&#25454;&#33258;&#24049;&#30340;&#24847;&#24895;&#33258;&#30001;&#30340;&#19979;&#36733;&#12289;&#20462;&#25913;&#21644;&#37325;&#26032;&#21457;&#24067;Subversion&#65292;&#19981;&#38656;&#35201;CollabNet&#25110;&#20854;&#20182;&#20154;&#30340;&#25480;&#26435;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.features"></a>Subversion&#30340;&#29305;&#24615;</h3></div></div></div>
        
        <p>&#22312;&#35762;&#35299;Subversion&#20026;&#29256;&#26412;&#25511;&#21046;&#39046;&#22495;&#24102;&#26469;&#30340;&#29305;&#24615;&#26102;&#65292;&#25105;&#20204;&#20250;&#32463;&#24120;&#36890;&#36807;Subversion&#23545;CVS&#30340;&#25913;&#36827;&#36827;&#34892;&#35828;&#26126;&#12290;&#22914;&#26524;&#19981;&#29087;&#24713;CVS&#65292;&#20102;&#35299;&#25152;&#26377;Subversion&#30340;&#29305;&#24615;&#20250;&#26377;&#19968;&#23450;&#30340;&#22256;&#38590;&#12290;&#32780;&#22914;&#26524;&#26681;&#26412;&#23601;&#19981;&#29087;&#24713;&#29256;&#26412;&#25511;&#21046;&#65292;&#20320;&#23601;&#21482;&#26377;&#24178;&#30634;&#30524;&#30340;&#20221;&#20799;&#20102;&#12290;&#22240;&#27492;&#65292;&#26368;&#22909;&#39318;&#20808;&#38405;&#35835;&#19968;&#19979;<a class="xref" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;">&#31532;&nbsp;1&nbsp;&#31456; <i>&#22522;&#26412;&#27010;&#24565;</i></a>&#65292;&#36825;&#19968;&#31456;&#31616;&#21333;&#20171;&#32461;&#20102;&#19968;&#20123;&#29256;&#26412;&#25511;&#21046;&#30340;&#22522;&#26412;&#24605;&#24819;&#21644;&#27010;&#24565;&#12290;</p>
        <p>Subversion&#25903;&#25345;&#65306;</p>
        <div class="variablelist"><dl><dt><span class="term">&#29256;&#26412;&#21270;&#30340;&#30446;&#24405;</span></dt><dd>
              <p>CVS&#21482;&#33021;&#36319;&#36394;&#21333;&#20010;&#25991;&#20214;&#30340;&#21464;&#26356;&#21382;&#21490;&#65292;&#20294;&#26159;Subversion&#23454;&#29616;&#30340;&#8220;<span class="quote">&#34394;&#25311;</span>&#8221;&#29256;&#26412;&#21270;&#25991;&#20214;&#31995;&#32479;&#21017;&#21487;&#20197;&#36319;&#36394;&#30446;&#24405;&#26641;&#30340;&#21464;&#26356;&#12290;&#22312;Subversion&#20013;&#65292;&#25991;&#20214;<span class="emphasis"><em>&#21644;</em></span>&#30446;&#24405;&#37117;&#26159;&#29256;&#26412;&#21270;&#30340;&#12290;</p>
            </dd><dt><span class="term">&#30495;&#23454;&#30340;&#29256;&#26412;&#21382;&#21490;</span></dt><dd>
              <p>&#30001;&#20110;&#21482;&#33021;&#36319;&#36394;&#21333;&#20010;&#25991;&#20214;&#30340;&#21464;&#26356;&#65292;CVS&#26080;&#27861;&#25903;&#25345;&#22914;&#25991;&#20214;&#25335;&#36125;&#21644;&#25913;&#21517;&#36825;&#20123;&#24120;&#35265;&#30340;&#25805;&#20316;&#8212;&#36825;&#20123;&#25805;&#20316;&#25913;&#21464;&#20102;&#30446;&#24405;&#30340;&#20869;&#23481;&#12290;&#21516;&#26679;&#65292;&#22312;CVS&#20013;&#65292;&#19968;&#20010;&#30446;&#24405;&#19979;&#30340;&#25991;&#20214;&#21482;&#35201;&#21517;&#23383;&#30456;&#21516;&#21363;&#25317;&#26377;&#30456;&#21516;&#30340;&#21382;&#21490;&#65292;&#21363;&#20351;&#36825;&#20123;&#21516;&#21517;&#25991;&#20214;&#22312;&#21382;&#21490;&#19978;&#27627;&#26080;&#20851;&#31995;&#12290;&#32780;&#22312;Subversion&#20013;&#65292;&#21487;&#20197;&#23545;&#25991;&#20214;&#25110;&#30446;&#24405;&#36827;&#34892;&#22686;&#21152;&#12289;&#25335;&#36125;&#21644;&#25913;&#21517;&#25805;&#20316;&#65292;&#20063;&#35299;&#20915;&#20102;&#21516;&#21517;&#32780;&#26080;&#20851;&#30340;&#25991;&#20214;&#20043;&#38388;&#30340;&#21382;&#21490;&#32852;&#31995;&#38382;&#39064;&#12290;</p>
            </dd><dt><span class="term">&#21407;&#23376;&#25552;&#20132;</span></dt><dd>
              <p>&#19968;&#31995;&#21015;&#30456;&#20851;&#30340;&#26356;&#25913;&#65292;&#35201;&#20040;&#20840;&#37096;&#25552;&#20132;&#21040;&#29256;&#26412;&#24211;&#65292;&#35201;&#20040;&#19968;&#20010;&#20063;&#19981;&#25552;&#20132;&#12290;&#36825;&#26679;&#29992;&#25143;&#23601;&#21487;&#20197;&#23558;&#30456;&#20851;&#30340;&#26356;&#25913;&#32452;&#25104;&#19968;&#20010;&#36923;&#36753;&#25972;&#20307;&#65292;&#38450;&#27490;&#20986;&#29616;&#21482;&#26377;&#37096;&#20998;&#20462;&#25913;&#25552;&#20132;&#21040;&#29256;&#26412;&#24211;&#30340;&#24773;&#20917;&#12290;</p>
            </dd><dt><span class="term">&#29256;&#26412;&#21270;&#30340;&#20803;&#25968;&#25454;</span></dt><dd>
              <p>&#27599;&#19968;&#20010;&#25991;&#20214;&#21644;&#30446;&#24405;&#37117;&#26377;&#33258;&#24049;&#30340;&#19968;&#32452;&#23646;&#24615;&#8212;&#38190;&#21644;&#23427;&#20204;&#30340;&#20540;&#12290;&#21487;&#20197;&#26681;&#25454;&#38656;&#35201;&#24314;&#31435;&#24182;&#23384;&#20648;&#20219;&#20309;&#38190;/&#20540;&#23545;&#12290;&#21644;&#25991;&#20214;&#26412;&#36523;&#30340;&#20869;&#23481;&#19968;&#26679;&#65292;&#23646;&#24615;&#20063;&#22312;&#29256;&#26412;&#25511;&#21046;&#20043;&#19979;&#12290;</p>
            </dd><dt><span class="term">&#21487;&#36873;&#30340;&#32593;&#32476;&#23618;</span></dt><dd>
              <p>Subversion&#22312;&#29256;&#26412;&#24211;&#35775;&#38382;&#30340;&#23454;&#29616;&#19978;&#20855;&#26377;&#36739;&#39640;&#30340;&#25277;&#35937;&#31243;&#24230;&#65292;&#21033;&#20110;&#20154;&#20204;&#23454;&#29616;&#26032;&#30340;&#32593;&#32476;&#35775;&#38382;&#26426;&#21046;&#12290;Subversion&#21487;&#20197;&#20316;&#20026;&#19968;&#20010;&#25193;&#23637;&#27169;&#22359;&#23884;&#20837;&#21040;Apache&#20043;&#20013;&#12290;&#36825;&#31181;&#26041;&#24335;&#22312;&#31283;&#23450;&#24615;&#21644;&#20132;&#20114;&#24615;&#26041;&#38754;&#26377;&#24456;&#22823;&#30340;&#20248;&#21183;&#65292;&#21487;&#20197;&#30452;&#25509;&#20351;&#29992;&#26381;&#21153;&#22120;&#30340;&#25104;&#29087;&#25216;&#26415;&#8212;&#35748;&#35777;&#12289;&#25480;&#26435;&#21644;&#20256;&#36755;&#21387;&#32553;&#31561;&#12290;&#27492;&#22806;&#65292;Subversion&#33258;&#36523;&#20063;&#23454;&#29616;&#20102;&#19968;&#20010;&#36731;&#22411;&#30340;&#65292;&#21487;&#29420;&#31435;&#36816;&#34892;&#30340;&#26381;&#21153;&#22120;&#36719;&#20214;&#12290;&#36825;&#20010;&#26381;&#21153;&#22120;&#20351;&#29992;&#20102;&#19968;&#20010;&#33258;&#23450;&#20041;&#21327;&#35758;&#65292;&#21487;&#20197;&#36731;&#26494;&#30340;&#29992;SSH&#23553;&#35013;&#12290;</p>
            </dd><dt><span class="term">&#19968;&#33268;&#30340;&#25968;&#25454;&#25805;&#20316;</span></dt><dd>
              <p>Subversion&#29992;&#19968;&#20010;&#20108;&#36827;&#21046;&#24046;&#24322;&#31639;&#27861;&#25551;&#36848;&#25991;&#20214;&#30340;&#21464;&#21270;&#65292;&#23545;&#20110;&#25991;&#26412;(&#21487;&#35835;)&#21644;&#20108;&#36827;&#21046;(&#19981;&#21487;&#35835;)&#25991;&#20214;&#20854;&#25805;&#20316;&#26041;&#24335;&#26159;&#19968;&#33268;&#30340;&#12290;&#36825;&#20004;&#31181;&#31867;&#22411;&#30340;&#25991;&#20214;&#21387;&#32553;&#23384;&#20648;&#22312;&#29256;&#26412;&#24211;&#20013;&#65292;&#32780;&#24046;&#24322;&#20449;&#24687;&#21017;&#22312;&#32593;&#32476;&#19978;&#21452;&#21521;&#20256;&#36882;&#12290;</p>
            </dd><dt><span class="term">&#39640;&#25928;&#30340;&#20998;&#25903;&#21644;&#26631;&#31614;&#25805;&#20316;</span></dt><dd>
              <p>&#22312;Subversion&#20013;&#65292;&#20998;&#25903;&#19982;&#26631;&#31614;&#25805;&#20316;&#30340;&#24320;&#38144;&#19982;&#24037;&#31243;&#30340;&#22823;&#23567;&#26080;&#20851;&#12290;Subversion&#30340;&#20998;&#25903;&#21644;&#26631;&#31614;&#25805;&#20316;&#29992;&#21482;&#26159;&#19968;&#31181;&#31867;&#20284;&#20110;&#30828;&#38142;&#25509;&#30340;&#26426;&#21046;&#25335;&#36125;&#25972;&#20010;&#24037;&#31243;&#12290;&#22240;&#32780;&#36825;&#20123;&#25805;&#20316;&#36890;&#24120;&#21482;&#20250;&#33457;&#36153;&#24456;&#23569;&#19988;&#30456;&#23545;&#22266;&#23450;&#30340;&#26102;&#38388;&#12290;</p>
            </dd><dt><span class="term">&#21487;&#20462;&#25913;&#24615;</span></dt><dd>
              <p>Subversion&#27809;&#26377;&#21382;&#21490;&#36127;&#25285;&#65292;&#23427;&#20197;&#19968;&#31995;&#21015;&#20248;&#36136;&#30340;&#20849;&#20139;C&#31243;&#24207;&#24211;&#30340;&#26041;&#24335;&#23454;&#29616;&#65292;&#20855;&#26377;&#23450;&#20041;&#33391;&#22909;&#30340;API&#12290;&#36825;&#20351;&#24471;Subversion&#38750;&#24120;&#23481;&#26131;&#32500;&#25252;&#65292;&#21644;&#20854;&#23427;&#35821;&#35328;&#30340;&#20114;&#25805;&#20316;&#24615;&#24456;&#24378;&#12290;</p>
            </dd></dl></div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.architecture"></a>Subversion &#30340;&#26550;&#26500;</h3></div></div></div>
        
        <p><a class="xref" href="svn.intro.whatis.html#svn.intro.architecture.dia-1" title="&#22270;&nbsp;1.&nbsp;Subversion &#30340;&#26550;&#26500;">&#22270;&nbsp;1 &#8220;Subversion &#30340;&#26550;&#26500;&#8221;</a>&#32473;&#20986;&#20102;Subversion&#35774;&#35745;&#24635;&#20307;&#19978;&#30340;&#8220;<span class="quote">&#20463;&#35270;&#22270;</span>&#8221;&#12290;</p>
        <div class="figure"><a name="svn.intro.architecture.dia-1"></a><p class="title"><b>&#22270;&nbsp;1.&nbsp;Subversion &#30340;&#26550;&#26500;</b></p><div class="figure-contents">
          
          <div class="mediaobject"><img src="images/ch01dia1.png" alt="Subversion &#30340;&#26550;&#26500;"></div>
        </div></div><br class="figure-break">
        <p>&#22270;&#20013;&#30340;&#19968;&#31471;&#26159;&#20445;&#23384;&#25152;&#26377;&#29256;&#26412;&#25968;&#25454;&#30340;Subversion&#29256;&#26412;&#24211;&#65292;&#21478;&#19968;&#31471;&#26159;Subvesion&#30340;&#23458;&#25143;&#31243;&#24207;&#65292;&#31649;&#29702;&#30528;&#25152;&#26377;&#29256;&#26412;&#25968;&#25454;&#30340;&#26412;&#22320;&#24433;&#23556;(&#31216;&#20026;&#8220;<span class="quote">&#24037;&#20316;&#25335;&#36125;</span>&#8221;)&#65292;&#22312;&#36825;&#20004;&#26497;&#20043;&#38388;&#26159;&#21508;&#31181;&#21508;&#26679;&#30340;&#29256;&#26412;&#24211;&#35775;&#38382;(RA)&#23618;&#65292;&#26576;&#20123;&#20351;&#29992;&#30005;&#33041;&#32593;&#32476;&#36890;&#36807;&#32593;&#32476;&#26381;&#21153;&#22120;&#35775;&#38382;&#29256;&#26412;&#24211;&#65292;&#26576;&#20123;&#21017;&#32469;&#36807;&#32593;&#32476;&#26381;&#21153;&#22120;&#30452;&#25509;&#35775;&#38382;&#29256;&#26412;&#24211;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.intro.components"></a>Subversion &#30340;&#32452;&#20214;</h3></div></div></div>
        
        <p>&#23433;&#35013;&#22909;&#30340;Subversion&#30001;&#20960;&#20010;&#37096;&#20998;&#32452;&#25104;&#65292;&#19979;&#38754;&#23558;&#31616;&#21333;&#30340;&#20171;&#32461;&#19968;&#19979;&#36825;&#20123;&#32452;&#20214;&#12290;&#19979;&#25991;&#30340;&#25551;&#36848;&#25110;&#35768;&#36807;&#20110;&#31616;&#30053;&#65292;&#19981;&#26131;&#29702;&#35299;&#65292;&#20294;&#19981;&#29992;&#25285;&#24515;&#8212;&#26412;&#20070;&#21518;&#38754;&#30340;&#31456;&#33410;&#20013;&#20250;&#29992;<span class="emphasis"><em>&#26356;&#22810;&#30340;</em></span>&#20869;&#23481;&#26469;&#35814;&#32454;&#38416;&#36848;&#36825;&#20123;&#32452;&#20214;&#12290;</p>
        <div class="variablelist"><dl><dt><span class="term">svn</span></dt><dd>
              <p>&#21629;&#20196;&#34892;&#23458;&#25143;&#31471;&#31243;&#24207;&#12290;</p>
            </dd><dt><span class="term">svnversion</span></dt><dd>
              <p>&#27492;&#24037;&#20855;&#29992;&#26469;&#26174;&#31034;&#24037;&#20316;&#25335;&#36125;&#30340;&#29366;&#24577;(&#29992;&#26415;&#35821;&#26469;&#35828;&#65292;&#23601;&#26159;&#24403;&#21069;&#39033;&#30446;&#30340;&#20462;&#35746;&#29256;&#26412;)&#12290;</p>
            </dd><dt><span class="term">svnlook</span></dt><dd>
              <p>&#30452;&#25509;&#26597;&#30475;Subversion&#29256;&#26412;&#24211;&#30340;&#24037;&#20855;&#12290;</p>
            </dd><dt><span class="term">svnadmin</span></dt><dd>
              <p>&#24314;&#31435;&#12289;&#35843;&#25972;&#21644;&#20462;&#22797;Subversion&#29256;&#26412;&#24211;&#30340;&#24037;&#20855;&#12290;</p>
            </dd><dt><span class="term">svndumpfilter</span></dt><dd>
              <p>&#36807;&#28388;Subversion&#29256;&#26412;&#24211;&#36716;&#20648;&#25968;&#25454;&#27969;&#30340;&#24037;&#20855;&#12290;</p>
            </dd><dt><span class="term">mod_dav_svn</span></dt><dd>
              <p>Apache HTTP&#26381;&#21153;&#22120;&#30340;&#19968;&#20010;&#25554;&#20214;&#65292;&#20351;&#29256;&#26412;&#24211;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#12290;</p>
            </dd><dt><span class="term">svnserve</span></dt><dd>
              <p>&#19968;&#20010;&#21333;&#29420;&#36816;&#34892;&#30340;&#26381;&#21153;&#22120;&#31243;&#24207;&#65292;&#21487;&#20197;&#20316;&#20026;&#23432;&#25252;&#36827;&#31243;&#25110;&#30001;SSH&#35843;&#29992;&#12290;&#36825;&#26159;&#21478;&#19968;&#31181;&#20351;&#29256;&#26412;&#24211;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#30340;&#26041;&#24335;&#12290;</p>
            </dd><dt><span class="term">svnsync</span></dt><dd>
              <p>&#19968;&#20010;&#36890;&#36807;&#32593;&#32476;&#22686;&#37327;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340;&#31243;&#24207;&#12290;</p>
            </dd></dl></div>
        <p>&#22914;&#26524;&#24050;&#32463;&#27491;&#30830;&#23436;&#25104;&#20102;Subversion&#30340;&#23433;&#35013;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#24320;&#22987;&#25105;&#20204;&#30340;&#23398;&#20064;&#20043;&#26053;&#20102;&#12290;&#22312;&#21518;&#38754;&#30340;&#20004;&#31456;&#20013;&#65292;&#25105;&#20204;&#23558;&#35762;&#35299;&#22914;&#20309;&#20351;&#29992;Subversion&#30340;&#23458;&#25143;&#31471;&#31243;&#24207;<span class="command"><strong>svn</strong></span>&#12290;</p>
      </div>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.preface.acks.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.preface.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.basic.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#33268;&#35874;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;</td></tr></table></div></body></html>