<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#23646;&#24615;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="next" href="svn.advanced.props.file-portability.html" title="&#25991;&#20214;&#31227;&#26893;&#24615;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#23646;&#24615;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.advanced.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.props.file-portability.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.props"></a>&#23646;&#24615;</h2></div></div></div>
      
      <a class="indexterm" name="d4e1709"></a>
      <p>&#25105;&#20204;&#24050;&#32463;&#35814;&#32454;&#35762;&#36848;&#20102;Subversion&#23384;&#20648;&#21644;&#26816;&#32034;&#29256;&#26412;&#24211;&#20013;&#19981;&#21516;&#29256;&#26412;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#32454;&#33410;&#65292;&#24182;&#19988;&#29992;&#20102;&#22909;&#20960;&#20010;&#31456;&#33410;&#26469;&#35770;&#36848;&#36825;&#20010;&#24037;&#20855;&#30340;&#22522;&#26412;&#21151;&#33021;&#12290;&#22914;&#26524;&#23545;&#20110;&#29256;&#26412;&#21270;&#30340;&#25903;&#25345;&#21040;&#27492;&#20026;&#27490;&#65292;&#20174;&#29256;&#26412;&#25511;&#21046;&#30340;&#35282;&#24230;&#26469;&#30475;Subversion&#24050;&#32463;&#23436;&#25972;&#20102;&#12290;</p>
      <p>&#20294;&#19981;&#20165;&#20165;&#22914;&#27492;&#12290;</p>
      <p>&#20316;&#20026;&#30446;&#24405;&#21644;&#25991;&#20214;&#29256;&#26412;&#21270;&#30340;&#34917;&#20805;&#65292;Subversion&#25552;&#20379;&#20102;&#23545;&#27599;&#19968;&#20010;&#29256;&#26412;&#21270;&#30340;&#30446;&#24405;&#21644;&#25991;&#20214;&#28155;&#21152;&#12289;&#20462;&#25913;&#21644;&#21024;&#38500;&#29256;&#26412;&#21270;&#30340;&#20803;&#25968;&#25454;&#30340;&#25509;&#21475;&#65292;&#25105;&#20204;&#29992;<em class="firstterm">&#23646;&#24615;</em>&#26469;&#34920;&#31034;&#36825;&#20123;&#20803;&#25968;&#25454;&#12290;&#25105;&#20204;&#21487;&#20197;&#35748;&#20026;&#23427;&#20204;&#26159;&#19968;&#20010;&#20004;&#21015;&#30340;&#34920;&#65292;&#38468;&#21152;&#21040;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#30340;&#27599;&#20010;&#26465;&#30446;&#19978;&#65292;&#26144;&#23556;&#23646;&#24615;&#21517;&#21040;&#20219;&#24847;&#30340;&#20540;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;&#23646;&#24615;&#30340;&#21517;&#31216;&#21644;&#20540;&#21487;&#20197;&#26159;&#20320;&#24076;&#26395;&#30340;&#20219;&#20309;&#20540;&#65292;&#38480;&#21046;&#23601;&#26159;&#21517;&#31216;&#24517;&#39035;&#26159;&#21487;&#35835;&#30340;&#25991;&#26412;&#65292;&#24182;&#19988;&#26368;&#22909;&#30340;&#19968;&#28857;&#26159;&#36825;&#20123;&#23646;&#24615;&#20063;&#26159;&#29256;&#26412;&#21270;&#30340;&#65292;&#23601;&#20687;&#20320;&#30340;&#25991;&#26412;&#25991;&#20214;&#20869;&#23481;&#65292;&#20320;&#21487;&#20197;&#20687;&#25552;&#20132;&#25991;&#26412;&#20462;&#25913;&#19968;&#26679;&#20462;&#25913;&#12289;&#25552;&#20132;&#21644;&#24674;&#22797;&#23646;&#24615;&#20462;&#25913;&#65292;&#24403;&#20320;&#26356;&#26032;&#26102;&#20063;&#20250;&#25509;&#25910;&#21040;&#21035;&#20154;&#30340;&#23646;&#24615;&#20462;&#25913;&#8212;&#20320;&#19981;&#24517;&#20026;&#36866;&#24212;&#23646;&#24615;&#25913;&#21464;&#20320;&#30340;&#24037;&#20316;&#27969;&#31243;&#12290;</p>
      <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3>
        <p>Subversion&#33258;&#24049;&#20445;&#30041;&#20102;&#19968;&#32452;&#21517;&#31216;&#20197;<code class="literal">svn:</code>&#24320;&#22836;&#30340;&#23646;&#24615;&#65292;&#29616;&#22312;&#24050;&#32463;&#26377;&#20102;&#19968;&#20123;&#22312;&#29992;&#30340;&#23646;&#24615;&#65292;&#25152;&#20197;&#22312;&#20320;&#26681;&#25454;&#38656;&#35201;&#21019;&#24314;&#33258;&#23450;&#20041;&#23646;&#24615;&#26102;&#65292;&#38656;&#35201;&#36991;&#20813;&#36825;&#20123;&#21069;&#32512;&#24320;&#22836;&#30340;&#21517;&#31216;&#65292;&#21542;&#21017;&#65292;Subversion&#30340;&#26032;&#29256;&#26412;&#21487;&#33021;&#20250;&#37319;&#29992;&#21516;&#21517;&#30340;&#23646;&#24615;&#26469;&#28385;&#36275;&#26032;&#30340;&#29305;&#24615;&#65292;&#32780;&#20854;&#21547;&#20041;&#21487;&#33021;&#20250;&#23436;&#20840;&#19981;&#21516;&#12290;</p>
      </div>
      <p>Subversion&#30340;&#23646;&#24615;&#20063;&#21487;&#20197;&#22312;&#21035;&#30340;&#22320;&#26041;&#20986;&#29616;&#65292;&#23601;&#20687;&#25991;&#20214;&#21644;&#30446;&#24405;&#21487;&#33021;&#38468;&#21152;&#26377;&#20219;&#24847;&#30340;&#23646;&#24615;&#21517;&#21644;&#20540;&#65292;&#27599;&#20010;&#20462;&#35746;&#29256;&#26412;&#20316;&#20026;&#19968;&#20010;&#25972;&#20307;&#20063;&#21487;&#20197;&#38468;&#21152;&#20219;&#24847;&#30340;&#23646;&#24615;&#65292;&#20063;&#26377;&#21516;&#26679;&#30340;&#38480;&#21046;&#8212;&#21487;&#35835;&#30340;&#25991;&#26412;&#21517;&#31216;&#21644;&#20219;&#20309;&#20320;&#24076;&#26395;&#30340;&#20108;&#36827;&#21046;&#20540;&#65292;&#20027;&#35201;&#30340;&#21306;&#21035;&#26159;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#19981;&#26159;&#29256;&#26412;&#21270;&#30340;&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;&#22914;&#26524;&#20320;&#20462;&#25913;&#65292;&#21024;&#38500;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#65292;&#22312;Subversion&#39046;&#22495;&#20869;&#27809;&#26377;&#21150;&#27861;&#24674;&#22797;&#21040;&#20197;&#21069;&#30340;&#20540;&#12290;</p>
      <p>Subversion&#19981;&#20851;&#24515;&#22914;&#20309;&#20351;&#29992;&#23646;&#24615;&#65292;&#20294;&#26159;&#35201;&#27714;&#20320;&#19981;&#35201;&#20351;&#29992;<code class="literal">svn:</code>&#20026;&#21069;&#32512;&#30340;&#23646;&#24615;&#21517;&#65292;&#36825;&#26159;Subversion&#33258;&#24049;&#20351;&#29992;&#30340;&#21629;&#21517;&#31354;&#38388;&#65292;Subversion&#20351;&#29992;&#20102;&#29256;&#26412;&#21270;&#30340;&#21644;&#26410;&#29256;&#26412;&#21270;&#30340;&#23646;&#24615;&#12290;&#25991;&#20214;&#21644;&#30446;&#24405;&#19978;&#30340;&#29305;&#23450;&#29256;&#26412;&#21270;&#23646;&#24615;&#37117;&#26377;&#29305;&#21035;&#30340;&#24847;&#20041;&#25110;&#25928;&#26524;&#65292;&#25110;&#32773;&#26159;&#25552;&#20379;&#20102;&#20462;&#35746;&#29256;&#26412;&#30340;&#19968;&#20123;&#20449;&#24687;&#12290;&#19968;&#20123;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#20250;&#22312;&#25552;&#20132;&#26102;&#33258;&#21160;&#38468;&#21152;&#21040;&#20462;&#35746;&#29256;&#26412;&#19978;&#65292;&#21253;&#21547;&#20102;&#20462;&#35746;&#29256;&#26412;&#30340;&#20449;&#24687;&#12290;&#22823;&#22810;&#25968;&#36825;&#20123;&#23646;&#24615;&#20250;&#20316;&#20026;&#26222;&#36890;&#30340;&#20027;&#39064;&#22312;&#21518;&#38754;&#25552;&#21450;&#65292;&#20851;&#20110;Subversion&#39044;&#23450;&#20041;&#30340;&#23646;&#24615;&#30340;&#35814;&#32454;&#21015;&#34920;&#21487;&#20197;&#30475;<a class="xref" href="svn.ref.properties.html" title="Subversion&#23646;&#24615;">&#8220;Subversion&#23646;&#24615;&#8221;&#19968;&#33410;</a>&#12290;</p>
      <p>&#22312;&#26412;&#23567;&#33410;&#65292;&#25105;&#20204;&#23558;&#20250;&#26816;&#39564;&#36825;&#20010;&#24037;&#20855;&#8212;&#19981;&#20165;&#26159;&#23545;Subversion&#30340;&#29992;&#25143;&#65292;&#20063;&#23545;Subversion&#26412;&#36523;&#8212;&#23545;&#20110;&#23646;&#24615;&#30340;&#25903;&#25345;&#12290;&#20320;&#20250;&#23398;&#21040;&#19982;&#23646;&#24615;&#30456;&#20851;&#30340;<span class="command"><strong>svn</strong></span>&#23376;&#21629;&#20196;&#65292;&#21644;&#23646;&#24615;&#24590;&#26679;&#24433;&#21709;&#20320;&#30340;&#26222;&#36890;Subversion&#24037;&#20316;&#27969;&#65292;&#24076;&#26395;&#20320;&#20250;&#24863;&#21040;Subversion&#30340;&#23646;&#24615;&#21487;&#20197;&#25552;&#39640;&#20320;&#30340;&#29256;&#26412;&#25511;&#21046;&#20307;&#39564;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.props.why"></a>&#20026;&#20160;&#20040;&#38656;&#35201;&#23646;&#24615;&#65311;</h3></div></div></div>
        
        <p>&#23601;&#20687;Subversion&#20351;&#29992;&#23646;&#24615;&#20445;&#23384;&#20854;&#21253;&#21547;&#30340;&#25991;&#20214;&#12289;&#30446;&#24405;&#21644;&#20462;&#35746;&#29256;&#26412;&#30340;&#38468;&#21152;&#20449;&#24687;&#65292;&#20320;&#20063;&#20250;&#21457;&#29616;&#23646;&#24615;&#26377;&#19968;&#20123;&#31867;&#20284;&#30340;&#20351;&#29992;&#65292;&#20320;&#20250;&#21457;&#29616;&#22914;&#26524;&#22312;&#25968;&#25454;&#38468;&#36817;&#26377;&#20010;&#22320;&#26041;&#20445;&#23384;&#33258;&#23450;&#20041;&#20803;&#25968;&#25454;&#20250;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
        <p>&#20551;&#35774;&#20320;&#24076;&#26395;&#35774;&#35745;&#19968;&#20010;&#23384;&#25918;&#35768;&#22810;&#25968;&#30721;&#29031;&#29255;&#30340;&#32593;&#31449;&#65292;&#20250;&#26174;&#31034;&#26631;&#39064;&#21644;&#32553;&#30053;&#22270;&#12290;&#29616;&#22312;&#20320;&#30340;&#22270;&#29255;&#20250;&#32463;&#24120;&#20462;&#25913;&#65292;&#25152;&#20197;&#20320;&#24076;&#26395;&#33021;&#22815;&#35753;&#36825;&#20010;&#31449;&#28857;&#23613;&#37327;&#33258;&#21160;&#22788;&#29702;&#36825;&#20123;&#20107;&#24773;&#65292;&#36825;&#20123;&#29031;&#29255;&#20250;&#24456;&#22823;&#65292;&#25152;&#20197;&#20316;&#20026;&#32593;&#31449;&#65292;&#20320;&#24076;&#26395;&#20026;&#35775;&#38382;&#32773;&#25552;&#20379;&#30456;&#20284;&#30340;&#32553;&#30053;&#22270;&#12290;</p>
        <p>&#29616;&#22312;&#65292;&#20320;&#21487;&#20197;&#21033;&#29992;&#36825;&#20123;&#21151;&#33021;&#20351;&#29992;&#20256;&#32479;&#25991;&#20214;&#12290;&#20320;&#21487;&#20197;&#26377;&#19968;&#20010;<code class="filename">image123.jpg</code>&#21644;&#19968;&#20010;&#23545;&#24212;&#30340;<code class="filename">image123-thumbnail.jpg</code>&#22312;&#21516;&#19968;&#20010;&#30446;&#24405;&#37324;&#65292;&#26377;&#26102;&#20505;&#20320;&#24076;&#26395;&#20445;&#25345;&#25991;&#20214;&#21517;&#30456;&#21516;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#19981;&#21516;&#30340;&#30446;&#24405;&#65292;&#22914;<code class="filename">thumbnails/image123.jpg</code>&#12290;&#20320;&#21487;&#20197;&#29992;&#19968;&#31181;&#30456;&#20284;&#30340;&#26679;&#24335;&#26469;&#20445;&#23384;&#20320;&#30340;&#26631;&#39064;&#21644;&#26102;&#38388;&#25139;&#65292;&#21516;&#21407;&#22987;&#22270;&#20687;&#25991;&#20214;&#20998;&#24320;&#12290;&#27599;&#20010;&#26032;&#22270;&#29255;&#30340;&#28155;&#21152;&#37117;&#20250;&#25104;&#20493;&#30340;&#22686;&#21152;&#28151;&#20081;&#65292;&#24456;&#24555;&#20320;&#30340;&#30446;&#24405;&#26641;&#20250;&#26159;&#19968;&#22242;&#31967;&#12290;</p>
        <p>&#29616;&#22312;&#32771;&#34385;&#20351;&#29992;Subversion&#25991;&#20214;&#30340;&#23646;&#24615;&#30340;&#26041;&#24335;&#26469;&#31649;&#29702;&#36825;&#20010;&#31449;&#28857;&#65292;&#24819;&#35937;&#25105;&#20204;&#26377;&#19968;&#20010;&#21333;&#29420;&#30340;&#22270;&#20687;&#25991;&#20214;<code class="filename">image123.jpg</code>&#65292;&#28982;&#21518;&#36825;&#20010;&#25991;&#20214;&#30340;&#23646;&#24615;&#38598;&#21253;&#25324;<code class="literal">caption</code>&#12289;<code class="literal">datestamp</code>&#29978;&#33267;<code class="literal">thumbnail</code>&#12290;&#29616;&#22312;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#30446;&#24405;&#30475;&#36215;&#26469;&#26356;&#23481;&#26131;&#31649;&#29702;&#8212;&#23454;&#38469;&#19978;&#65292;&#23427;&#30475;&#36215;&#26469;&#21482;&#26377;&#22270;&#20687;&#25991;&#20214;&#65292;&#20294;&#26159;&#20320;&#30340;&#33258;&#21160;&#21270;&#33050;&#26412;&#30693;&#36947;&#24471;&#26356;&#22810;&#65292;&#23427;&#20204;&#30693;&#36947;&#21487;&#20197;&#29992;<span class="command"><strong>svn</strong></span>(&#26356;&#22909;&#30340;&#36873;&#25321;&#26159;&#20351;&#29992;Subversion&#30340;&#35821;&#35328;&#32465;&#23450;&#8212;&#35265;<a class="xref" href="svn.developer.usingapi.html" title="&#20351;&#29992; API">&#8220;&#20351;&#29992; API&#8221;&#19968;&#33410;</a>)&#26469;&#25366;&#25496;&#26356;&#22810;&#30340;&#31449;&#28857;&#26174;&#31034;&#38656;&#35201;&#30340;&#39069;&#22806;&#20449;&#24687;&#65292;&#32780;&#19981;&#24517;&#21435;&#38405;&#35835;&#19968;&#20010;&#32034;&#24341;&#25991;&#20214;&#25110;&#32773;&#26159;&#29609;&#19968;&#20010;&#36335;&#24452;&#22788;&#29702;&#30340;&#28216;&#25103;&#12290;</p>
        <p>&#33258;&#23450;&#20041;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#20063;&#32463;&#24120;&#34987;&#20351;&#29992;&#65292;&#19968;&#20010;&#24120;&#35265;&#30340;&#29992;&#27861;&#26159;&#19968;&#20010;&#21253;&#21547;&#38382;&#39064;&#36319;&#36394;ID&#30340;&#23646;&#24615;&#65292;&#21487;&#33021;&#26159;&#22240;&#20026;&#36825;&#20010;&#20462;&#25913;&#20462;&#27491;&#20102;&#36825;&#20010;ID&#30340;&#38382;&#39064;&#12290;&#21478;&#22806;&#19968;&#20123;&#20154;&#29992;&#23646;&#24615;&#26469;&#23384;&#25918;&#26356;&#23481;&#26131;&#35760;&#30340;&#20462;&#35746;&#29256;&#26412;&#21517;&#31216;&#8212;&#35760;&#20303;&#20462;&#35746;&#29256;&#26412;1935&#26159;&#19968;&#20010;&#23436;&#20840;&#27979;&#35797;&#30340;&#29256;&#26412;&#26159;&#24456;&#22256;&#38590;&#30340;&#65292;&#20294;&#26159;&#22914;&#26524;&#22312;&#20462;&#35746;&#29256;&#26412;&#19978;&#35774;&#32622;&#19968;&#20010;&#20540;&#20026;<code class="literal">all passing</code>&#30340;<code class="literal">test-results</code>&#23646;&#24615;&#65292;&#36825;&#23601;&#26377;&#20102;&#19968;&#20010;&#26377;&#29992;&#30340;&#20449;&#24687;&#12290;</p>
        <div class="sidebar"><p class="title"><b>&#21487;&#25628;&#32034;&#24615;(&#25110;&#32773;&#65292;&#20026;&#20160;&#20040;<span class="emphasis"><em>&#19981;</em></span>&#20351;&#29992;&#23646;&#24615;)</b></p>
          
          <p>&#23545;&#20110;Subversion&#23646;&#24615;&#30340;&#25152;&#26377;&#21151;&#33021;&#8212;&#25110;&#32773;&#26356;&#20934;&#30830;&#30340;&#35762;&#65292;&#23545;&#20110;&#23646;&#24615;&#30340;&#25152;&#26377;&#25509;&#21475;&#8212;&#37117;&#26377;&#19968;&#20123;&#20027;&#35201;&#30340;&#24212;&#29992;&#20250;&#21066;&#24369;&#20182;&#20204;&#30340;&#24212;&#29992;&#12290;&#35774;&#32622;&#19968;&#20010;&#33258;&#23450;&#20041;&#23646;&#24615;&#21518;&#65292;&#24456;&#23481;&#26131;&#21457;&#29616;&#23646;&#24615;&#23436;&#20840;&#21464;&#25104;&#21478;&#22806;&#19968;&#20250;&#20799;&#20107;&#12290;</p>
          <p>&#20026;&#20102;&#23450;&#20301;&#19968;&#20010;&#33258;&#23450;&#20041;&#23646;&#24615;&#36890;&#24120;&#35201;&#32447;&#24418;&#35775;&#38382;&#29256;&#26412;&#24211;&#30340;&#25152;&#26377;&#20462;&#35746;&#29256;&#26412;&#65292;&#21521;&#27599;&#20010;&#20462;&#35746;&#29256;&#26412;&#35810;&#38382;&#65292;&#8220;&#20320;&#20204;&#26377;&#25105;&#25214;&#30340;&#23646;&#24615;&#21527;&#65311;&#8221;&#23581;&#35797;&#26597;&#25214;&#33258;&#23450;&#20041;&#29256;&#26412;&#21270;&#23646;&#24615;&#20063;&#26159;&#21516;&#26679;&#30340;&#30171;&#33510;&#65292;&#36890;&#24120;&#38656;&#35201;&#22312;&#25972;&#20010;&#24037;&#20316;&#25335;&#36125;&#36882;&#24402;&#35843;&#29992;<span class="command"><strong>svn propget</strong></span>&#12290;&#22312;&#20320;&#30340;&#24773;&#20917;&#19979;&#65292;&#21487;&#33021;&#19981;&#20250;&#27604;&#36941;&#21382;&#25152;&#26377;&#20462;&#35746;&#29256;&#26412;&#24046;&#12290;&#20294;&#20063;&#22312;&#24615;&#33021;&#21644;&#25104;&#21151;&#21487;&#33021;&#24615;&#37324;&#30041;&#19979;&#20102;&#35768;&#22810;&#24748;&#24565;&#65292;&#29305;&#21035;&#26159;&#24403;&#20320;&#38656;&#35201;&#20174;&#29256;&#26412;&#24211;&#30340;&#26681;&#24320;&#22987;&#25628;&#32034;&#26102;&#12290;</p>
          <p>&#22240;&#20026;&#36825;&#20010;&#21407;&#22240;&#65292;&#20320;&#20250;&#36873;&#25321;&#8212;&#29305;&#21035;&#26159;&#22312;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#29992;&#20363;&#8212;&#31616;&#21333;&#30340;&#28155;&#21152;&#20320;&#30340;&#20803;&#25968;&#25454;&#21040;&#20462;&#35746;&#29256;&#26412;&#26085;&#24535;&#20449;&#24687;&#65292;&#20351;&#29992;&#19968;&#20123;&#25919;&#31574;&#39537;&#21160;(&#24182;&#19988;&#26159;&#32534;&#31243;&#24378;&#21046;&#30340;)&#19988;&#21487;&#20197;&#36890;&#36807;<span class="command"><strong>svn log</strong></span>&#24555;&#36895;&#35299;&#26512;&#30340;&#26684;&#24335;&#12290;&#22914;&#19979;&#30340;Subversion&#26085;&#24535;&#20449;&#24687;&#20250;&#24456;&#24120;&#35265;&#65306;</p>
          <pre class="programlisting">
Issue(s): IZ2376, IZ1919
Reviewed by:  sally

This fixes a nasty segfault in the wort frabbing process
&#8230;
</pre>
          <p>&#20294;&#26159;&#29616;&#22312;&#20381;&#28982;&#26377;&#19968;&#20123;&#19981;&#24184;&#65292;Subversion&#19981;&#25903;&#25345;&#26085;&#24535;&#20449;&#24687;&#27169;&#29256;&#26426;&#21046;&#65292;&#34429;&#28982;&#36825;&#26679;&#23545;&#29992;&#25143;&#19982;&#26085;&#24535;&#23884;&#20837;&#30340;&#20462;&#35746;&#29256;&#26412;&#20803;&#25968;&#25454;&#20445;&#25345;&#19968;&#33268;&#26377;&#24456;&#22823;&#24110;&#21161;&#12290;</p>
        </div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.props.manip"></a>&#25805;&#20316;&#23646;&#24615;</h3></div></div></div>
        
        <p><span class="command"><strong>svn</strong></span>&#21629;&#20196;&#25552;&#20379;&#19968;&#20123;&#26041;&#27861;&#26469;&#28155;&#21152;&#21644;&#20462;&#25913;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#23646;&#24615;&#65292;&#23545;&#20110;&#30701;&#30340;&#65292;&#21487;&#35835;&#30340;&#23646;&#24615;&#65292;&#26368;&#31616;&#21333;&#30340;&#28155;&#21152;&#26041;&#27861;&#26159;&#22312;<span class="command"><strong>propset</strong></span>&#23376;&#21629;&#20196;&#37324;&#25351;&#23450;&#27491;&#30830;&#30340;&#21517;&#31216;&#21644;&#20540;&#12290;</p>
        <pre class="screen">
$ svn propset copyright '(c) 2006 Red-Bean Software' calc/button.c
property 'copyright' set on 'calc/button.c'
$
</pre>
        <p>&#20294;&#26159;&#25105;&#20204;&#24050;&#32463;&#21561;&#25447;&#20102;Subversion&#25552;&#20379;&#30340;&#23646;&#24615;&#21151;&#33021;&#30340;&#28789;&#27963;&#24615;&#65292;&#22914;&#26524;&#20320;&#35745;&#21010;&#20351;&#29992;&#22810;&#34892;&#25991;&#26412;&#65292;&#25110;&#32773;&#26159;&#20108;&#36827;&#21046;&#23646;&#24615;&#20540;&#65292;&#20320;&#21487;&#33021;&#19981;&#20250;&#24076;&#26395;&#36890;&#36807;&#21629;&#20196;&#34892;&#25552;&#20379;&#36825;&#20123;&#20540;&#65292;&#25152;&#20197;<span class="command"><strong>propset</strong></span>&#23376;&#21629;&#20196;&#25552;&#20379;&#30340;<code class="option">--file (-F)</code>&#36873;&#39033;&#21487;&#20197;&#25351;&#23450;&#21253;&#21547;&#23646;&#24615;&#20540;&#30340;&#25991;&#20214;&#12290;</p>
        <pre class="screen">
$ svn propset license -F /path/to/LICENSE calc/button.c
property 'license' set on 'calc/button.c'
$
</pre>
        <p>&#23545;&#20110;&#23646;&#24615;&#21517;&#31216;&#20063;&#26377;&#19968;&#20123;&#38480;&#21046;&#65292;&#23646;&#24615;&#21517;&#24517;&#39035;&#20197;&#19968;&#20010;&#23383;&#31526;&#12289;&#19968;&#20010;&#20882;&#21495;(<code class="literal">:</code>)&#25110;&#19979;&#21010;&#32447;(<code class="literal">_</code>)&#24320;&#22987;&#65292;&#20043;&#21518;&#20320;&#21487;&#20197;&#20351;&#29992;&#25968;&#23383;&#65292;&#27178;&#32447;(<code class="literal">-</code>)&#21644;&#21477;&#21495;(<code class="literal">.</code>)&#12290; <sup>[<a name="d4e1772" href="#ftn.d4e1772" class="footnote">9</a>]</sup></p>
        <p>&#20316;&#20026;<span class="command"><strong>propset</strong></span>&#21629;&#20196;&#30340;&#34917;&#20805;&#65292;<span class="command"><strong>svn</strong></span>&#25552;&#20379;&#20102;&#19968;&#20010;<span class="command"><strong>propedit</strong></span>&#21629;&#20196;&#65292;&#36825;&#20010;&#21629;&#20196;&#20351;&#29992;&#23450;&#21046;&#30340;&#32534;&#36753;&#22120;&#31243;&#24207;(&#35265;<a class="xref" href="svn.customization.html#svn.advanced.confarea.opts.config" title="&#37197;&#32622;">&#8220;&#37197;&#32622;&#8221;&#19968;&#33410;</a>)&#26469;&#28155;&#21152;&#21644;&#20462;&#25913;&#23646;&#24615;&#12290;&#24403;&#20320;&#36816;&#34892;&#36825;&#20010;&#21629;&#20196;&#65292;<span class="command"><strong>svn</strong></span>&#35843;&#29992;&#20320;&#30340;&#32534;&#36753;&#22120;&#31243;&#24207;&#25171;&#24320;&#19968;&#20010;&#20020;&#26102;&#25991;&#20214;&#65292;&#25991;&#20214;&#20013;&#20445;&#23384;&#24403;&#21069;&#30340;&#23646;&#24615;&#20540;(&#25110;&#32773;&#26159;&#31354;&#25991;&#20214;&#65292;&#22914;&#26524;&#20320;&#27491;&#22312;&#28155;&#21152;&#26032;&#30340;&#23646;&#24615;)&#12290;&#28982;&#21518;&#20320;&#21482;&#38656;&#35201;&#20462;&#25913;&#20026;&#20320;&#24819;&#35201;&#30340;&#20540;&#65292;&#20445;&#23384;&#20020;&#26102;&#25991;&#20214;&#65292;&#28982;&#21518;&#31163;&#24320;&#32534;&#36753;&#22120;&#31243;&#24207;&#12290;&#22914;&#26524;Subversion&#21457;&#29616;&#20320;&#24050;&#32463;&#20462;&#25913;&#20102;&#23646;&#24615;&#20540;&#65292;&#23601;&#20250;&#25509;&#21463;&#26032;&#20540;&#65292;&#22914;&#26524;&#20320;&#26410;&#20316;&#20219;&#20309;&#20462;&#25913;&#32780;&#31163;&#24320;&#65292;&#19981;&#20250;&#20135;&#29983;&#23646;&#24615;&#20462;&#25913;&#25805;&#20316;&#65306;</p>
        <pre class="screen">
$ svn propedit copyright calc/button.c  ### exit the editor without changes
No changes to property 'copyright' on 'calc/button.c'
$
</pre>
        <p>&#25105;&#20204;&#20063;&#24212;&#35813;&#27880;&#24847;&#21040;&#65292;&#20687;&#20854;&#23427;<span class="command"><strong>svn</strong></span>&#23376;&#21629;&#20196;&#19968;&#26679;&#65292;&#36825;&#20123;&#20851;&#32852;&#30340;&#23646;&#24615;&#21487;&#20197;&#19968;&#27425;&#28155;&#21152;&#21040;&#22810;&#20010;&#36335;&#24452;&#19978;&#65292;&#36825;&#26679;&#23601;&#21487;&#20197;&#36890;&#36807;&#19968;&#20010;&#21629;&#20196;&#20462;&#25913;&#19968;&#32452;&#25991;&#20214;&#30340;&#23646;&#24615;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#21487;&#20197;&#65306;</p>
        <pre class="screen">
$ svn propset copyright '(c) 2006 Red-Bean Software' calc/*
property 'copyright' set on 'calc/Makefile'
property 'copyright' set on 'calc/button.c'
property 'copyright' set on 'calc/integer.c'
&#8230;
$
</pre>
        <p>&#22914;&#26524;&#19981;&#33021;&#26041;&#20415;&#30340;&#24471;&#21040;&#23384;&#20648;&#30340;&#23646;&#24615;&#20540;&#65292;&#37027;&#20040;&#23646;&#24615;&#30340;&#28155;&#21152;&#21644;&#32534;&#36753;&#25805;&#20316;&#20063;&#19981;&#20250;&#24456;&#23481;&#26131;&#65292;&#25152;&#20197;<span class="command"><strong>svn</strong></span>&#25552;&#20379;&#20102;&#20004;&#20010;&#23376;&#21629;&#20196;&#26469;&#26174;&#31034;&#25991;&#20214;&#21644;&#30446;&#24405;&#23384;&#20648;&#30340;&#23646;&#24615;&#21517;&#21644;&#20540;&#12290;<span class="command"><strong>svn proplist</strong></span>&#21629;&#20196;&#20250;&#21015;&#20986;&#36335;&#24452;&#19978;&#23384;&#22312;&#30340;&#25152;&#26377;&#23646;&#24615;&#21517;&#31216;&#65292;&#19968;&#26086;&#20320;&#30693;&#36947;&#20102;&#26576;&#20010;&#33410;&#28857;&#30340;&#23646;&#24615;&#21517;&#31216;&#65292;&#20320;&#21487;&#20197;&#29992;<span class="command"><strong>svn propget</strong></span>&#33719;&#21462;&#23427;&#30340;&#20540;&#65292;&#36825;&#20010;&#21629;&#20196;&#33719;&#21462;&#32473;&#23450;&#30340;&#36335;&#24452;(&#25110;&#32773;&#26159;&#19968;&#32452;&#36335;&#24452;)&#21644;&#23646;&#24615;&#21517;&#31216;&#65292;&#25171;&#21360;&#36825;&#20010;&#23646;&#24615;&#30340;&#20540;&#21040;&#26631;&#20934;&#36755;&#20986;&#12290;</p>
        <pre class="screen">
$ svn proplist calc/button.c
Properties on 'calc/button.c':
  copyright
  license
$ svn propget copyright calc/button.c
(c) 2006 Red-Bean Software
</pre>
        <p>&#36824;&#26377;&#19968;&#20010;<span class="command"><strong>proplist</strong></span>&#21464;&#31181;&#21629;&#20196;&#20250;&#21015;&#20986;&#25152;&#26377;&#23646;&#24615;&#30340;&#21517;&#31216;&#21644;&#20540;&#65292;&#21482;&#38656;&#35201;&#35774;&#32622;<code class="option">--verbose</code>(<code class="option">-v</code>)&#36873;&#39033;&#12290;</p>
        <pre class="screen">
$ svn proplist -v calc/button.c
Properties on 'calc/button.c':
  copyright : (c) 2006 Red-Bean Software
  license : ================================================================
Copyright (c) 2006 Red-Bean Software.  All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions 
are met:

1. Redistributions of source code must retain the above copyright
notice, this list of conditions, and the recipe for Fitz's famous
red-beans-and-rice.
&#8230;
</pre>
        <p>&#26368;&#21518;&#19968;&#20010;&#19982;&#23646;&#24615;&#30456;&#20851;&#30340;&#23376;&#21629;&#20196;&#26159;<span class="command"><strong>propdel</strong></span>&#65292;&#22240;&#20026;Subversion&#20801;&#35768;&#23646;&#24615;&#20540;&#20026;&#31354;&#65292;&#25152;&#26377;&#19981;&#33021;&#29992;<span class="command"><strong>propedit</strong></span>&#25110;&#32773;<span class="command"><strong>propset</strong></span>&#21629;&#20196;&#21024;&#38500;&#19968;&#20010;&#23646;&#24615;&#12290;&#20363;&#22914;&#65292;&#36825;&#20010;&#21629;&#20196;<span class="emphasis"><em>&#19981;&#20250;</em></span>&#20135;&#29983;&#39044;&#26399;&#30340;&#25928;&#26524;&#65306;</p>
        <pre class="screen">
$ svn propset license '' calc/button.c
property 'license' set on 'calc/button.c'
$ svn proplist -v calc/button.c
Properties on 'calc/button.c':
  copyright : (c) 2006 Red-Bean Software
  license : 
$
</pre>
        <p>&#20320;&#38656;&#35201;&#29992;<span class="command"><strong>propdel</strong></span>&#26469;&#21024;&#38500;&#23646;&#24615;&#65292;&#35821;&#27861;&#19982;&#20854;&#23427;&#19982;&#23646;&#24615;&#21629;&#20196;&#30456;&#20284;&#65306;</p>
        <pre class="screen">
$ svn propdel license calc/button.c
property 'license' deleted from 'calc/button.c'.
$ svn proplist -v calc/button.c
Properties on 'calc/button.c':
  copyright : (c) 2006 Red-Bean Software
$
</pre>
        <p>&#36824;&#35760;&#30340;&#36825;&#20123;&#26410;&#29256;&#26412;&#21270;&#30340;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#65311;&#20320;&#20063;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn</strong></span>&#23376;&#21629;&#20196;&#20462;&#25913;&#36825;&#20123;&#23646;&#24615;&#12290;&#21482;&#38656;&#35201;&#28155;&#21152;<code class="option">--revprop</code>&#21629;&#20196;&#21442;&#25968;&#65292;&#35828;&#26126;&#24076;&#26395;&#20462;&#25913;&#23646;&#24615;&#30340;&#20462;&#35746;&#29256;&#26412;&#12290;&#22240;&#20026;&#20462;&#35746;&#29256;&#26412;&#26159;&#20840;&#23616;&#30340;&#65292;&#20320;&#19981;&#38656;&#35201;&#25351;&#23450;&#19968;&#20010;&#36335;&#24452;&#65292;&#21482;&#35201;&#20320;&#24050;&#32463;&#20301;&#20110;&#20320;&#24076;&#26395;&#20462;&#25913;&#23646;&#24615;&#30340;&#24037;&#20316;&#25335;&#36125;&#36335;&#24452;&#65292;&#25110;&#32773;&#65292;&#20320;&#20063;&#21487;&#20197;&#25552;&#20379;&#29256;&#26412;&#24211;&#30340;URL&#30340;&#20219;&#20309;&#36335;&#24452;(&#20063;&#21253;&#25324;&#29256;&#26412;&#24211;&#30340;&#26681;URL)&#12290;&#20363;&#22914;&#65292;<sup>[<a name="d4e1806" href="#ftn.d4e1806" class="footnote">10</a>]</sup>&#22914;&#26524;&#20320;&#24403;&#21069;&#30340;&#24037;&#20316;&#36335;&#24452;&#26159;&#19968;&#20010;&#29256;&#26412;&#24211;&#24037;&#20316;&#25335;&#36125;&#30340;&#19968;&#37096;&#20998;&#65292;&#20320;&#21487;&#20197;&#31616;&#21333;&#30340;&#36816;&#34892;&#27809;&#26377;&#30446;&#26631;&#36335;&#24452;&#30340;<span class="command"><strong>svn propset</strong></span>&#21629;&#20196;&#65306;</p>
        <pre class="screen">
$ svn propset svn:log '* button.c: Fix a compiler warning.' -r11 --revprop
property 'svn:log' set on repository revision '11'
$
</pre>
        <p>&#20294;&#26159;&#21363;&#20351;&#20320;&#27809;&#26377;&#20174;&#29256;&#26412;&#24211;&#26816;&#20986;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#65292;&#20320;&#20173;&#28982;&#21487;&#20197;&#36890;&#36807;&#25552;&#20379;&#29256;&#26412;&#24211;&#26681;URL&#26469;&#24433;&#21709;&#23646;&#24615;&#20462;&#25913;&#12290;</p>
        <pre class="screen">
$ svn propset svn:log '* button.c: Fix a compiler warning.' -r11 --revprop \
              http://svn.example.com/repos/project
property 'svn:log' set on repository revision '11'
$
</pre>
        <p>&#27880;&#24847;&#65292;&#20462;&#25913;&#36825;&#20123;&#26410;&#29256;&#26412;&#21270;&#30340;&#23646;&#24615;&#30340;&#33021;&#21147;&#19968;&#23450;&#35201;&#26126;&#30830;&#30340;&#28155;&#21152;&#32473;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;(&#35265;<a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.setlog" title="&#20462;&#27491;&#25552;&#20132;&#28040;&#24687;">&#8220;&#20462;&#27491;&#25552;&#20132;&#28040;&#24687;&#8221;&#19968;&#33410;</a>)&#12290;&#22240;&#20026;&#23646;&#24615;&#27809;&#26377;&#29256;&#26412;&#21270;&#65292;&#22914;&#26524;&#32534;&#36753;&#30340;&#26102;&#20505;&#19981;&#23567;&#24515;&#65292;&#23601;&#20250;&#20882;&#20002;&#22833;&#20449;&#24687;&#30340;&#39118;&#38505;&#65292;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#21487;&#20197;&#35774;&#32622;&#26041;&#27861;&#26469;&#38450;&#33539;&#36825;&#31181;&#24847;&#22806;&#65292;&#32570;&#30465;&#24773;&#20917;&#19979;&#65292;&#20462;&#25913;&#26410;&#29256;&#26412;&#21270;&#30340;&#23646;&#24615;&#26159;&#31105;&#27490;&#30340;&#12290;</p>
        <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
          <p>&#29992;&#25143;&#24517;&#39035;&#22312;&#21487;&#33021;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;<span class="command"><strong>svn propedit</strong></span>&#65292;&#32780;&#19981;&#26159;<span class="command"><strong>svn propset</strong></span>&#12290;&#28982;&#32780;&#36825;&#20004;&#20010;&#21629;&#20196;&#30340;&#32467;&#26524;&#26159;&#30456;&#21516;&#30340;&#65292;&#21069;&#19968;&#20010;&#20250;&#20801;&#35768;&#20182;&#20204;&#26597;&#30475;&#20462;&#25913;&#20197;&#21069;&#30340;&#20869;&#23481;&#65292;&#21487;&#20197;&#24110;&#21161;&#29992;&#25143;&#39564;&#35777;&#65292;&#23454;&#38469;&#19978;&#65292;&#20316;&#20986;&#20182;&#20204;&#25152;&#26399;&#26395;&#30340;&#20462;&#25913;&#65292;&#24403;&#20462;&#25913;&#26410;&#29256;&#26412;&#21270;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#26102;&#65292;&#36825;&#19968;&#28857;&#29305;&#21035;&#38656;&#35201;&#12290;&#21478;&#22806;&#65292;&#36825;&#20010;&#21629;&#20196;&#20063;&#21487;&#20197;&#36890;&#36807;&#25991;&#26412;&#32534;&#36753;&#22120;&#25110;&#21629;&#20196;&#34892;&#36731;&#26494;&#30340;&#20462;&#25913;&#22810;&#34892;&#23646;&#24615;&#12290;</p>
        </div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.props.workflow"></a>&#23646;&#24615;&#21644; Subversion &#24037;&#20316;&#27969;&#31243;</h3></div></div></div>
        
        <p>&#29616;&#22312;&#20320;&#24050;&#32463;&#29087;&#24713;&#20102;&#25152;&#26377;&#19982;&#23646;&#24615;&#30456;&#20851;&#30340;<span class="command"><strong>svn</strong></span>&#23376;&#21629;&#20196;&#65292;&#35753;&#25105;&#20204;&#30475;&#30475;&#23646;&#24615;&#20462;&#25913;&#22914;&#20309;&#24433;&#21709;Subversion&#30340;&#24037;&#20316;&#27969;&#12290;&#25105;&#20204;&#21069;&#38754;&#25552;&#21040;&#36807;&#65292;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#23646;&#24615;&#26159;&#29256;&#26412;&#21270;&#30340;&#65292;&#36825;&#19968;&#28857;&#31867;&#20284;&#20110;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#20869;&#23481;&#12290;&#21518;&#26524;&#20043;&#19968;&#65292;&#23601;&#26159;Subversion&#20855;&#26377;&#20102;&#21516;&#26679;&#30340;&#26426;&#21046;&#26469;&#21512;&#24182;&#8212;&#29992;&#24178;&#20928;&#25110;&#32773;&#20914;&#31361;&#30340;&#26041;&#24335;&#8212;&#20854;&#20182;&#20154;&#30340;&#20462;&#25913;&#24212;&#29992;&#21040;&#20320;&#30340;&#20462;&#25913;&#12290;</p>
        <p>&#23601;&#20687;&#25991;&#20214;&#20869;&#23481;&#65292;&#20320;&#30340;&#23646;&#24615;&#20462;&#25913;&#26159;&#26412;&#22320;&#20462;&#25913;&#65292;&#21482;&#26377;&#20351;&#29992;<span class="command"><strong>svn commit</strong></span>&#21629;&#20196;&#25552;&#20132;&#21518;&#25165;&#20250;&#20445;&#23384;&#21040;&#29256;&#26412;&#24211;&#20013;&#65292;&#23646;&#24615;&#20462;&#25913;&#20063;&#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#21462;&#28040;&#8212;<span class="command"><strong>svn revert</strong></span>&#21629;&#20196;&#20250;&#24674;&#22797;&#20320;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#20026;&#32534;&#36753;&#21069;&#29366;&#24577;&#65292;&#21253;&#25324;&#20869;&#23481;&#12289;&#23646;&#24615;&#21644;&#20854;&#23427;&#30340;&#20449;&#24687;&#12290;&#21478;&#22806;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn status</strong></span>&#21644;<span class="command"><strong>svn diff</strong></span>&#25509;&#21463;&#24863;&#20852;&#36259;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#23646;&#24615;&#30340;&#29366;&#24577;&#20449;&#24687;&#12290;</p>
        <pre class="screen">
$ svn status calc/button.c
 M     calc/button.c
$ svn diff calc/button.c
Property changes on: calc/button.c
___________________________________________________________________
Name: copyright
   + (c) 2006 Red-Bean Software

$
</pre>
        <p>&#27880;&#24847;<span class="command"><strong>status</strong></span>&#23376;&#21629;&#20196;&#26174;&#31034;&#30340;<code class="literal">M</code>&#22312;&#31532;&#20108;&#21015;&#32780;&#19981;&#26159;&#22312;&#31532;&#19968;&#21015;&#65292;&#36825;&#26159;&#22240;&#20026;&#25105;&#20204;&#20462;&#25913;&#20102;<code class="filename">calc/button.c</code>&#30340;&#23646;&#24615;&#65292;&#32780;&#19981;&#26159;&#23427;&#30340;&#25991;&#26412;&#20869;&#23481;&#65292;&#22914;&#26524;&#25105;&#20204;&#37117;&#20462;&#25913;&#20102;&#65292;&#25105;&#20204;&#20063;&#20250;&#30475;&#21040;<code class="literal">M</code>&#20986;&#29616;&#22312;&#31532;&#19968;&#21015;(&#35265;<a class="xref" href="svn.tour.cycle.html#svn.tour.cycle.examine.status" title="&#26597;&#30475;&#20320;&#30340;&#20462;&#25913;&#27010;&#20917;">&#8220;&#26597;&#30475;&#20320;&#30340;&#20462;&#25913;&#27010;&#20917;&#8221;&#19968;&#33410;</a>)&#12290;</p>
        <div class="sidebar"><p class="title"><b>&#23646;&#24615;&#20914;&#31361;</b></p>
          
          <p>&#19982;&#25991;&#20214;&#20869;&#23481;&#19968;&#26679;&#65292;&#26412;&#22320;&#30340;&#23646;&#24615;&#20462;&#25913;&#20063;&#20250;&#21516;&#21035;&#20154;&#30340;&#25552;&#20132;&#20914;&#31361;&#65292;&#22914;&#26524;&#20320;&#26356;&#26032;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#30446;&#24405;&#24182;&#19988;&#25509;&#25910;&#21040;&#26377;&#36164;&#28304;&#23646;&#24615;&#20462;&#25913;&#19982;&#20320;&#30340;&#20462;&#25913;&#20914;&#31361;&#65292;Subversion&#20250;&#25253;&#21578;&#36164;&#28304;&#22788;&#20110;&#20914;&#31361;&#29366;&#24577;&#12290;</p>
          <pre class="screen">
% svn update calc
M  calc/Makefile.in
 C calc/button.c
Updated to revision 143.
$ 
</pre>
          <p>Subversion&#20063;&#20250;&#22312;&#20914;&#31361;&#36164;&#28304;&#30340;&#21516;&#19968;&#20010;&#30446;&#24405;&#21019;&#24314;&#19968;&#20010;<code class="filename">.prej</code>&#25193;&#23637;&#21517;&#30340;&#25991;&#20214;&#65292;&#20445;&#23384;&#20914;&#31361;&#30340;&#32454;&#33410;&#12290;&#20320;&#19968;&#23450;&#35201;&#26816;&#26597;&#36825;&#20010;&#25991;&#20214;&#30340;&#20869;&#23481;&#26469;&#20915;&#23450;&#22914;&#20309;&#35299;&#20915;&#20914;&#31361;&#65292;&#22312;&#20320;&#35299;&#20915;&#20914;&#31361;&#20043;&#21069;&#65292;&#20320;&#20250;&#22312;&#20351;&#29992;<span class="command"><strong>svn status</strong></span>&#26102;&#30475;&#21040;&#36825;&#20010;&#36164;&#28304;&#30340;&#36755;&#20986;&#30340;&#31532;&#20108;&#21015;&#26159;&#19968;&#20010;<code class="literal">C</code>&#65292;&#25552;&#20132;&#26412;&#22320;&#20462;&#25913;&#30340;&#23581;&#35797;&#20250;&#22833;&#36133;&#12290;</p>
          <pre class="screen">
$ svn status calc
 C     calc/button.c
?      calc/button.c.prej
$ cat calc/button.c.prej 
prop 'linecount': user set to '1256', but update set to '1301'.
$
</pre>
          <p>&#20026;&#20102;&#35299;&#20915;&#23646;&#24615;&#20914;&#31361;&#65292;&#21482;&#38656;&#35201;&#30830;&#23450;&#20914;&#31361;&#30340;&#23646;&#24615;&#20445;&#23384;&#20102;&#23427;&#20204;&#24212;&#35813;&#30340;&#20540;&#65292;&#28982;&#21518;&#20351;&#29992;<span class="command"><strong>svn resolved</strong></span>&#21629;&#20196;&#21578;&#35785;Subversion&#20320;&#24050;&#32463;&#25163;&#24037;&#35299;&#20915;&#20102;&#38382;&#39064;&#12290;</p>
        </div>
        <p>&#20320;&#20063;&#35768;&#24050;&#32463;&#27880;&#24847;&#21040;&#20102;Subversion&#22312;&#26174;&#31034;&#23646;&#24615;&#26102;&#30340;&#38750;&#26631;&#20934;&#26041;&#24335;&#12290;&#20320;&#36824;&#21487;&#20197;&#36816;&#34892;<span class="command"><strong>svn diff</strong></span>&#24182;&#19988;&#37325;&#23450;&#21521;&#36755;&#20986;&#26469;&#20135;&#29983;&#19968;&#20010;&#26377;&#29992;&#30340;&#34917;&#19969;&#25991;&#20214;&#65292;<span class="command"><strong>patch</strong></span>&#31243;&#24207;&#20250;&#24573;&#30053;&#23646;&#24615;&#34917;&#19969;&#8212;&#20316;&#20026;&#35268;&#21017;&#65292;&#23427;&#20250;&#24573;&#30053;&#20219;&#20309;&#19981;&#29702;&#35299;&#30340;&#22122;&#38899;&#12290;&#24456;&#36951;&#25022;&#65292;&#36825;&#24847;&#21619;&#30528;&#23436;&#20840;&#24212;&#29992;<span class="command"><strong>svn diff</strong></span>&#20135;&#29983;&#30340;&#34917;&#19969;&#26102;&#65292;&#20219;&#20309;&#23646;&#24615;&#20462;&#25913;&#24517;&#39035;&#25163;&#24037;&#23454;&#26045;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.props.auto"></a>&#33258;&#21160;&#35774;&#32622;&#23646;&#24615;</h3></div></div></div>
        
        <p>&#23646;&#24615;&#26159;Subversion&#19968;&#20010;&#24378;&#22823;&#30340;&#29305;&#24615;&#65292;&#25104;&#20026;&#26412;&#31456;&#21644;&#20854;&#23427;&#31456;&#35752;&#35770;&#30340;&#35768;&#22810;Subversion&#29305;&#24615;&#30340;&#20851;&#38190;&#32452;&#25104;&#37096;&#20998;&#8212;&#25991;&#26412;&#21306;&#21035;&#21644;&#21512;&#24182;&#25903;&#25345;&#12289;&#20851;&#38190;&#23383;&#26367;&#25442;&#12289;&#26032;&#34892;&#30340;&#33258;&#21160;&#36716;&#25442;&#31561;&#31561;&#12290;&#20294;&#26159;&#20026;&#20102;&#20174;&#23646;&#24615;&#24471;&#21040;&#23436;&#20840;&#30340;&#21033;&#30410;&#65292;&#20182;&#20204;&#24517;&#39035;&#35774;&#32622;&#21040;&#27491;&#30830;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#22312;&#26085;&#24120;&#24037;&#20316;&#20013;&#24456;&#23481;&#26131;&#24536;&#35760;&#36825;&#19968;&#27493;&#24037;&#20316;&#65292;&#29305;&#21035;&#26159;&#24403;&#27809;&#26377;&#35774;&#32622;&#23646;&#24615;&#19981;&#20250;&#24341;&#36215;&#26126;&#26174;&#30340;&#38169;&#35823;&#26102;(&#33267;&#23569;&#30456;&#23545;&#19982;&#26410;&#33021;&#28155;&#21152;&#19968;&#20010;&#25991;&#20214;&#21040;&#29256;&#26412;&#25511;&#21046;&#36825;&#31181;&#25805;&#20316;)&#65292;&#20026;&#20102;&#24110;&#21161;&#20320;&#22312;&#38656;&#35201;&#28155;&#21152;&#23646;&#24615;&#30340;&#25991;&#20214;&#19978;&#28155;&#21152;&#23646;&#24615;&#65292;Subversion&#25552;&#20379;&#20102;&#19968;&#20123;&#31616;&#21333;&#20294;&#26159;&#26377;&#29992;&#30340;&#29305;&#24615;&#12290;</p>
        <p>&#24403;&#20320;&#20351;&#29992;<span class="command"><strong>svn add</strong></span>&#25110;&#26159;<span class="command"><strong>svn import</strong></span>&#20934;&#22791;&#21152;&#20837;&#19968;&#20010;&#29256;&#26412;&#25511;&#21046;&#30340;&#25991;&#20214;&#26102;&#65292;Subversion&#20250;&#33258;&#21160;&#36816;&#34892;&#19968;&#20010;&#22522;&#26412;&#25506;&#27979;&#26469;&#26816;&#26597;&#25991;&#20214;&#26159;&#21253;&#21547;&#20102;&#21487;&#35835;&#36824;&#26159;&#19981;&#21487;&#35835;&#30340;&#20869;&#23481;&#65292;&#39318;&#20808;&#65292;&#22312;&#25903;&#25345;&#25191;&#34892;&#20801;&#35768;&#20301;&#30340;&#25805;&#20316;&#31995;&#32479;&#65292;Subversion&#20250;&#33258;&#21160;&#20250;&#20026;&#35774;&#32622;&#25191;&#34892;&#20301;&#30340;&#25991;&#20214;&#35774;&#32622;<code class="literal">svn:executable</code>&#23646;&#24615;(&#26356;&#22810;&#20449;&#24687;&#35265;<a class="xref" href="svn.advanced.props.file-portability.html#svn.advanced.props.special.executable" title="&#25991;&#20214;&#30340;&#21487;&#25191;&#34892;&#24615;">&#8220;&#25991;&#20214;&#30340;&#21487;&#25191;&#34892;&#24615;&#8221;&#19968;&#33410;</a>)&#12290;&#31532;&#20108;&#65292;&#23427;&#20250;&#36816;&#34892;&#38750;&#24120;&#22522;&#30784;&#30340;&#21551;&#21457;&#24335;&#26816;&#26597;&#26469;&#26816;&#27979;&#25991;&#20214;&#26159;&#21542;&#21487;&#35835;&#65292;&#22914;&#26524;&#19981;&#26159;&#65292;Subversion&#20250;&#33258;&#21160;&#35774;&#32622;&#25991;&#20214;&#30340;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#20026;<code class="literal">application/octet-stream</code>(&#21407;&#22987;&#30340;&#8220;<span class="quote">&#19968;&#32452;&#23383;&#33410;</span>&#8221;&#30340;MIME&#31867;&#22411;)&#12290;&#22914;&#26524;Subversion&#29468;&#27979;&#38169;&#35823;&#65292;&#25110;&#32773;&#26159;&#20320;&#24076;&#26395;&#20351;&#29992;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#26356;&#31934;&#30830;&#30340;&#35774;&#32622;&#8212;&#25110;&#35768;&#26159;<code class="literal">image/png</code>&#25110;&#32773;<code class="literal">application/x-shockwave-flash</code>&#8212;&#20320;&#21487;&#20197;&#19968;&#30452;&#21024;&#38500;&#25110;&#32534;&#36753;&#37027;&#20010;&#23646;&#24615;(&#20851;&#20110;Subversion&#20351;&#29992;MIME&#31867;&#22411;&#30340;&#26356;&#22810;&#20449;&#24687;&#65292;&#35265;<a class="xref" href="svn.advanced.props.file-portability.html#svn.advanced.props.special.mime-type" title="&#25991;&#20214;&#20869;&#23481;&#31867;&#22411;">&#8220;&#25991;&#20214;&#20869;&#23481;&#31867;&#22411;&#8221;&#19968;&#33410;</a>&#12290;)</p>
        <p>Subversion&#20063;&#36890;&#36807;&#36816;&#34892;&#37197;&#32622;&#31995;&#32479;(&#35265;<a class="xref" href="svn.customization.html#svn.advanced.confarea" title="&#36816;&#34892;&#37197;&#32622;&#21306;">&#8220;&#36816;&#34892;&#37197;&#32622;&#21306;&#8221;&#19968;&#33410;</a>)&#25552;&#20379;&#20102;&#33258;&#21160;&#23646;&#24615;&#29305;&#24615;&#65292;&#20801;&#35768;&#20320;&#21019;&#24314;&#25991;&#20214;&#21517;&#21040;&#23646;&#24615;&#21517;&#31216;&#19982;&#20540;&#24433;&#23556;&#65292;&#36825;&#20010;&#24433;&#23556;&#22312;&#20320;&#30340;&#36816;&#34892;&#37197;&#32622;&#21306;&#22495;&#35774;&#32622;&#65292;&#23427;&#20204;&#20250;&#24433;&#21709;&#28155;&#21152;&#21644;&#23548;&#20837;&#25805;&#20316;&#65292;&#32780;&#19988;&#19981;&#20165;&#20165;&#20250;&#35206;&#30422;Subversion&#25152;&#26377;&#32570;&#30465;&#30340;MIME&#31867;&#22411;&#21028;&#26029;&#25805;&#20316;&#65292;&#20063;&#20250;&#35774;&#32622;&#39069;&#22806;&#30340;Subversion&#25110;&#32773;&#33258;&#23450;&#20041;&#30340;&#23646;&#24615;&#12290;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#20250;&#21019;&#24314;&#19968;&#20010;&#24433;&#23556;&#25991;&#20214;&#35828;&#22312;&#20219;&#20309;&#26102;&#20505;&#20320;&#28155;&#21152;&#20102;&#19968;&#20010;JPEG&#25991;&#20214;&#8212;&#19968;&#20123;&#31526;&#21512;<code class="literal">*.jpg</code>&#30340;&#25991;&#20214;&#8212;Subversion&#19968;&#23450;&#20250;&#33258;&#21160;&#35774;&#32622;&#23427;&#20204;&#30340;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#20026;<code class="literal">image/jpeg</code>&#12290;&#25110;&#32773;&#26159;&#20219;&#20309;&#21305;&#37197;<code class="literal">*.cpp</code>&#30340;&#25991;&#20214;&#65292;&#24517;&#39035;&#25226;<code class="literal">svn:eol-style</code>&#35774;&#32622;&#20026;<code class="literal">native</code>&#65292;&#24182;&#19988;<code class="literal">svn:keywords</code>&#35774;&#32622;&#20026;<code class="literal">Id</code>&#12290;&#33258;&#21160;&#23646;&#24615;&#25903;&#25345;&#26159;Subversion&#24037;&#20855;&#31665;&#20013;&#23646;&#24615;&#30456;&#20851;&#26368;&#22402;&#25163;&#21487;&#24471;&#30340;&#24037;&#20855;&#65292;&#35265;<a class="xref" href="svn.customization.html#svn.advanced.confarea.opts.config" title="&#37197;&#32622;">&#8220;&#37197;&#32622;&#8221;&#19968;&#33410;</a>&#26469;&#26597;&#30475;&#26356;&#22810;&#30340;&#37197;&#32622;&#25903;&#25345;&#12290;</p>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e1772" href="#d4e1772" class="para">9</a>] </sup>&#22914;&#26524;&#20320;&#29087;&#24713;XML&#65292;&#20854;&#23454;&#36825;&#23601;&#26159;XML&#30340;"Name"&#35821;&#27861;&#30340;ASCII&#23376;&#38598;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e1806" href="#d4e1806" class="para">10</a>] </sup>&#20462;&#27491;&#25552;&#20132;&#26085;&#24535;&#20449;&#24687;&#30340;&#25340;&#20889;&#38169;&#35823;&#65292;&#25991;&#27861;&#38169;&#35823;&#21644;&#8220;<span class="quote">&#31616;&#21333;&#30340;&#38169;&#35823;</span>&#8221;&#26159;<code class="option">--revprop</code>&#36873;&#39033;&#26368;&#24120;&#35265;&#29992;&#20363;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.advanced.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.advanced.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.props.file-portability.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#25991;&#20214;&#31227;&#26893;&#24615;</td></tr></table></div></body></html>