<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#30446;&#24405;&#30340;&#29256;&#26412;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.forcvs.html" title="&#38468;&#24405;&nbsp;B.&nbsp;CVS &#29992;&#25143;&#30340; Subversion &#25351;&#21335;"><link rel="prev" href="svn.forcvs.html" title="&#38468;&#24405;&nbsp;B.&nbsp;CVS &#29992;&#25143;&#30340; Subversion &#25351;&#21335;"><link rel="next" href="svn.forcvs.disconnected.html" title="&#26356;&#22810;&#31163;&#32447;&#25805;&#20316;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#30446;&#24405;&#30340;&#29256;&#26412;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.forcvs.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#38468;&#24405;&nbsp;B.&nbsp;CVS &#29992;&#25143;&#30340; Subversion &#25351;&#21335;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.forcvs.disconnected.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.forcvs.directories"></a>&#30446;&#24405;&#30340;&#29256;&#26412;</h2></div></div></div>
      
      <p>Subversion&#20250;&#35760;&#24405;&#30446;&#24405;&#26641;&#30340;&#32467;&#26500;&#65292;&#19981;&#20165;&#20165;&#26159;&#25991;&#20214;&#30340;&#20869;&#23481;&#12290;&#36825;&#26159;&#32534;&#20889;Subversion&#26367;&#20195;CVS&#26368;&#37325;&#35201;&#30340;&#19968;&#20010;&#21407;&#22240;&#12290;</p>
      <p>&#20197;&#19979;&#26159;&#23545;&#20320;&#36825;&#24847;&#21619;&#30528;&#20160;&#20040;&#30340;&#35828;&#26126;&#65292;&#20316;&#20026;&#19968;&#20010;&#21069;CVS&#29992;&#25143;&#65306;</p>
      <div class="itemizedlist"><ul type="disc"><li>
          <p><span class="command"><strong>svn add</strong></span>&#21644;<span class="command"><strong>svn delete</strong></span>&#29616;&#22312;&#20063;&#24037;&#20316;&#22312;&#30446;&#24405;&#19978;&#20102;&#65292;&#23601;&#20687;&#22312;&#25991;&#20214;&#19978;&#19968;&#26679;&#65292;&#36824;&#26377;<span class="command"><strong>svn copy</strong></span>&#21644;<span class="command"><strong>svn move</strong></span>&#20063;&#19968;&#26679;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#21629;&#20196;<span class="emphasis"><em>&#19981;</em></span>&#20250;&#23548;&#33268;&#29256;&#26412;&#24211;&#21363;&#26102;&#30340;&#21464;&#21270;&#65292;&#30456;&#21453;&#65292;&#24037;&#20316;&#30340;&#39033;&#30446;&#21482;&#26159;&#8220;<span class="quote">&#39044;&#23450;&#35201;</span>&#8221;&#28155;&#21152;&#21644;&#21024;&#38500;&#65292;&#22312;&#36816;&#34892;<span class="command"><strong>svn commit</strong></span>&#20043;&#21069;&#27809;&#26377;&#29256;&#26412;&#24211;&#30340;&#20462;&#25913;&#12290;</p>
        </li><li>
          <p>&#30446;&#24405;&#19981;&#20877;&#26159;&#21713;&#23481;&#22120;&#20102;&#65307;&#23427;&#20204;&#20063;&#26377;&#25991;&#20214;&#19968;&#26679;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#12290;(&#26356;&#20934;&#30830;&#19968;&#28857;&#65292;&#35848;&#35770;&#8220;<span class="quote">&#20462;&#35746;&#29256;&#26412;5&#30340;&#30446;&#24405;<code class="filename">foo/</code></span>&#8221;&#26159;&#27491;&#30830;&#30340;&#12290;)</p>
        </li></ul></div>
      <p>&#35753;&#25105;&#20204;&#20877;&#35752;&#35770;&#19968;&#19979;&#26368;&#21518;&#19968;&#28857;&#65292;&#30446;&#24405;&#29256;&#26412;&#21270;&#26159;&#19968;&#20010;&#22256;&#38590;&#30340;&#38382;&#39064;&#65307;&#22240;&#20026;&#25105;&#20204;&#24076;&#26395;&#20801;&#35768;&#28151;&#21512;&#20462;&#35746;&#29256;&#26412;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#26377;&#19968;&#20123;&#38450;&#27490;&#25105;&#20204;&#28389;&#29992;&#36825;&#20010;&#27169;&#22411;&#30340;&#38480;&#21046;&#12290;</p>
      <p>&#20174;&#29702;&#35770;&#35266;&#28857;&#65292;&#25105;&#20204;&#23450;&#20041;&#8220;<span class="quote">&#30446;&#24405;<code class="filename">foo</code>&#30340;&#20462;&#35746;&#29256;&#26412;5</span>&#8221;&#24847;&#21619;&#30528;&#19968;&#32452;&#30446;&#24405;&#26465;&#30446;&#21644;&#23646;&#24615;&#12290;&#29616;&#22312;&#20551;&#23450;&#25105;&#20204;&#20174;<code class="filename">foo</code>&#24320;&#22987;&#28155;&#21152;&#21644;&#21024;&#38500;&#25991;&#20214;&#65292;&#28982;&#21518;&#25552;&#20132;&#12290;&#22914;&#26524;&#35828;&#25105;&#20204;&#36824;&#26377;<code class="filename">foo</code>&#30340;&#20462;&#35746;&#29256;&#26412;5&#23601;&#26159;&#19968;&#20010;&#35854;&#35328;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#35828;&#25105;&#20204;&#22312;&#25552;&#20132;&#20043;&#21518;&#22686;&#21152;&#20102;&#19968;&#20301;<code class="filename">foo</code>&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#65292;&#36825;&#20063;&#26159;&#19968;&#20010;&#35854;&#35328;&#65307;<code class="filename">foo</code>&#36824;&#26377;&#19968;&#20123;&#20462;&#25913;&#25105;&#20204;&#27809;&#26377;&#24471;&#21040;&#65292;&#22240;&#20026;&#25105;&#20204;&#36824;&#27809;&#26377;&#26356;&#26032;&#12290;</p>
      <p>Subversion&#36890;&#36807;&#22312;<code class="filename">.svn</code>&#21306;&#22495;&#20599;&#20599;&#30340;&#32426;&#24405;&#28155;&#21152;&#21644;&#21024;&#38500;&#26469;&#22788;&#29702;&#36825;&#20123;&#38382;&#39064;&#65292;&#24403;&#20320;&#26368;&#21518;&#36816;&#34892;<span class="command"><strong>svn update</strong></span>&#65292;&#25152;&#26377;&#30340;&#36134;&#30446;&#20250;&#21040;&#29256;&#26412;&#24211;&#32467;&#31639;&#65292;&#24182;&#19988;&#30446;&#24405;&#30340;&#26032;&#20462;&#35746;&#29256;&#26412;&#21495;&#20250;&#27491;&#30830;&#35774;&#32622;&#12290;<span class="emphasis"><em>&#22240;&#27492;&#65292;&#21482;&#26377;&#22312;&#26356;&#26032;&#20043;&#21518;&#25165;&#21487;&#20197;&#30495;&#27491;&#23433;&#20840;&#22320;&#35828;&#25105;&#20204;&#26377;&#20102;&#19968;&#20010;&#8220;<span class="quote">&#23436;&#32654;&#30340;</span>&#8221;&#20462;&#35746;&#29256;&#26412;&#30446;&#24405;&#12290;</em></span>&#22312;&#22823;&#22810;&#25968;&#26102;&#20505;&#65292;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#20250;&#20445;&#23384;&#8220;<span class="quote">&#19981;&#23436;&#32654;&#30340;</span>&#8221;&#30446;&#24405;&#20462;&#35746;&#29256;&#26412;&#12290;</p>
      <p>&#21516;&#26679;&#30340;&#65292;&#22914;&#26524;&#20320;&#23581;&#35797;&#25552;&#20132;&#30446;&#24405;&#30340;&#23646;&#24615;&#20462;&#25913;&#20250;&#26377;&#19968;&#20010;&#38382;&#39064;&#65292;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#25552;&#20132;&#24212;&#35813;&#20250;&#25552;&#39640;&#24037;&#20316;&#30446;&#24405;&#30340;&#26412;&#22320;&#20462;&#35746;&#29256;&#26412;&#21495;&#65292;&#20294;&#26159;&#20877;&#19968;&#27425;&#65292;&#36825;&#36824;&#26159;&#19968;&#20010;&#35854;&#35328;&#65292;&#22240;&#20026;&#36825;&#20010;&#30446;&#24405;&#36824;&#27809;&#26377;&#28155;&#21152;&#21644;&#21024;&#38500;&#21457;&#29983;&#65292;&#22240;&#20026;&#36824;&#27809;&#26377;&#26356;&#26032;&#21457;&#29983;&#12290;<span class="emphasis"><em>&#22240;&#27492;&#65292;&#22312;&#20320;&#30340;&#30446;&#24405;&#19981;&#26159;&#26368;&#26032;&#30340;&#26102;&#20505;&#19981;&#20801;&#35768;&#20320;&#25552;&#20132;&#23646;&#24615;&#20462;&#25913;&#12290;</em></span></p>
      <p>&#20851;&#20110;&#30446;&#24405;&#29256;&#26412;&#30340;&#26356;&#22810;&#35752;&#35770;&#35265;<a class="xref" href="svn.basic.in-action.html#svn.basic.in-action.mixedrevs" title="&#28151;&#21512;&#20462;&#35746;&#29256;&#26412;&#30340;&#24037;&#20316;&#21103;&#26412;">&#8220;&#28151;&#21512;&#20462;&#35746;&#29256;&#26412;&#30340;&#24037;&#20316;&#21103;&#26412;&#8221;&#19968;&#33410;</a>&#12290;</p>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.forcvs.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.forcvs.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.forcvs.disconnected.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#38468;&#24405;&nbsp;B.&nbsp;CVS &#29992;&#25143;&#30340; Subversion &#25351;&#21335;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#26356;&#22810;&#31163;&#32447;&#25805;&#20316;</td></tr></table></div></body></html>