<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#33268;&#35874;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.preface.html" title="&#24207;&#35328;"><link rel="prev" href="svn.preface.free.html" title="&#26412;&#20070;&#26159;&#20813;&#36153;&#30340;"><link rel="next" href="svn.intro.whatis.html" title="Subversion&#26159;&#20160;&#20040;&#65311;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#33268;&#35874;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.preface.free.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#24207;&#35328;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.intro.whatis.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.preface.acks"></a>&#33268;&#35874;</h2></div></div></div>
      
      <p>&#27809;&#26377;Subversion&#23601;&#19981;&#21487;&#33021;&#26377;(&#21363;&#20351;&#26377;&#20063;&#27809;&#20160;&#20040;&#20215;&#20540;)&#36825;&#26412;&#20070;&#12290;&#25152;&#20197;&#20316;&#32773;&#34935;&#24515;&#24863;&#35874;Brian Behlendorf&#21644;CollabNet&#65292;&#20182;&#20204;&#29420;&#21040;&#30340;&#30524;&#20809;&#24320;&#21019;&#20102;&#36825;&#20010;&#20805;&#28385;&#20882;&#38505;&#20294;&#38596;&#24515;&#21187;&#21187;&#30340;&#24320;&#28304;&#39033;&#30446;&#65307;Jim Blandy&#36129;&#29486;&#20102;Subversion&#26368;&#21021;&#30340;&#21517;&#23383;&#21644;&#35774;&#35745;&#8212;&#25105;&#20204;&#29233;&#20320;&#65292;Jim&#12290;&#36824;&#26377;Karl Fogel&#65292;&#19968;&#20010;&#22909;&#26379;&#21451;&#21644;&#20255;&#22823;&#30340;&#31038;&#21306;&#39046;&#34966;&#12290;<sup>[<a name="d4e285" href="#ftn.d4e285" class="footnote">1</a>]</sup></p>
      <p>&#24863;&#35874;O'Reilly&#21644;&#25105;&#20204;&#30340;&#32534;&#36753;Linda Mui&#21644;Tatiana&#23545;&#25105;&#20204;&#30340;&#32784;&#24515;&#21644;&#25903;&#25345;&#12290;</p>
      <p>&#26368;&#21518;&#65292;&#25105;&#20204;&#35201;&#24863;&#35874;&#25968;&#19981;&#28165;&#30340;&#26366;&#32463;&#20026;&#26412;&#20070;&#20316;&#20986;&#36129;&#29486;&#30340;&#20154;&#20204;&#65292;&#20182;&#20204;&#36827;&#34892;&#20102;&#38750;&#27491;&#24335;&#30340;&#23457;&#38405;&#65292;&#24182;&#32473;&#20986;&#20102;&#22823;&#37327;&#24314;&#35758;&#21644;&#20462;&#25913;&#24847;&#35265;&#12290;&#34429;&#28982;&#26080;&#27861;&#21015;&#20986;&#19968;&#20010;&#23436;&#25972;&#30340;&#21015;&#34920;&#65292;&#20294;&#26412;&#20070;&#30340;&#23436;&#25972;&#21644;&#27491;&#30830;&#31163;&#19981;&#24320;&#20182;&#20204;&#65306;David Anderson, Jani Averbach, Ryan Barrett, Francois Beausoleil, Jennifer Bevan, Matt Blais, Zack Brown, Martin Buchholz, Brane Cibej, John R. Daily, Peter Davis, Olivier Davy, Robert P. J. Day, Mo DeJong, Brian Denny, Joe Drew, Nick Duffek, Ben Elliston, Justin Erenkrantz, Shlomi Fish, Julian Foad, Chris Foote, Martin Furter, Dave Gilbert, Eric Gillespie, David Glasser, Matthew Gregan, Art Haas, Eric Hanchrow, Greg Hudson, Alexis Huxley, Jens B. Jorgensen, Tez Kamihira, David Kimdon, Mark Benedetto King, Andreas J. Koenig, Nuutti Kotivuori, Matt Kraai, Scott Lamb, Vincent Lefevre, Morten Ludvigsen, Paul Lussier, Bruce A. Mah, Philip Martin, Feliciano Matias, Patrick Mayweg, Gareth McCaughan, Jon Middleton, Tim Moloney, Christopher Ness, Mats Nilsson, Joe Orton, Amy Lyn Pilato, Kevin Pilch-Bisson, Dmitriy Popkov, Michael Price, Mark Proctor, Steffen Prohaska, Daniel Rall, Jack Repenning, Tobias Ringstrom, Garrett Rooney, Joel Rosdahl, Christian Sauer, Larry Shatzer, Russell Steicke, Sander Striker, Erik Sjoelund, Johan Sundstroem, John Szakmeister, Mason Thomas, Eric Wadsworth, Colin Watson, Alex Waugh, Chad Whitacre, Josef Wolf, Blair Zajac, &#20197;&#21450;&#25972;&#20010;Subversion&#31038;&#21306;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.preface.acks.sussman"></a>&#26469;&#33258; Ben Collins-Sussman</h3></div></div></div>
        
        <p>&#24863;&#35874;&#25105;&#30340;&#22971;&#23376;Frances&#65292;&#22312;&#22909;&#20960;&#20010;&#26376;&#37324;&#65292;&#25105;&#19968;&#30452;&#22312;&#23545;&#20320;&#35828;&#65306;&#8220;<span class="quote">&#20294;&#26159;&#20146;&#29233;&#30340;&#65292;&#25105;&#36824;&#22312;&#20026;&#36825;&#26412;&#20070;&#24037;&#20316;</span>&#8221;&#65292;&#27492;&#22806;&#36824;&#26377;&#65292;&#8220;<span class="quote">&#20294;&#26159;&#20146;&#29233;&#30340;&#65292;&#25105;&#36824;&#22312;&#22788;&#29702;&#37038;&#20214;</span>&#8221;&#12290;&#25105;&#19981;&#30693;&#36947;&#22905;&#20026;&#20160;&#20040;&#20250;&#22914;&#27492;&#32784;&#24515;&#65281;&#22905;&#26159;&#25105;&#23436;&#32654;&#30340;&#24179;&#34913;&#28857;&#12290;</p>
        <p>&#24863;&#35874;&#25105;&#30340;&#23478;&#20154;&#23545;&#25105;&#30340;&#40723;&#21169;&#65292;&#26080;&#35770;&#20182;&#20204;&#26159;&#21542;&#30495;&#30340;&#23545;&#25105;&#30340;&#35838;&#39064;&#24863;&#20852;&#36259;&#12290;(&#20320;&#30693;&#36947;&#30340;&#65292;&#19968;&#20010;&#20154;&#35828; &#8220;<span class="quote">&#21703;&#65292;&#20320;&#27491;&#22312;&#20889;&#19968;&#26412;&#20070;&#65311;</span>&#8221;&#65292;&#28982;&#21518;&#24403;&#20182;&#30693;&#36947;&#20320;&#26159;&#20889;&#19968;&#26412;&#35745;&#31639;&#26426;&#20070;&#26102;&#65292;&#37027;&#31181;&#24778;&#35766;&#23601;&#21464;&#24471;&#27809;&#26377;&#37027;&#20040;&#22810;&#20102;&#12290;)</p>
        <p>&#24863;&#35874;&#25105;&#36523;&#36793;&#35753;&#25105;&#23500;&#26377;&#30340;&#26379;&#21451;&#65292;&#19981;&#35201;&#37027;&#26679;&#30475;&#25105;&#8212;&#20320;&#20204;&#30693;&#36947;&#20320;&#20204;&#26159;&#35841;&#12290;</p>
        <p>&#24863;&#35874;&#29238;&#27597;&#23545;&#25105;&#30340;&#20302;&#32423;&#26684;&#24335;&#21270;&#65292;&#21644;&#38590;&#20197;&#32622;&#20449;&#30340;&#35282;&#33394;&#20856;&#33539; &#65292;&#24863;&#35874;&#20799;&#23376;&#32473;&#25105;&#26426;&#20250;&#20256;&#25215;&#36825;&#20123;&#19996;&#35199;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.preface.acks.fitz"></a>&#26469;&#33258; Brian W. Fitzpatrick</h3></div></div></div>
        
        
        <p>&#38750;&#24120;&#38750;&#24120;&#24863;&#35874;&#25105;&#30340;&#22971;&#23376;Marie&#30340;&#29702;&#35299;&#65292;&#25903;&#25345;&#21644;&#26368;&#37325;&#35201;&#30340;&#32784;&#24515;&#12290;&#24863;&#35874;&#24341;&#23548;&#25105;&#23398;&#20250;UNIX&#32534;&#31243;&#30340;&#20804;&#24351;Eric&#65292;&#24863;&#35874;&#25105;&#30340;&#27597;&#20146;&#21644;&#31062;&#27597;&#30340;&#25903;&#25345;&#65292;&#23545;&#25105;&#22312;&#22307;&#35806;&#22812;&#37324;&#22475;&#22836;&#24037;&#20316;&#30340;&#29702;&#35299;&#12290;</p>
        <p>Mike&#21644;Ben&#65306;&#19982;&#20320;&#20204;&#19968;&#36215;&#24037;&#20316;&#38750;&#24120;&#24555;&#20048;&#65292;Heck&#65292;&#25105;&#20204;&#22312;&#19968;&#36215;&#24037;&#20316;&#24456;&#24841;&#24555;&#65281;</p>
        <p>&#24863;&#35874;&#25152;&#26377;&#22312;Subversion&#21644;Apache&#36719;&#20214;&#22522;&#37329;&#20250;&#30340;&#20154;&#20204;&#32473;&#25105;&#26426;&#20250;&#19982;&#20320;&#20204;&#22312;&#19968;&#36215;&#65292;&#27809;&#26377;&#19968;&#22825;&#25105;&#19981;&#20174;&#20320;&#20204;&#37027;&#37324;&#23398;&#21040;&#30693;&#35782;&#12290;</p>
        <p>&#26368;&#21518;&#65292;&#24863;&#35874;&#25105;&#30340;&#31062;&#29238;&#65292;&#20182;&#19968;&#30452;&#36319;&#25105;&#35828;&#8220;<span class="quote">&#33258;&#30001;&#31561;&#20110;&#36131;&#20219;</span>&#8221;&#65292;&#25105;&#28145;&#20449;&#19981;&#30097;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.preface.acks.cmpilato"></a>&#26469;&#33258; C. Michael Pilato</h3></div></div></div>
        
        <p>&#29305;&#21035;&#24863;&#35874;Amy&#65292;&#25105;&#26368;&#22909;&#30340;&#26379;&#21451;&#21644;9&#24180;&#37324;&#19981;&#21487;&#24605;&#35758;&#30340;&#22971;&#23376;&#65292;&#22240;&#20026;&#22905;&#30340;&#29233;&#21644;&#32784;&#24515;&#25903;&#25345;&#65292;&#22240;&#20026;&#22905;&#25552;&#20379;&#30340;&#28145;&#22812;&#24037;&#20316;&#65292;&#22240;&#20026;&#22905;&#23545;&#25105;&#24378;&#21152;&#32473;&#22905;&#30340;&#29256;&#26412;&#25511;&#21046;&#36807;&#31243;&#30340;&#20248;&#38597;&#24525;&#21463; &#12290;&#19981;&#35201;&#25285;&#24515;&#65292;&#29980;&#24515;&#8212;&#20320;&#20250;&#31435;&#21051;&#25104;&#20026;TortoiseSVN&#24043;&#24072;&#65281;</p>
        <p>Gavin&#65292;&#25110;&#35768;&#29616;&#22312;&#26412;&#20070;&#30340;&#24456;&#22810;&#35789;&#20320;&#36824;&#19981;&#33021;&#35835;&#20986;&#26469;&#65292;&#20294;&#26159;&#24403;&#20320;&#26368;&#32456;&#33021;&#22815;&#20070;&#20889;&#25105;&#20204;&#25152;&#35828;&#30340;&#30127;&#29378;&#35821;&#35328;&#26102;&#65292;&#24076;&#26395;&#20320;&#20250;&#20026;&#20320;&#30340;&#29238;&#20146;&#24863;&#21040;&#39556;&#20658;&#65292;&#23601;&#20687;&#20182;&#23545;&#20320;&#19968;&#26679;&#12290;</p>
        <p>Aidan, Daddy luffoo et ope Aiduh yike contootoo as much as Aiduh yike batetball, base-ball, et bootball. <sup>[<a name="d4e316" href="#ftn.d4e316" class="footnote">2</a>]</sup></p>
        <p>&#22920;&#22920;&#21644;&#29240;&#29240;&#65292;&#24863;&#35874;&#20320;&#20204;&#30340;&#25903;&#25345;&#21644;&#28909;&#24773;&#65292;&#23731;&#29238;&#23731;&#27597;&#65292;&#20197;&#21516;&#26679;&#30340;&#29702;&#30001;&#24863;&#35874;&#20320;&#20204;&#65292;&#36824;&#35201;&#24863;&#35874;&#20320;&#20204;&#38590;&#20197;&#32622;&#20449;&#30340;&#22899;&#20799;&#12290;</p>
        <p>&#21521;&#20320;&#20204;&#33268;&#25964;&#65292;Shep Kendall&#65292;&#20026;&#25105;&#25171;&#24320;&#20102;&#36890;&#21521;&#35745;&#31639;&#26426;&#19990;&#30028;&#30340;&#22823;&#38376;&#65307;Ben Collins Sussman&#65292;&#25105;&#22312;&#24320;&#28304;&#19990;&#30028;&#30340;&#23548;&#24072;&#65307;Karl Fogel&#8212;&#20320;<span class="emphasis"><em>&#26159;</em></span>&#25105;&#30340;<code class="filename">.emacs</code>&#65307;Greg Stain&#65292;&#35753;&#25105;&#22312;&#22256;&#22659;&#20013;&#30693;&#36947;&#24590;&#26679;&#32534;&#31243;&#65307;Brain Fitzpatrick&#8212;&#21516;&#25105;&#20998;&#20139;&#20182;&#30340;&#20889;&#20316;&#32463;&#39564;&#12290;&#25152;&#26377;&#25105;&#26366;&#32463;&#20174;&#20320;&#20204;&#37027;&#37324;&#33719;&#24471;&#30693;&#35782;&#30340;&#20154;&#8212;&#23613;&#31649;&#21448;&#19981;&#26029;&#24536;&#35760;&#12290;</p>
        <p>&#26368;&#21518;&#65292;&#23545;&#25152;&#26377;&#20026;&#25105;&#23637;&#29616;&#23436;&#32654;&#21331;&#36234;&#21019;&#36896;&#21147;&#30340;&#20154;&#20204;&#8212;&#24863;&#35874;&#12290;</p>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e285" href="#d4e285" class="para">1</a>] </sup>&#22114;&#65292;&#36824;&#35201;&#24863;&#35874;Karl&#20026;&#20102;&#26412;&#20070;&#25152;&#20184;&#20986;&#30340;&#36763;&#21220;&#24037;&#20316;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e316" href="#d4e316" class="para">2</a>] </sup>&#32763;&#35793;&#65306;&#29240;&#29240;&#24076;&#26395;&#20320;&#20250;&#20687;&#21916;&#27426;&#31726;&#29699;&#12289;&#26834;&#29699;&#21644;&#36275;&#29699;&#19968;&#26679;&#21916;&#27426;&#35745;&#31639;&#26426;&#12290;(&#19981;&#26159;&#24456;&#26126;&#26174;&#21527;&#65311;)</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.preface.free.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.preface.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.intro.whatis.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#26412;&#20070;&#26159;&#20813;&#36153;&#30340;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;Subversion&#26159;&#20160;&#20040;&#65311;</td></tr></table></div></body></html>