<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#22312;&#20998;&#25903;&#38388;&#22797;&#21046;&#20462;&#25913;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="svn.branchmerge.using.html" title="&#20351;&#29992;&#20998;&#25903;"><link rel="next" href="svn.branchmerge.commonuses.html" title="&#24120;&#35265;&#29992;&#20363;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#22312;&#20998;&#25903;&#38388;&#22797;&#21046;&#20462;&#25913;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.using.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.commonuses.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.branchmerge.copychanges"></a>&#22312;&#20998;&#25903;&#38388;&#22797;&#21046;&#20462;&#25913;</h2></div></div></div>
      
      <p>&#29616;&#22312;&#20320;&#19982;Sally&#22312;&#21516;&#19968;&#20010;&#39033;&#30446;&#30340;&#24182;&#34892;&#20998;&#25903;&#19978;&#24037;&#20316;&#65306;&#20320;&#22312;&#31169;&#26377;&#20998;&#25903;&#19978;&#65292;&#32780;Sally&#22312;&#20027;&#24178;(<em class="firstterm">trunk</em>)&#25110;&#32773;&#21483;&#20570;&#24320;&#21457;&#20027;&#32447;&#19978;&#12290;</p>
      <p>&#30001;&#20110;&#26377;&#20247;&#22810;&#30340;&#20154;&#21442;&#19982;&#39033;&#30446;&#65292;&#22823;&#22810;&#25968;&#20154;&#25317;&#26377;&#20027;&#24178;&#25335;&#36125;&#26159;&#24456;&#27491;&#24120;&#30340;&#65292;&#20219;&#20309;&#20154;&#22914;&#26524;&#36827;&#34892;&#19968;&#20010;&#38271;&#21608;&#26399;&#30340;&#20462;&#25913;&#20250;&#20351;&#24471;&#20027;&#24178;&#38519;&#20837;&#28151;&#20081;&#65292;&#25152;&#20197;&#36890;&#24120;&#30340;&#20570;&#27861;&#26159;&#24314;&#31435;&#19968;&#20010;&#31169;&#26377;&#20998;&#25903;&#65292;&#25552;&#20132;&#20462;&#25913;&#21040;&#33258;&#24049;&#30340;&#20998;&#25903;&#65292;&#30452;&#21040;&#36825;&#38454;&#27573;&#24037;&#20316;&#32467;&#26463;&#12290;</p>
      <p>&#25152;&#20197;&#65292;&#22909;&#28040;&#24687;&#23601;&#26159;&#20320;&#21644;Sally&#19981;&#20250;&#20114;&#30456;&#25171;&#25200;&#65292;&#22351;&#28040;&#24687;&#26159;&#26377;&#26102;&#20505;&#20998;&#31163;&#20250;<span class="emphasis"><em>&#22826;</em></span>&#36828;&#12290;&#35760;&#20303;&#8220;<span class="quote">&#38381;&#38376;&#36896;&#36710;</span>&#8221;&#31574;&#30053;&#30340;&#38382;&#39064;&#65292;&#24403;&#20320;&#23436;&#25104;&#20320;&#30340;&#20998;&#25903;&#21518;&#65292;&#21487;&#33021;&#22240;&#20026;&#22826;&#22810;&#20914;&#31361;&#65292;&#24050;&#32463;&#26080;&#27861;&#36731;&#26131;&#21512;&#24182;&#20320;&#30340;&#20998;&#25903;&#21644;&#20027;&#24178;&#30340;&#20462;&#25913;&#12290;</p>
      <p>&#30456;&#21453;&#65292;&#22312;&#20320;&#24037;&#20316;&#30340;&#26102;&#20505;&#20320;&#21644;Sally&#20173;&#28982;&#21487;&#20197;&#32487;&#32493;&#20998;&#20139;&#20462;&#25913;&#65292;&#36825;&#20381;&#36182;&#20110;&#20320;&#20915;&#23450;&#20160;&#20040;&#20540;&#24471;&#20998;&#20139;&#65292;Subversion&#32473;&#20320;&#22312;&#20998;&#25903;&#38388;&#36873;&#25321;&#24615;&#8220;<span class="quote">&#25335;&#36125;</span>&#8221;&#20462;&#25913;&#30340;&#33021;&#21147;&#65292;&#24403;&#20320;&#23436;&#25104;&#20102;&#20998;&#25903;&#19978;&#30340;&#25152;&#26377;&#24037;&#20316;&#65292;&#25152;&#26377;&#30340;&#20998;&#25903;&#20462;&#25913;&#21487;&#20197;&#34987;&#25335;&#36125;&#22238;&#21040;&#20027;&#24178;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.copychanges.specific"></a>&#22797;&#21046;&#29305;&#23450;&#30340;&#20462;&#25913;</h3></div></div></div>
        
        <p>&#22312;&#19978;&#19968;&#31456;&#33410;&#65292;&#25105;&#20204;&#25552;&#21040;&#20320;&#21644;Sally&#23545;<code class="filename">integer.c</code>&#22312;&#19981;&#21516;&#30340;&#20998;&#25903;&#19978;&#20570;&#36807;&#20462;&#25913;&#65292;&#22914;&#26524;&#20320;&#30475;&#20102;Sally&#30340;344&#29256;&#26412;&#30340;&#26085;&#24535;&#20449;&#24687;&#65292;&#20320;&#20250;&#30693;&#36947;&#22905;&#20462;&#27491;&#20102;&#19968;&#20123;&#25340;&#20889;&#38169;&#35823;&#65292;&#27595;&#24248;&#32622;&#30097;&#65292;&#20320;&#30340;&#25335;&#36125;&#30340;&#25991;&#20214;&#20063;&#19968;&#23450;&#23384;&#22312;&#36825;&#20123;&#25340;&#20889;&#38169;&#35823;&#65292;&#25152;&#20197;&#20320;&#20197;&#21518;&#30340;&#23545;&#36825;&#20010;&#25991;&#20214;&#20462;&#25913;&#20063;&#20250;&#20445;&#30041;&#36825;&#20123;&#25340;&#20889;&#38169;&#35823;&#65292;&#25152;&#20197;&#20320;&#20250;&#22312;&#23558;&#26469;&#21512;&#24182;&#26102;&#24471;&#21040;&#35768;&#22810;&#20914;&#31361;&#12290;&#26368;&#22909;&#26159;&#29616;&#22312;&#25509;&#25910;Sally&#30340;&#20462;&#25913;&#65292;&#32780;&#19981;&#26159;&#20316;&#20102;&#35768;&#22810;&#24037;&#20316;&#20043;&#21518;&#25165;&#26469;&#20570;&#12290;</p>
        <p>&#26159;&#26102;&#38388;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#21629;&#20196;&#65292;&#36825;&#20010;&#21629;&#20196;&#30340;&#32467;&#26524;&#38750;&#24120;&#31867;&#20284;<span class="command"><strong>svn diff</strong></span>&#21629;&#20196;(&#22312;<a class="xref" href="svn.tour.html" title="&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#22522;&#26412;&#20351;&#29992;">&#31532;&nbsp;2&nbsp;&#31456; <i>&#22522;&#26412;&#20351;&#29992;</i></a>&#30340;&#20869;&#23481;)&#65292;&#20004;&#20010;&#21629;&#20196;&#37117;&#21487;&#20197;&#27604;&#36739;&#29256;&#26412;&#24211;&#20013;&#30340;&#20219;&#20309;&#20004;&#20010;&#23545;&#35937;&#24182;&#19988;&#25551;&#36848;&#20854;&#21306;&#21035;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn diff</strong></span>&#26469;&#26597;&#30475;Sally&#22312;&#29256;&#26412;344&#20316;&#30340;&#20462;&#25913;&#65306;</p>
        <pre class="screen">
$ svn diff -c 344 http://svn.example.com/repos/calc/trunk

Index: integer.c
===================================================================
--- integer.c	(revision 343)
+++ integer.c	(revision 344)
@@ -147,7 +147,7 @@
     case 6:  sprintf(info-&gt;operating_system, "HPFS (OS/2 or NT)"); break;
     case 7:  sprintf(info-&gt;operating_system, "Macintosh"); break;
     case 8:  sprintf(info-&gt;operating_system, "Z-System"); break;
-    case 9:  sprintf(info-&gt;operating_system, "CPM"); break;
+    case 9:  sprintf(info-&gt;operating_system, "CP/M"); break;
     case 10:  sprintf(info-&gt;operating_system, "TOPS-20"); break;
     case 11:  sprintf(info-&gt;operating_system, "NTFS (Windows NT)"); break;
     case 12:  sprintf(info-&gt;operating_system, "QDOS"); break;
@@ -164,7 +164,7 @@
     low = (unsigned short) read_byte(gzfile);  /* read LSB */
     high = (unsigned short) read_byte(gzfile); /* read MSB */
     high = high &lt;&lt; 8;  /* interpret MSB correctly */
-    total = low + high; /* add them togethe for correct total */
+    total = low + high; /* add them together for correct total */

     info-&gt;extra_header = (unsigned char *) my_malloc(total);
     fread(info-&gt;extra_header, total, 1, gzfile);
@@ -241,7 +241,7 @@
      Store the offset with ftell() ! */

   if ((info-&gt;data_offset = ftell(gzfile))== -1) {
-    printf("error: ftell() retturned -1.\n");
+    printf("error: ftell() returned -1.\n");
     exit(1);
   }

@@ -249,7 +249,7 @@
   printf("I believe start of compressed data is %u\n", info-&gt;data_offset);
   #endif

-  /* Set postion eight bytes from the end of the file. */
+  /* Set position eight bytes from the end of the file. */

   if (fseek(gzfile, -8, SEEK_END)) {
     printf("error: fseek() returned non-zero\n");
</pre>
        <p><span class="command"><strong>svn merge</strong></span>&#21629;&#20196;&#20960;&#20046;&#23436;&#20840;&#30456;&#21516;&#65292;&#20294;&#19981;&#26159;&#25171;&#21360;&#21306;&#21035;&#21040;&#20320;&#30340;&#32456;&#31471;&#65292;&#23427;&#20250;&#30452;&#25509;&#20316;&#20026;<span class="emphasis"><em>&#26412;&#22320;&#20462;&#25913;</em></span>&#20316;&#29992;&#21040;&#20320;&#30340;&#26412;&#22320;&#25335;&#36125;&#65306;</p>
        <pre class="screen">
$ svn merge -c 344 http://svn.example.com/repos/calc/trunk
U  integer.c

$ svn status
M  integer.c
</pre>
        <p><span class="command"><strong>svn merge</strong></span>&#30340;&#36755;&#20986;&#21578;&#35785;&#20320;&#30340;<code class="filename">integer.c</code>&#25991;&#20214;&#24050;&#32463;&#20316;&#20102;&#34917;&#19969;(patched)&#65292;&#29616;&#22312;&#24050;&#32463;&#20445;&#30041;&#20102;Sally&#20462;&#25913;&#8212;&#20462;&#25913;&#20174;&#20027;&#24178;&#8220;<span class="quote">&#25335;&#36125;</span>&#8221;&#21040;&#20320;&#30340;&#31169;&#26377;&#20998;&#25903;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#29616;&#22312;&#20316;&#20026;&#19968;&#20010;&#26412;&#22320;&#20462;&#25913;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#35201;&#38752;&#20320;&#23457;&#26597;&#26412;&#22320;&#30340;&#20462;&#25913;&#26469;&#30830;&#23450;&#23427;&#20204;&#24037;&#20316;&#27491;&#24120;&#12290;</p>
        <p>&#22312;&#21478;&#19968;&#31181;&#24773;&#22659;&#19979;&#65292;&#20107;&#24773;&#24182;&#19981;&#20250;&#36816;&#34892;&#24471;&#36825;&#26679;&#27491;&#24120;&#65292;&#20063;&#35768;<code class="filename">integer.c</code>&#20063;&#35768;&#20250;&#36827;&#20837;&#20914;&#31361;&#29366;&#24577;&#65292;&#20320;&#24517;&#39035;&#20351;&#29992;&#26631;&#20934;&#36807;&#31243;(&#35265;<a class="xref" href="svn.tour.html" title="&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#22522;&#26412;&#20351;&#29992;">&#31532;&nbsp;2&nbsp;&#31456; <i>&#22522;&#26412;&#20351;&#29992;</i></a>)&#26469;&#35299;&#20915;&#36825;&#31181;&#29366;&#24577;&#65292;&#25110;&#32773;&#20320;&#35748;&#20026;&#21512;&#24182;&#26159;&#19968;&#20010;&#38169;&#35823;&#30340;&#20915;&#23450;&#65292;&#20320;&#21482;&#38656;&#35201;&#36816;&#34892;<span class="command"><strong>svn revert</strong></span>&#25918;&#24323;&#26412;&#22320;&#20462;&#25913;&#12290;</p>
        <p>&#20294;&#26159;&#24403;&#20320;&#23457;&#26597;&#36807;&#20320;&#30340;&#21512;&#24182;&#32467;&#26524;&#21518;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn commit</strong></span>&#25552;&#20132;&#20462;&#25913;&#65292;&#22312;&#37027;&#19968;&#21051;&#65292;&#20462;&#25913;&#24050;&#32463;&#21512;&#24182;&#21040;&#20320;&#30340;&#20998;&#25903;&#19978;&#20102;&#65292;&#22312;&#29256;&#26412;&#25511;&#21046;&#26415;&#35821;&#20013;&#65292;&#36825;&#31181;&#22312;&#20998;&#25903;&#20043;&#38388;&#25335;&#36125;&#20462;&#25913;&#30340;&#34892;&#20026;&#21483;&#20570;<em class="firstterm">&#25644;&#36816;</em>&#20462;&#25913;&#12290;</p>
        <p>&#24403;&#20320;&#25552;&#20132;&#20320;&#30340;&#20462;&#25913;&#26102;&#65292;&#30830;&#23450;&#20320;&#30340;&#26085;&#24535;&#20449;&#24687;&#20013;&#35828;&#26126;&#20320;&#26159;&#20174;&#26576;&#19968;&#29256;&#26412;&#25644;&#36816;&#20102;&#20462;&#25913;&#65292;&#20030;&#20010;&#20363;&#23376;&#65306;</p>
        <pre class="screen">
$ svn commit -m "integer.c: ported r344 (spelling fixes) from trunk."
Sending        integer.c
Transmitting file data .
Committed revision 360.
</pre>
        <p>&#20320;&#23558;&#20250;&#22312;&#19979;&#19968;&#33410;&#30475;&#21040;&#65292;&#36825;&#26159;&#19968;&#26465;&#38750;&#24120;&#37325;&#35201;&#30340;&#8220;<span class="quote">&#26368;&#20339;&#23454;&#36341;</span>&#8221;&#12290;</p>
        <div class="sidebar"><p class="title"><b>&#20026;&#20160;&#20040;&#19981;&#20351;&#29992;&#34917;&#19969;&#65311;</b></p>
          
          <p>&#20063;&#35768;&#20320;&#30340;&#33041;&#20013;&#20250;&#20986;&#29616;&#19968;&#20010;&#38382;&#39064;&#65292;&#29305;&#21035;&#22914;&#26524;&#20320;&#26159;Unix&#29992;&#25143;&#65292;&#20026;&#20160;&#20040;&#38750;&#35201;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#65311;&#20026;&#20160;&#20040;&#19981;&#31616;&#21333;&#30340;&#20351;&#29992;&#25805;&#20316;&#31995;&#32479;&#30340;<span class="command"><strong>patch</strong></span>&#21629;&#20196;&#26469;&#36827;&#34892;&#30456;&#21516;&#30340;&#24037;&#20316;&#65311;&#20363;&#22914;&#65306;</p>
          <pre class="screen">
$ svn diff -c 344 http://svn.example.com/repos/calc/trunk &gt; patchfile
$ patch -p0  &lt; patchfile
Patching file integer.c using Plan A...
Hunk #1 succeeded at 147.
Hunk #2 succeeded at 164.
Hunk #3 succeeded at 241.
Hunk #4 succeeded at 249.
done
</pre>
          <p>&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#30830;&#23454;&#27809;&#26377;&#21306;&#21035;&#65292;&#20294;&#26159;<span class="command"><strong>svn merge</strong></span>&#26377;&#36229;&#36234;<span class="command"><strong>patch</strong></span>&#30340;&#29305;&#21035;&#33021;&#21147;&#65292;&#20351;&#29992;<span class="command"><strong>patch</strong></span>&#23545;&#25991;&#20214;&#26684;&#24335;&#26377;&#19968;&#23450;&#30340;&#38480;&#21046;&#65292;&#23427;&#21482;&#33021;&#38024;&#23545;&#25991;&#20214;&#20869;&#23481;&#65292;&#27809;&#26377;&#26041;&#27861;&#34920;&#29616;<span class="emphasis"><em>&#30446;&#24405;&#26641;</em></span>&#30340;&#20462;&#25913;&#65292;&#20363;&#22914;&#28155;&#21152;&#12289;&#21024;&#38500;&#25110;&#26159;&#25913;&#21517;&#12290;&#22914;&#26524;Sally&#30340;&#20462;&#25913;&#21253;&#25324;&#22686;&#21152;&#19968;&#20010;&#26032;&#30340;&#30446;&#24405;&#65292;<span class="command"><strong>svn diff</strong></span>&#19981;&#20250;&#27880;&#24847;&#21040;&#36825;&#20123;&#65292;<span class="command"><strong>svn diff</strong></span>&#21482;&#20250;&#36755;&#20986;&#26377;&#38480;&#30340;&#34917;&#19969;&#26684;&#24335;&#65292;&#25152;&#20197;&#26377;&#20123;&#38382;&#39064;&#26080;&#27861;&#34920;&#36798;&#12290; &#20294;&#26159;<span class="command"><strong>svn merge</strong></span>&#21629;&#20196;&#20250;&#36890;&#36807;&#30452;&#25509;&#20316;&#29992;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#26469;&#34920;&#31034;&#30446;&#24405;&#26641;&#30340;&#32467;&#26500;&#21644;&#23646;&#24615;&#21464;&#21270;&#12290;</p>
        </div>
        <p>&#19968;&#20010;&#35686;&#21578;&#65306;&#20026;&#20160;&#20040;<span class="command"><strong>svn diff</strong></span>&#21644;<span class="command"><strong>svn merge</strong></span>&#22312;&#27010;&#24565;&#19978;&#26159;&#24456;&#25509;&#36817;&#65292;&#20294;&#35821;&#27861;&#19978;&#26377;&#35768;&#22810;&#19981;&#21516;&#65292;&#19968;&#23450;&#38405;&#35835;<a class="xref" href="svn.ref.html" title="&#31532;&nbsp;9&nbsp;&#31456;&nbsp;Subversion &#23436;&#20840;&#21442;&#32771;">&#31532;&nbsp;9&nbsp;&#31456; <i>Subversion &#23436;&#20840;&#21442;&#32771;</i></a>&#26469;&#26597;&#30475;&#20854;&#32454;&#33410;&#25110;&#32773;&#20351;&#29992;<span class="command"><strong>svn help</strong></span>&#26597;&#30475;&#24110;&#21161;&#12290;&#20030;&#20010;&#20363;&#23376;&#65292;<span class="command"><strong>svn merge</strong></span>&#38656;&#35201;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#20316;&#20026;&#30446;&#26631;&#65292;&#23601;&#26159;&#19968;&#20010;&#22320;&#26041;&#26469;&#26045;&#23637;&#30446;&#24405;&#26641;&#20462;&#25913;&#65292;&#22914;&#26524;&#19968;&#20010;&#30446;&#26631;&#37117;&#27809;&#26377;&#25351;&#23450;&#65292;&#23427;&#20250;&#20551;&#23450;&#20320;&#35201;&#20570;&#20197;&#19979;&#26576;&#20010;&#26222;&#36890;&#30340;&#25805;&#20316;&#65306;</p>
        <div class="orderedlist"><ol type="1"><li>
            <p>&#20320;&#24076;&#26395;&#21512;&#24182;&#30446;&#24405;&#20462;&#25913;&#21040;&#24037;&#20316;&#25335;&#36125;&#30340;&#24403;&#21069;&#30446;&#24405;&#12290;</p>
          </li><li>
            <p>&#20320;&#24076;&#26395;&#21512;&#24182;&#20462;&#25913;&#21040;&#20320;&#30340;&#24403;&#21069;&#24037;&#20316;&#30446;&#24405;&#30340;&#30456;&#21516;&#25991;&#20214;&#21517;&#30340;&#25991;&#20214;&#12290;</p>
          </li></ol></div>
        <p>&#22914;&#26524;&#20320;&#21512;&#24182;&#19968;&#20010;&#30446;&#24405;&#32780;&#27809;&#26377;&#25351;&#23450;&#29305;&#23450;&#30340;&#30446;&#26631;&#65292;<span class="command"><strong>svn merge</strong></span>&#20551;&#23450;&#31532;&#19968;&#31181;&#24773;&#20917;&#65292;&#22312;&#20320;&#30340;&#24403;&#21069;&#30446;&#24405;&#24212;&#29992;&#20462;&#25913;&#12290;&#22914;&#26524;&#20320;&#21512;&#24182;&#19968;&#20010;&#25991;&#20214;&#65292;&#32780;&#36825;&#20010;&#25991;&#20214;(&#25110;&#26159;&#19968;&#20010;&#26377;&#30456;&#21516;&#30340;&#21517;&#23383;&#25991;&#20214;)&#22312;&#20320;&#30340;&#24403;&#21069;&#24037;&#20316;&#30446;&#24405;&#23384;&#22312;&#65292;<span class="command"><strong>svn merge</strong></span>&#20551;&#23450;&#31532;&#20108;&#31181;&#24773;&#20917;&#65292;&#20320;&#24819;&#23545;&#36825;&#20010;&#21516;&#21517;&#25991;&#20214;&#20351;&#29992;&#21512;&#24182;&#12290;</p>
        <p>&#22914;&#26524;&#20320;&#24076;&#26395;&#20462;&#25913;&#24212;&#29992;&#21040;&#21035;&#30340;&#30446;&#24405;&#65292;&#20320;&#38656;&#35201;&#35828;&#20986;&#26469;&#12290;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#22312;&#24037;&#20316;&#25335;&#36125;&#30340;&#29238;&#30446;&#24405;&#65292;&#20320;&#38656;&#35201;&#25351;&#23450;&#30446;&#26631;&#30446;&#24405;&#65306;</p>
        <pre class="screen">
$ svn merge -c 344 http://svn.example.com/repos/calc/trunk my-calc-branch
U   my-calc-branch/integer.c
</pre>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.copychanges.keyconcept"></a>&#21512;&#24182;&#32972;&#21518;&#30340;&#20851;&#38190;&#27010;&#24565;</h3></div></div></div>
        
        <p>&#20320;&#24050;&#32463;&#30475;&#21040;&#20102;<span class="command"><strong>svn merge</strong></span>&#21629;&#20196;&#30340;&#20363;&#23376;&#65292;&#20320;&#23558;&#20250;&#30475;&#21040;&#26356;&#22810;&#65292;&#22914;&#26524;&#20320;&#23545;&#21512;&#24182;&#26159;&#22914;&#20309;&#24037;&#20316;&#30340;&#24863;&#21040;&#36855;&#24785;&#65292;&#36825;&#24182;&#19981;&#22855;&#24618;&#65292;&#24456;&#22810;&#20154;&#21644;&#20320;&#19968;&#26679;&#12290;&#35768;&#22810;&#26032;&#29992;&#25143;(&#29305;&#21035;&#26159;&#23545;&#29256;&#26412;&#25511;&#21046;&#24456;&#38476;&#29983;&#30340;&#29992;&#25143;)&#20250;&#23545;&#36825;&#20010;&#21629;&#20196;&#30340;&#27491;&#30830;&#35821;&#27861;&#24863;&#21040;&#19981;&#30693;&#25152;&#25514;&#65292;&#19981;&#30693;&#36947;&#24590;&#26679;&#21644;&#20160;&#20040;&#26102;&#20505;&#20351;&#29992;&#36825;&#20010;&#29305;&#24615;&#65292;&#19981;&#35201;&#23475;&#24597;&#65292;&#36825;&#20010;&#21629;&#20196;&#23454;&#38469;&#19978;&#27604;&#20320;&#24819;&#35937;&#30340;&#31616;&#21333;&#65281;&#26377;&#19968;&#20010;&#31616;&#21333;&#30340;&#25216;&#24039;&#26469;&#24110;&#21161;&#20320;&#29702;&#35299;<span class="command"><strong>svn merge</strong></span>&#30340;&#34892;&#20026;&#12290;</p>
        <p>&#36855;&#24785;&#30340;&#20027;&#35201;&#21407;&#22240;&#26159;&#36825;&#20010;&#21629;&#20196;&#30340;<span class="emphasis"><em>&#21517;&#31216;</em></span>&#65292;&#26415;&#35821;&#8220;<span class="quote">&#21512;&#24182;</span>&#8221;&#19981;&#30693;&#20160;&#20040;&#21407;&#22240;&#34987;&#29992;&#26469;&#34920;&#26126;&#20998;&#25903;&#30340;&#32452;&#21512;&#65292;&#25110;&#32773;&#26159;&#20854;&#20182;&#20160;&#20040;&#31070;&#22855;&#30340;&#25968;&#25454;&#28151;&#21512;&#65292;&#36825;&#19981;&#26159;&#20107;&#23454;&#65292;&#19968;&#20010;&#26356;&#22909;&#30340;&#21517;&#31216;&#24212;&#35813;&#26159;<span class="command"><strong>svn diff-and-apply</strong></span>&#65292;&#36825;&#26159;&#21457;&#29983;&#30340;&#25152;&#26377;&#20107;&#20214;&#65306;&#39318;&#20808;&#20004;&#20010;&#29256;&#26412;&#24211;&#26641;&#27604;&#36739;&#65292;&#28982;&#21518;&#23558;&#21306;&#21035;&#24212;&#29992;&#21040;&#26412;&#22320;&#25335;&#36125;&#12290;</p>
        <p>&#36825;&#20010;&#21629;&#20196;&#21253;&#25324;&#19977;&#20010;&#21442;&#25968;&#65306;</p>
        <div class="orderedlist"><ol type="1"><li>
            <p>&#21021;&#22987;&#30340;&#29256;&#26412;&#26641;(&#36890;&#24120;&#21483;&#20570;&#27604;&#36739;&#30340;<em class="firstterm">&#24038;&#36793;</em>)&#65292;</p>
          </li><li>
            <p>&#26368;&#32456;&#30340;&#29256;&#26412;&#26641;(&#36890;&#24120;&#21483;&#20570;&#27604;&#36739;&#30340;<em class="firstterm">&#21491;&#36793;</em>)&#65292;</p>
          </li><li>
            <p>&#19968;&#20010;&#25509;&#25910;&#21306;&#21035;&#30340;&#24037;&#20316;&#25335;&#36125;(&#36890;&#24120;&#21483;&#20570;&#21512;&#24182;&#30340;<em class="firstterm">&#30446;&#26631;</em>)&#12290;</p>
          </li></ol></div>
        <p>&#19968;&#26086;&#36825;&#19977;&#20010;&#21442;&#25968;&#25351;&#23450;&#20197;&#21518;&#65292;&#20004;&#20010;&#30446;&#24405;&#26641;&#23558;&#35201;&#20570;&#27604;&#36739;&#65292;&#27604;&#36739;&#32467;&#26524;&#23558;&#20250;&#20316;&#20026;&#26412;&#22320;&#20462;&#25913;&#24212;&#29992;&#21040;&#30446;&#26631;&#24037;&#20316;&#25335;&#36125;&#65292;&#24403;&#21629;&#20196;&#32467;&#26463;&#21518;&#65292;&#32467;&#26524;&#21516;&#20320;&#25163;&#24037;&#20462;&#25913;&#25110;&#32773;&#26159;&#20351;&#29992;<span class="command"><strong>svn add</strong></span>&#25110;<span class="command"><strong>svn delete</strong></span>&#27809;&#26377;&#20160;&#20040;&#21306;&#21035;&#65292;&#22914;&#26524;&#20320;&#21916;&#27426;&#36825;&#32467;&#26524;&#65292;&#20320;&#21487;&#20197;&#25552;&#20132;&#65292;&#22914;&#26524;&#19981;&#21916;&#27426;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn revert</strong></span>&#24674;&#22797;&#20462;&#25913;&#12290;</p>
        <p><span class="command"><strong>svn merge</strong></span>&#30340;&#35821;&#27861;&#20801;&#35768;&#38750;&#24120;&#28789;&#27963;&#30340;&#25351;&#23450;&#19977;&#20010;&#24517;&#35201;&#30340;&#21442;&#25968;&#65292;&#22914;&#19979;&#26159;&#19968;&#20123;&#20363;&#23376;&#65306;</p>
        <pre class="screen">
$ svn merge http://svn.example.com/repos/branch1@150 \
            http://svn.example.com/repos/branch2@212 \
            my-working-copy

$ svn merge -r 100:200 http://svn.example.com/repos/trunk my-working-copy

$ svn merge -r 100:200 http://svn.example.com/repos/trunk
</pre>
        <p>&#31532;&#19968;&#31181;&#35821;&#27861;&#20351;&#29992;<span class="emphasis"><em>URL@REV</em></span>&#30340;&#24418;&#24335;&#30452;&#25509;&#21015;&#20986;&#20102;&#25152;&#26377;&#21442;&#25968;&#65292;&#31532;&#20108;&#31181;&#35821;&#27861;&#21487;&#20197;&#29992;&#26469;&#20316;&#20026;&#27604;&#36739;&#21516;&#19968;&#20010;URL&#30340;&#19981;&#21516;&#29256;&#26412;&#30340;&#31616;&#30053;&#20889;&#27861;&#65292;&#26368;&#21518;&#19968;&#31181;&#35821;&#27861;&#34920;&#31034;&#24037;&#20316;&#25335;&#36125;&#26159;&#21487;&#36873;&#30340;&#65292;&#22914;&#26524;&#30465;&#30053;&#65292;&#40664;&#35748;&#26159;&#24403;&#21069;&#30446;&#24405;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.copychanges.bestprac"></a>&#21512;&#24182;&#30340;&#26368;&#20339;&#23454;&#36341;</h3></div></div></div>
        
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.branchmerge.copychanges.bestprac.track"></a>&#25163;&#24037;&#36319;&#36394;&#21512;&#24182;</h4></div></div></div>
          
          <p>&#21512;&#24182;&#20462;&#25913;&#21548;&#36215;&#26469;&#24456;&#31616;&#21333;&#65292;&#20294;&#26159;&#23454;&#36341;&#36215;&#26469;&#20250;&#26159;&#24456;&#22836;&#30171;&#30340;&#20107;&#65292;&#22914;&#26524;&#20320;&#37325;&#22797;&#21512;&#24182;&#20004;&#20010;&#20998;&#25903;&#65292;&#20320;&#20063;&#35768;&#20250;&#21512;&#24182;<span class="emphasis"><em>&#20004;&#27425;</em></span>&#21516;&#26679;&#30340;&#20462;&#25913;&#12290;&#24403;&#36825;&#31181;&#20107;&#24773;&#21457;&#29983;&#26102;&#65292;&#26377;&#26102;&#20505;&#20107;&#24773;&#20250;&#20381;&#28982;&#27491;&#24120;&#65292;&#24403;&#23545;&#25991;&#20214;&#25171;&#34917;&#19969;&#26102;&#65292;Subversion&#22914;&#26524;&#27880;&#24847;&#21040;&#36825;&#20010;&#25991;&#20214;&#24050;&#32463;&#26377;&#20102;&#30456;&#24212;&#30340;&#20462;&#25913;&#65292;&#32780;&#19981;&#20250;&#20316;&#20219;&#20309;&#25805;&#20316;&#65292;&#20294;&#26159;&#22914;&#26524;&#24050;&#32463;&#24212;&#29992;&#30340;&#20462;&#25913;&#21448;&#34987;&#20462;&#25913;&#20102;&#65292;&#20320;&#20250;&#24471;&#21040;&#20914;&#31361;&#12290;</p>
          <p>&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#20320;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#24212;&#35813;&#20250;&#38459;&#27490;&#23545;&#19968;&#20010;&#20998;&#25903;&#20570;&#20004;&#27425;&#25913;&#21464;&#25805;&#20316;&#65292;&#24517;&#39035;&#33258;&#21160;&#30340;&#35760;&#20303;&#37027;&#19968;&#20010;&#20998;&#25903;&#30340;&#20462;&#25913;&#24050;&#32463;&#25509;&#25910;&#20102;&#65292;&#24182;&#19988;&#21487;&#20197;&#26174;&#31034;&#20986;&#26469;&#65292;&#29992;&#26469;&#23613;&#21487;&#33021;&#24110;&#21161;&#33258;&#21160;&#21270;&#30340;&#21512;&#24182;&#12290;</p>
          <p>&#19981;&#24184;&#30340;&#26159;&#65292;Subversion&#19981;&#26159;&#36825;&#26679;&#19968;&#20010;&#31995;&#32479;&#65292;&#31867;&#20284;&#20110;CVS&#65292;Subversion&#24182;&#19981;&#35760;&#24405;&#20219;&#20309;&#21512;&#24182;&#25805;&#20316;&#65292;<sup>[<a name="d4e2908" href="#ftn.d4e2908" class="footnote">21</a>]</sup>&#24403;&#20320;&#25552;&#20132;&#26412;&#22320;&#20462;&#25913;&#65292;&#29256;&#26412;&#24211;&#24182;&#19981;&#33021;&#21028;&#26029;&#20986;&#20320;&#26159;&#36890;&#36807;<span class="command"><strong>svn merge</strong></span>&#36824;&#26159;&#25163;&#24037;&#20462;&#25913;&#24471;&#21040;&#36825;&#20123;&#25991;&#20214;&#12290;</p>
          <p>&#36825;&#23545;&#20320;&#36825;&#26679;&#30340;&#29992;&#25143;&#24847;&#21619;&#30528;&#20160;&#20040;&#65311;&#36825;&#24847;&#21619;&#30528;&#38500;&#38750;Subversion&#20197;&#21518;&#21457;&#23637;&#36825;&#20010;&#29305;&#24615;&#65292;&#20320;&#24517;&#39035;&#25163;&#24037;&#30340;&#35760;&#24405;&#36825;&#20123;&#20449;&#24687;&#12290;&#26368;&#20339;&#30340;&#26041;&#24335;&#26159;&#20351;&#29992;&#25552;&#20132;&#26085;&#24535;&#20449;&#24687;&#65292;&#20687;&#21069;&#38754;&#30340;&#20363;&#23376;&#25552;&#21040;&#30340;&#65292;&#25512;&#33616;&#20320;&#22312;&#26085;&#24535;&#20449;&#24687;&#20013;&#35828;&#26126;&#21512;&#24182;&#30340;&#29305;&#23450;&#29256;&#26412;&#21495;(&#25110;&#26159;&#29256;&#26412;&#21495;&#30340;&#33539;&#22260;)&#65292;&#20043;&#21518;&#65292;&#20320;&#21487;&#20197;&#36816;&#34892;<span class="command"><strong>svn log</strong></span>&#26469;&#26597;&#30475;&#20320;&#30340;&#20998;&#25903;&#21253;&#21547;&#21738;&#20123;&#20462;&#25913;&#12290;&#36825;&#21487;&#20197;&#24110;&#21161;&#20320;&#23567;&#24515;&#30340;&#20381;&#24207;&#36816;&#34892;<span class="command"><strong>svn merge</strong></span>&#21629;&#20196;&#32780;&#19981;&#20250;&#36827;&#34892;&#22810;&#20313;&#30340;&#21512;&#24182;&#12290;</p>
          <p>&#22312;&#19979;&#19968;&#23567;&#33410;&#65292;&#25105;&#20204;&#35201;&#23637;&#31034;&#19968;&#20123;&#36825;&#31181;&#25216;&#24039;&#30340;&#20363;&#23376;&#12290;</p>
        </div>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.branchmerge.copychanges.bestprac.preview"></a>&#39044;&#35272;&#21512;&#24182;</h4></div></div></div>
          
          <p>&#39318;&#20808;&#65292;&#19968;&#23450;&#35201;&#35760;&#20303;&#21512;&#24182;&#30340;&#24037;&#20316;&#25335;&#36125;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#26412;&#22320;&#26356;&#25913;&#65292;&#24182;&#19988;&#26368;&#36817;&#24050;&#26356;&#26032;&#36807;&#12290;&#22914;&#26524;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#29992;&#36825;&#26679;&#30340;&#26041;&#27861;&#8220;<span class="quote">&#28165;&#29702;</span>&#8221;&#65292;&#20320;&#20250;&#21457;&#29616;&#19968;&#20123;&#22836;&#30171;&#30340;&#20107;&#24773;&#12290;</p>
          <p>&#22240;&#20026;&#21512;&#24182;&#21482;&#26159;&#23548;&#33268;&#26412;&#22320;&#20462;&#25913;&#65292;&#23427;&#19981;&#26159;&#19968;&#20010;&#39640;&#39118;&#38505;&#30340;&#25805;&#20316;&#65292;&#22914;&#26524;&#20320;&#22312;&#31532;&#19968;&#27425;&#25805;&#20316;&#38169;&#35823;&#65292;&#20320;&#21487;&#20197;&#36816;&#34892;<span class="command"><strong>svn revert</strong></span>&#26469;&#20877;&#35797;&#19968;&#27425;&#12290;</p>
          <p>&#26377;&#26102;&#20505;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#24456;&#21487;&#33021;&#24050;&#32463;&#25913;&#21464;&#20102;&#65292;&#21512;&#24182;&#20250;&#38024;&#23545;&#23384;&#22312;&#30340;&#37027;&#19968;&#20010;&#25991;&#20214;&#65292;&#36825;&#26102;&#36816;&#34892;<span class="command"><strong>svn revert</strong></span>&#19981;&#20250;&#24674;&#22797;&#20320;&#22312;&#26412;&#22320;&#20316;&#30340;&#20462;&#25913;&#65292;&#20004;&#37096;&#20998;&#30340;&#20462;&#25913;&#26080;&#27861;&#35782;&#21035;&#20986;&#26469;&#12290;</p>
          <p>&#22312;&#36825;&#20010;&#24773;&#20917;&#19979;&#65292;&#20154;&#20204;&#24456;&#20048;&#24847;&#33021;&#22815;&#22312;&#21512;&#24182;&#20043;&#21069;&#39044;&#27979;&#19968;&#19979;&#65292;&#19968;&#20010;&#31616;&#21333;&#30340;&#26041;&#27861;&#26159;&#20351;&#29992;&#36816;&#34892;<span class="command"><strong>svn merge</strong></span>&#21516;&#26679;&#30340;&#21442;&#25968;&#36816;&#34892;<span class="command"><strong>svn diff</strong></span>&#65292;&#21478;&#19968;&#31181;&#26041;&#24335;&#26159;&#20256;&#36882;<code class="option">--dry-run</code>&#36873;&#39033;&#32473;merge&#21629;&#20196;&#26469;&#39044;&#35272;&#65306;</p>
          <pre class="screen">
$ svn merge --dry-run -c 344 http://svn.example.com/repos/calc/trunk
U  integer.c

$ svn status
#  nothing printed, working copy is still unchanged.
</pre>
          <p><code class="option">--dry-run</code>&#36873;&#39033;&#23454;&#38469;&#19978;&#24182;&#19981;&#20462;&#25913;&#26412;&#22320;&#25335;&#36125;&#65292;&#23427;&#21482;&#26159;&#26174;&#31034;&#23454;&#38469;&#21512;&#24182;&#26102;&#30340;&#29366;&#24577;&#20449;&#24687;&#65292;&#23545;&#20110;&#24471;&#21040;&#28508;&#22312;&#21512;&#24182;&#30340;&#8220;<span class="quote">&#25972;&#20307;</span>&#8221;&#39044;&#35272;&#65292;&#36825;&#20010;&#21629;&#20196;&#24456;&#26377;&#29992;&#65292;&#22240;&#20026;<span class="command"><strong>svn diff</strong></span>&#21253;&#25324;&#22826;&#22810;&#32454;&#33410;&#12290;</p>
        </div>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.branchmerge.copychanges.bestprac.merge"></a>&#21512;&#24182;&#20914;&#31361;</h4></div></div></div>
          
          <p>&#23601;&#20687;<span class="command"><strong>svn update</strong></span>&#21629;&#20196;&#65292;<span class="command"><strong>svn merge</strong></span>&#20250;&#25226;&#20462;&#25913;&#24212;&#29992;&#21040;&#24037;&#20316;&#25335;&#36125;&#65292;&#22240;&#27492;&#23427;&#20063;&#20250;&#36896;&#25104;&#20914;&#31361;&#65292;&#22240;&#20026;<span class="command"><strong>svn merge</strong></span>&#36896;&#25104;&#30340;&#20914;&#31361;&#26377;&#26102;&#20505;&#20250;&#26377;&#20123;&#19981;&#21516;&#65292;&#26412;&#23567;&#33410;&#20250;&#35299;&#37322;&#36825;&#20123;&#21306;&#21035;&#12290;</p>
          <p>&#20316;&#20026;&#24320;&#22987;&#65292;&#25105;&#20204;&#20551;&#23450;&#26412;&#22320;&#27809;&#26377;&#20462;&#25913;&#65292;&#24403;&#20320;<span class="command"><strong>svn update</strong></span>&#21040;&#19968;&#20010;&#29305;&#23450;&#20462;&#35746;&#29256;&#26412;&#26102;&#65292;&#20462;&#25913;&#20250;&#8220;<span class="quote">&#24178;&#20928;&#30340;</span>&#8221;&#24212;&#29992;&#21040;&#24037;&#20316;&#25335;&#36125;&#65292;&#26381;&#21153;&#22120;&#20135;&#29983;&#27604;&#36739;&#20004;&#26641;&#30340;&#22686;&#37327;&#25968;&#25454;&#65306;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#21644;&#20320;&#20851;&#27880;&#30340;&#29256;&#26412;&#26641;&#30340;&#34394;&#25311;&#24555;&#29031;&#65292;&#22240;&#20026;&#27604;&#36739;&#30340;&#24038;&#36793;&#21516;&#20320;&#25317;&#26377;&#30340;&#23436;&#20840;&#30456;&#21516;&#65292;&#22686;&#37327;&#25968;&#25454;&#30830;&#20445;&#20320;&#25226;&#24037;&#20316;&#25335;&#36125;&#36716;&#21270;&#21040;&#21491;&#36793;&#30340;&#26641;&#12290;</p>
          <p>&#20294;&#26159;<span class="command"><strong>svn merge</strong></span>&#27809;&#26377;&#36825;&#26679;&#30340;&#20445;&#35777;&#65292;&#20250;&#23548;&#33268;&#24456;&#22810;&#30340;&#28151;&#20081;&#65306;&#29992;&#25143;&#21487;&#20197;&#35810;&#38382;&#26381;&#21153;&#22120;&#27604;&#36739;<span class="emphasis"><em>&#20219;&#20309;</em></span>&#20004;&#20010;&#26641;&#65292;&#21363;&#20351;&#19968;&#20010;&#19982;&#24037;&#20316;&#25335;&#36125;&#27627;&#19981;&#30456;&#20851;&#30340;&#65281;&#36825;&#24847;&#21619;&#30528;&#26377;&#28508;&#22312;&#30340;&#20154;&#20026;&#38169;&#35823;&#65292;&#29992;&#25143;&#26377;&#26102;&#20505;&#20250;&#27604;&#36739;&#20004;&#20010;&#38169;&#35823;&#30340;&#26641;&#65292;&#21019;&#24314;&#30340;&#22686;&#37327;&#25968;&#25454;&#19981;&#20250;&#24178;&#20928;&#30340;&#24212;&#29992;&#65292;<span class="command"><strong>svn merge</strong></span>&#20250;&#23613;&#21147;&#24212;&#29992;&#26356;&#22810;&#30340;&#22686;&#37327;&#25968;&#25454;&#65292;&#20294;&#26159;&#26377;&#19968;&#20123;&#37096;&#20998;&#20063;&#35768;&#20250;&#38590;&#20197;&#23436;&#25104;&#65292;&#23601;&#20687;Unix&#19979;<span class="command"><strong>patch</strong></span>&#21629;&#20196;&#26377;&#26102;&#20505;&#20250;&#25253;&#21578;&#8220;<span class="quote">failed hunks</span>&#8221;&#38169;&#35823;&#65292;<span class="command"><strong>svn merge</strong></span>&#20250;&#25253;&#21578;&#8220;<span class="quote">skipped targets</span>&#8221;&#65306;</p>
          <pre class="screen">
$ svn merge -r 1288:1351 http://svn.example.com/repos/branch
U  foo.c
U  bar.c
Skipped missing target: 'baz.c'
U  glub.c
C  glorb.h

$
</pre>
          <p>&#22312;&#21069;&#19968;&#20010;&#20363;&#23376;&#20013;&#65292;<code class="filename">baz.c</code>&#20063;&#35768;&#20250;&#23384;&#22312;&#20110;&#27604;&#36739;&#30340;&#20004;&#20010;&#20998;&#25903;&#24555;&#29031;&#37324;&#65292;&#20294;&#24037;&#20316;&#25335;&#36125;&#37324;&#19981;&#23384;&#22312;&#65292;&#27604;&#36739;&#30340;&#22686;&#37327;&#25968;&#25454;&#35201;&#24212;&#29992;&#21040;&#36825;&#20010;&#25991;&#20214;&#65292;&#36825;&#31181;&#24773;&#20917;&#19979;&#20250;&#21457;&#29983;&#20160;&#20040;&#65311;&#8220;<span class="quote">skipped</span>&#8221;&#20449;&#24687;&#24847;&#21619;&#30528;&#29992;&#25143;&#21487;&#33021;&#26159;&#22312;&#27604;&#36739;&#38169;&#35823;&#30340;&#20004;&#26869;&#26641;&#65292;&#36825;&#26159;&#32463;&#20856;&#30340;&#29992;&#25143;&#38169;&#35823;&#65292;&#24403;&#21457;&#29983;&#36825;&#31181;&#24773;&#20917;&#65292;&#21487;&#20197;&#20351;&#29992;&#36845;&#20195;&#24674;&#22797;(<span class="command"><strong>svn revert --recursive</strong></span>)&#21512;&#24182;&#25152;&#20316;&#30340;&#20462;&#25913;&#65292;&#21024;&#38500;&#24674;&#22797;&#21518;&#30041;&#19979;&#30340;&#25152;&#26377;&#26410;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#65292;&#24182;&#19988;&#20351;&#29992;&#21478;&#22806;&#30340;&#21442;&#25968;&#36816;&#34892;<span class="command"><strong>svn merge</strong></span>&#12290;</p>
          <p>&#20063;&#24212;&#24403;&#27880;&#24847;&#21069;&#19968;&#20010;&#20363;&#23376;&#26174;&#31034;<code class="filename">glorb.h</code>&#21457;&#29983;&#20102;&#20914;&#31361;&#65292;&#25105;&#20204;&#24050;&#32463;&#35268;&#23450;&#26412;&#22320;&#25335;&#36125;&#27809;&#26377;&#20462;&#25913;&#65306;&#20914;&#31361;&#24590;&#20040;&#20250;&#21457;&#29983;&#21602;&#65311;&#22240;&#20026;&#29992;&#25143;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#23558;&#36807;&#21435;&#30340;&#20219;&#20309;&#21464;&#21270;&#24212;&#29992;&#21040;&#24403;&#21069;&#24037;&#20316;&#25335;&#36125;&#65292;&#21464;&#21270;&#21253;&#21547;&#30340;&#25991;&#26412;&#20462;&#25913;&#20063;&#35768;&#24182;&#19981;&#33021;&#24178;&#20928;&#30340;&#24212;&#29992;&#21040;&#24037;&#20316;&#25335;&#36125;&#25991;&#20214;&#65292;&#21363;&#20351;&#36825;&#20123;&#25991;&#20214;&#27809;&#26377;&#26412;&#22320;&#20462;&#25913;&#12290;</p>
          <p>&#21478;&#19968;&#20010;<span class="command"><strong>svn update</strong></span>&#21644;<span class="command"><strong>svn merge</strong></span>&#30340;&#23567;&#21306;&#21035;&#26159;&#20914;&#31361;&#20135;&#29983;&#30340;&#25991;&#20214;&#30340;&#21517;&#23383;&#19981;&#21516;&#65292;&#22312;<a class="xref" href="svn.tour.cycle.html#svn.tour.cycle.resolve" title="&#35299;&#20915;&#20914;&#31361;(&#21512;&#24182;&#21035;&#20154;&#30340;&#20462;&#25913;)">&#8220;&#35299;&#20915;&#20914;&#31361;(&#21512;&#24182;&#21035;&#20154;&#30340;&#20462;&#25913;)&#8221;&#19968;&#33410;</a>&#65292;&#25105;&#20204;&#30475;&#21040;&#36807;&#26356;&#26032;&#20135;&#29983;&#30340;&#25991;&#20214;&#21517;&#23383;&#20026;<code class="filename">filename.mine</code>&#12289;<code class="filename">filename.rOLDREV</code>&#21644;<code class="filename">filename.rNEWREV</code>&#65292;&#24403;<span class="command"><strong>svn merge</strong></span>&#20135;&#29983;&#20914;&#31361;&#26102;&#65292;&#23427;&#20135;&#29983;&#30340;&#19977;&#20010;&#25991;&#20214;&#20998;&#21035;&#20026; <code class="filename">filename.working</code>&#12289;<code class="filename">filename.left</code>&#21644;<code class="filename">filename.right</code>&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#26415;&#35821;&#8220;<span class="quote">left</span>&#8221;&#21644;&#8220;<span class="quote">right</span>&#8221;&#34920;&#31034;&#20102;&#20004;&#26869;&#26641;&#27604;&#36739;&#26102;&#30340;&#20004;&#36793;&#65292;&#22312;&#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#19981;&#21516;&#30340;&#21517;&#23383;&#20250;&#24110;&#21161;&#20320;&#21306;&#20998;&#20914;&#31361;&#26159;&#22240;&#20026;&#26356;&#26032;&#36896;&#25104;&#30340;&#36824;&#26159;&#21512;&#24182;&#36896;&#25104;&#30340;&#12290;</p>
        </div>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.branchmerge.copychanges.bestprac.ancestry"></a>&#20851;&#27880;&#36824;&#26159;&#24573;&#35270;&#31062;&#20808;</h4></div></div></div>
          
          <p>&#24403;&#19982;Subversion&#24320;&#21457;&#32773;&#20132;&#35848;&#26102;&#20320;&#19968;&#23450;&#20250;&#21548;&#21040;&#25552;&#21450;&#26415;&#35821;<em class="firstterm">&#31062;&#20808;</em>&#65292;&#36825;&#20010;&#35789;&#26159;&#29992;&#26469;&#25551;&#36848;&#20004;&#20010;&#23545;&#35937;&#30340;&#20851;&#31995;&#65306;&#22914;&#26524;&#20182;&#20204;&#20114;&#30456;&#20851;&#32852;&#65292;&#19968;&#20010;&#23545;&#35937;&#23601;&#26159;&#21478;&#19968;&#20010;&#30340;&#31062;&#20808;&#65292;&#25110;&#32773;&#30456;&#21453;&#12290;</p>
          <p>&#20030;&#20010;&#20363;&#23376;&#65292;&#20551;&#35774;&#20320;&#25552;&#20132;&#29256;&#26412;100&#65292;&#21253;&#25324;&#23545;<code class="filename">foo.c</code>&#30340;&#20462;&#25913;&#65292;&#21017;foo.c@99&#26159;foo.c@100&#30340;&#19968;&#20010;&#8220;<span class="quote">&#31062;&#20808;</span>&#8221;&#65292;&#21478;&#19968;&#26041;&#38754;&#65292;&#20551;&#35774;&#20320;&#22312;&#29256;&#26412;101&#21024;&#38500;&#36825;&#20010;&#25991;&#20214;&#65292;&#32780;&#22312;102&#29256;&#26412;&#25552;&#20132;&#19968;&#20010;&#21516;&#21517;&#30340;&#25991;&#20214;&#65292;&#22312;&#36825;&#20010;&#24773;&#20917;&#19979;&#65292;<code class="filename">foo.c@99</code>&#19982;<code class="filename">foo.c@102</code>&#30475;&#36215;&#26469;&#26159;&#20851;&#32852;&#30340;(&#26377;&#21516;&#26679;&#30340;&#36335;&#24452;)&#65292;&#20294;&#26159;&#20107;&#23454;&#19978;&#20182;&#20204;&#26159;&#23436;&#20840;&#19981;&#21516;&#30340;&#23545;&#35937;&#65292;&#23427;&#20204;&#24182;&#19981;&#20849;&#20139;&#21516;&#19968;&#20010;&#21382;&#21490;&#25110;&#32773;&#35828;&#8220;<span class="quote">&#31062;&#20808;</span>&#8221;&#12290;</p>
          <p>&#25351;&#20986;<span class="command"><strong>svn diff</strong></span>&#21644;<span class="command"><strong>svn merge</strong></span>&#21306;&#21035;&#30340;&#37325;&#35201;&#24615;&#22312;&#20110;&#65292;&#21069;&#19968;&#20010;&#21629;&#20196;&#24573;&#30053;&#31062;&#20808;&#65292;&#22914;&#26524;&#20320;&#35810;&#38382;<span class="command"><strong>svn diff</strong></span>&#26469;&#27604;&#36739;&#25991;&#20214;<code class="filename">foo.c</code>&#30340;&#29256;&#26412;99&#21644;102&#65292;&#20320;&#20250;&#30475;&#21040;&#34892;&#20026;&#22522;&#30784;&#30340;&#21306;&#21035;&#65292;<code class="literal">diff</code>&#21629;&#20196;&#21482;&#26159;&#30450;&#30446;&#30340;&#27604;&#36739;&#20004;&#26465;&#36335;&#24452;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#26159;&#27604;&#36739;&#21516;&#26679;&#30340;&#20004;&#20010;&#23545;&#35937;&#65292;&#23427;&#20250;&#27880;&#24847;&#21040;&#20182;&#20204;&#26159;&#19981;&#20851;&#32852;&#30340;&#65292;&#32780;&#19988;&#39318;&#20808;&#23581;&#35797;&#21024;&#38500;&#26087;&#25991;&#20214;&#65292;&#28982;&#21518;&#28155;&#21152;&#26032;&#25991;&#20214;&#65292;&#36755;&#20986;&#20250;&#26159;&#19968;&#20010;&#21024;&#38500;&#32039;&#25509;&#30528;&#19968;&#20010;&#22686;&#21152;&#65306;</p>
          <pre class="screen">
D  foo.c
A  foo.c
</pre>
          <p>&#22823;&#22810;&#25968;&#21512;&#24182;&#21253;&#25324;&#27604;&#36739;&#21253;&#25324;&#31062;&#20808;&#20851;&#32852;&#30340;&#20004;&#26465;&#26641;&#65292;&#22240;&#27492;<span class="command"><strong>svn merge</strong></span>&#36825;&#26679;&#36816;&#20316;&#65292;&#28982;&#32780;&#65292;&#20320;&#20063;&#35768;&#20250;&#24076;&#26395;<code class="literal">merge</code>&#21629;&#20196;&#33021;&#22815;&#27604;&#36739;&#20004;&#20010;&#19981;&#30456;&#20851;&#30340;&#30446;&#24405;&#26641;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#26377;&#20004;&#20010;&#30446;&#24405;&#26641;&#20998;&#21035;&#20195;&#34920;&#20102;&#20379;&#24212;&#26041;&#36719;&#20214;&#39033;&#30446;&#30340;&#19981;&#21516;&#29256;&#26412;(&#35265;<a class="xref" href="svn.advanced.vendorbr.html" title="&#20379;&#26041;&#20998;&#25903;">&#8220;&#20379;&#26041;&#20998;&#25903;&#8221;&#19968;&#33410;</a>)&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#36827;&#34892;&#27604;&#36739;&#65292;&#20320;&#20250;&#30475;&#21040;&#31532;&#19968;&#20010;&#30446;&#24405;&#26641;&#34987;&#21024;&#38500;&#65292;&#32780;&#31532;&#20108;&#20010;&#26641;&#28155;&#21152;&#19978;&#65281;&#22312;&#36825;&#20010;&#24773;&#20917;&#19979;&#65292;&#20320;&#20165;&#20165;&#26159;&#24076;&#26395;<span class="command"><strong>svn merge</strong></span>&#20197;&#36335;&#24452;&#20026;&#22522;&#30784;&#27604;&#36739;&#20004;&#26869;&#26641;&#65292;&#32780;&#24573;&#30053;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#19981;&#30456;&#20851;&#24615;&#65292;&#24403;&#20026;&#21512;&#24182;&#21629;&#20196;&#28155;&#21152;<code class="option">--ignore-ancestry</code>&#36873;&#39033;&#26102;&#65292;&#23601;&#20250;&#20687;<span class="command"><strong>svn diff</strong></span>&#19968;&#26679;&#24037;&#20316;&#12290;(&#30456;&#21453;&#65292;<code class="option">--notice-ancestry</code>&#20250;&#23548;&#33268;<span class="command"><strong>svn diff</strong></span>&#20687;<code class="literal">merge</code>&#21629;&#20196;&#19968;&#26679;&#24037;&#20316;&#12290;)</p>
        </div>
        
        <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h4 class="title"><a name="svn.branchmerge.copychanges.bestprac.moves"></a>&#21512;&#24182;&#21644;&#31227;&#21160;</h4></div></div></div>
          
          <p>&#19968;&#20010;&#26222;&#36941;&#30340;&#24895;&#26395;&#26159;&#37325;&#26500;&#28304;&#31243;&#24207;&#65292;&#29305;&#21035;&#26159;Java&#36719;&#20214;&#39033;&#30446;&#12290;&#22312;&#25913;&#21517;&#20013;&#25991;&#20214;&#21644;&#30446;&#24405;&#21464;&#20081;&#65292;&#36890;&#24120;&#23548;&#33268;&#27599;&#20010;&#39033;&#30446;&#25104;&#21592;&#30340;&#26497;&#22823;&#30772;&#22351;&#12290;&#21548;&#36215;&#26469;&#22909;&#20687;&#24212;&#35813;&#20351;&#29992;&#20998;&#25903;&#65292;&#19981;&#26159;&#21527;&#65311;&#21482;&#26159;&#21019;&#24314;&#20998;&#25903;&#65292;&#21464;&#20081;&#20107;&#24773;&#65292;&#28982;&#21518;&#21512;&#24182;&#22238;&#20027;&#24178;&#65292;&#19981;&#23545;&#21527;&#65311;</p>
          <p>&#21769;&#65292;&#36825;&#20010;&#22330;&#26223;&#19979;&#36825;&#26679;&#24182;&#19981;&#27491;&#30830;&#65292;&#21487;&#20197;&#30475;&#20316;Subversion&#24403;&#21069;&#30340;&#24369;&#28857;&#65292;&#36825;&#20010;&#38382;&#39064;&#26159;&#22240;&#20026;Subversion&#30340;<span class="command"><strong>update</strong></span>&#36824;&#19981;&#26159;&#36275;&#22815;&#30340;&#24378;&#22766;&#65292;&#29305;&#21035;&#26159;&#38024;&#23545;&#25335;&#36125;&#21644;&#31227;&#21160;&#25805;&#20316;&#12290;</p>
          <p>&#24403;&#20320;&#20351;&#29992;<span class="command"><strong>svn copy</strong></span>&#22797;&#21046;&#25991;&#20214;&#26102;&#65292;&#29256;&#26412;&#24211;&#20250;&#35760;&#20303;&#26032;&#25991;&#20214;&#30340;&#20986;&#22788;&#65292;&#20294;&#26159;&#23427;&#19981;&#33021;&#23558;&#36825;&#20010;&#20449;&#24687;&#20256;&#36882;&#32473;&#20351;&#29992;<span class="command"><strong>svn update</strong></span>&#25110;<span class="command"><strong>svn merge</strong></span>&#30340;&#23458;&#25143;&#31471;&#65292;&#19981;&#26159;&#21578;&#35785;&#23458;&#25143;&#31471;&#8220;<span class="quote"> &#23558;&#25991;&#20214;&#25335;&#36125;&#21040;&#26032;&#30340;&#20301;&#32622;</span>&#8221;&#65292;&#32780;&#26159;&#20256;&#36882;&#19968;&#25972;&#20010;&#26032;&#25991;&#20214;&#12290;&#36825;&#26679;&#20250;&#23548;&#33268;&#38382;&#39064;&#65292;&#29305;&#21035;&#26159;&#22240;&#20026;&#36825;&#20214;&#20107;&#20063;&#21457;&#29983;&#22312;&#25913;&#21517;&#30340;&#25991;&#20214;&#12290; &#19968;&#20010;&#40092;&#20026;&#20154;&#30693;&#30340;&#20107;&#23454;&#26159;Subversion&#32570;&#20047;&#30495;&#27491;&#30340;&#37325;&#21629;&#21517;&#8212;<span class="command"><strong>svn move</strong></span>&#21629;&#20196;&#21482;&#26159;&#19968;&#20010;<span class="command"><strong>svn copy</strong></span>&#21644;<span class="command"><strong>svn delete</strong></span>&#30340;&#32452;&#21512;&#12290;</p>
          <p>&#20363;&#22914;&#65292;&#20551;&#23450;&#25105;&#20204;&#22312;&#19968;&#20010;&#31169;&#26377;&#20998;&#25903;&#24037;&#20316;&#65292;&#20320;&#23558;<code class="filename">integer.c</code>&#25913;&#21517;&#20026;<code class="filename">whole.c</code>&#65292;&#20320;&#36825;&#26159;&#22312;&#20998;&#25903;&#19978;&#21019;&#24314;&#20102;&#21407;&#26469;&#25991;&#20214;&#30340;&#19968;&#20010;&#25335;&#36125;&#65292;&#24182;&#19988;&#21024;&#38500;&#20102;&#21407;&#26469;&#30340;&#25991;&#20214;&#12290;&#21516;&#26102;&#65292;&#22238;&#21040;<code class="filename">trunk</code>&#65292;Sally&#25552;&#20132;&#20102;&#19968;&#20123;<code class="filename">integer.c</code>&#30340;&#20462;&#25913;&#65292;&#25152;&#20197;&#20320;&#38656;&#35201;&#23558;&#20998;&#25903;&#21512;&#24182;&#21040;&#20027;&#24178;&#65306;</p>
          <pre class="screen">
$ cd calc/trunk

$ svn merge -r 341:405 http://svn.example.com/repos/calc/branches/my-calc-branch
D   integer.c
A   whole.c
</pre>
          <p>&#31532;&#19968;&#30524;&#30475;&#36215;&#26469;&#19981;&#26159;&#24456;&#24046;&#65292;&#20294;&#26159;&#24456;&#21487;&#33021;&#36825;&#19981;&#26159;&#20320;&#21644;Sally&#24076;&#26395;&#30340;&#65292;&#21512;&#24182;&#25805;&#20316;&#24050;&#32463;&#21024;&#38500;&#20102;&#26368;&#26032;&#29256;&#26412;&#30340;<code class="filename">integer.c</code>(&#21253;&#21547;&#20102;Sally&#26368;&#26032;&#30340;&#20462;&#25913;)&#65292;&#32780;&#19988;&#30450;&#30446;&#30340;&#28155;&#21152;&#20102;&#20320;&#30340;<code class="filename">whole.c</code>&#25991;&#20214;&#8212;&#26159;&#26087;&#29256;&#26412;&#30340;<code class="filename">integer.c</code>&#22797;&#21046;&#21697;&#12290;&#26368;&#32456;&#30340;&#32467;&#26524;&#26159;&#23558;&#20320;&#30340;&#8220;<span class="quote">rename</span>&#8221;&#21512;&#24182;&#21040;&#20998;&#25903;&#65292;&#24182;&#19988;&#20174;&#26368;&#26032;&#20462;&#35746;&#29256;&#26412;&#21024;&#38500;&#20102;Sally&#26368;&#36817;&#30340;&#20462;&#25913;&#12290;</p>
          <p>&#36825;&#19981;&#26159;&#30495;&#30340;&#25968;&#25454;&#20002;&#22833;&#65307;Sally&#30340;&#20462;&#25913;&#36824;&#22312;&#29256;&#26412;&#24211;&#30340;&#21382;&#21490;&#20013;&#65292;&#20294;&#26159;&#12290;&#22312;Subversion&#25913;&#36827;&#20043;&#21069;&#65292;&#26368;&#22909;&#23567;&#24515;&#23545;&#20998;&#25903;&#36827;&#34892;&#21512;&#24182;&#21644;&#25913;&#21517;&#12290;</p>
        </div>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e2908" href="#d4e2908" class="para">21</a>] </sup>&#28982;&#32780;&#65292;&#20889;&#36825;&#20123;&#30340;&#26102;&#20505;&#65292;&#36825;&#20123;&#29305;&#24615;&#27491;&#22312;&#23454;&#29616;&#20013;&#65281;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.using.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.branchmerge.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.commonuses.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20351;&#29992;&#20998;&#25903;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#24120;&#35265;&#29992;&#20363;</td></tr></table></div></body></html>