<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#32593;&#32476;&#27169;&#22411;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="svn.advanced.pegrevs.html" title="Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;"><link rel="next" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#32593;&#32476;&#27169;&#22411;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.advanced.pegrevs.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.serverconfig.netmodel"></a>&#32593;&#32476;&#27169;&#22411;</h2></div></div></div>
      
      <p>&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#20320;&#38656;&#35201;&#29702;&#35299;Subversion&#23458;&#25143;&#31471;&#22914;&#20309;&#19982;&#26381;&#21153;&#22120;&#36890;&#35759;&#12290;Subversion&#32593;&#32476;&#23618;&#26159;&#25277;&#35937;&#30340;&#65292;&#24847;&#21619;&#30528;Subversion&#23458;&#25143;&#31471;&#19981;&#31649;&#20854;&#25805;&#20316;&#30340;&#23545;&#35937;&#37117;&#20250;&#20351;&#29992;&#30456;&#21516;&#30340;&#34892;&#20026;&#26041;&#24335;&#65292;&#19981;&#31649;&#26159;&#20351;&#29992;HTTP&#21327;&#35758;(<code class="literal">http://</code>)&#19982;Apache HTTP&#26381;&#21153;&#22120;&#36890;&#35759;&#25110;&#26159;&#20351;&#29992;&#33258;&#23450;&#20041;Subversion&#21327;&#35758;(<code class="literal">svn://</code>)&#19982;<span class="command"><strong>svnserve</strong></span>&#36890;&#35759;&#65292;&#22522;&#26412;&#30340;&#32593;&#32476;&#27169;&#22411;&#26159;&#30456;&#21516;&#30340;&#12290;&#22312;&#26412;&#23567;&#33410;&#65292;&#25105;&#20204;&#35201;&#35299;&#37322;&#32593;&#32476;&#27169;&#22411;&#22522;&#30784;&#65292;&#21253;&#25324;Subversion&#22914;&#20309;&#31649;&#29702;&#35748;&#35777;&#21644;&#25480;&#26435;&#20449;&#24687;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.serverconfig.netmodel.reqresp"></a>&#35831;&#27714;&#21644;&#21709;&#24212;</h3></div></div></div>
        
        <p>Subversion&#23458;&#25143;&#31471;&#33457;&#36153;&#22823;&#37327;&#30340;&#26102;&#38388;&#26469;&#31649;&#29702;&#24037;&#20316;&#25335;&#36125;&#65292;&#24403;&#23427;&#38656;&#35201;&#36828;&#31243;&#29256;&#26412;&#24211;&#30340;&#20449;&#24687;&#65292;&#23427;&#20250;&#20570;&#19968;&#20010;&#32593;&#32476;&#35831;&#27714;&#65292;&#28982;&#21518;&#26381;&#21153;&#22120;&#32473;&#19968;&#20010;&#24688;&#24403;&#30340;&#22238;&#31572;&#65292;&#20855;&#20307;&#30340;&#32593;&#32476;&#21327;&#35758;&#32454;&#33410;&#23545;&#29992;&#25143;&#19981;&#21487;&#35265;&#65292;&#23458;&#25143;&#31471;&#23581;&#35797;&#21435;&#35775;&#38382;&#19968;&#20010;URL&#65292;&#26681;&#25454;URL&#27169;&#24335;&#30340;&#19981;&#21516;&#65292;&#20250;&#20351;&#29992;&#29305;&#23450;&#30340;&#21327;&#35758;&#19982;&#26381;&#21153;&#22120;&#32852;&#31995;(&#35265;<a class="xref" href="svn.basic.in-action.html#svn.basic.in-action.wc.sb-1" title="&#29256;&#26412;&#24211;&#30340; URL">&#29256;&#26412;&#24211;&#30340; URL</a>)&#12290;</p>
        <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
          <p>&#29992;&#25143;&#21487;&#20197;&#36816;&#34892;<span class="command"><strong>svn --version</strong></span>&#26469;&#26597;&#30475;&#23458;&#25143;&#31471;&#21487;&#20197;&#20351;&#29992;&#30340;URL&#27169;&#24335;&#21644;&#21327;&#35758;&#12290;</p>
        </div>
        <p>&#24403;&#26381;&#21153;&#22120;&#22788;&#29702;&#19968;&#20010;&#23458;&#25143;&#31471;&#35831;&#27714;&#65292;&#23427;&#36890;&#24120;&#20250;&#35201;&#27714;&#23458;&#25143;&#31471;&#30830;&#23450;&#23427;&#33258;&#24049;&#30340;&#36523;&#20221;&#65292;&#23427;&#20250;&#21457;&#20986;&#19968;&#20010;&#35748;&#35777;&#35831;&#27714;&#32473;&#23458;&#25143;&#31471;&#65292;&#32780;&#23458;&#25143;&#31471;&#36890;&#36807;&#25552;&#20379;<em class="firstterm">&#20973;&#35777;</em>&#32473;&#26381;&#21153;&#22120;&#20316;&#20026;&#21709;&#24212;&#65292;&#19968;&#26086;&#35748;&#35777;&#32467;&#26463;&#65292;&#26381;&#21153;&#22120;&#20250;&#21709;&#24212;&#23458;&#25143;&#31471;&#26368;&#21021;&#35831;&#27714;&#30340;&#20449;&#24687;&#12290;&#27880;&#24847;&#36825;&#20010;&#31995;&#32479;&#19982;CVS&#20043;&#31867;&#30340;&#31995;&#32479;&#19981;&#19968;&#26679;&#65292;&#23427;&#20204;&#20250;&#22312;&#35831;&#27714;&#20043;&#21069;&#65292;&#39044;&#20808;&#25552;&#20379;&#20973;&#35777;(&#8220;<span class="quote">logs in</span>&#8221;)&#32473;&#26381;&#21153;&#22120;&#65292;&#22312;Subversion&#37324;&#65292;&#26381;&#21153;&#22120;&#36890;&#36807;&#35831;&#27714;&#23458;&#25143;&#31471;&#36866;&#26102;&#22320;&#8220;<span class="quote">&#25302;&#20837;</span>&#8221;&#20973;&#35777;&#65292;&#32780;&#19981;&#26159;&#23458;&#25143;&#31471;&#8220;<span class="quote">&#25512;</span>&#8221;&#20986;&#65292;&#36825;&#20351;&#24471;&#36825;&#31181;&#25805;&#20316;&#26356;&#21152;&#30340;&#20248;&#38597;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#19968;&#20010;&#26381;&#21153;&#22120;&#37197;&#32622;&#20026;&#19990;&#30028;&#19978;&#30340;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#35835;&#21462;&#29256;&#26412;&#24211;&#65292;&#22312;&#23458;&#25143;&#20351;&#29992;<span class="command"><strong>svn checkout</strong></span>&#26102;&#65292;&#26381;&#21153;&#22120;&#27704;&#36828;&#19981;&#20250;&#21457;&#36215;&#19968;&#20010;&#35748;&#35777;&#35831;&#27714;&#12290;</p>
        <p>&#22914;&#26524;&#23458;&#25143;&#31471;&#30340;&#35831;&#27714;&#20250;&#22312;&#29256;&#26412;&#24211;&#21019;&#24314;&#26032;&#30340;&#20462;&#35746;&#29256;&#26412;(&#20363;&#22914;<span class="command"><strong>svn commit</strong></span>)&#65292;Subversion&#23601;&#20250;&#20351;&#29992;&#35748;&#35777;&#36807;&#30340;&#29992;&#25143;&#21517;&#20316;&#20026;&#27492;&#27425;&#25552;&#20132;&#30340;&#20316;&#32773;&#12290;&#20063;&#23601;&#26159;&#35828;&#32463;&#36807;&#35748;&#35777;&#30340;&#29992;&#25143;&#21517;&#20316;&#20026;<code class="literal">svn:author</code>&#23646;&#24615;&#30340;&#20540;&#20445;&#23384;&#21040;&#26032;&#30340;&#20462;&#35746;&#26412;&#37324;(&#35265;<a class="xref" href="svn.ref.properties.html" title="Subversion&#23646;&#24615;">&#8220;Subversion&#23646;&#24615;&#8221;&#19968;&#33410;</a>)&#12290;&#22914;&#26524;&#23458;&#25143;&#31471;&#27809;&#26377;&#32463;&#36807;&#35748;&#35777;(&#25442;&#21477;&#35805;&#35828;&#65292;&#26381;&#21153;&#22120;&#27809;&#26377;&#21457;&#36215;&#36807;&#35748;&#35777;&#35831;&#27714;)&#65292;&#36825;&#26102;&#20462;&#35746;&#26412;&#30340;<code class="literal">svn:author</code>&#30340;&#20540;&#26159;&#31354;&#30340;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.serverconfig.netmodel.credcache"></a>&#23458;&#25143;&#31471;&#20973;&#35777;&#32531;&#23384;</h3></div></div></div>
        
        <p>&#35768;&#22810;&#26381;&#21153;&#22120;&#37197;&#32622;&#20026;&#27599;&#27425;&#35831;&#27714;&#35201;&#27714;&#35748;&#35777;&#65292;&#23545;&#34987;&#24378;&#21046;&#27599;&#27425;&#36755;&#20837;&#29992;&#25143;&#21517;&#23494;&#30721;&#65292;&#35768;&#22810;&#29992;&#25143;&#20250;&#24863;&#21040;&#24456;&#35752;&#21388;&#12290;&#24184;&#36816;&#30340;&#26159;&#65292;Subversion&#23458;&#25143;&#31471;&#23545;&#27492;&#26377;&#19968;&#20010;&#20462;&#34917;&#8212;&#23384;&#22312;&#19968;&#20010;&#22312;&#30913;&#30424;&#19978;&#20445;&#23384;&#35748;&#35777;&#20973;&#35777;&#32531;&#23384;&#30340;&#31995;&#32479;&#65292;&#32570;&#30465;&#24773;&#20917;&#19979;&#65292;&#24403;&#19968;&#20010;&#21629;&#20196;&#34892;&#23458;&#25143;&#31471;&#25104;&#21151;&#30340;&#21709;&#24212;&#20102;&#26381;&#21153;&#22120;&#30340;&#35748;&#35777;&#35831;&#27714;&#65292;&#23427;&#20250;&#20445;&#23384;&#19968;&#20010;&#35748;&#35777;&#25991;&#20214;&#21040;&#29992;&#25143;&#30340;&#31169;&#26377;&#36816;&#34892;&#37197;&#32622;&#21306;(&#31867;Unix&#31995;&#32479;&#19979;&#20250;&#22312;<code class="filename">~/.subversion/auth/</code>&#65292;Windows&#19979;&#22312;<code class="filename">%APPDATA%/Subversion/auth/</code>&#65292;&#36816;&#34892;&#37197;&#32622;&#31995;&#32479;&#22312;<a class="xref" href="svn.customization.html#svn.advanced.confarea" title="&#36816;&#34892;&#37197;&#32622;&#21306;">&#8220;&#36816;&#34892;&#37197;&#32622;&#21306;&#8221;&#19968;&#33410;</a>&#20250;&#26377;&#26356;&#22810;&#32454;&#33410;&#25551;&#36848;)&#12290;&#25104;&#21151;&#30340;&#20973;&#35777;&#20250;&#32531;&#23384;&#22312;&#30913;&#30424;&#65292;&#20197;&#20027;&#26426;&#21517;&#12289;&#31471;&#21475;&#21644;&#35748;&#35777;&#22495;&#30340;&#32452;&#21512;&#20316;&#20026;&#21807;&#19968;&#24615;&#21306;&#21035;&#12290;</p>
        <p>&#24403;&#23458;&#25143;&#31471;&#25509;&#25910;&#21040;&#19968;&#20010;&#35748;&#35777;&#35831;&#27714;&#65292;&#23427;&#20250;&#39318;&#20808;&#26597;&#25214;&#29992;&#25143;&#30913;&#30424;&#20013;&#30340;&#35748;&#35777;&#20973;&#35777;&#32531;&#23384;&#65292;&#22914;&#26524;&#27809;&#26377;&#21457;&#29616;&#65292;&#25110;&#32773;&#26159;&#32531;&#23384;&#30340;&#20973;&#35777;&#35748;&#35777;&#22833;&#36133;&#65292;&#23458;&#25143;&#31471;&#20250;&#25552;&#31034;&#29992;&#25143;&#25552;&#20379;&#38656;&#35201;&#30340;&#20449;&#24687;&#12290;</p>
        <p>&#21313;&#20998;&#20851;&#24515;&#23433;&#20840;&#30340;&#20154;&#20204;&#19968;&#23450;&#20250;&#24819;&#8220;<span class="quote">&#25226;&#23494;&#30721;&#32531;&#23384;&#22312;&#30913;&#30424;&#65311;&#22826;&#21487;&#24597;&#20102;&#65292;&#27704;&#36828;&#19981;&#35201;&#36825;&#26679;&#20570;&#65281;</span>&#8221;</p>
        <p>Subversion&#24320;&#21457;&#32773;&#35748;&#35782;&#21040;&#36825;&#31181;&#20851;&#27880;&#30340;&#27491;&#30830;&#24615;&#65292;&#25152;&#20197;Subversion&#20351;&#29992;&#25805;&#20316;&#31995;&#32479;&#21644;&#29615;&#22659;&#25552;&#20379;&#30340;&#26426;&#21046;&#26469;&#20943;&#23569;&#27844;&#38706;&#36825;&#20123;&#20449;&#24687;&#30340;&#39118;&#38505;&#65292;&#19979;&#38754;&#26159;&#22312;&#22823;&#22810;&#25968;&#24179;&#21488;&#19978;&#36825;&#31181;&#21547;&#20041;&#30340;&#21015;&#34920;&#65306;</p>
        <div class="itemizedlist"><ul type="disc"><li>
            <p>&#22312;Windows 2000&#25110;&#26356;&#26032;&#30340;&#31995;&#32479;&#19978;&#65292;Subversion&#23458;&#25143;&#31471;&#20351;&#29992;&#26631;&#20934;Windows&#21152;&#23494;&#26381;&#21153;&#26469;&#21152;&#23494;&#30913;&#30424;&#19978;&#30340;&#23494;&#30721;&#12290;&#22240;&#20026;&#21152;&#23494;&#23494;&#38053;&#26159;Windows&#31649;&#29702;&#30340;&#65292;&#19982;&#29992;&#25143;&#30340;&#30331;&#38470;&#20973;&#35777;&#30456;&#20851;&#65292;&#21482;&#26377;&#29992;&#25143;&#21487;&#20197;&#35299;&#23494;&#23494;&#30721;&#12290;(&#27880;&#24847;&#65306;&#22914;&#26524;&#29992;&#25143;&#30340;Windows&#36134;&#25143;&#23494;&#30721;&#34987;&#31649;&#29702;&#21592;&#37325;&#32622;&#65292;&#25152;&#26377;&#30340;&#32531;&#23384;&#23494;&#30721;&#23601;&#19981;&#21487;&#20197;&#35299;&#23494;&#20102;&#65292;&#27492;&#26102;Subversion&#23458;&#25143;&#31471;&#23601;&#20250;&#24403;&#23427;&#20204;&#26681;&#26412;&#19981;&#23384;&#22312;&#65292;&#22312;&#38656;&#35201;&#26102;&#32487;&#32493;&#35810;&#38382;&#23494;&#30721;&#12290;)</p>
          </li><li>
            <p>&#31867;&#20284;&#30340;&#65292;&#22312;Mac OS X&#65292;Subversion&#23458;&#25143;&#31471;&#22312;&#30331;&#38470;keyring(&#20351;&#29992;Keychain&#31649;&#29702;)&#20445;&#23384;&#20102;&#25152;&#26377;&#30340;&#29256;&#26412;&#24211;&#23494;&#30721;&#65292;&#20351;&#29992;&#25143;&#29992;&#24080;&#21495;&#23494;&#30721;&#20445;&#25252;&#12290;&#29992;&#25143;&#36873;&#25321;&#30340;&#35774;&#32622;&#21487;&#20197;&#24378;&#21152;&#39069;&#22806;&#30340;&#25919;&#31574;&#65292;&#20363;&#22914;&#22312;&#38656;&#35201;&#29992;&#25143;&#23494;&#30721;&#26102;&#35201;&#27714;&#36755;&#20837;&#29992;&#25143;&#24080;&#21495;&#23494;&#30721;&#12290;</p>
          </li><li>
            <p>&#23545;&#20110;&#20854;&#20182;&#31867;Unix&#31995;&#32479;&#65292;&#27809;&#26377;&#26631;&#20934;&#30340;&#21152;&#23494;&#26381;&#21153;&#12290;&#28982;&#32780;<code class="filename">auth/</code>&#32531;&#23384;&#21306;&#21482;&#26377;&#29992;&#25143;(&#25317;&#26377;&#32773;)&#21487;&#20197;&#35775;&#38382;&#65292;&#32780;&#19981;&#26159;&#20840;&#19990;&#30028;&#37117;&#21487;&#20197;&#65292;&#25805;&#20316;&#31995;&#32479;&#30340;&#35775;&#38382;&#35768;&#21487;&#21487;&#20197;&#20445;&#25252;&#23494;&#30721;&#25991;&#20214;&#12290;</p>
          </li></ul></div>
        <p>&#24403;&#28982;&#65292;&#23545;&#20110;&#30495;&#27491;&#30340;&#22916;&#24819;&#29378;&#65292;&#27809;&#26377;&#20219;&#20309;&#26426;&#21046;&#26159;&#23436;&#32654;&#30340;&#12290;&#36825;&#31867;&#20154;&#24076;&#26395;&#29992;&#26080;&#38480;&#30340;&#23433;&#20840;&#26469;&#29306;&#29298;&#20415;&#21033;&#24615;&#65292;Subversion&#25552;&#20379;&#20102;&#21508;&#31181;&#26041;&#27861;&#26469;&#23436;&#20840;&#20851;&#38381;&#20973;&#35777;&#32531;&#23384;&#12290;</p>
        <p>&#20320;&#21487;&#20197;&#20851;&#38381;&#20973;&#35777;&#32531;&#23384;&#65292;&#21482;&#38656;&#35201;&#19968;&#20010;&#31616;&#21333;&#30340;&#21629;&#20196;&#65292;&#20351;&#29992;&#21442;&#25968;<code class="option">--no-auth-cache</code>&#65306;</p>
        <pre class="screen">
$ svn commit -F log_msg.txt --no-auth-cache
Authentication realm: &lt;svn://host.example.com:3690&gt; example realm
Username:  joe
Password for 'joe':

Adding         newfile
Transmitting file data .
Committed revision 2324.

# password was not cached, so a second commit still prompts us

$ svn delete newfile
$ svn commit -F new_msg.txt
Authentication realm: &lt;svn://host.example.com:3690&gt; example realm
Username:  joe
&#8230;
</pre>
        <p>&#25110;&#35768;&#65292;&#20320;&#24076;&#26395;&#27704;&#36828;&#20851;&#38381;&#20973;&#35777;&#32531;&#23384;&#65292;&#20320;&#21487;&#20197;&#32534;&#36753;&#20320;&#30340;&#36816;&#34892;&#36816;&#34892;&#37197;&#32622;&#21306;&#30340;<code class="filename">config</code>&#25991;&#20214;&#65292;&#21482;&#38656;&#35201;&#25226;<code class="literal">store-auth-creds</code>&#35774;&#32622;&#20026;<code class="literal">no</code>&#65292;&#36825;&#26679;&#22312;&#24433;&#21709;&#30340;&#20027;&#26426;&#19978;&#30340;Subversion&#25805;&#20316;&#23601;&#19981;&#20250;&#26377;&#20973;&#35777;&#32531;&#23384;&#22312;&#30913;&#30424;&#12290;&#36890;&#36807;&#20462;&#25913;&#31995;&#32479;&#32423;&#30340;&#36816;&#34892;&#37197;&#32622;&#21306;&#65292;&#36825;&#20010;&#21151;&#33021;&#20063;&#20250;&#24433;&#21709;&#21040;&#26412;&#26426;&#30340;&#25152;&#26377;&#29992;&#25143;(&#35814;&#32454;&#20869;&#23481;&#35265;<a class="xref" href="svn.customization.html#svn.advanced.confarea.layout" title="&#37197;&#32622;&#21306;&#24067;&#23616;">&#8220;&#37197;&#32622;&#21306;&#24067;&#23616;&#8221;&#19968;&#33410;</a>)&#12290;</p>
        <pre class="screen">
[auth]
store-auth-creds = no
</pre>
        <p>&#26377;&#26102;&#20505;&#65292;&#29992;&#25143;&#24076;&#26395;&#20174;&#30913;&#30424;&#32531;&#23384;&#21024;&#38500;&#29305;&#23450;&#30340;&#20973;&#35777;&#65292;&#20026;&#27492;&#20320;&#21487;&#20197;&#27983;&#35272;&#21040;<code class="filename">auth/</code>&#21306;&#22495;&#65292;&#21024;&#38500;&#29305;&#23450;&#30340;&#32531;&#23384;&#25991;&#20214;&#65292;&#20973;&#35777;&#37117;&#26159;&#20316;&#20026;&#19968;&#20010;&#21333;&#29420;&#30340;&#25991;&#20214;&#32531;&#23384;&#65292;&#22914;&#26524;&#20320;&#25171;&#24320;&#27599;&#19968;&#20010;&#25991;&#20214;&#65292;&#20320;&#20250;&#30475;&#21040;&#38190;&#21644;&#20540;&#65292;<code class="literal">svn:realmstring</code>&#25551;&#36848;&#20102;&#36825;&#20010;&#25991;&#20214;&#20851;&#32852;&#30340;&#29305;&#23450;&#26381;&#21153;&#22120;&#30340;&#22495;&#65306;</p>
        <pre class="screen">
$ ls ~/.subversion/auth/svn.simple/
5671adf2865e267db74f09ba6f872c28
3893ed123b39500bca8a0b382839198e
5c3c22968347b390f349ff340196ed39

$ cat ~/.subversion/auth/svn.simple/5671adf2865e267db74f09ba6f872c28

K 8
username
V 3
joe
K 8
password
V 4
blah
K 15
svn:realmstring
V 45
&lt;https://svn.domain.com:443&gt; Joe's repository
END
</pre>
        <p>&#19968;&#26086;&#20320;&#23450;&#20301;&#20102;&#27491;&#30830;&#30340;&#32531;&#23384;&#25991;&#20214;&#65292;&#21482;&#38656;&#35201;&#21024;&#38500;&#23427;&#12290;</p>
        <p>
          <span class="command"><strong>svn--username--password--username--passwordsvn)</strong></span>
        </p>
        <p>&#36825;&#37324;&#26159;Subversion&#23458;&#25143;&#31471;&#22312;&#25910;&#21040;&#35748;&#35777;&#35831;&#27714;&#30340;&#26102;&#20505;&#30340;&#34892;&#20026;&#26041;&#24335;&#26368;&#32456;&#24635;&#32467;&#65306;</p>
        <div class="orderedlist"><ol type="1"><li>
            <p>&#39318;&#20808;&#65292;&#26816;&#26597;&#29992;&#25143;&#26159;&#21542;&#36890;&#36807;&#21629;&#20196;&#36873;&#39033;(<code class="option">--username</code>&#21644;/&#25110;<code class="option">--password</code>)&#25351;&#23450;&#20102;&#20219;&#20309;&#20973;&#35777;&#20449;&#24687;&#65292;&#22914;&#26524;&#27809;&#26377;&#65292;&#25110;&#32773;&#36825;&#20123;&#36873;&#39033;&#27809;&#26377;&#35748;&#35777;&#25104;&#21151;&#65292;&#28982;&#21518;</p>
          </li><li>
            <p>&#26597;&#25214;&#36816;&#34892;&#20013;&#30340;<code class="filename">auth/</code>&#21306;&#22495;&#20445;&#23384;&#30340;&#26381;&#21153;&#22120;&#21517;&#65292;&#31471;&#21475;&#21644;&#35748;&#35777;&#22495;&#20449;&#24687;&#65292;&#26469;&#30830;&#23450;&#29992;&#25143;&#26159;&#21542;&#24050;&#32463;&#26377;&#20102;&#24688;&#24403;&#30340;&#35748;&#35777;&#32531;&#23384;&#65292;&#22914;&#26524;&#27809;&#26377;&#65292;&#25110;&#32773;&#32531;&#23384;&#20973;&#35777;&#35748;&#35777;&#22833;&#36133;&#65292;&#28982;&#21518;</p>
          </li><li>
            <p>&#26368;&#32456;&#65292;&#23458;&#25143;&#31471;&#36820;&#22238;&#35201;&#27714;&#29992;&#25143;(&#38500;&#38750;&#20351;&#29992;<code class="option">--non-interactive</code>&#36873;&#39033;&#25110;&#23458;&#25143;&#31471;&#23545;&#31561;&#30340;&#26041;&#24335;)&#12290;</p>
          </li></ol></div>
        <p>&#22914;&#26524;&#23458;&#25143;&#31471;&#36890;&#36807;&#20197;&#19978;&#30340;&#20219;&#20309;&#19968;&#31181;&#26041;&#24335;&#25104;&#21151;&#35748;&#35777;&#65292;&#23427;&#20250;&#23581;&#35797;&#22312;&#30913;&#30424;&#32531;&#23384;&#20973;&#35777;(&#38500;&#38750;&#29992;&#25143;&#24050;&#32463;&#20851;&#38381;&#20102;&#36825;&#31181;&#34892;&#20026;&#26041;&#24335;&#65292;&#22312;&#21069;&#38754;&#25552;&#21040;&#36807;&#12290;)</p>
      </div>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.advanced.pegrevs.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.advanced.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</td></tr></table></div></body></html>