<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#20851;&#38190;&#23383;&#26367;&#25442;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL-NS Stylesheets V1.73.2"><link rel="start" href="index.html" title="&#20351;&#29992;Subversion&#36827;&#34892;&#29256;&#26412;&#25511;&#21046;"><link rel="up" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="svn.advanced.props.special.ignore.html" title="&#24573;&#30053;&#26410;&#29256;&#26412;&#25511;&#21046;&#30340;&#26465;&#30446;"><link rel="next" href="svn.advanced.locking.html" title="&#38145;&#23450;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20851;&#38190;&#23383;&#26367;&#25442;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.advanced.props.special.ignore.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.locking.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.props.special.keywords"></a>&#20851;&#38190;&#23383;&#26367;&#25442;</h2></div></div></div><p>Subversion&#20855;&#22791;&#28155;&#21152;<em class="firstterm">&#20851;&#38190;&#23383;</em>&#30340;&#33021;&#21147;&#8212;&#19968;&#20123;&#26377;&#29992;&#30340;&#65292;&#20851;&#20110;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#21160;&#24577;&#20449;&#24687;&#30340;&#29255;&#26029;&#8212;&#19981;&#24517;&#30452;&#25509;&#28155;&#21152;&#21040;&#25991;&#20214;&#26412;&#36523;&#12290;&#20851;&#38190;&#23383;&#36890;&#24120;&#20250;&#29992;&#26469;&#25551;&#36848;&#25991;&#20214;&#26368;&#21518;&#19968;&#27425;&#20462;&#25913;&#30340;&#19968;&#20123;&#20449;&#24687;&#65292;&#22240;&#20026;&#36825;&#20123;&#20449;&#24687;&#27599;&#27425;&#37117;&#26377;&#25913;&#21464;&#65292;&#26356;&#37325;&#35201;&#30340;&#19968;&#28857;&#65292;&#36825;&#26159;&#22312;&#25991;&#20214;&#20462;&#25913;<span class="emphasis"><em>&#20043;&#21518;</em></span>&#65292;&#38500;&#20102;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#23545;&#20110;&#20219;&#20309;&#20225;&#22270;&#20445;&#25345;&#25968;&#25454;&#26368;&#26032;&#30340;&#36807;&#31243;&#37117;&#26159;&#19968;&#22330;&#28151;&#20081;&#65292;&#20316;&#20026;&#20154;&#31867;&#20316;&#32773;&#65292;&#20449;&#24687;&#21464;&#24471;&#38472;&#26087;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#12290;</p><p>&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#26377;&#19968;&#20010;&#25991;&#26723;&#24076;&#26395;&#26174;&#31034;&#26368;&#21518;&#20462;&#25913;&#30340;&#26085;&#26399;&#65292;&#20320;&#38656;&#35201;&#40635;&#28902;&#27599;&#20010;&#20316;&#32773;&#25552;&#20132;&#20043;&#21069;&#20570;&#36825;&#20214;&#20107;&#24773;&#65292;&#20063;&#35201;&#20462;&#25913;&#25991;&#26723;&#30340;&#19968;&#37096;&#20998;&#26469;&#25551;&#36848;&#20309;&#26102;&#20316;&#30340;&#20462;&#25913;&#65292;&#20294;&#26159;&#36831;&#26089;&#20250;&#26377;&#20154;&#24536;&#35760;&#20570;&#36825;&#20214;&#20107;&#65292;&#19981;&#36873;&#25321;&#31616;&#21333;&#30340;&#21578;&#35785;Subversion&#26469;&#25191;&#34892;&#26367;&#25442;<code class="literal">LastChangedDate</code>&#20851;&#38190;&#23383;&#30340;&#25805;&#20316;&#65292;&#20320;&#36890;&#36807;&#22312;&#30446;&#26631;&#20301;&#32622;&#25918;&#32622;&#19968;&#20010;<em class="firstterm">keyword anchor</em>&#26469;&#25511;&#21046;&#20851;&#38190;&#23383;&#25554;&#20837;&#30340;&#20301;&#32622;&#65292;&#36825;&#20010;anchor&#21482;&#26159;&#19968;&#20010;&#26684;&#24335;&#20026;<code class="literal">$</code><em class="replaceable"><code>KeywordName</code></em><code class="literal">$</code>&#23383;&#31526;&#20018;&#12290;</p><p>&#25152;&#26377;&#20316;&#20026;anchor&#20986;&#29616;&#22312;&#25991;&#20214;&#37324;&#30340;&#20851;&#38190;&#23383;&#26159;&#22823;&#23567;&#20889;&#25935;&#24863;&#30340;&#65306;&#20026;&#20102;&#20851;&#38190;&#23383;&#30340;&#25193;&#23637;&#65292;&#20320;&#24517;&#39035;&#20351;&#29992;&#27491;&#30830;&#30340;&#22823;&#20889;&#65292;&#20320;&#24517;&#39035;&#32771;&#34385;<code class="literal">svn:keywords</code>&#30340;&#23646;&#24615;&#20540;&#20063;&#26159;&#22823;&#23567;&#20889;&#25935;&#24863;&#8212;&#29305;&#23450;&#30340;&#20851;&#38190;&#23383;&#21517;&#20250;&#24573;&#30053;&#22823;&#23567;&#20889;&#65292;&#20294;&#26159;&#36825;&#20010;&#29305;&#24615;&#24050;&#32463;&#34987;&#24223;&#24323;&#20102;&#12290;</p><p>Subversion&#23450;&#20041;&#20102;&#29992;&#26469;&#26367;&#25442;&#30340;&#20851;&#38190;&#23383;&#21015;&#34920;&#65292;&#36825;&#20010;&#21015;&#34920;&#20445;&#23384;&#20102;&#22914;&#19979;&#20116;&#20010;&#20851;&#38190;&#23383;&#65292;&#26377;&#19968;&#20123;&#20063;&#21253;&#25324;&#20102;&#21487;&#29992;&#30340;&#21035;&#21517;&#65306;</p><div class="variablelist"><dl><dt><span class="term">
            <code class="literal">Date</code>
          </span></dt><dd><p>&#36825;&#20010;&#20851;&#38190;&#23383;&#20445;&#23384;&#20102;&#25991;&#20214;&#26368;&#21518;&#19968;&#27425;&#22312;&#29256;&#26412;&#24211;&#20462;&#25913;&#30340;&#26085;&#26399;&#65292;&#30475;&#36215;&#26469;&#31867;&#20284;&#20110;<code class="literal">$Date$</code>&#65292;&#23427;&#20063;&#21487;&#20197;&#29992;<code class="literal">LastChangedDate</code>&#26469;&#25351;&#23450;&#12290;</p></dd><dt><span class="term">
            <code class="literal">Revision</code>
          </span></dt><dd><p>&#36825;&#20010;&#20851;&#38190;&#23383;&#25551;&#36848;&#20102;&#36825;&#20010;&#25991;&#20214;&#26368;&#21518;&#19968;&#27425;&#20462;&#25913;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#30475;&#36215;&#26469;&#20687;<code class="literal">$Revision$</code>&#65292;&#20063;&#21487;&#20197;&#36890;&#36807;<code class="literal">LastChangedRevision</code>&#25110;&#32773;<code class="literal">Rev</code>&#24341;&#29992;&#12290;</p></dd><dt><span class="term">
            <code class="literal">Author</code>
          </span></dt><dd><p>&#36825;&#20010;&#20851;&#38190;&#23383;&#25551;&#36848;&#20102;&#26368;&#21518;&#19968;&#20010;&#20462;&#25913;&#36825;&#20010;&#25991;&#20214;&#30340;&#29992;&#25143;&#65292;&#30475;&#36215;&#26469;&#31867;&#20284;<code class="literal">$Author$</code>&#65292;&#20063;&#21487;&#20197;&#29992;<code class="literal">LastChangedBy</code>&#26469;&#25351;&#23450;&#12290;</p></dd><dt><span class="term">
            <code class="literal">HeadURL</code>
          </span></dt><dd><p>&#36825;&#20010;&#20851;&#38190;&#23383;&#25551;&#36848;&#20102;&#36825;&#20010;&#25991;&#20214;&#22312;&#29256;&#26412;&#24211;&#26368;&#26032;&#29256;&#26412;&#30340;&#23436;&#20840;URL&#65292;&#30475;&#36215;&#26469;&#31867;&#20284;<code class="literal">$HeadURL$</code>&#65292;&#21487;&#20197;&#32553;&#20889;&#20026;<code class="literal">URL</code>&#12290;</p></dd><dt><span class="term">
            <code class="literal">Id</code>
          </span></dt><dd><p>&#36825;&#20010;&#20851;&#38190;&#23383;&#26159;&#20854;&#20182;&#20851;&#38190;&#23383;&#19968;&#20010;&#21387;&#32553;&#32452;&#21512;&#65292;&#23427;&#30475;&#36215;&#26469;&#23601;&#20687;<code class="literal">$Id$</code>&#65292;&#21487;&#20197;&#35299;&#37322;&#20026;&#25991;&#20214;<code class="filename">calc.c</code>&#19978;&#19968;&#27425;&#20462;&#25913;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#26159;148&#65292;&#26102;&#38388;&#26159;2006&#24180;7&#26376;28&#26085;&#65292;&#20316;&#32773;&#26159;<code class="literal">sally</code>&#12290;</p></dd></dl></div><p>&#21069;&#38754;&#30340;&#19968;&#20123;&#25551;&#36848;&#20351;&#29992;&#20102;&#31867;&#20284;&#8220;<span class="quote">&#26368;&#21518;&#24050;&#30693;&#30340;</span>&#8221;&#30701;&#35821;&#65292;&#35831;&#35760;&#20303;&#20851;&#38190;&#23383;&#25193;&#23637;&#26159;&#23458;&#25143;&#31471;&#25805;&#20316;&#65292;&#20320;&#30340;&#23458;&#25143;&#31471;&#21482;&#8220;<span class="quote">&#30693;&#36947;</span>&#8221;&#22312;&#20320;&#26356;&#26032;&#24037;&#20316;&#25335;&#36125;&#26102;&#29256;&#26412;&#24211;&#21457;&#29983;&#30340;&#20462;&#25913;&#65292;&#22914;&#26524;&#20320;&#20174;&#19981;&#26356;&#26032;&#24037;&#20316;&#25335;&#36125;&#65292;&#21363;&#20351;&#25991;&#20214;&#22312;&#29256;&#26412;&#24211;&#37324;&#26377;&#35268;&#24459;&#30340;&#20462;&#25913;&#65292;&#36825;&#20123;&#20851;&#38190;&#23383;&#20063;&#19981;&#20250;&#25193;&#23637;&#20026;&#19981;&#21516;&#30340;&#20540;&#12290;</p><p>&#21482;&#22312;&#20320;&#30340;&#25991;&#20214;&#22686;&#21152;&#20851;&#38190;&#23383;anchor&#19981;&#20250;&#20570;&#20160;&#20040;&#29305;&#21035;&#30340;&#20107;&#24773;&#65292;Subversion&#19981;&#20250;&#23581;&#35797;&#23545;&#20320;&#30340;&#25991;&#20214;&#20869;&#23481;&#25191;&#34892;&#25991;&#26412;&#26367;&#25442;&#65292;&#38500;&#38750;&#26126;&#30830;&#30340;&#34987;&#21578;&#30693;&#36825;&#26679;&#20570;&#65292;&#27605;&#31455;&#65292;&#20320;&#21487;&#20197;&#25776;&#20889;&#19968;&#20010;&#20851;&#20110;&#22914;&#20309;&#20351;&#29992;&#20851;&#38190;&#23383;&#30340;&#25991;&#26723;<sup>[<a name="d0e4280" href="#ftn.d0e4280" class="footnote">14</a>]</sup>&#65292;&#20320;&#19981;&#24076;&#26395;Subversion&#20250;&#26367;&#25442;&#20320;&#28418;&#20142;&#30340;&#20851;&#20110;&#19981;&#38656;&#35201;&#26367;&#25442;&#30340;&#20851;&#38190;&#23383;anchor&#23454;&#20363;&#65281;</p><p>&#20026;&#20102;&#21578;&#35785;Subversion&#26159;&#21542;&#26367;&#20195;&#26576;&#20010;&#25991;&#20214;&#30340;&#20851;&#38190;&#23383;&#65292;&#25105;&#20204;&#35201;&#20877;&#27425;&#27714;&#21161;&#20110;&#23646;&#24615;&#30456;&#20851;&#30340;&#23376;&#21629;&#20196;&#65292;&#24403;<code class="literal">svn:keywords</code>&#23646;&#24615;&#35774;&#32622;&#21040;&#19968;&#20010;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#65292;&#36825;&#20123;&#23646;&#24615;&#25511;&#21046;&#20102;&#21738;&#20123;&#20851;&#38190;&#23383;&#23558;&#20250;&#26367;&#25442;&#21040;&#36825;&#20010;&#25991;&#20214;&#65292;&#36825;&#20010;&#23646;&#24615;&#30340;&#20540;&#26159;&#31354;&#26684;&#20998;&#38548;&#30340;&#21069;&#38754;&#21015;&#34920;&#30340;&#21517;&#31216;&#25110;&#26159;&#21035;&#21517;&#21015;&#34920;&#12290;</p><p>&#20030;&#20010;&#20363;&#23376;&#65292;&#20551;&#23450;&#20320;&#26377;&#19968;&#20010;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;<code class="filename">weather.txt</code>&#65292;&#20869;&#23481;&#22914;&#19979;&#65306;</p><pre class="programlisting">
Here is the latest report from the front lines.
$LastChangedDate$
$Rev$
Cumulus clouds are appearing more frequently as summer approaches.
</pre><p>&#24403;&#27809;&#26377;<code class="literal">svn:keywords</code>&#23646;&#24615;&#35774;&#32622;&#21040;&#36825;&#20010;&#25991;&#20214;&#65292;Subversion&#19981;&#20250;&#26377;&#20219;&#20309;&#29305;&#21035;&#25805;&#20316;&#65292;&#29616;&#22312;&#35753;&#25105;&#20204;&#20801;&#35768;<code class="literal">LastChangedDate</code>&#20851;&#38190;&#23383;&#30340;&#26367;&#25442;&#12290;</p><pre class="screen">
$ svn propset svn:keywords "Date Author" weather.txt
property 'svn:keywords' set on 'weather.txt'
$
</pre><p>&#29616;&#22312;&#20320;&#24050;&#32463;&#23545;<code class="filename">weather.txt</code>&#30340;&#23646;&#24615;&#20316;&#20102;&#20462;&#25913;&#65292;&#20320;&#20250;&#30475;&#21040;&#25991;&#20214;&#30340;&#20869;&#23481;&#27809;&#26377;&#25913;&#21464;&#65288;&#38500;&#38750;&#20320;&#20043;&#21069;&#20570;&#20102;&#19968;&#20123;&#23646;&#24615;&#35774;&#32622;&#65289;&#65292;&#27880;&#24847;&#36825;&#20010;&#25991;&#20214;&#21253;&#21547;&#20102;<code class="literal">Rev</code>&#30340;&#20851;&#38190;&#23383;anchor&#65292;&#20294;&#25105;&#20204;&#27809;&#26377;&#22312;&#23646;&#24615;&#20540;&#20013;&#21253;&#25324;&#36825;&#20010;&#20851;&#38190;&#23383;&#65292;Subversion&#20250;&#39640;&#20852;&#30340;&#24573;&#30053;&#26367;&#25442;&#36825;&#20010;&#25991;&#20214;&#20013;&#30340;&#20851;&#38190;&#23383;&#65292;&#20063;&#19981;&#20250;&#26367;&#25442;<code class="literal">svn:keywords</code>&#23646;&#24615;&#20013;&#27809;&#26377;&#20986;&#29616;&#30340;&#20851;&#38190;&#23383;&#12290;</p><p>&#22312;&#20320;&#25552;&#20132;&#20102;&#23646;&#24615;&#20462;&#25913;&#21518;&#65292;Subversion&#20250;&#31435;&#21051;&#26356;&#26032;&#20320;&#30340;&#24037;&#20316;&#25991;&#20214;&#20026;&#26032;&#30340;&#26367;&#20195;&#25991;&#26412;&#65292;&#20320;&#23558;&#26080;&#27861;&#25214;&#21040;<code class="literal">$LastChangedDate$</code>&#30340;&#20851;&#38190;&#23383;anchor&#65292;&#20320;&#20250;&#30475;&#21040;&#26367;&#25442;&#30340;&#32467;&#26524;&#65292;&#36825;&#20010;&#32467;&#26524;&#20063;&#20445;&#23384;&#20102;&#20851;&#38190;&#23383;&#30340;&#21517;&#23383;&#65292;&#19982;&#32654;&#20803;&#31526;&#21495;&#65288;<code class="literal">$</code>&#65289;&#32465;&#23450;&#22312;&#19968;&#36215;&#65292;&#32780;&#19988;&#25105;&#20204;&#39044;&#27979;&#30340;&#65292;<code class="literal">Rev</code>&#20851;&#38190;&#23383;&#19981;&#20250;&#34987;&#26367;&#25442;&#65292;&#22240;&#20026;&#25105;&#20204;&#27809;&#26377;&#35201;&#27714;&#36825;&#26679;&#20570;&#12290;</p><p>&#27880;&#24847;&#25105;&#20204;&#35774;&#32622;<code class="literal">svn:keywords</code>&#23646;&#24615;&#20026;&#8220;<span class="quote">Date Author</span>&#8221;&#65292;&#20851;&#38190;&#23383;anchor&#20351;&#29992;&#21035;&#21517;<code class="literal">$LastChangedDate$</code>&#24182;&#19988;&#27491;&#30830;&#30340;&#25193;&#23637;&#12290;</p><pre class="screen">
Here is the latest report from the front lines.
$LastChangedDate$
$Rev$
Cumulus clouds are appearing more frequently as summer approaches.
</pre><p>&#22914;&#26524;&#26377;&#20854;&#20182;&#20154;&#25552;&#20132;&#20102;<code class="filename">weather.txt</code>&#30340;&#20462;&#25913;&#65292;&#20320;&#30340;&#27492;&#25991;&#20214;&#30340;&#25335;&#36125;&#36824;&#20250;&#26174;&#31034;&#21516;&#26679;&#30340;&#26367;&#25442;&#20851;&#38190;&#23383;&#20540;&#8212;&#30452;&#21040;&#20320;&#26356;&#26032;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#27492;&#26102;&#20320;&#30340;<code class="filename">weather.txt</code>&#37325;&#30340;&#20851;&#38190;&#23383;&#23558;&#20250;&#34987;&#26367;&#25442;&#26469;&#21453;&#26144;&#26368;&#26032;&#30340;&#25552;&#20132;&#20449;&#24687;&#12290;</p><div class="sidebar"><p class="title"><b>$GlobalRev$&#22312;&#21738;&#37324;&#65311;</b></p><p>&#26032;&#29992;&#25143;&#32463;&#24120;&#20026;&#22914;&#20309;&#20351;&#29992;<code class="literal">$Rev$</code>&#20851;&#38190;&#23383;&#36855;&#24785;&#65292;&#33258;&#20174;&#29256;&#26412;&#24211;&#26377;&#20102;&#21333;&#29420;&#30340;&#20840;&#23616;&#22686;&#38271;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#65292;&#35768;&#22810;&#20154;&#20197;&#20026;<code class="literal">$Rev$</code>&#20851;&#38190;&#23383;&#26159;&#21453;&#26144;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#30340;&#65292;&#20294;&#23454;&#38469;&#19978;<code class="literal">$Rev$</code>&#26159;&#25991;&#20214;&#26368;&#21518;&#20462;&#25913;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#32780;&#19981;&#26159;&#26368;&#21518;&#26356;&#26032;&#30340;&#12290;&#29702;&#35299;&#36825;&#19968;&#28857;&#65292;&#20250;&#20943;&#23569;&#19968;&#20123;&#28151;&#28102;&#65292;&#20294;&#26159;&#36824;&#26377;&#19968;&#20123;&#25387;&#25240;&#8212;&#22914;&#26524;&#27809;&#26377;Subversion&#20851;&#38190;&#23383;&#30340;&#25903;&#25345;&#65292;&#20320;&#24590;&#20040;&#25165;&#33021;&#22312;&#20320;&#30340;&#25991;&#20214;&#33258;&#21160;&#24471;&#21040;&#20840;&#23616;&#20462;&#35746;&#29256;&#26412;&#21495;&#21040;&#12290;</p><p>&#20026;&#27492;&#20320;&#38656;&#35201;&#22806;&#32622;&#22788;&#29702;&#65292;Subversion&#20013;&#26377;&#19968;&#20010;&#24037;&#20855;<span class="command"><strong>svnversion</strong></span>&#23601;&#26159;&#20026;&#27492;&#35774;&#35745;&#12290;<span class="command"><strong>svnversion</strong></span>&#36941;&#21382;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#28982;&#21518;&#36755;&#20986;&#23427;&#21457;&#29616;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#36825;&#20010;&#31243;&#24207;&#65292;&#22806;&#21152;&#19968;&#20123;&#24037;&#20855;&#65292;&#23558;&#20462;&#35746;&#29256;&#26412;&#20449;&#24687;&#23884;&#20837;&#21040;&#20320;&#30340;&#25991;&#20214;&#12290;&#20851;&#20110;<span class="command"><strong>svnversion</strong></span>&#30340;&#26356;&#22810;&#20449;&#24687;&#65292;&#35265;<a class="xref" href="svn.ref.svnversion.html" title="svnversion">&#8220;
          <span class="command"><strong>svnversion</strong></span>
        &#8221;&#19968;&#33410;</a>&#12290;</p></div><p>Subversion 1.2&#24341;&#20837;&#20102;&#21478;&#19968;&#31181;&#20851;&#38190;&#23383;&#30340;&#35821;&#27861;&#65292;&#25552;&#20379;&#20102;&#39069;&#22806;&#21644;&#26377;&#29992;&#30340;&#65292;&#23613;&#31649;&#26159;&#38750;&#20856;&#22411;&#30340;&#21151;&#33021;&#12290;&#20320;&#29616;&#22312;&#21487;&#20197;&#21578;&#35785;Subversion&#20026;&#26367;&#20195;&#30340;&#20851;&#38190;&#23383;&#32500;&#25252;&#19968;&#20010;&#22266;&#23450;&#38271;&#24230;&#65288;&#20174;&#28040;&#32791;&#23383;&#33410;&#30340;&#35266;&#28857;&#65289;&#65292;&#36890;&#36807;&#22312;&#20851;&#38190;&#23383;&#21517;&#21518;&#20351;&#29992;&#21452;&#20882;&#21495;&#65288;<code class="literal">::</code>&#65289;&#65292;&#28982;&#21518;&#32039;&#36319;&#19968;&#32452;&#31354;&#26684;&#65292;&#20320;&#23601;&#23450;&#20041;&#20102;&#22266;&#23450;&#23485;&#24230;&#12290;&#24403;Subversion&#20351;&#29992;&#26367;&#20195;&#20540;&#20195;&#26367;&#20320;&#30340;&#20851;&#38190;&#23383;&#65292;&#21482;&#20250;&#26367;&#25442;&#36825;&#20123;&#31354;&#30333;&#23383;&#31526;&#65292;&#20445;&#25345;&#20851;&#38190;&#23383;&#23383;&#27573;&#38271;&#24230;&#20445;&#25345;&#19981;&#21464;&#65292;&#22914;&#26524;&#26367;&#20195;&#20540;&#27604;&#23450;&#20041;&#30340;&#23383;&#27573;&#30701;&#65292;&#20250;&#26377;&#26367;&#20195;&#23383;&#27573;&#21518;&#20445;&#30041;&#31354;&#26684;&#65307;&#22914;&#26524;&#26367;&#20195;&#20540;&#22826;&#38271;&#65292;&#23601;&#20250;&#22312;&#26368;&#21518;&#30340;&#32654;&#20803;&#31526;&#21495;&#32456;&#27490;&#31526;&#21069;&#29992;&#20117;&#21495;&#65288;<code class="literal">#</code>&#65289;&#25130;&#26029;&#12290;</p><p>&#20363;&#22914;&#65292;&#20320;&#26377;&#19968;&#31687;&#25991;&#26723;&#65292;&#20854;&#20013;&#19968;&#27573;&#26159;&#19968;&#20123;&#21453;&#26144;Subversion&#20851;&#38190;&#23383;&#30340;&#34920;&#26684;&#25968;&#25454;&#65292;&#20351;&#29992;&#21407;&#22987;&#30340;Subversion&#20851;&#38190;&#23383;&#26367;&#25442;&#35821;&#27861;&#65292;&#20320;&#30340;&#25991;&#20214;&#25110;&#35768;&#20687;&#36825;&#26679;&#65306;</p><pre class="screen">
$Rev$:     Revision of last commit
$Author$:  Author of last commit
$Date$:    Date of last commit
</pre><p>&#29616;&#22312;&#65292;&#34920;&#26684;&#30475;&#36215;&#26469;&#20343;&#28418;&#20142;&#65292;&#20294;&#26159;&#24403;&#20320;&#25552;&#20132;&#25991;&#20214;&#65288;&#24403;&#28982;&#65292;&#20851;&#38190;&#23383;&#26367;&#25442;&#21151;&#33021;&#24050;&#25171;&#24320;&#65289;&#65292;&#20320;&#20250;&#30475;&#21040;&#65306;</p><pre class="screen">
$Rev$:     Revision of last commit
$Author$:  Author of last commit
$Date$:    Date of last commit
</pre><p>&#32467;&#26524;&#24182;&#19981;&#28418;&#20142;&#65292;&#20320;&#21487;&#33021;&#20250;&#23581;&#35797;&#37325;&#26032;&#35843;&#25972;&#25991;&#20214;&#20351;&#20043;&#26356;&#20687;&#19968;&#20010;&#21015;&#34920;&#12290;&#21482;&#26377;&#20851;&#38190;&#23383;&#30340;&#38271;&#24230;&#26159;&#30456;&#21516;&#30340;&#26102;&#20505;&#25165;&#33021;&#20445;&#35777;&#20445;&#25345;&#26679;&#24335;&#65292;&#22914;&#26524;&#36827;&#20837;&#21478;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#65288;&#22914;&#20174;99&#21040;100&#65289;&#65292;&#25110;&#32773;&#26159;&#21478;&#19968;&#20010;&#26377;&#36739;&#38271;&#29992;&#25143;&#21517;&#30340;&#20154;&#25552;&#20132;&#20102;&#25991;&#20214;&#65292;&#34920;&#26684;&#21448;&#20250;&#21464;&#24418;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;Subversion 1.2&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#26032;&#30340;&#22266;&#23450;&#38271;&#24230;&#30340;&#20851;&#38190;&#23383;&#35821;&#27861;&#65292;&#23450;&#20041;&#21512;&#36866;&#30340;&#23383;&#27573;&#23485;&#24230;&#65292;&#28982;&#21518;&#20320;&#30340;&#25991;&#20214;&#21487;&#33021;&#22914;&#27492;&#65306;</p><pre class="screen">
$Rev::               $:  Revision of last commit
$Author::            $:  Author of last commit
$Date::              $:  Date of last commit
</pre><p>&#20320;&#25552;&#20132;&#36825;&#20010;&#25991;&#20214;&#30340;&#20462;&#25913;&#65292;&#36825;&#19968;&#27425;Subversion&#27880;&#24847;&#21040;&#20102;&#26032;&#30340;&#22266;&#23450;&#38271;&#24230;&#30340;&#20851;&#38190;&#23383;&#35821;&#27861;&#65292;&#26681;&#25454;&#20320;&#22312;&#21452;&#20882;&#21495;&#20043;&#38388;&#25351;&#23450;&#30340;&#31354;&#26684;&#38271;&#24230;&#35843;&#25972;&#26684;&#24335;&#65292;&#24182;&#19988;&#32039;&#36319;&#19968;&#20010;&#32654;&#20803;&#31526;&#21495;&#12290;&#32463;&#36807;&#26367;&#25442;&#65292;&#23383;&#27573;&#30340;&#38271;&#24230;&#27809;&#26377;&#21457;&#29983;&#21464;&#21270;&#8212;<code class="literal">Rev</code>&#21644;<code class="literal">Author</code>&#22810;&#20102;&#19968;&#20123;&#31354;&#26684;&#65292;&#32780;&#36739;&#38271;&#30340;<code class="literal">Date</code>&#23383;&#27573;&#34987;&#19968;&#20010;&#20998;&#21495;&#25130;&#26029;&#65306;</p><pre class="screen">
$Rev::               $:  Revision of last commit
$Author::            $:  Author of last commit
$Date::              $:  Date of last commit
</pre><p>&#22266;&#23450;&#38271;&#24230;&#20851;&#38190;&#23383;&#22312;&#25191;&#34892;&#22797;&#26434;&#25991;&#20214;&#26684;&#24335;&#30340;&#26367;&#25442;&#20013;&#38750;&#24120;&#26131;&#29992;&#65292;&#20063;&#21487;&#20197;&#22788;&#29702;&#37027;&#20123;&#24456;&#38590;&#36890;&#36807;&#20854;&#20182;&#31243;&#24207;&#65288;&#20363;&#22914;Microsoft Office&#25991;&#26723;&#65289;&#36827;&#34892;&#20462;&#25913;&#30340;&#25991;&#20214;&#12290;</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#35686;&#21578;</h3><p>&#38656;&#35201;&#24847;&#35782;&#21040;&#65292;&#22240;&#20026;&#20851;&#38190;&#23383;&#23383;&#27573;&#30340;&#38271;&#24230;&#26159;&#20197;&#23383;&#33410;&#20026;&#21333;&#20301;&#65292;&#21487;&#33021;&#20250;&#30772;&#22351;&#22810;&#23383;&#33410;&#20540;&#65292;&#20363;&#22914;&#19968;&#20010;&#29992;&#25143;&#21517;&#21253;&#21547;&#22810;&#23383;&#33410;&#30340;UTF-8&#23383;&#31526;&#65292;&#21487;&#33021;&#20250;&#36973;&#36935;&#20174;&#26576;&#20010;&#23383;&#31526;&#20013;&#38388;&#25130;&#26029;&#30340;&#24773;&#20917;&#65292;&#20174;&#23383;&#33410;&#35282;&#24230;&#30475;&#20165;&#20165;&#26159;&#19968;&#31181;&#25130;&#26029;&#65292;&#20294;&#26159;&#20174;UTF-8&#23383;&#31526;&#20018;&#35282;&#24230;&#30475;&#21487;&#33021;&#26159;&#38169;&#35823;&#21644;&#26354;&#35299;&#30340;&#65292;&#24403;&#36733;&#20837;&#25991;&#20214;&#26102;&#65292;&#30772;&#22351;&#30340;UTF-8&#25991;&#26412;&#21487;&#33021;&#23548;&#33268;&#25972;&#20010;&#25991;&#20214;&#30340;&#30772;&#22351;&#65292;&#25972;&#20010;&#25991;&#20214;&#26080;&#27861;&#25805;&#20316;&#12290;&#25152;&#20197;&#65292;&#24403;&#38480;&#21046;&#20851;&#38190;&#23383;&#20026;&#22266;&#23450;&#22823;&#23567;&#26102;&#65292;&#38656;&#35201;&#36873;&#25321;&#19968;&#20010;&#21487;&#20197;&#25193;&#23637;&#30340;&#22823;&#23567;&#12290;</p></div><div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d0e4280" href="#d0e4280" class="para">14</a>] </sup>&#8230; &#25110;&#32773;&#21487;&#33021;&#26159;&#19968;&#26412;&#20070;&#30340;&#19968;&#20010;&#23567;&#33410; &#8230;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.advanced.props.special.ignore.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.advanced.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.locking.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#24573;&#30053;&#26410;&#29256;&#26412;&#25511;&#21046;&#30340;&#26465;&#30446;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#38145;&#23450;</td></tr></table></div></body></html>