<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#20351;&#29992;&#20998;&#25903;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="next" href="svn.branchmerge.copychanges.html" title="&#22312;&#20998;&#25903;&#38388;&#22797;&#21046;&#20462;&#25913;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#20351;&#29992;&#20998;&#25903;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.copychanges.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.branchmerge.using"></a>&#20351;&#29992;&#20998;&#25903;</h2></div></div></div>
      
      <p>&#22312;&#36825;&#19968;&#28857;&#19978;&#65292;&#20320;&#24517;&#39035;&#29702;&#35299;&#27599;&#19968;&#27425;&#25552;&#20132;&#26159;&#24590;&#26679;&#24314;&#31435;&#25972;&#20010;&#26032;&#30340;&#25991;&#20214;&#31995;&#32479;&#26641;(&#21483;&#20570;&#8220;<span class="quote">&#20462;&#35746;&#29256;&#26412;</span>&#8221;)&#30340;&#65292;&#22914;&#26524;&#27809;&#26377;&#65292;&#21487;&#20197;&#22238;&#22836;&#21435;&#35835;<a class="xref" href="svn.basic.in-action.html#svn.basic.in-action.revs" title="&#20462;&#35746;&#29256;&#26412;">&#8220;&#20462;&#35746;&#29256;&#26412;&#8221;&#19968;&#33410;</a>&#12290;</p>
      <p>&#23545;&#20110;&#26412;&#31456;&#33410;&#65292;&#25105;&#20204;&#20250;&#22238;&#21040;<a class="xref" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;">&#31532;&nbsp;1&nbsp;&#31456; <i>&#22522;&#26412;&#27010;&#24565;</i></a>&#30340;&#21516;&#19968;&#20010;&#20363;&#23376;&#65292;&#36824;&#35760;&#24471;&#20320;&#21644;&#20320;&#30340;&#21512;&#20316;&#32773;Sally&#20998;&#20139;&#19968;&#20010;&#21253;&#21547;&#20004;&#20010;&#39033;&#30446;&#30340;&#29256;&#26412;&#24211;&#65292;<code class="filename">paint</code>&#21644;<code class="filename">calc</code>&#12290;&#27880;&#24847;<a class="xref" href="svn.branchmerge.using.html#svn.branchmerge.using.dia-1" title="&#22270;&nbsp;4.2.&nbsp;&#24320;&#22987;&#35268;&#21010;&#29256;&#26412;&#24211;">&#22270;&nbsp;4.2 &#8220;&#24320;&#22987;&#35268;&#21010;&#29256;&#26412;&#24211;&#8221;</a>&#65292;&#28982;&#32780;&#65292;&#29616;&#22312;&#27599;&#20010;&#39033;&#30446;&#30340;&#37117;&#26377;&#19968;&#20010;<code class="filename">trunk</code>&#21644;<code class="filename">branches</code>&#23376;&#30446;&#24405;&#65292;&#23427;&#20204;&#23384;&#22312;&#30340;&#29702;&#30001;&#24456;&#24555;&#23601;&#20250;&#28165;&#26224;&#36215;&#26469;&#12290;</p>
      <div class="figure"><a name="svn.branchmerge.using.dia-1"></a><p class="title"><b>&#22270;&nbsp;4.2.&nbsp;&#24320;&#22987;&#35268;&#21010;&#29256;&#26412;&#24211;</b></p><div class="figure-contents">
        
        <div class="mediaobject"><img src="images/ch04dia2.png" alt="&#24320;&#22987;&#35268;&#21010;&#29256;&#26412;&#24211;"></div>
      </div></div><br class="figure-break">
      <p>&#20687;&#20197;&#21069;&#19968;&#26679;&#65292;&#20551;&#23450;Sally&#21644;&#20320;&#37117;&#26377;&#8220;<span class="quote">calc</span>&#8221;&#39033;&#30446;&#30340;&#19968;&#20221;&#25335;&#36125;&#65292;&#26356;&#20934;&#30830;&#22320;&#35828;&#65292;&#20320;&#26377;&#19968;&#20221;<code class="filename">/calc/trunk</code>&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#36825;&#20010;&#39033;&#30446;&#30340;&#25152;&#26377;&#30340;&#25991;&#20214;&#22312;&#36825;&#20010;&#23376;&#30446;&#24405;&#37324;&#65292;&#32780;&#19981;&#26159;&#22312;<code class="filename">/calc</code>&#19979;&#65292;&#22240;&#20026;&#20320;&#30340;&#23567;&#32452;&#20915;&#23450;&#20351;&#29992;<code class="filename">/calc/trunk</code>&#20316;&#20026;&#24320;&#21457;&#20351;&#29992;&#30340;&#8220;<span class="quote">&#20027;&#32447;</span>&#8221;&#12290;</p>
      <p>&#20551;&#23450;&#20320;&#26377;&#19968;&#20010;&#20219;&#21153;&#65292;&#23558;&#35201;&#23545;&#39033;&#30446;&#20570;&#22522;&#26412;&#30340;&#37325;&#26032;&#32452;&#32455;&#65292;&#36825;&#38656;&#35201;&#33457;&#36153;&#22823;&#37327;&#26102;&#38388;&#26469;&#23436;&#25104;&#65292;&#20250;&#24433;&#21709;&#39033;&#30446;&#30340;&#25152;&#26377;&#25991;&#20214;&#65292;&#38382;&#39064;&#26159;&#20320;&#19981;&#20250;&#24076;&#26395;&#25171;&#25200;Sally&#65292;&#22905;&#27491;&#22312;&#22788;&#29702;&#36825;&#26679;&#25110;&#37027;&#26679;&#30340;&#31243;&#24207;&#23567;Bug&#65292;&#19968;&#30452;&#20351;&#29992;&#25972;&#20010;&#39033;&#30446;(<code class="filename">/calc/trunk</code>)&#30340;&#26368;&#26032;&#29256;&#26412;&#65292;&#22914;&#26524;&#20320;&#19968;&#28857;&#19968;&#28857;&#30340;&#25552;&#20132;&#20320;&#30340;&#20462;&#25913;&#65292;&#20320;&#19968;&#23450;&#20250;&#24178;&#25200;Sally&#30340;&#24037;&#20316;&#12290;</p>
      <p>&#19968;&#31181;&#31574;&#30053;&#26159;&#33258;&#24049;&#38381;&#38376;&#36896;&#36710;&#65306;&#20320;&#21644;Sally&#21487;&#20197;&#20572;&#27490;&#19968;&#20010;&#21040;&#20004;&#20010;&#26143;&#26399;&#30340;&#20849;&#20139;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#24320;&#22987;&#20316;&#20986;&#26412;&#36136;&#19978;&#30340;&#20462;&#25913;&#21644;&#37325;&#26032;&#32452;&#32455;&#24037;&#20316;&#25335;&#36125;&#30340;&#25991;&#20214;&#65292;&#20294;&#26159;&#22312;&#23436;&#25104;&#36825;&#20010;&#20219;&#21153;&#20043;&#21069;&#19981;&#20570;&#25552;&#20132;&#21644;&#26356;&#26032;&#12290;&#36825;&#26679;&#20250;&#26377;&#24456;&#22810;&#38382;&#39064;&#65292;&#39318;&#20808;&#65292;&#36825;&#26679;&#24182;&#19981;&#23433;&#20840;&#65292;&#35768;&#22810;&#20154;&#20064;&#24815;&#39057;&#32321;&#30340;&#20445;&#23384;&#20462;&#25913;&#21040;&#29256;&#26412;&#24211;&#65292;&#24037;&#20316;&#25335;&#36125;&#19968;&#23450;&#26377;&#35768;&#22810;&#24847;&#22806;&#30340;&#20462;&#25913;&#12290;&#31532;&#20108;&#65292;&#36825;&#26679;&#24182;&#19981;&#28789;&#27963;&#65292;&#22914;&#26524;&#20320;&#30340;&#24037;&#20316;&#22312;&#19981;&#21516;&#30340;&#35745;&#31639;&#26426;(&#25110;&#35768;&#20320;&#22312;&#19981;&#21516;&#30340;&#26426;&#22120;&#26377;&#20004;&#20221;<code class="filename">/calc/trunk</code>&#30340;&#24037;&#20316;&#25335;&#36125;)&#65292;&#20320;&#38656;&#35201;&#25163;&#24037;&#30340;&#26469;&#22238;&#25335;&#36125;&#20462;&#25913;&#65292;&#25110;&#32773;&#21482;&#22312;&#19968;&#20010;&#35745;&#31639;&#26426;&#19978;&#24037;&#20316;&#65292;&#36825;&#26102;&#24456;&#38590;&#20570;&#21040;&#20849;&#20139;&#20320;&#21363;&#26102;&#30340;&#20462;&#25913;&#65292;&#19968;&#39033;&#36719;&#20214;&#24320;&#21457;&#30340;&#8220;<span class="quote">&#26368;&#20339;&#23454;&#36341;</span>&#8221;&#23601;&#26159;&#20801;&#35768;&#23457;&#26680;&#20320;&#20570;&#36807;&#30340;&#24037;&#20316;&#65292;&#22914;&#26524;&#27809;&#26377;&#20154;&#30475;&#21040;&#20320;&#30340;&#25552;&#20132;&#65292;&#20320;&#22833;&#21435;&#20102;&#28508;&#22312;&#30340;&#21453;&#39304;&#12290;&#26368;&#21518;&#65292;&#24403;&#20320;&#23436;&#25104;&#20102;&#20844;&#21496;&#20027;&#24178;&#20195;&#30721;&#30340;&#20462;&#25913;&#24037;&#20316;&#65292;&#20320;&#20250;&#21457;&#29616;&#21512;&#24182;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#21644;&#20844;&#21496;&#30340;&#20027;&#24178;&#20195;&#30721;&#20250;&#26159;&#19968;&#20214;&#38750;&#24120;&#22256;&#38590;&#30340;&#20107;&#24773;&#65292;Sally(&#25110;&#32773;&#20854;&#20182;&#20154;)&#20063;&#35768;&#24050;&#32463;&#23545;&#29256;&#26412;&#24211;&#20570;&#20102;&#35768;&#22810;&#20462;&#25913;&#65292;&#24050;&#32463;&#24456;&#38590;&#21644;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#32467;&#21512;&#8212;&#24403;&#20320;&#21333;&#29420;&#24037;&#20316;&#20960;&#21608;&#21518;&#36816;&#34892;<span class="command"><strong>svn update</strong></span>&#26102;&#23601;&#20250;&#21457;&#29616;&#36825;&#19968;&#28857;&#12290;</p>
      <p>&#26368;&#20339;&#26041;&#26696;&#26159;&#21019;&#24314;&#20320;&#33258;&#24049;&#30340;&#20998;&#25903;&#65292;&#25110;&#32773;&#26159;&#29256;&#26412;&#24211;&#30340;&#24320;&#21457;&#32447;&#12290;&#36825;&#20801;&#35768;&#20320;&#20445;&#23384;&#30772;&#22351;&#20102;&#19968;&#21322;&#30340;&#24037;&#20316;&#32780;&#19981;&#25171;&#25200;&#21035;&#20154;&#65292;&#23613;&#31649;&#20320;&#20173;&#21487;&#20197;&#36873;&#25321;&#24615;&#30340;&#21516;&#20320;&#30340;&#21512;&#20316;&#32773;&#20998;&#20139;&#20449;&#24687;&#65292;&#20320;&#23558;&#20250;&#30475;&#21040;&#36825;&#26159;&#24590;&#26679;&#24037;&#20316;&#30340;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.using.create"></a>&#21019;&#24314;&#20998;&#25903;</h3></div></div></div>
        
        <p>&#24314;&#31435;&#20998;&#25903;&#38750;&#24120;&#30340;&#31616;&#21333;&#8212;&#20351;&#29992;<span class="command"><strong>svn copy</strong></span>&#21629;&#20196;&#32473;&#20320;&#30340;&#24037;&#31243;&#20570;&#20010;&#25335;&#36125;&#65292;Subversion&#19981;&#20165;&#21487;&#20197;&#25335;&#36125;&#21333;&#20010;&#25991;&#20214;&#65292;&#20063;&#21487;&#20197;&#25335;&#36125;&#25972;&#20010;&#30446;&#24405;&#65292;&#22312;&#30446;&#21069;&#24773;&#20917;&#19979;&#65292;&#20320;&#24076;&#26395;&#20316;<code class="filename">/calc/trunk</code>&#30340;&#25335;&#36125;&#65292;&#26032;&#30340;&#25335;&#36125;&#24212;&#35813;&#22312;&#21738;&#37324;&#65311;&#22312;&#20320;&#24076;&#26395;&#30340;&#20219;&#20309;&#22320;&#26041;&#8212;&#23427;&#21482;&#26159;&#22312;&#20110;&#39033;&#30446;&#30340;&#25919;&#31574;&#65292;&#25105;&#20204;&#20551;&#35774;&#20320;&#20204;&#39033;&#30446;&#30340;&#25919;&#31574;&#26159;&#22312;<code class="filename">/calc/branches</code>&#24314;&#31435;&#20998;&#25903;&#65292;&#24182;&#19988;&#20320;&#24076;&#26395;&#25226;&#20320;&#30340;&#20998;&#25903;&#21483;&#20570;<code class="literal">my-calc-branch</code>&#65292;&#20320;&#24076;&#26395;&#24314;&#31435;&#19968;&#20010;&#26032;&#30340;&#30446;&#24405;<code class="filename">/calc/branches/my-calc-branch</code>&#65292;&#20316;&#20026;/calc/trunk&#30340;&#25335;&#36125;&#24320;&#22987;&#23427;&#30340;&#29983;&#21629;&#21608;&#26399;&#12290;</p>
        <p>&#26377;&#20004;&#20010;&#26041;&#27861;&#20316;&#25335;&#36125;&#65292;&#25105;&#20204;&#20808;&#20171;&#32461;&#19968;&#20010;&#28151;&#20081;&#30340;&#26041;&#27861;&#65292;&#21482;&#26159;&#35753;&#27010;&#24565;&#26356;&#28165;&#26970;&#65292;&#39318;&#20808;&#21462;&#20986;&#19968;&#20010;&#39033;&#30446;&#30340;&#26681;&#30446;&#24405;&#65292;<code class="filename">/calc</code>&#65306;</p>
        <pre class="screen">
$ svn checkout http://svn.example.com/repos/calc bigwc
A  bigwc/trunk/
A  bigwc/trunk/Makefile
A  bigwc/trunk/integer.c
A  bigwc/trunk/button.c
A  bigwc/branches/
Checked out revision 340.
</pre>
        <p>&#24314;&#31435;&#19968;&#20010;&#22791;&#20221;&#21482;&#26159;&#20256;&#36882;&#20004;&#20010;&#30446;&#24405;&#21442;&#25968;&#21040;<span class="command"><strong>svn copy</strong></span>&#21629;&#20196;&#65306;</p>
        <pre class="screen">
$ cd bigwc
$ svn copy trunk branches/my-calc-branch
$ svn status
A  +   branches/my-calc-branch
</pre>
        <p>&#22312;&#36825;&#20010;&#24773;&#20917;&#19979;&#65292;<span class="command"><strong>svn copy</strong></span>&#21629;&#20196;&#36845;&#20195;&#30340;&#23558;<code class="filename">trunk</code>&#24037;&#20316;&#30446;&#24405;&#25335;&#36125;&#21040;&#19968;&#20010;&#26032;&#30340;&#30446;&#24405;branhes/my-calc-branch&#65292;&#20687;&#20320;&#20174;<span class="command"><strong>svn status</strong></span>&#30475;&#21040;&#30340;&#65292;&#26032;&#30340;&#30446;&#24405;&#26159;&#20934;&#22791;&#28155;&#21152;&#21040;&#29256;&#26412;&#24211;&#30340;&#65292;&#20294;&#26159;&#20063;&#35201;&#27880;&#24847;A&#21518;&#38754;&#30340;&#8220;<span class="quote">+</span>&#8221;&#21495;&#65292;&#36825;&#34920;&#26126;&#36825;&#20010;&#20934;&#22791;&#28155;&#21152;&#30340;&#19996;&#35199;&#26159;&#19968;&#20221;<span class="emphasis"><em>&#22791;&#20221;</em></span>&#65292;&#32780;&#19981;&#26159;&#26032;&#30340;&#19996;&#35199;&#12290;&#24403;&#20320;&#25552;&#20132;&#20462;&#25913;&#65292;Subversion&#20250;&#36890;&#36807;&#25335;&#36125;<code class="filename">/calc/trunk</code>&#24314;&#31435;<code class="filename">/calc/branches/my-calc-branch</code>&#30446;&#24405;&#65292;&#32780;&#19981;&#26159;&#36890;&#36807;&#32593;&#32476;&#20256;&#36882;&#25152;&#26377;&#25968;&#25454;&#65306;</p>
        <pre class="screen">
$ svn commit -m "Creating a private branch of /calc/trunk."
Adding         branches/my-calc-branch
Committed revision 341.
</pre>
        <p>&#29616;&#22312;&#65292;&#25105;&#20204;&#24517;&#39035;&#21578;&#35785;&#20320;&#24314;&#31435;&#20998;&#25903;&#26368;&#31616;&#21333;&#30340;&#26041;&#27861;&#65306;<span class="command"><strong>svn copy</strong></span>&#21487;&#20197;&#30452;&#25509;&#23545;&#20004;&#20010;URL&#25805;&#20316;&#12290;</p>
        <pre class="screen">
$ svn copy http://svn.example.com/repos/calc/trunk \
           http://svn.example.com/repos/calc/branches/my-calc-branch \
      -m "Creating a private branch of /calc/trunk."

Committed revision 341.
</pre>
        <p>&#20174;&#29256;&#26412;&#24211;&#30340;&#35270;&#28857;&#26469;&#30475;&#65292;&#20854;&#23454;&#36825;&#20004;&#31181;&#26041;&#27861;&#27809;&#26377;&#20160;&#20040;&#21306;&#21035;&#65292;&#20004;&#20010;&#36807;&#31243;&#37117;&#22312;&#29256;&#26412;341&#24314;&#31435;&#20102;&#19968;&#20010;&#26032;&#30446;&#24405;&#20316;&#20026;<code class="filename">/calc/trunk</code>&#30340;&#19968;&#20010;&#22791;&#20221;&#65292;&#36825;&#20123;&#21487;&#20197;&#22312;<a class="xref" href="svn.branchmerge.using.html#svn.branchmerge.using.create.dia-1" title="&#22270;&nbsp;4.3.&nbsp;&#29256;&#26412;&#24211;&#19982;&#22797;&#21046;">&#22270;&nbsp;4.3 &#8220;&#29256;&#26412;&#24211;&#19982;&#22797;&#21046;&#8221;</a>&#30475;&#21040;&#65292;&#27880;&#24847;&#31532;&#20108;&#31181;&#26041;&#27861;&#65292;&#21482;&#26159;&#25191;&#34892;&#20102;&#19968;&#20010;<span class="emphasis"><em>&#31435;&#21363;</em></span>&#25552;&#20132;&#12290; <sup>[<a name="d4e2720" href="#ftn.d4e2720" class="footnote">20</a>]</sup>&#36825;&#26159;&#19968;&#20010;&#31616;&#21333;&#30340;&#36807;&#31243;&#65292;&#22240;&#20026;&#20320;&#19981;&#38656;&#35201;&#21462;&#20986;&#29256;&#26412;&#24211;&#19968;&#20010;&#24222;&#22823;&#30340;&#38236;&#20687;&#65292;&#20107;&#23454;&#19978;&#65292;&#36825;&#20010;&#25216;&#26415;&#19981;&#38656;&#35201;&#20320;&#26377;&#24037;&#20316;&#25335;&#36125;&#65292;&#36825;&#26159;&#22823;&#22810;&#25968;&#29992;&#25143;&#21019;&#24314;&#20998;&#25903;&#30340;&#26041;&#24335;&#12290;</p>
        <div class="figure"><a name="svn.branchmerge.using.create.dia-1"></a><p class="title"><b>&#22270;&nbsp;4.3.&nbsp;&#29256;&#26412;&#24211;&#19982;&#22797;&#21046;</b></p><div class="figure-contents">
          
          <div class="mediaobject"><img src="images/ch04dia3.png" alt="&#29256;&#26412;&#24211;&#19982;&#22797;&#21046;"></div>
        </div></div><br class="figure-break">
        <div class="sidebar"><p class="title"><b>&#24265;&#20215;&#22797;&#21046;</b></p>
          
          <p>Subversion&#30340;&#29256;&#26412;&#24211;&#26377;&#29305;&#27530;&#30340;&#35774;&#35745;&#65292;&#24403;&#20320;&#22797;&#21046;&#19968;&#20010;&#30446;&#24405;&#65292;&#20320;&#19981;&#38656;&#35201;&#25285;&#24515;&#29256;&#26412;&#24211;&#20250;&#21464;&#24471;&#21313;&#20998;&#24040;&#22823;&#8212;Subversion&#24182;&#19981;&#26159;&#25335;&#36125;&#25152;&#26377;&#30340;&#25968;&#25454;&#65292;&#30456;&#21453;&#65292;&#23427;&#24314;&#31435;&#20102;&#19968;&#20010;<span class="emphasis"><em>&#24050;&#23384;&#22312;</em></span>&#30446;&#24405;&#26641;&#30340;&#20837;&#21475;&#65292;&#22914;&#26524;&#20320;&#26159;Unix&#29992;&#25143;&#65292;&#21487;&#20197;&#25226;&#23427;&#29702;&#35299;&#25104;&#30828;&#38142;&#25509;&#65292;&#22312;&#23545;&#25335;&#36125;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#25805;&#20316;&#20043;&#21069;&#65292;Subversion&#36824;&#20165;&#20165;&#25226;&#23427;&#24403;&#20316;&#30828;&#38142;&#25509;&#65292;&#21482;&#26377;&#20026;&#20102;&#21306;&#20998;&#19981;&#21516;&#29256;&#26412;&#30340;&#23545;&#35937;&#26102;&#25165;&#20250;&#22797;&#21046;&#25968;&#25454;&#12290;</p>
          <p>&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#32463;&#24120;&#21548;&#21040;Subversion&#29992;&#25143;&#35848;&#35770;&#8220;<span class="quote">&#24265;&#20215;&#30340;&#25335;&#36125;</span>&#8221;&#65292;&#19982;&#30446;&#24405;&#30340;&#22823;&#23567;&#26080;&#20851;&#8212;&#36825;&#20010;&#25805;&#20316;&#20250;&#20351;&#29992;&#24456;&#23569;&#30340;&#26102;&#38388;&#65292;&#20107;&#23454;&#19978;&#65292;&#36825;&#20010;&#29305;&#24615;&#26159;Subversion&#25552;&#20132;&#24037;&#20316;&#30340;&#22522;&#30784;&#65306;&#27599;&#19968;&#27425;&#29256;&#26412;&#37117;&#26159;&#21069;&#19968;&#20010;&#29256;&#26412;&#30340;&#19968;&#20010;&#8220;<span class="quote">&#24265;&#20215;&#30340;&#25335;&#36125;</span>&#8221;&#65292;&#21482;&#26377;&#23569;&#25968;&#39033;&#30446;&#20462;&#25913;&#20102;&#12290;(&#35201;&#38405;&#35835;&#26356;&#22810;&#20851;&#20110;&#36825;&#37096;&#20998;&#30340;&#20869;&#23481;&#65292;&#35775;&#38382;Subversion&#32593;&#31449;&#24182;&#19988;&#38405;&#35835;&#35774;&#35745;&#25991;&#26723;&#20013;&#30340;&#8220;<span class="quote">bubble up</span>&#8221;&#26041;&#27861;)&#12290;</p>
          <p>&#24403;&#28982;&#65292;&#25335;&#36125;&#19982;&#20998;&#20139;&#30340;&#20869;&#37096;&#26426;&#21046;&#23545;&#29992;&#25143;&#26469;&#35762;&#26159;&#19981;&#21487;&#35265;&#30340;&#65292;&#29992;&#25143;&#21482;&#26159;&#30475;&#21040;&#25335;&#36125;&#26641;&#65292;&#36825;&#37324;&#30340;&#35201;&#28857;&#26159;&#25335;&#36125;&#30340;&#26102;&#38388;&#19982;&#31354;&#38388;&#20195;&#20215;&#24456;&#23567;&#12290;&#22914;&#26524;&#20320;&#23436;&#20840;&#22312;&#29256;&#26412;&#24211;&#37324;&#21019;&#24314;&#20998;&#25903;(&#36890;&#36807;&#36816;&#34892;<span class="command"><strong>svn copy URL1 URL2</strong></span>)&#65292;&#36825;&#26159;&#19968;&#20010;&#24555;&#36895;&#30340;&#65292;&#26102;&#38388;&#22522;&#26412;&#22266;&#23450;&#30340;&#25805;&#20316;&#65292;&#21482;&#35201;&#20320;&#24076;&#26395;&#65292;&#21487;&#20197;&#38543;&#24847;&#21019;&#24314;&#20998;&#25903;&#12290;</p>
        </div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.using.work"></a>&#22312;&#20998;&#25903;&#19978;&#24037;&#20316;</h3></div></div></div>
        
        <p>&#29616;&#22312;&#20320;&#24050;&#32463;&#22312;&#39033;&#30446;&#37324;&#24314;&#31435;&#20998;&#25903;&#20102;&#65292;&#20320;&#21487;&#20197;&#21462;&#20986;&#19968;&#20010;&#26032;&#30340;&#24037;&#20316;&#25335;&#36125;&#26469;&#24320;&#22987;&#20351;&#29992;&#65306;</p>
        <pre class="screen">
$ svn checkout http://svn.example.com/repos/calc/branches/my-calc-branch
A  my-calc-branch/Makefile
A  my-calc-branch/integer.c
A  my-calc-branch/button.c
Checked out revision 341.
</pre>
        <p>&#36825;&#19968;&#20221;&#24037;&#20316;&#25335;&#36125;&#27809;&#26377;&#20160;&#20040;&#29305;&#21035;&#30340;&#65292;&#23427;&#21482;&#26159;&#29256;&#26412;&#24211;&#21478;&#19968;&#20010;&#30446;&#24405;&#30340;&#19968;&#20010;&#38236;&#20687;&#32610;&#20102;&#65292;&#24403;&#20320;&#25552;&#20132;&#20462;&#25913;&#26102;&#65292;Sally&#22312;&#26356;&#26032;&#26102;&#19981;&#20250;&#30475;&#21040;&#25913;&#21464;&#65292;&#22905;&#26159;<code class="filename">/calc/trunk</code>&#30340;&#24037;&#20316;&#25335;&#36125;&#12290;(&#30830;&#23450;&#35201;&#35835;&#26412;&#31456;&#21518;&#38754;&#30340;<a class="xref" href="svn.branchmerge.switchwc.html" title="&#20351;&#29992;&#20998;&#25903;">&#8220;&#20351;&#29992;&#20998;&#25903;&#8221;&#19968;&#33410;</a>&#65306;<span class="command"><strong>svn switch</strong></span>&#21629;&#20196;&#26159;&#24314;&#31435;&#20998;&#25903;&#24037;&#20316;&#25335;&#36125;&#30340;&#21478;&#19968;&#20010;&#36873;&#25321;&#12290;)</p>
        <p>&#25105;&#20204;&#20551;&#23450;&#26412;&#21608;&#23601;&#35201;&#36807;&#21435;&#20102;&#65292;&#22914;&#19979;&#30340;&#25552;&#20132;&#21457;&#29983;&#65306;</p>
        <div class="itemizedlist"><ul type="disc"><li>
            <p>&#20320;&#20462;&#25913;&#20102;<code class="filename">/calc/branches/my-calc-branch/button.c</code>&#65292;&#29983;&#25104;&#20462;&#35746;&#29256;&#26412;342&#12290;</p>
          </li><li>
            <p>&#20320;&#20462;&#25913;&#20102;<code class="filename">/calc/branches/my-calc-branch/integer.c</code>&#65292;&#29983;&#25104;&#20462;&#35746;&#29256;&#26412;343&#12290;</p>
          </li><li>
            <p>Sally&#20462;&#25913;&#20102;<code class="filename">/calc/trunk/integer.c</code>&#65292;&#29983;&#25104;&#20102;&#20462;&#35746;&#29256;&#26412;344&#12290;</p>
          </li></ul></div>
        <p>&#29616;&#22312;&#26377;&#20004;&#20010;&#29420;&#31435;&#24320;&#21457;&#32447;&#65292;<a class="xref" href="svn.branchmerge.using.html#svn.branchmerge.using.work.dia-1" title="&#22270;&nbsp;4.4.&nbsp;&#19968;&#20010;&#25991;&#20214;&#30340;&#20998;&#25903;&#21382;&#21490;">&#22270;&nbsp;4.4 &#8220;&#19968;&#20010;&#25991;&#20214;&#30340;&#20998;&#25903;&#21382;&#21490;&#8221;</a>&#26174;&#31034;&#20102;<code class="filename">integer.c</code>&#30340;&#21382;&#21490;&#12290;</p>
        <div class="figure"><a name="svn.branchmerge.using.work.dia-1"></a><p class="title"><b>&#22270;&nbsp;4.4.&nbsp;&#19968;&#20010;&#25991;&#20214;&#30340;&#20998;&#25903;&#21382;&#21490;</b></p><div class="figure-contents">
          
          <div class="mediaobject"><img src="images/ch04dia4.png" alt="&#19968;&#20010;&#25991;&#20214;&#30340;&#20998;&#25903;&#21382;&#21490;"></div>
        </div></div><br class="figure-break">
        <p>&#24403;&#20320;&#30475;&#21040;<code class="filename">integer.c</code>&#30340;&#25913;&#21464;&#26102;&#65292;&#20320;&#20250;&#21457;&#29616;&#24456;&#26377;&#36259;&#65306;</p>
        <pre class="screen">
$ pwd
/home/user/my-calc-branch

$ svn log -v integer.c
------------------------------------------------------------------------
r343 | user | 2002-11-07 15:27:56 -0600 (Thu, 07 Nov 2002) | 2 lines
Changed paths:
   M /calc/branches/my-calc-branch/integer.c

* integer.c:  frozzled the wazjub.

------------------------------------------------------------------------
r341 | user | 2002-11-03 15:27:56 -0600 (Thu, 07 Nov 2002) | 2 lines
Changed paths:
   A /calc/branches/my-calc-branch (from /calc/trunk:340)

Creating a private branch of /calc/trunk.

------------------------------------------------------------------------
r303 | sally | 2002-10-29 21:14:35 -0600 (Tue, 29 Oct 2002) | 2 lines
Changed paths:
   M /calc/trunk/integer.c

* integer.c:  changed a docstring.

------------------------------------------------------------------------
r98 | sally | 2002-02-22 15:35:29 -0600 (Fri, 22 Feb 2002) | 2 lines
Changed paths:
   M /calc/trunk/integer.c

* integer.c:  adding this file to the project.

------------------------------------------------------------------------
</pre>
        <p>&#27880;&#24847;&#65292;Subversion&#36861;&#36394;&#20998;&#25903;&#19978;&#30340;<code class="filename">integer.c</code>&#30340;&#21382;&#21490;&#65292;&#21253;&#25324;&#25152;&#26377;&#30340;&#25805;&#20316;&#65292;&#29978;&#33267;&#36861;&#36394;&#21040;&#25335;&#36125;&#20043;&#21069;&#12290;&#36825;&#34920;&#31034;&#20102;&#24314;&#31435;&#20998;&#25903;&#20063;&#26159;&#21382;&#21490;&#20013;&#30340;&#19968;&#27425;&#20107;&#20214;&#65292;&#22240;&#20026;&#22312;&#25335;&#36125;&#25972;&#20010;<code class="filename">/calc/trunk/</code>&#26102;&#24050;&#32463;&#25335;&#36125;&#20102;&#19968;&#20221;<code class="filename">integer.c</code>&#12290;&#29616;&#22312;&#30475;Sally&#22312;&#22905;&#30340;&#24037;&#20316;&#25335;&#36125;&#36816;&#34892;&#21516;&#26679;&#30340;&#21629;&#20196;&#65306;</p>
        <pre class="screen">
$ pwd
/home/sally/calc

$ svn log -v integer.c
------------------------------------------------------------------------
r344 | sally | 2002-11-07 15:27:56 -0600 (Thu, 07 Nov 2002) | 2 lines
Changed paths:
   M /calc/trunk/integer.c

* integer.c:  fix a bunch of spelling errors.

------------------------------------------------------------------------
r303 | sally | 2002-10-29 21:14:35 -0600 (Tue, 29 Oct 2002) | 2 lines
Changed paths:
   M /calc/trunk/integer.c

* integer.c:  changed a docstring.

------------------------------------------------------------------------
r98 | sally | 2002-02-22 15:35:29 -0600 (Fri, 22 Feb 2002) | 2 lines
Changed paths:
   M /calc/trunk/integer.c

* integer.c:  adding this file to the project.

------------------------------------------------------------------------
</pre>
        <p>sally&#30475;&#21040;&#22905;&#33258;&#24049;&#30340;344&#20462;&#35746;&#65292;&#20320;&#20570;&#30340;343&#20462;&#25913;&#22905;&#30475;&#19981;&#21040;&#65292;&#20174;Subversion&#30475;&#26469;&#65292;&#20004;&#27425;&#25552;&#20132;&#21482;&#26159;&#24433;&#21709;&#29256;&#26412;&#24211;&#20013;&#19981;&#21516;&#20301;&#32622;&#19978;&#30340;&#20004;&#20010;&#25991;&#20214;&#12290;&#28982;&#32780;&#65292;Subversion<span class="emphasis"><em>&#26174;&#31034;</em></span>&#20102;&#20004;&#20010;&#25991;&#20214;&#26377;&#20849;&#21516;&#30340;&#21382;&#21490;&#65292;&#22312;&#20998;&#25903;&#25335;&#36125;&#20043;&#21069;&#65292;&#20182;&#20204;&#20351;&#29992;&#21516;&#19968;&#20010;&#25991;&#20214;&#65292;&#25152;&#20197;&#20320;&#21644;Sally&#37117;&#30475;&#21040;&#29256;&#26412;&#21495;303&#21040;98&#30340;&#20462;&#25913;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.using.concepts"></a>&#20998;&#25903;&#32972;&#21518;&#30340;&#20851;&#38190;&#27010;&#24565;</h3></div></div></div>
        
        <p>&#22312;&#26412;&#33410;&#65292;&#20320;&#38656;&#35201;&#35760;&#20303;&#20004;&#20214;&#37325;&#35201;&#30340;&#35838;&#31243;&#12290;&#39318;&#20808;&#65292;Subversion&#24182;&#27809;&#26377;&#20869;&#22312;&#30340;&#20998;&#25903;&#27010;&#24565;&#8212;&#21482;&#26377;&#25335;&#36125;&#65292;&#24403;&#20320;&#25335;&#36125;&#19968;&#20010;&#30446;&#24405;&#65292;&#36825;&#20010;&#32467;&#26524;&#30446;&#24405;&#23601;&#26159;&#19968;&#20010;&#8220;<span class="quote">&#20998;&#25903;</span>&#8221;&#65292;&#21482;&#26159;&#22240;&#20026;&#20320;&#32473;&#20102;&#23427;&#36825;&#26679;&#19968;&#20010;&#21547;&#20041;&#32780;&#24050;&#12290;&#20320;&#21487;&#20197;&#25442;&#19968;&#31181;&#35282;&#24230;&#32771;&#34385;&#65292;&#25110;&#32773;&#29305;&#21035;&#23545;&#24453;&#65292;&#20294;&#26159;&#23545;&#20110;Subversion&#23427;&#21482;&#26159;&#19968;&#20010;&#26222;&#36890;&#30340;&#25335;&#36125;&#65292;&#21482;&#19981;&#36807;&#30896;&#24039;&#21253;&#21547;&#20102;&#19968;&#20123;&#39069;&#22806;&#30340;&#21382;&#21490;&#20449;&#24687;&#12290;&#31532;&#20108;&#65292;&#22240;&#20026;&#25335;&#36125;&#26426;&#21046;&#65292;Subversion&#30340;&#20998;&#25903;&#26159;&#20197;<span class="emphasis"><em>&#26222;&#36890;&#25991;&#20214;&#31995;&#32479;&#30446;&#24405;</em></span>&#23384;&#22312;&#30340;&#65292;&#36825;&#19982;&#20854;&#20182;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#19981;&#21516;&#65292;&#23427;&#20204;&#37117;&#20026;&#20998;&#25903;&#23450;&#20041;&#20102;&#21478;&#19968;&#32500;&#24230;&#30340;&#8220;<span class="quote">&#26631;&#31614;</span>&#8221;&#12290;</p>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e2720" href="#d4e2720" class="para">20</a>] </sup>Subversion&#19981;&#25903;&#25345;&#36328;&#29256;&#26412;&#24211;&#30340;&#25335;&#36125;&#65292;&#24403;&#20351;&#29992;<span class="command"><strong>svn copy</strong></span>&#25110;&#32773;<span class="command"><strong>svn move</strong></span>&#30452;&#25509;&#25805;&#20316;URL&#26102;&#20320;&#21482;&#33021;&#22312;&#21516;&#19968;&#20010;&#29256;&#26412;&#24211;&#20869;&#25805;&#20316;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.branchmerge.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.copychanges.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#22312;&#20998;&#25903;&#38388;&#22797;&#21046;&#20462;&#25913;</td></tr></table></div></body></html>