<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#25991;&#20214;&#31227;&#26893;&#24615;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="svn.advanced.props.html" title="&#23646;&#24615;"><link rel="next" href="svn.advanced.props.special.ignore.html" title="&#24573;&#30053;&#26410;&#29256;&#26412;&#25511;&#21046;&#30340;&#26465;&#30446;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#25991;&#20214;&#31227;&#26893;&#24615;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.advanced.props.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.props.special.ignore.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.props.file-portability"></a>&#25991;&#20214;&#31227;&#26893;&#24615;</h2></div></div></div>
      
      <p>&#24184;&#36816;&#30340;&#26159;&#65292;&#23545;&#20110;&#35768;&#22810;&#22312;&#19981;&#21516;&#25805;&#20316;&#31995;&#32479;&#19979;&#24037;&#20316;&#30340;&#29992;&#25143;&#65292;Subversion&#21629;&#20196;&#34892;&#31243;&#24207;&#30340;&#34892;&#20026;&#26041;&#24335;&#20960;&#20046;&#23436;&#20840;&#19968;&#33268;&#65292;&#22914;&#26524;&#20320;&#30693;&#36947;&#22312;&#19968;&#20010;&#24179;&#21488;&#19978;&#22914;&#20309;&#36816;&#34892;<span class="command"><strong>svn</strong></span>&#65292;&#20320;&#20063;&#23601;&#23398;&#20250;&#20102;&#22312;&#20854;&#20182;&#24179;&#21488;&#19978;&#36816;&#34892;&#12290;</p>
      <p>&#28982;&#32780;&#65292;&#36825;&#19968;&#28857;&#22312;&#26412;&#36719;&#20214;&#30340;&#20854;&#20182;&#20960;&#31867;&#22320;&#26041;&#25110;Subversion&#20445;&#25345;&#30340;&#23454;&#38469;&#25991;&#20214;&#24182;&#19981;&#19968;&#23450;&#37117;&#26159;&#27491;&#30830;&#30340;&#12290;&#20363;&#22914;&#65292;&#22312;&#19968;&#20010;Windows&#31995;&#32479;&#65292;&#8220;<span class="quote">&#25991;&#26412;&#25991;&#20214;</span>&#8221;&#30340;&#23450;&#20041;&#19982;Linux&#29615;&#22659;&#19979;&#30340;&#31867;&#20284;&#65292;&#20294;&#26159;&#20063;&#26377;&#21306;&#21035;&#8212;&#34892;&#32467;&#26463;&#30340;&#23383;&#31526;&#20018;&#24182;&#19981;&#30456;&#21516;&#12290;&#24403;&#28982;&#20063;&#26377;&#20854;&#20182;&#30340;&#21306;&#21035;&#65292;Unix&#24179;&#21488;&#25903;&#25345;(Subversion&#20063;&#25903;&#25345;)&#31526;&#21495;&#38142;&#65307;Windows&#19981;&#30693;&#21507;&#65292;Unix&#20351;&#29992;&#25991;&#20214;&#31995;&#32479;&#25191;&#34892;&#20301;&#26469;&#26816;&#27979;&#21487;&#25191;&#34892;&#24615;&#65307;&#32780;Windows&#20351;&#29992;&#25991;&#20214;&#25193;&#23637;&#21517;&#12290;</p>
      <p>&#22240;&#20026;Subversion&#19981;&#26159;&#35201;&#23558;&#19990;&#30028;&#19978;&#30340;&#25152;&#26377;&#27492;&#31867;&#20107;&#24773;&#32479;&#19968;&#36215;&#26469;&#65292;&#25152;&#20197;&#25105;&#20204;&#26368;&#22909;&#26159;&#23613;&#21487;&#33021;&#35753;&#25105;&#20204;&#22312;&#22810;&#20010;&#35745;&#31639;&#26426;&#21644;&#25805;&#20316;&#31995;&#32479;&#19978;&#20351;&#29992;&#29256;&#26412;&#21270;&#25991;&#20214;&#21644;&#30446;&#24405;&#26102;&#33021;&#22815;&#26356;&#31616;&#21333;&#65292;&#26412;&#33410;&#25551;&#36848;&#20102;Subversion&#26159;&#22914;&#20309;&#20570;&#30340;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.props.special.mime-type"></a>&#25991;&#20214;&#20869;&#23481;&#31867;&#22411;</h3></div></div></div>
        
        <p>Subversion&#21516;&#24456;&#22810;&#24212;&#29992;&#19968;&#26679;&#21033;&#29992;&#22810;&#29992;&#36884;&#32593;&#38469;&#37038;&#20214;&#25193;&#23637;(MIME)&#20869;&#23481;&#31867;&#22411;&#65292;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#20026;Subversion&#30340;&#35768;&#22810;&#30446;&#30340;&#26381;&#21153;&#65292;&#38500;&#20102;&#20445;&#23384;&#19968;&#20010;&#25991;&#20214;&#30340;MIME&#20998;&#31867;&#20197;&#22806;&#65292;&#36825;&#20010;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#20540;&#20063;&#25551;&#36848;&#20102;&#19968;&#20123;Subversion&#33258;&#24049;&#20351;&#29992;&#30340;&#34892;&#20026;&#29305;&#24615;&#12290;</p>
        <div class="sidebar"><p class="title"><b>&#35782;&#21035;&#25991;&#20214;&#31867;&#22411;</b></p>
          
          <p>&#22823;&#22810;&#25968;&#29616;&#20195;&#25805;&#20316;&#31995;&#32479;&#36890;&#36807;&#25991;&#20214;&#21517;&#30340;&#25193;&#23637;&#21517;&#25512;&#26029;&#25991;&#20214;&#30340;&#31867;&#22411;&#21644;&#26684;&#24335;&#65292;&#20363;&#22914;&#65292;&#20197;<code class="filename">.txt</code>&#20026;&#21518;&#32512;&#30340;&#25991;&#20214;&#36890;&#24120;&#34987;&#35748;&#20026;&#26159;&#21487;&#35835;&#30340;&#65292;&#19981;&#38656;&#35201;&#36890;&#36807;&#22797;&#26434;&#30340;&#35299;&#30721;&#22788;&#29702;&#23601;&#21487;&#20197;&#34987;&#38405;&#35835;&#12290;&#23545;&#20110;&#21518;&#32512;&#21517;&#20026;<code class="filename">.png</code>&#25991;&#20214;&#65292;&#21017;&#34987;&#35748;&#20026;&#26159;Portable Network Graphics&#31867;&#22411;&#8212;&#19981;&#26159;&#21487;&#35835;&#30340;&#26684;&#24335;&#65292;&#21482;&#33021;&#36890;&#36807;&#35782;&#21035;PNG&#26684;&#24335;&#24182;&#19988;&#21487;&#20197;&#23558;&#20449;&#24687;&#36716;&#21270;&#20026;&#20809;&#26629;&#30340;&#36719;&#20214;&#20351;&#29992;&#12290;</p>
          <p>&#19981;&#24184;&#30340;&#26159;&#65292;&#19968;&#20123;&#25193;&#23637;&#21517;&#24050;&#32463;&#38543;&#26102;&#38388;&#25913;&#21464;&#20102;&#24847;&#20041;&#12290;&#24403;&#20010;&#20154;&#30005;&#33041;&#31532;&#19968;&#27425;&#20986;&#29616;&#26102;&#65292;&#19968;&#20010;&#21483;&#20570;<code class="filename">README.DOC</code>&#30340;&#25991;&#20214;&#19968;&#23450;&#26159;&#19968;&#20010;&#32431;&#25991;&#26412;&#25991;&#20214;&#20102;&#65292;&#23601;&#20687;&#29616;&#22312;&#30340;<code class="filename">.txt</code>&#25991;&#20214;&#12290;&#20294;&#26159;&#22312;&#20061;&#21313;&#24180;&#20195;&#20013;&#26399;&#65292;&#20320;&#21487;&#20197;&#25171;&#36172;&#36825;&#20010;&#25991;&#20214;&#24050;&#32463;&#19981;&#26159;&#25991;&#26412;&#25991;&#20214;&#65292;&#32780;&#21464;&#25104;&#20102;&#24494;&#36719;&#30340;&#31169;&#26377;&#30340;&#12289;&#19981;&#21487;&#35835;&#30340;Word&#25991;&#26723;&#26684;&#24335;&#12290;&#20294;&#26159;&#36825;&#20010;&#21464;&#21270;&#19981;&#26159;&#19968;&#22812;&#23436;&#25104;&#30340;&#8212;&#22312;&#19968;&#27573;&#26102;&#38388;&#37324;&#19968;&#23450;&#20250;&#26377;&#29992;&#25143;&#22312;&#30475;&#21040;&#19968;&#20010;<code class="filename">.DOC</code>&#26102;&#24863;&#21040;&#22256;&#24785;&#12290;<sup>[<a name="d4e1908" href="#ftn.d4e1908" class="footnote">11</a>]</sup></p>
          <p>&#35745;&#31639;&#26426;&#32593;&#32476;&#30340;&#26222;&#21450;&#23548;&#33268;&#23545;&#20110;&#25991;&#20214;&#21517;&#21644;&#20854;&#20851;&#32852;&#20869;&#23481;&#30340;&#26356;&#22810;&#28151;&#28102;&#65292;&#24403;&#20449;&#24687;&#23384;&#25918;&#22312;&#32593;&#32476;&#19978;&#24182;&#30001;&#26381;&#21153;&#22120;&#33050;&#26412;&#21160;&#24577;&#29983;&#25104;&#26102;&#65292;&#20250;&#27809;&#26377;&#25991;&#20214;&#21517;&#12290;Web&#26381;&#21153;&#22120;&#65292;&#38656;&#35201;&#20351;&#29992;&#20854;&#20182;&#26041;&#24335;&#21578;&#35785;&#27983;&#35272;&#22120;&#23427;&#20204;&#25152;&#35831;&#27714;&#20869;&#23481;&#30340;&#20449;&#24687;&#65292;&#36825;&#26679;&#27983;&#35272;&#22120;&#25165;&#33021;&#26234;&#33021;&#30340;&#26681;&#25454;&#20449;&#24687;&#20316;&#19968;&#20123;&#20107;&#24773;&#65292;&#25110;&#32773;&#26159;&#20351;&#29992;&#27880;&#20876;&#30340;&#31243;&#24207;&#26174;&#31034;&#25968;&#25454;&#65292;&#25110;&#32773;&#26159;&#25552;&#31034;&#29992;&#25143;&#23558;&#25991;&#20214;&#19979;&#36733;&#21040;&#26576;&#20010;&#22320;&#26041;&#12290;</p>
          <p>&#26368;&#32456;&#65292;&#19968;&#20010;&#25551;&#36848;&#25968;&#25454;&#27969;&#20869;&#23481;&#30340;&#26631;&#20934;&#20986;&#29616;&#20102;&#12290;1996&#24180;&#65292;5&#20010;&#25551;&#36848;MIME&#30340;RFC&#20013;&#30340;&#31532;&#19968;&#20010;RFC2045&#21457;&#24067;&#20102;&#65292;&#36825;&#20010;RFC&#25551;&#36848;&#20102;&#23186;&#20307;&#31867;&#22411;&#21644;&#23376;&#31867;&#22411;&#27010;&#24565;&#65292;&#24182;&#19988;&#25552;&#20986;&#20102;&#34920;&#31034;&#36825;&#20123;&#31867;&#22411;&#30340;&#25512;&#33616;&#35821;&#27861;&#12290;&#29616;&#22312;&#65292;MIME&#23186;&#20307;&#31867;&#22411;&#8212;MIME&#31867;&#22411;&#24050;&#32463;&#24191;&#27867;&#24212;&#29992;&#22312;&#30005;&#37038;&#24212;&#29992;&#65292;Web&#26381;&#21153;&#22120;&#21644;&#20854;&#20182;&#36719;&#20214;&#65292;&#25104;&#20026;&#20102;&#38450;&#27490;&#25991;&#20214;&#20869;&#23481;&#28151;&#28102;&#30340;&#26631;&#20934;&#26426;&#21046;&#12290;</p>
        </div>
        <p>&#20030;&#20010;&#20363;&#23376;&#65292;&#19968;&#20010;&#22909;&#22788;&#23601;&#26159;Subversion&#22312;&#26356;&#26032;&#26102;&#36890;&#24120;&#21487;&#20197;&#25552;&#20379;&#22522;&#20110;&#19978;&#19979;&#25991;&#30340;&#34892;&#20026;&#22522;&#30784;&#30340;&#21512;&#24182;&#65292;&#22914;&#26524;&#19968;&#20010;&#25991;&#20214;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#35774;&#32622;&#20026;&#38750;&#25991;&#26412;&#30340;MIME&#31867;&#22411;(&#36890;&#24120;&#26159;&#37027;&#20123;&#19981;&#26159;<code class="literal">text/</code>&#24320;&#22836;&#30340;&#31867;&#22411;&#65292;&#20294;&#20063;&#26377;&#20363;&#22806;)&#65292;Subversion&#20250;&#20551;&#23450;&#36825;&#20010;&#25991;&#20214;&#20445;&#23384;&#20102;&#20108;&#36827;&#21046;&#20869;&#23481;&#8212;&#20063;&#23601;&#26159;&#19981;&#21487;&#35835;&#30340;&#25968;&#25454;&#12290;&#19968;&#20010;&#22909;&#22788;&#23601;&#26159;Subversion&#36890;&#24120;&#22312;&#26356;&#26032;&#24037;&#20316;&#25335;&#36125;&#26102;&#25552;&#20379;&#20102;&#19968;&#20010;&#21069;&#21518;&#30456;&#20851;&#30340;&#20197;&#34892;&#20026;&#22522;&#30784;&#30340;&#20462;&#25913;&#21512;&#24182;&#65292;&#20294;&#26159;&#23545;&#20110;&#20108;&#36827;&#21046;&#25968;&#25454;&#25991;&#20214;&#65292;&#27809;&#26377;&#8220;<span class="quote">&#34892;</span>&#8221;&#30340;&#27010;&#24565;&#65292;&#25152;&#20197;&#23545;&#36825;&#20123;&#25991;&#20214;&#65292;Subversion&#19981;&#20250;&#22312;&#26356;&#26032;&#26102;&#23581;&#35797;&#25191;&#34892;&#21512;&#24182;&#25805;&#20316;&#65292;&#30456;&#21453;&#65292;&#20219;&#20309;&#26102;&#20505;&#20320;&#22312;&#26412;&#22320;&#24050;&#32463;&#20462;&#25913;&#30340;&#19968;&#20010;&#20108;&#36827;&#21046;&#25991;&#20214;&#26377;&#20102;&#26356;&#26032;&#65292;&#20320;&#30340;&#25991;&#20214;&#25193;&#23637;&#21517;&#20250;&#20462;&#25913;&#20026;<code class="filename">.orig</code>&#65292;&#28982;&#21518;Subversion&#20445;&#23384;&#19968;&#20010;&#26032;&#30340;&#24037;&#20316;&#25335;&#36125;&#25991;&#20214;&#26469;&#20445;&#23384;&#26356;&#26032;&#26102;&#24471;&#21040;&#30340;&#20462;&#25913;&#65292;&#20294;&#21407;&#26469;&#30340;&#25991;&#20214;&#21517;&#24050;&#32463;&#19981;&#26159;&#20320;&#33258;&#24049;&#30340;&#26412;&#22320;&#20462;&#25913;&#12290;&#36825;&#20010;&#34892;&#20026;&#27169;&#24335;&#26159;&#29992;&#26469;&#20445;&#25252;&#29992;&#25143;&#22312;&#23545;&#19981;&#21487;&#25991;&#26412;&#21512;&#24182;&#30340;&#25991;&#20214;&#23581;&#35797;&#25191;&#34892;&#25991;&#26412;&#30340;&#21512;&#24182;&#26102;&#22833;&#36133;&#30340;&#24773;&#24418;&#12290;</p>
        <p>&#21478;&#22806;&#65292;&#22914;&#26524;&#35774;&#32622;&#20102;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#65292;Subversion&#30340;Apache&#27169;&#22359;&#20250;&#20351;&#29992;&#36825;&#20010;&#20540;&#26469;&#22312;HTTP&#22836;&#37324;&#36755;&#20837;<code class="literal">Content-type:</code>&#65292;&#36825;&#32473;&#20102;web&#27983;&#35272;&#22120;&#22914;&#20309;&#26174;&#31034;&#29256;&#26412;&#24211;&#30340;&#19968;&#20010;&#25991;&#20214;&#25552;&#20379;&#20102;&#33267;&#20851;&#37325;&#35201;&#30340;&#32447;&#32034;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.props.special.executable"></a>&#25991;&#20214;&#30340;&#21487;&#25191;&#34892;&#24615;</h3></div></div></div>
        
        <p>&#22312;&#22810;&#25968;&#25805;&#20316;&#31995;&#32479;&#65292;&#25191;&#34892;&#19968;&#20010;&#25991;&#20214;&#25110;&#21629;&#20196;&#30340;&#33021;&#21147;&#26159;&#30001;&#25191;&#34892;&#20301;&#31649;&#29702;&#30340;&#65292;&#36825;&#20123;&#20301;&#32570;&#30465;&#26159;&#20851;&#38381;&#30340;&#65292;&#24517;&#39035;&#30001;&#29992;&#25143;&#26681;&#25454;&#38656;&#35201;&#26174;&#24335;&#30340;&#25351;&#23450;&#65292;&#20294;&#26159;&#35760;&#20303;&#24212;&#35813;&#20026;&#21738;&#20123;&#26816;&#20986;&#30340;&#25991;&#20214;&#35774;&#32622;&#21487;&#25191;&#34892;&#20301;&#20250;&#26159;&#19968;&#20214;&#24456;&#40635;&#28902;&#30340;&#20107;&#24773;&#65292;&#25152;&#20197;Subversion&#25552;&#20379;&#20102;<code class="literal">svn:executable</code>&#36825;&#20010;&#23646;&#24615;&#26469;&#20445;&#25345;&#25171;&#24320;&#25191;&#34892;&#20301;&#65292;&#22312;&#24037;&#20316;&#25335;&#36125;&#24471;&#21040;&#36825;&#20123;&#25991;&#20214;&#26102;&#35774;&#32622;&#25191;&#34892;&#20301;&#12290;</p>
        <p>&#36825;&#20010;&#23646;&#24615;&#23545;&#20110;&#27809;&#26377;&#21487;&#25191;&#34892;&#26435;&#38480;&#20301;&#30340;&#25991;&#20214;&#31995;&#32479;&#26080;&#25928;&#65292;&#22914;FAT32&#21644;NTFS&#12290; <sup>[<a name="d4e1928" href="#ftn.d4e1928" class="footnote">12</a>]</sup>&#20063;&#23601;&#26159;&#35828;&#65292;&#23613;&#31649;&#23427;&#27809;&#26377;&#23450;&#20041;&#30340;&#20540;&#65292;&#22312;&#35774;&#32622;&#36825;&#20010;&#23646;&#24615;&#26102;&#65292;Subversion&#20250;&#24378;&#21046;&#23427;&#30340;&#20540;&#20026;<code class="literal">*</code>&#65292;&#26368;&#21518;&#65292;&#36825;&#20010;&#23646;&#24615;&#21482;&#23545;&#25991;&#20214;&#26377;&#25928;&#65292;&#30446;&#24405;&#26080;&#25928;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.props.special.eol-style"></a>&#34892;&#32467;&#26463;&#23383;&#31526;&#24207;&#21015;</h3></div></div></div>
        
        <p>&#38500;&#38750;&#20351;&#29992;&#29256;&#26412;&#21270;&#25991;&#20214;&#30340;<code class="literal">svn:mime-type</code>&#23646;&#24615;&#27880;&#26126;&#65292;Subversion&#20250;&#20551;&#23450;&#36825;&#20010;&#25991;&#20214;&#20445;&#23384;&#20102;&#21487;&#35835;&#30340;&#25968;&#25454;&#65292;&#19968;&#33324;&#26469;&#35762;&#65292;Subversion&#21482;&#20351;&#29992;&#36825;&#20123;&#20449;&#24687;&#26469;&#21028;&#26029;&#19968;&#20010;&#25991;&#20214;&#26159;&#21542;&#21487;&#20197;&#29992;&#19978;&#19979;&#25991;&#21306;&#21035;&#30340;&#25253;&#21578;&#65292;&#21542;&#21017;&#65292;&#23545;Subversion&#26469;&#35828;&#21482;&#26159;&#23383;&#33410;&#12290;</p>
        <p>&#36825;&#24847;&#21619;&#30528;&#32570;&#30465;&#24773;&#20917;&#19979;&#65292;Subversion&#19981;&#20250;&#20851;&#27880;&#20219;&#20309;<em class="firstterm">&#34892;&#32467;&#26463;&#26631;&#35760;(end-of-line&#65292;EOL)</em>&#65292;&#19981;&#24184;&#30340;&#26159;&#19981;&#21516;&#30340;&#25805;&#20316;&#31995;&#32479;&#22312;&#25991;&#26412;&#25991;&#20214;&#20351;&#29992;&#19981;&#21516;&#30340;&#34892;&#32467;&#26463;&#26631;&#24535;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;Windows&#24179;&#21488;&#19979;&#30340;A&#32534;&#36753;&#24037;&#20855;&#20351;&#29992;&#19968;&#23545;ASCII&#25511;&#21046;&#23383;&#31526;&#8212;&#22238;&#36710;(<code class="literal">CR</code>)&#21644;&#19968;&#20010;&#25442;&#34892;(<code class="literal">LF</code>)&#65292;&#32780;Unix&#36719;&#20214;&#65292;&#21482;&#20351;&#29992;&#19968;&#20010;<code class="literal">LF</code>&#26469;&#34920;&#31034;&#19968;&#20010;&#34892;&#30340;&#32467;&#26463;&#12290;</p>
        <p>&#24182;&#19981;&#26159;&#25152;&#26377;&#25805;&#20316;&#31995;&#32479;&#30340;&#24037;&#20855;&#20934;&#22791;&#22909;&#20102;&#29702;&#35299;&#19982;<em class="firstterm">&#26412;&#22320;&#34892;&#32467;&#26463;&#26679;&#24335;</em>&#19981;&#19968;&#26679;&#30340;&#34892;&#32467;&#26463;&#26684;&#24335;&#65292;&#19968;&#20010;&#24120;&#35265;&#30340;&#32467;&#26524;&#26159;Unix&#31243;&#24207;&#20250;&#25226;Windows&#25991;&#20214;&#20013;&#30340;<code class="literal">CR</code>&#24403;&#20316;&#19968;&#20010;&#19981;&#21516;&#30340;&#23383;&#31526;(&#36890;&#24120;&#34920;&#29616;&#20026;<code class="literal">^M</code>)&#65292;&#32780;Windows&#31243;&#24207;&#20250;&#25226;Unix&#25991;&#20214;&#21512;&#24182;&#20026;&#19968;&#20010;&#38750;&#24120;&#22823;&#30340;&#34892;&#65292;&#22240;&#20026;&#27809;&#26377;&#21457;&#29616;&#26631;&#24535;&#34892;&#32467;&#26463;&#30340;&#22238;&#36710;&#21152;&#25442;&#34892;(&#25110;&#32773;&#26159;<code class="literal">CRLF</code>)&#23383;&#31526;&#12290;</p>
        <p>&#23545;&#22806;&#26469;EOL&#26631;&#24535;&#30340;&#25935;&#24863;&#20250;&#35753;&#22312;&#22810;&#31181;&#25805;&#20316;&#31995;&#32479;&#20998;&#20139;&#25991;&#20214;&#30340;&#20154;&#20204;&#24863;&#21040;&#27822;&#20007;&#65292;&#20363;&#22914;&#65292;&#32771;&#34385;&#26377;&#19968;&#20010;&#28304;&#20195;&#30721;&#25991;&#20214;&#65292;&#24320;&#21457;&#32773;&#20250;&#22312;Windows&#21644;Unix&#31995;&#32479;&#19978;&#32534;&#36753;&#36825;&#20010;&#25991;&#20214;&#65292;&#22914;&#26524;&#25152;&#26377;&#30340;&#29992;&#25143;&#20351;&#29992;&#30340;&#24037;&#20855;&#21487;&#20197;&#23637;&#31034;&#25991;&#20214;&#30340;&#34892;&#32467;&#26463;&#65292;&#37027;&#23601;&#27809;&#26377;&#38382;&#39064;&#20102;&#12290;</p>
        <p>&#20294;&#23454;&#36341;&#20013;&#65292;&#35768;&#22810;&#24120;&#29992;&#30340;&#24037;&#20855;&#19981;&#20250;&#27491;&#30830;&#30340;&#35835;&#21462;&#22806;&#26469;&#30340;EOL&#26631;&#24535;&#65292;&#25110;&#32773;&#21482;&#26159;&#22312;&#20445;&#23384;&#25991;&#20214;&#26102;&#23558;&#25991;&#20214;&#30340;&#34892;&#32467;&#26463;&#31526;&#36716;&#21270;&#20026;&#26412;&#22320;&#30340;&#26679;&#24335;&#65292;&#22914;&#26524;&#26159;&#21069;&#32773;&#65292;&#20182;&#38656;&#35201;&#19968;&#20010;&#22806;&#37096;&#30340;&#36716;&#21270;&#24037;&#20855;(&#22914;<span class="command"><strong>dos2unix</strong></span>&#65292;&#25110;&#26159;&#20182;&#30340;&#20276;&#20387;<span class="command"><strong>unix2dos</strong></span>)&#26469;&#20934;&#22791;&#38656;&#35201;&#32534;&#36753;&#30340;&#25991;&#20214;&#12290;&#21518;&#19968;&#31181;&#24773;&#20917;&#19981;&#38656;&#35201;&#39069;&#22806;&#30340;&#20934;&#22791;&#24037;&#20316;&#65292;&#20004;&#31181;&#26041;&#27861;&#37117;&#20250;&#36896;&#25104;&#25991;&#20214;&#20250;&#19982;&#21407;&#26469;&#30340;&#25991;&#20214;&#22312;&#27599;&#19968;&#34892;&#19978;&#37117;&#19981;&#19968;&#26679;&#65281;&#22312;&#25552;&#20132;&#20043;&#21069;&#65292;&#29992;&#25143;&#26377;&#20004;&#20010;&#36873;&#25321;&#65292;&#25110;&#32773;&#36873;&#25321;&#29992;&#19968;&#20010;&#36716;&#21270;&#24037;&#20855;&#24674;&#22797;&#25991;&#20214;&#30340;&#34892;&#32467;&#26463;&#26679;&#24335;&#65292;&#25110;&#32773;&#26159;&#31616;&#21333;&#30340;&#25552;&#20132;&#25991;&#20214;&#8212;&#21253;&#21547;&#26032;&#30340;EOL&#26631;&#24535;&#12290;</p>
        <p>&#36825;&#20010;&#24773;&#26223;&#30340;&#32467;&#23616;&#30475;&#36215;&#26469;&#20687;&#26159;&#35201;&#28010;&#36153;&#26102;&#38388;&#23545;&#25552;&#20132;&#30340;&#25991;&#20214;&#20316;&#19981;&#24517;&#35201;&#30340;&#20462;&#25913;&#65292;&#28010;&#36153;&#26102;&#38388;&#26159;&#30171;&#33510;&#30340;&#65292;&#20294;&#26159;&#22914;&#26524;&#25552;&#20132;&#20462;&#25913;&#20102;&#25991;&#20214;&#30340;&#27599;&#19968;&#34892;&#65292;&#21028;&#26029;&#25991;&#20214;&#20462;&#25913;&#20102;&#21738;&#19968;&#34892;&#20250;&#26159;&#19968;&#20214;&#22797;&#26434;&#30340;&#24037;&#20316;&#65292;bug&#22312;&#21738;&#19968;&#34892;&#20462;&#27491;&#30340;&#65311;&#21738;&#19968;&#34892;&#23548;&#33268;&#20102;&#35821;&#27861;&#38169;&#35823;&#65311;</p>
        <p>&#36825;&#20010;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;<code class="literal">svn:eol-style</code>&#23646;&#24615;&#65292;&#24403;&#36825;&#20010;&#23646;&#24615;&#35774;&#32622;&#20026;&#19968;&#20010;&#27491;&#30830;&#30340;&#20540;&#26102;&#65292;Subversion&#20351;&#29992;&#23427;&#26469;&#21028;&#26029;&#38024;&#23545;&#34892;&#32467;&#26463;&#26679;&#24335;&#25191;&#34892;&#20309;&#31181;&#29305;&#27530;&#30340;&#25805;&#20316;&#65292;&#32780;&#19981;&#20250;&#38543;&#30528;&#22810;&#31181;&#25805;&#20316;&#31995;&#32479;&#30340;&#27599;&#27425;&#25552;&#20132;&#32780;&#21457;&#29983;&#21095;&#28872;&#21464;&#21270;&#65292;&#27491;&#30830;&#30340;&#20540;&#26377;&#65306;</p>
        <div class="variablelist"><dl><dt><span class="term">
              <code class="literal">native</code>
            </span></dt><dd>
              <p>&#36825;&#20250;&#23548;&#33268;&#20445;&#23384;EOL&#26631;&#24535;&#30340;&#25991;&#20214;&#20351;&#29992;Subversion&#36816;&#34892;&#30340;&#25805;&#20316;&#31995;&#32479;&#30340;&#26412;&#22320;&#32534;&#30721;&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;&#22914;&#26524;&#19968;&#20010;Windows&#29992;&#25143;&#21462;&#20986;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#21253;&#21547;&#30340;&#25991;&#20214;&#35774;&#32622;<code class="literal">native</code>&#30340;&#23646;&#24615;&#20026;<code class="literal">svn:eol-style</code>&#65292;&#36825;&#20010;&#25991;&#20214;&#20250;&#20351;&#29992;<code class="literal">CRLF</code>&#30340;EOL&#26631;&#24535;&#65292;&#19968;&#20010;Unix&#29992;&#25143;&#21462;&#20986;&#30456;&#21516;&#30340;&#25991;&#20214;&#20250;&#30475;&#21040;&#20182;&#30340;&#25991;&#20214;&#20351;&#29992;<code class="literal">LF</code>&#30340;EOL&#26631;&#24535;&#12290;</p>
              <p>&#27880;&#24847;Subversion&#23454;&#38469;&#19978;&#20351;&#29992;<code class="literal">LF</code>&#30340;EOL&#26631;&#24535;&#65292;&#32780;&#19981;&#20250;&#32771;&#30053;&#25805;&#20316;&#31995;&#32479;&#65292;&#23613;&#31649;&#36825;&#23545;&#29992;&#25143;&#26469;&#35828;&#26159;&#36879;&#26126;&#30340;&#12290;</p>
            </dd><dt><span class="term">
              <code class="literal">CRLF</code>
            </span></dt><dd>
              <p>&#36825;&#20250;&#23548;&#33268;&#36825;&#20010;&#25991;&#20214;&#20351;&#29992;<code class="literal">CRLF</code>&#24207;&#21015;&#20316;&#20026;EOL&#26631;&#24535;&#65292;&#19981;&#31649;&#20351;&#29992;&#20309;&#31181;&#25805;&#20316;&#31995;&#32479;&#12290;</p>
            </dd><dt><span class="term">
              <code class="literal">LF</code>
            </span></dt><dd>
              <p>&#36825;&#20250;&#23548;&#33268;&#25991;&#20214;&#20351;&#29992;<code class="literal">LF</code>&#23383;&#31526;&#20316;&#20026;EOL&#26631;&#24535;&#65292;&#19981;&#31649;&#20351;&#29992;&#20309;&#31181;&#25805;&#20316;&#31995;&#32479;&#12290;</p>
            </dd><dt><span class="term">
              <code class="literal">CR</code>
            </span></dt><dd>
              <p>&#36825;&#20250;&#23548;&#33268;&#25991;&#20214;&#20351;&#29992;<code class="literal">CR</code>&#23383;&#31526;&#20316;&#20026;EOL&#26631;&#24535;&#65292;&#19981;&#31649;&#20351;&#29992;&#20309;&#31181;&#25805;&#20316;&#31995;&#32479;&#12290;&#36825;&#31181;&#34892;&#32467;&#26463;&#26679;&#24335;&#19981;&#26159;&#24456;&#24120;&#35265;&#65292;&#23427;&#29992;&#22312;&#19968;&#20123;&#32769;&#30340;&#33529;&#26524;&#26426;(Subversion&#19981;&#20250;&#36816;&#34892;&#30340;&#26426;&#22120;&#19978;)&#19978;&#12290;</p>
            </dd></dl></div>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e1908" href="#d4e1908" class="para">11</a>] </sup>&#20320;&#35748;&#20026;&#37027;&#26679;&#36807;&#20110;&#31895;&#29378;&#65311;&#22312;&#21516;&#19968;&#20010;&#26102;&#20195;&#37324;&#65292;WordPerfect&#20063;&#20351;&#29992;<code class="filename">.DOC</code>&#20316;&#20026;&#23427;&#20204;&#31169;&#26377;&#25991;&#20214;&#26684;&#24335;&#30340;&#25193;&#23637;&#21517;&#65281;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e1928" href="#d4e1928" class="para">12</a>] </sup>Windows&#25991;&#20214;&#31995;&#32479;&#20351;&#29992;&#25991;&#20214;&#25193;&#23637;&#21517;(&#22914;<code class="literal">.EXE</code>&#12289;<code class="literal">.BAT</code>&#21644;<code class="literal">.COM</code>)&#26469;&#26631;&#31034;&#21487;&#25191;&#34892;&#25991;&#20214;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.advanced.props.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.advanced.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.props.special.ignore.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#23646;&#24615;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#24573;&#30053;&#26410;&#29256;&#26412;&#25511;&#21046;&#30340;&#26465;&#30446;</td></tr></table></div></body></html>