<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#22806;&#37096;&#23450;&#20041;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="svn.advanced.locking.html" title="&#38145;&#23450;"><link rel="next" href="svn.advanced.pegrevs.html" title="Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#22806;&#37096;&#23450;&#20041;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.advanced.locking.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.pegrevs.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.externals"></a>&#22806;&#37096;&#23450;&#20041;</h2></div></div></div>
      
      <p>&#26377;&#26102;&#20505;&#21019;&#24314;&#19968;&#20010;&#30001;&#22810;&#20010;&#19981;&#21516;&#26816;&#20986;&#24471;&#21040;&#30340;&#24037;&#20316;&#25335;&#36125;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#65292;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#25110;&#35768;&#24076;&#26395;&#19981;&#21516;&#30340;&#23376;&#30446;&#24405;&#26469;&#33258;&#19981;&#21516;&#30340;&#29256;&#26412;&#24211;&#20301;&#32622;&#65292;&#25110;&#32773;&#26159;&#19981;&#21516;&#30340;&#29256;&#26412;&#24211;&#12290;&#20320;&#21487;&#20197;&#25163;&#24037;&#35774;&#32622;&#36825;&#26679;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#8212;&#20351;&#29992;<span class="command"><strong>svn checkout</strong></span>&#26469;&#21019;&#24314;&#36825;&#31181;&#20320;&#38656;&#35201;&#30340;&#23884;&#22871;&#30340;&#24037;&#20316;&#25335;&#36125;&#32467;&#26500;&#12290;&#20294;&#26159;&#22914;&#26524;&#36825;&#20010;&#32467;&#26500;&#23545;&#25152;&#26377;&#30340;&#29992;&#25143;&#26159;&#24456;&#37325;&#35201;&#30340;&#65292;&#27599;&#20010;&#29992;&#25143;&#38656;&#35201;&#25191;&#34892;&#21516;&#26679;&#30340;&#26816;&#20986;&#25805;&#20316;&#12290;</p>
      <p>&#24456;&#24184;&#36816;&#65292;Subversion&#25552;&#20379;&#20102;<em class="firstterm">&#22806;&#37096;&#23450;&#20041;</em>&#30340;&#25903;&#25345;&#65292;&#19968;&#20010;&#22806;&#37096;&#23450;&#20041;&#26159;&#19968;&#20010;&#26412;&#22320;&#36335;&#32463;&#21040;URL&#30340;&#24433;&#23556;&#8212;&#20063;&#26377;&#21487;&#33021;&#19968;&#20010;&#29305;&#23450;&#30340;&#20462;&#35746;&#29256;&#26412;&#8212;&#19968;&#20123;&#29256;&#26412;&#21270;&#30340;&#36164;&#28304;&#12290;&#22312;Subversion&#20320;&#21487;&#20197;&#20351;&#29992;<code class="literal">svn:externals</code>&#23646;&#24615;&#26469;&#23450;&#20041;&#22806;&#37096;&#23450;&#20041;&#65292;&#20320;&#21487;&#20197;&#29992;<span class="command"><strong>svn propset</strong></span>&#25110;<span class="command"><strong>svn propedit</strong></span>(&#35265;<a class="xref" href="svn.advanced.props.html#svn.advanced.props.manip" title="&#25805;&#20316;&#23646;&#24615;">&#8220;&#25805;&#20316;&#23646;&#24615;&#8221;&#19968;&#33410;</a>)&#21019;&#24314;&#21644;&#20462;&#25913;&#36825;&#20010;&#23646;&#24615;&#12290;&#23427;&#21487;&#20197;&#35774;&#32622;&#21040;&#20219;&#20309;&#29256;&#26412;&#21270;&#30340;&#36335;&#32463;&#65292;&#23427;&#30340;&#20540;&#26159;&#19968;&#20010;&#22810;&#34892;&#30340;&#23376;&#30446;&#24405;&#65292;&#21487;&#36873;&#30340;&#20462;&#35746;&#29256;&#26412;&#26631;&#35760;&#21644;&#23436;&#20840;&#26377;&#25928;&#30340;Subversion&#29256;&#26412;&#24211;URL&#30340;&#21015;&#34920;(&#30456;&#23545;&#20110;&#35774;&#32622;&#23646;&#24615;&#30340;&#29256;&#26412;&#21270;&#30446;&#24405;)&#12290;</p>
      <pre class="screen">
$ svn propget svn:externals calc
third-party/sounds             http://sounds.red-bean.com/repos
third-party/skins              http://skins.red-bean.com/repositories/skinproj
third-party/skins/toolkit -r21 http://svn.red-bean.com/repos/skin-maker
</pre>
      <p><code class="literal">svn:externals</code>&#30340;&#26041;&#20415;&#20043;&#22788;&#26159;&#36825;&#20010;&#23646;&#24615;&#35774;&#32622;&#21040;&#29256;&#26412;&#21270;&#30340;&#36335;&#24452;&#21518;&#65292;&#20219;&#20309;&#20154;&#21487;&#20197;&#20174;&#37027;&#20010;&#30446;&#24405;&#21462;&#20986;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#65292;&#21516;&#26679;&#24471;&#21040;&#22806;&#37096;&#23450;&#20041;&#30340;&#22909;&#22788;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#19968;&#26086;&#19968;&#20010;&#20154;&#21162;&#21147;&#26469;&#23450;&#20041;&#36825;&#20123;&#23884;&#22871;&#30340;&#24037;&#20316;&#25335;&#36125;&#26816;&#20986;&#65292;&#20854;&#20182;&#20219;&#20309;&#20154;&#19981;&#38656;&#35201;&#20877;&#40635;&#28902;&#20102;&#8212;Subversion&#20250;&#22312;&#21407;&#20808;&#30340;&#24037;&#20316;&#25335;&#36125;&#26816;&#20986;&#20043;&#21518;&#65292;&#20063;&#20250;&#26816;&#20986;&#22806;&#37096;&#24037;&#20316;&#25335;&#36125;&#12290;</p>
      <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#35686;&#21578;</h3>
        <p>&#22806;&#37096;&#23450;&#20041;&#30340;&#30456;&#23545;&#30446;&#26631;&#23376;&#30446;&#24405;&#19981;&#38656;&#35201;&#23384;&#22312;&#20110;&#20320;&#30340;&#25110;&#20854;&#23427;&#29992;&#25143;&#30340;&#31995;&#32479;&#20013;&#8212;Subversion&#20250;&#22312;&#26816;&#20986;&#24037;&#20316;&#25335;&#36125;&#26102;&#21019;&#24314;&#36825;&#20123;&#25991;&#20214;&#12290;&#23454;&#38469;&#19978;&#65292;&#20320;&#19968;&#23450;&#19981;&#35201;&#20351;&#29992;&#22806;&#37096;&#23450;&#20041;&#26469;&#20135;&#29983;&#24050;&#32463;&#22312;&#29256;&#26412;&#25511;&#21046;&#30340;&#36335;&#24452;&#12290;</p>
      </div>
      <p>&#27880;&#24847;&#21069;&#19968;&#20010;&#22806;&#37096;&#23450;&#20041;&#23454;&#20363;&#65292;&#24403;&#26377;&#20154;&#21462;&#20986;&#20102;&#19968;&#20010;<code class="filename">calc</code>&#30446;&#24405;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;Subversion&#20250;&#32487;&#32493;&#26469;&#21462;&#20986;&#22806;&#37096;&#23450;&#20041;&#30340;&#39033;&#30446;&#12290;</p>
      <pre class="screen">
$ svn checkout http://svn.example.com/repos/calc
A  calc
A  calc/Makefile
A  calc/integer.c
A  calc/button.c
Checked out revision 148.

Fetching external item into calc/third-party/sounds
A  calc/third-party/sounds/ding.ogg
A  calc/third-party/sounds/dong.ogg
A  calc/third-party/sounds/clang.ogg
&#8230;
A  calc/third-party/sounds/bang.ogg
A  calc/third-party/sounds/twang.ogg
Checked out revision 14.

Fetching external item into calc/third-party/skins
&#8230;
</pre>
      <p>&#22914;&#26524;&#20320;&#24076;&#26395;&#20462;&#25913;&#22806;&#37096;&#23450;&#20041;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#26222;&#36890;&#30340;&#23646;&#24615;&#20462;&#25913;&#23376;&#21629;&#20196;&#65292;&#24403;&#20320;&#25552;&#20132;&#19968;&#20010;<code class="literal">svn:externals</code>&#23646;&#24615;&#20462;&#25913;&#21518;&#65292;&#24403;&#20320;&#36816;&#34892;<span class="command"><strong>svn update</strong></span>&#26102;&#65292;Subversion&#20250;&#26681;&#25454;&#20462;&#25913;&#30340;&#22806;&#37096;&#23450;&#20041;&#21516;&#27493;&#26816;&#20986;&#30340;&#39033;&#30446;&#65292;&#21516;&#26679;&#30340;&#20107;&#24773;&#20063;&#20250;&#21457;&#29983;&#22312;&#21035;&#20154;&#26356;&#26032;&#20182;&#20204;&#30340;&#24037;&#20316;&#25335;&#36125;&#25509;&#21463;&#20320;&#30340;&#22806;&#37096;&#23450;&#20041;&#20462;&#25913;&#26102;&#12290;</p>
      <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
        <p>&#22240;&#20026;<code class="literal">svn:externals</code>&#30340;&#20540;&#26159;&#22810;&#34892;&#30340;&#65292;&#25152;&#20197;&#25105;&#20204;&#24378;&#28872;&#24314;&#35758;&#20351;&#29992;<span class="command"><strong>svn propedit</strong></span>&#65292;&#32780;&#19981;&#26159;&#20351;&#29992;<span class="command"><strong>svn propset</strong></span>&#12290;</p>
      </div>
      <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
        <p>&#20320;&#19968;&#23450;&#35201;&#35201;&#32771;&#34385;&#22312;&#25152;&#26377;&#30340;&#22806;&#37096;&#23450;&#20041;&#20013;&#20351;&#29992;&#26126;&#30830;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#36825;&#26679;&#20570;&#24847;&#21619;&#30528;&#20320;&#24050;&#32463;&#20915;&#23450;&#20102;&#20309;&#26102;&#25302;&#20986;&#22806;&#37096;&#20449;&#24687;&#19981;&#21516;&#30340;&#24555;&#29031;&#65292;&#21644;&#31934;&#30830;&#30340;&#25302;&#20986;&#21738;&#20010;&#24555;&#29031;&#12290;&#38500;&#20102;&#19981;&#20250;&#21463;&#21040;&#31532;&#19977;&#26041;&#29256;&#26412;&#24211;&#30340;&#24847;&#22806;&#20462;&#25913;&#30340;&#24433;&#21709;&#20197;&#22806;&#65292;&#24403;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#22238;&#28335;&#21040;&#20197;&#21069;&#30340;&#29256;&#26412;&#24211;&#26102;&#65292;&#20351;&#29992;&#26126;&#30830;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#20250;&#35753;&#22806;&#37096;&#23450;&#20041;&#22238;&#21040;&#20197;&#21069;&#30340;&#37027;&#20010;&#20462;&#35746;&#29256;&#26412;&#65292;&#20063;&#24847;&#21619;&#30528;&#22806;&#37096;&#23450;&#20041;&#30340;&#24037;&#20316;&#25335;&#36125;&#26356;&#26032;&#20250;&#21305;&#37197;&#20197;&#21069;&#20462;&#35746;&#29256;&#26412;&#30340;&#26679;&#23376;&#12290;&#23545;&#20110;&#36719;&#20214;&#39033;&#30446;&#65292;&#36825;&#21487;&#33021;&#26159;&#32534;&#35793;&#22797;&#26434;&#20195;&#30721;&#22522;&#30340;&#32769;&#24555;&#29031;&#25104;&#21151;&#21644;&#22833;&#36133;&#30340;&#21306;&#21035;&#12290;</p>
      </div>
      <p><span class="command"><strong>svn status</strong></span>&#21629;&#20196;&#20063;&#35748;&#35782;&#22806;&#37096;&#23450;&#20041;&#65292;&#20250;&#20026;&#22806;&#37096;&#23450;&#20041;&#30340;&#23376;&#30446;&#24405;&#26174;&#31034;<code class="literal">X</code>&#29366;&#24577;&#30721;&#65292;&#28982;&#21518;&#36845;&#20195;&#36825;&#20123;&#23376;&#30446;&#24405;&#26469;&#26174;&#31034;&#22806;&#37096;&#39033;&#30446;&#30340;&#23376;&#30446;&#24405;&#29366;&#24577;&#20449;&#24687;&#12290;</p>
      <p>Subversion&#30446;&#21069;&#23545;&#22806;&#37096;&#23450;&#20041;&#30340;&#25903;&#25345;&#21487;&#33021;&#20250;&#24341;&#36215;&#35823;&#23548;&#65292;&#39318;&#20808;&#65292;&#19968;&#20010;&#22806;&#37096;&#23450;&#20041;&#21482;&#21487;&#20197;&#25351;&#21521;&#30446;&#24405;&#65292;&#32780;&#19981;&#26159;&#25991;&#20214;&#12290;&#31532;&#20108;&#65292;&#22806;&#37096;&#23450;&#20041;&#19981;&#21487;&#20197;&#25351;&#21521;&#30456;&#23545;&#36335;&#24452;(&#22914;<code class="filename">../../skins/myskin</code>)&#12290;&#31532;&#19977;&#65292;&#36890;&#36807;&#22806;&#37096;&#23450;&#20041;&#21019;&#24314;&#30340;&#24037;&#20316;&#25335;&#36125;&#19982;&#20027;&#24037;&#20316;&#25335;&#36125;&#27809;&#26377;&#36830;&#25509;&#36215;&#26469;(&#19982;&#35774;&#32622;<code class="literal">svn:externals</code>&#23646;&#24615;&#30340;&#24037;&#20316;&#25335;&#36125;&#30340;&#29256;&#26412;&#24211;)&#65292;&#25152;&#20197;Subversion&#20250;&#20197;&#19981;&#20851;&#32852;&#30340;&#24037;&#20316;&#25335;&#36125;&#25805;&#20316;&#12290;&#25152;&#20197;&#20030;&#20010;&#20363;&#23376;&#65292;&#22914;&#26524;&#20320;&#24076;&#26395;&#25552;&#20132;&#19968;&#20010;&#25110;&#22810;&#20010;&#22806;&#37096;&#23450;&#20041;&#30340;&#25335;&#36125;&#65292;&#20320;&#24517;&#39035;&#22312;&#36825;&#20123;&#24037;&#20316;&#25335;&#36125;&#26174;&#31034;&#30340;&#36816;&#34892;<span class="command"><strong>svn commit</strong></span>&#8212;&#23545;&#20027;&#24037;&#20316;&#25335;&#36125;&#30340;&#25552;&#20132;&#19981;&#20250;&#36845;&#20195;&#21040;&#22806;&#37096;&#23450;&#20041;&#30340;&#37096;&#20998;&#12290;</p>
      <p>&#21478;&#22806;&#65292;&#22240;&#20026;&#23450;&#20041;&#26412;&#36523;&#20351;&#29992;&#32477;&#23545;&#36335;&#24452;&#65292;&#31227;&#21160;&#21644;&#25335;&#36125;&#36335;&#24452;&#20182;&#20204;&#38468;&#30528;&#30340;&#36335;&#24452;&#19981;&#20250;&#24433;&#21709;&#20182;&#20204;&#20316;&#20026;&#22806;&#37096;&#30340;&#26816;&#20986;(&#23613;&#31649;&#30456;&#23545;&#30340;&#26412;&#22320;&#30446;&#26631;&#23376;&#30446;&#24405;&#20250;&#36825;&#26679;&#65292;&#24403;&#28982;&#65292;&#26681;&#25454;&#37325;&#21629;&#21517;&#30340;&#30446;&#24405;&#25913;&#21464;)&#12290;&#22312;&#29305;&#23450;&#24773;&#24418;&#19979;&#36825;&#30475;&#36215;&#26469;&#26377;&#20123;&#36855;&#24785;&#8212;&#29978;&#33267;&#35753;&#20154;&#27822;&#20007;&#12290;&#20030;&#20010;&#20363;&#23376;&#65292;&#20320;&#30340;&#39030;&#32423;&#30446;&#24405;&#21483;&#20316;<code class="filename">my-project</code>&#65292;&#20320;&#22312;&#23427;&#30340;&#23376;&#30446;&#24405;(<code class="filename">my-project/some-dir</code>)&#21019;&#24314;&#20102;&#19968;&#20010;&#22806;&#37096;&#23450;&#20041;&#65292;&#32780;&#36825;&#20010;&#22806;&#37096;&#23450;&#20041;&#25351;&#21521;&#30340;&#26159;&#21478;&#19968;&#20010;&#23376;&#30446;&#24405;(<code class="filename">my-project/external-dir</code>)&#30340;&#26368;&#26032;&#29256;&#26412;&#12290;</p>
      <pre class="screen">
$ svn checkout http://svn.example.com/projects .
A    my-project
A    my-project/some-dir
A    my-project/external-dir
&#8230;
Fetching external item into 'my-project/some-dir/subdir'
Checked out external at revision 11.

Checked out revision 11.
$ svn propget svn:externals my-project/some-dir
subdir http://svn.example.com/projects/my-project/external-dir

$
</pre>
      <p>&#29616;&#22312;&#20320;&#20351;&#29992;<span class="command"><strong>svn move</strong></span>&#23558;&#30446;&#24405;<code class="filename">my-project</code>&#25913;&#21517;&#65292;&#27492;&#21051;&#65292;&#20320;&#30340;&#22806;&#37096;&#23450;&#20041;&#36824;&#26159;&#25351;&#21521;<code class="filename">my-project</code>&#30446;&#24405;&#65292;&#21363;&#20351;&#36825;&#20010;&#30446;&#24405;&#24050;&#32463;&#19981;&#23384;&#22312;&#20102;&#12290;</p>
      <pre class="screen">
$ svn move -q my-project renamed-project
$ svn commit -m "Rename my-project to renamed-project."
Deleting       my-project
Adding         my-renamed-project

Committed revision 12.
$ svn update

Fetching external item into 'renamed-project/some-dir/subdir'
svn: Target path does not exist
$
</pre>
      <p>&#24403;&#28982;&#65292;&#22914;&#26524;&#29256;&#26412;&#24211;&#23384;&#22312;&#22810;&#31181;URL&#27169;&#24335;&#26102;&#65292;&#20351;&#29992;&#32477;&#23545;URL&#26469;&#24341;&#29992;&#22806;&#37096;&#23450;&#20041;&#20250;&#23548;&#33268;&#38382;&#39064;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#30340;Subversion&#26381;&#21153;&#22120;&#24050;&#32463;&#37197;&#32622;&#20026;&#20219;&#20309;&#29992;&#25143;&#21487;&#20197;&#20351;&#29992;<code class="literal">http://</code>&#25110;<code class="literal">https://</code>&#26816;&#20986;&#65292;&#20294;&#26159;&#21482;&#33021;&#36890;&#36807;<code class="literal">https://</code>&#25552;&#20132;&#65292;&#20320;&#29616;&#22312;&#26377;&#20102;&#19968;&#20010;&#24456;&#26377;&#36259;&#30340;&#38382;&#39064;&#12290;&#22914;&#26524;&#20320;&#30340;&#22806;&#37096;&#23450;&#20041;&#20351;&#29992;<code class="literal">http://</code>&#24418;&#24335;&#65292;&#21017;&#20320;&#19981;&#33021;&#20174;&#36825;&#20010;&#24037;&#20316;&#25335;&#36125;&#25552;&#20132;&#20219;&#20309;&#20869;&#23481;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20182;&#20204;&#20351;&#29992;<code class="literal">https://</code>&#26041;&#24335;&#30340;URL&#65292;&#20219;&#20309;&#22240;&#20026;&#19981;&#25903;&#25345;<code class="literal">https://</code>&#30340;&#23458;&#25143;&#20351;&#29992;<code class="literal">http://</code>&#26816;&#20986;&#30340;&#24037;&#20316;&#25335;&#36125;&#19981;&#33021;&#24471;&#21040;&#22806;&#37096;&#39033;&#30446;&#12290;&#20063;&#38656;&#35201;&#24847;&#35782;&#21040;&#65292;&#22914;&#26524;&#20320;&#38656;&#35201;&#37325;&#23450;&#20301;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;(&#20351;&#29992;<span class="command"><strong>svn switch --relocate</strong></span>)&#65292;&#22806;&#37096;&#23450;&#20041;&#19981;&#20250;&#37325;&#26032;&#23450;&#20301;&#12290;</p>
      <p>&#26368;&#21518;&#65292;&#20320;&#25110;&#35768;&#32463;&#24120;&#24076;&#26395;<span class="command"><strong>svn</strong></span>&#23376;&#21629;&#20196;&#19981;&#20250;&#35782;&#21035;&#25110;&#20854;&#23427;&#20316;&#20026;&#22806;&#37096;&#23450;&#20041;&#22788;&#29702;&#30340;&#32467;&#26524;&#30340;&#22806;&#37096;&#24037;&#20316;&#25335;&#36125;&#19978;&#30340;&#25805;&#20316;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20320;&#21487;&#20197;&#23545;&#23376;&#21629;&#20196;&#20351;&#29992;<code class="option">--ignore-externals</code>&#36873;&#39033;&#12290;</p>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.advanced.locking.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.advanced.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.pegrevs.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#38145;&#23450;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;Peg &#21644;&#23454;&#26045;&#20462;&#35746;&#29256;&#26412;</td></tr></table></div></body></html>