<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#38145;&#23450;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;"><link rel="prev" href="svn.advanced.props.special.keywords.html" title="&#20851;&#38190;&#23383;&#26367;&#25442;"><link rel="next" href="svn.advanced.externals.html" title="&#22806;&#37096;&#23450;&#20041;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#38145;&#23450;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.advanced.props.special.keywords.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.externals.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.advanced.locking"></a>&#38145;&#23450;</h2></div></div></div>
      
      <p>Subversion&#30340;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#29256;&#26412;&#25511;&#21046;&#27169;&#22411;&#30340;&#20851;&#38190;&#26159;&#20854;&#21512;&#24182;&#31639;&#27861;&#65292;&#20063;&#23601;&#26159;&#22914;&#20309;&#22788;&#29702;&#22810;&#20010;&#29992;&#25143;&#20462;&#25913;&#21516;&#26102;&#20462;&#25913;&#19968;&#20010;&#25991;&#20214;&#20135;&#29983;&#20914;&#31361;&#26102;&#30340;&#31639;&#27861;&#12290;Subversion&#26412;&#36523;&#21482;&#25552;&#20379;&#20102;&#19968;&#20010;&#36825;&#26679;&#30340;&#31639;&#27861;&#65292;&#20854;&#19977;&#26041;&#21306;&#21035;&#31639;&#27861;&#21487;&#20197;&#36275;&#22815;&#32874;&#26126;&#30340;&#30340;&#34892;&#31890;&#24230;&#30340;&#25968;&#25454;&#22788;&#29702;&#65292;Subversion&#20063;&#25903;&#25345;&#20351;&#29992;&#22806;&#32622;&#27604;&#36739;&#24037;&#20855;(<a class="xref" href="svn.advanced.externaldifftools.html#svn.advanced.externaldifftools.diff3" title="&#22806;&#32622; diff3">&#8220;&#22806;&#32622; diff3&#8221;&#19968;&#33410;</a>&#20013;&#26377;&#25551;&#36848;)&#65292;&#26377;&#19968;&#20123;&#21487;&#20197;&#20570;&#24471;&#38750;&#24120;&#22909;&#65292;&#25110;&#35768;&#21487;&#20197;&#25552;&#20379;&#20197;&#21333;&#35789;&#25110;&#23383;&#27597;&#31890;&#24230;&#30340;&#31639;&#27861;&#12290;&#20294;&#26159;&#65292;&#36825;&#20123;&#24037;&#20855;&#30340;&#20849;&#21516;&#28857;&#26159;&#22522;&#20110;&#25991;&#26412;&#30340;&#65292;&#24403;&#20320;&#35752;&#35770;&#38750;&#25991;&#26412;&#25991;&#20214;&#26684;&#24335;&#26102;&#65292;&#36825;&#30475;&#36215;&#26469;&#26377;&#19968;&#28857;&#27531;&#37239;&#12290;&#22914;&#26524;&#20320;&#26080;&#27861;&#25214;&#21040;&#19968;&#20010;&#24037;&#20855;&#25903;&#25345;&#36825;&#31181;&#31867;&#22411;&#30340;&#21512;&#24182;&#65292;&#20320;&#30340;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#27169;&#22411;&#23601;&#20250;&#36935;&#21040;&#40635;&#28902;&#12290;</p>
      <p>&#35753;&#25105;&#20204;&#30475;&#19968;&#20010;&#20351;&#29992;&#36825;&#20010;&#27169;&#22411;&#30340;&#30495;&#23454;&#20363;&#23376;&#65292;Harry&#21644;Sally&#26159;&#21516;&#19968;&#20010;&#39033;&#30446;&#30340;&#22270;&#24418;&#35774;&#35745;&#24072;&#65292;&#27773;&#36710;&#25216;&#24037;&#30340;&#38388;&#25509;&#33829;&#38144;&#12290;&#28023;&#25253;&#30340;&#35774;&#35745;&#19968;&#20010;&#23567;&#36710;&#65292;&#38656;&#35201;&#19968;&#20123;&#20027;&#35201;&#37096;&#20998;&#30340;&#24037;&#20316;&#65292;&#20351;&#29992;PNG&#25991;&#20214;&#26684;&#24335;&#12290;&#28023;&#25253;&#30340;&#24067;&#23616;&#20960;&#20046;&#23436;&#25104;&#65292;Harry&#21644;Sally&#37117;&#30475;&#19978;&#20102;&#19968;&#20010;&#20174;&#25439;&#22351;&#23567;&#36710;&#24471;&#21040;&#30340;&#29305;&#21035;&#29031;&#29255;&#8212;&#19968;&#20010;1967&#30340;&#28129;&#34013;&#33394;&#30340;Ford Mustang&#65292;&#25377;&#27877;&#26495;&#26377;&#19968;&#20123;&#28293;&#36857;&#12290;</p>
      <p>&#29616;&#22312;&#65292;&#20316;&#20026;&#22270;&#20687;&#35774;&#35745;&#30340;&#24815;&#20363;&#65292;&#35745;&#21010;&#30340;&#25913;&#21464;&#23548;&#33268;&#36710;&#30340;&#39068;&#33394;&#24456;&#37325;&#35201;&#65292;&#25152;&#20197;Sally&#23558;&#24037;&#20316;&#25335;&#36125;&#26356;&#26032;&#21040;<code class="literal">HEAD</code>&#65292;&#21551;&#21160;&#22270;&#24418;&#32534;&#36753;&#36719;&#20214;&#65292;&#20462;&#25913;&#22270;&#20687;&#23558;&#36710;&#30340;&#39068;&#33394;&#20462;&#25913;&#20026;&#27185;&#26691;&#32418;&#65292;&#21516;&#26102;Harry&#37027;&#19968;&#22825;&#29305;&#21035;&#26377;&#28789;&#24863;&#65292;&#25152;&#20197;&#20915;&#23450;&#22914;&#26524;&#36825;&#20010;&#36710;&#21463;&#21040;&#26356;&#22823;&#30340;&#25758;&#20987;&#21487;&#33021;&#20250;&#26377;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;&#20182;&#20063;&#26356;&#26032;&#21040;<code class="literal">HEAD</code>&#65292;&#28982;&#21518;&#22312;&#36710;&#25377;&#39118;&#29627;&#29827;&#19978;&#21046;&#20316;&#20102;&#19968;&#20123;&#35010;&#30165;&#65292;&#20182;&#35774;&#27861;&#22312;Sally&#23436;&#25104;&#21069;&#32467;&#26463;&#20462;&#25913;&#65292;&#22240;&#20026;&#21463;&#21040;&#33258;&#24049;&#19981;&#21487;&#38459;&#25377;&#22825;&#36171;&#30340;&#40723;&#33310;&#65292;&#25552;&#20132;&#20102;&#22270;&#20687;&#12290;&#27809;&#36807;&#22810;&#20037;&#65292;Sally&#32467;&#26463;&#20102;&#22905;&#30340;&#24037;&#20316;&#65292;&#23581;&#35797;&#25552;&#20132;&#12290;&#20294;&#26159;&#22914;&#25105;&#20204;&#25152;&#26009;&#65292;Subversion&#25552;&#20132;&#22833;&#36133;&#65292;&#21578;&#35785;Sally&#22905;&#30340;&#22270;&#20687;&#24050;&#32463;&#36807;&#26399;&#20102;&#12290;</p>
      <p>&#36825;&#37324;&#23601;&#26159;&#40635;&#28902;&#30340;&#22320;&#26041;&#65292;&#22914;&#26524;Harry&#21644;Sally&#20462;&#25913;&#30340;&#26159;&#25991;&#26412;&#25991;&#20214;&#65292;&#22905;&#21482;&#38656;&#35201;&#31616;&#21333;&#24471;&#26356;&#26032;&#24037;&#20316;&#25335;&#36125;&#65292;&#25509;&#25910;Harry&#30340;&#20462;&#25913;&#12290;&#22312;&#26368;&#22351;&#30340;&#24773;&#20917;&#19979;&#65292;&#20182;&#20204;&#20250;&#20462;&#25913;&#25991;&#20214;&#30340;&#21516;&#19968;&#37096;&#20998;&#65292;Sally&#38656;&#35201;&#20154;&#24037;&#35299;&#20915;&#20914;&#31361;&#12290;&#20294;&#26159;&#29616;&#22312;&#19981;&#26159;&#25991;&#26412;&#25991;&#20214;&#8212;&#32780;&#26159;&#20108;&#36827;&#21046;&#22270;&#20687;&#65292;&#27809;&#27861;&#20272;&#35745;&#21512;&#24182;&#30340;&#32467;&#26524;&#20250;&#26159;&#20160;&#20040;&#26679;&#23376;&#30340;&#65292;&#24050;&#23384;&#30340;&#36719;&#20214;&#19981;&#21487;&#33021;&#20174;&#22522;&#32447;&#22270;&#20687;&#20998;&#31163;&#20986;Harry&#21644;Sally&#30340;&#24037;&#20316;&#65292;&#24182;&#32452;&#21512;&#20986;&#19968;&#20010;&#25377;&#39118;&#29627;&#29827;&#22351;&#25481;&#30340;&#32418;&#33394;Mustang&#12290;</p>
      <p>&#24456;&#26174;&#28982;&#65292;&#22914;&#26524;&#33021;&#22815;&#23558;Harry&#21644;Sally&#30340;&#24037;&#20316;&#20018;&#34892;&#35805;&#20107;&#24773;&#20250;&#21464;&#24471;&#24179;&#28369;&#65292;&#20063;&#23601;&#26159;&#35828;Harry&#21487;&#20197;&#31561;&#21040;Sally&#30340;&#32418;&#36710;&#28982;&#21518;&#20877;&#30011;&#19978;&#30772;&#22351;&#30340;&#25377;&#39118;&#29627;&#29827;&#65292;&#25110;&#32773;Sally&#22312;&#30772;&#22351;&#20043;&#21518;&#25913;&#21464;&#39068;&#33394;&#12290;&#23601;&#20687;&#22312;<a class="xref" href="svn.basic.vsn-models.html#svn.basic.vsn-models.copy-merge" title="&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;">&#8220;&#8220;&#25335;&#36125;-&#20462;&#25913;-&#21512;&#24182;&#8221;&#26041;&#26696;&#8221;&#19968;&#33410;</a>&#35752;&#35770;&#30340;&#65292;&#22914;&#26524;Harry&#21644;Sally&#20043;&#38388;&#26377;&#23436;&#32654;&#30340;&#20132;&#27969;&#65292;&#23601;&#19981;&#20250;&#26377;&#36825;&#31181;&#38382;&#39064;&#21457;&#29983;&#12290;<sup>[<a name="d4e2178" href="#ftn.d4e2178" class="footnote">15</a>]</sup>&#20294;&#26159;&#20316;&#20026;&#19968;&#31181;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#23454;&#38469;&#19978;&#26159;&#19968;&#31181;&#20132;&#27969;&#30340;&#24418;&#24335;&#65292;&#20351;&#24471;&#36719;&#20214;&#36981;&#24490;&#38750;&#24182;&#34892;&#32534;&#36753;&#30340;&#20018;&#34892;&#21270;&#20063;&#19981;&#26159;&#19968;&#20214;&#22351;&#20107;&#65292;&#36825;&#37324;Subversion&#23454;&#29616;&#20102;&#38145;&#23450;-&#20462;&#25913;-&#35299;&#38145;&#27169;&#22411;&#65292;&#36825;&#37324;&#25105;&#20204;&#35201;&#35752;&#35770;Subversion&#30340;<em class="firstterm">&#38145;&#23450;</em>&#29305;&#24615;&#65292;&#19982;&#20854;&#20182;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#8220;<span class="quote">&#20445;&#30041;&#26816;&#20986;</span>&#8221;&#26426;&#21046;&#31867;&#20284;&#12290;</p>
      <p>Subversion &#30340;&#38145;&#23450;&#29305;&#24615;&#20026;&#20004;&#20010;&#20027;&#35201;&#30446;&#30340;&#26381;&#21153;&#65306;</p>
      <div class="itemizedlist"><ul type="disc"><li>
          <p><span class="emphasis"><em>&#39034;&#24207;&#35775;&#38382;&#36164;&#28304;</em></span>&#12290;&#20801;&#35768;&#29992;&#25143;&#24471;&#21040;&#19968;&#20010;&#25490;&#20182;&#30340;&#20462;&#25913;&#25991;&#20214;&#26435;&#65292;&#36825;&#20010;&#29992;&#25143;&#21487;&#20197;&#30830;&#23450;&#19981;&#21487;&#21512;&#24182;&#30340;&#20462;&#25913;&#19981;&#20250;&#34987;&#28010;&#36153;&#8212;&#20182;&#23545;&#36825;&#20010;&#20462;&#25913;&#30340;&#25552;&#20132;&#20250;&#25104;&#21151;&#12290;</p>
        </li><li>
          <p><span class="emphasis"><em>&#36741;&#21161;&#20132;&#27969;</em></span>&#12290;&#36890;&#36807;&#35201;&#27714;&#29992;&#25143;&#23545;&#26576;&#20010;&#29256;&#26412;&#21270;&#23545;&#35937;&#20018;&#34892;&#24037;&#20316;&#65292;&#29992;&#25143;&#21487;&#20197;&#30693;&#36947;&#23545;&#35937;&#27491;&#22312;&#34987;&#21035;&#20154;&#20462;&#25913;&#65292;&#36825;&#26679;&#21487;&#20197;&#38450;&#27490;&#28010;&#36153;&#31934;&#21147;&#21644;&#26102;&#38388;&#21435;&#20462;&#25913;&#19968;&#20010;&#19981;&#21487;&#21512;&#24182;&#21644;&#25552;&#20132;&#30340;&#23545;&#35937;&#12290;</p>
        </li></ul></div>
      <p>&#24403;&#25105;&#20204;&#24341;&#29992;Subversion&#38145;&#23450;&#29305;&#24615;&#26102;&#65292;&#36825;&#26159;&#22312;&#35752;&#35770;&#19968;&#20010;&#22788;&#29702;&#29256;&#26412;&#21270;&#25991;&#20214;&#30340;&#34892;&#20026;&#29305;&#24615;<sup>[<a name="d4e2191" href="#ftn.d4e2191" class="footnote">16</a>]</sup>(&#22768;&#26126;&#23545;&#19968;&#20010;&#25991;&#20214;&#25490;&#20182;&#24615;&#20462;&#25913;&#29305;&#26435;)&#65292;&#21253;&#25324;&#23545;&#25991;&#20214;&#30340;&#38145;&#23450;&#21644;&#35299;&#38145;(&#37322;&#25918;&#25490;&#20182;&#24615;&#20462;&#25913;&#26435;&#38480;)&#65292;&#23519;&#30475;&#21253;&#25324;&#25991;&#20214;&#34987;&#35841;&#38145;&#23450;&#30340;&#25253;&#21578;&#65292;&#20197;&#21450;&#25552;&#37266;&#20225;&#22270;&#20462;&#25913;&#38145;&#23450;&#25991;&#20214;&#30340;&#29992;&#25143;&#12290;&#22312;&#26412;&#23567;&#33410;&#65292;&#25105;&#20204;&#20250;&#35206;&#30422;&#38145;&#23450;&#29305;&#24615;&#30340;&#22823;&#37096;&#20998;&#20869;&#23481;&#12290;</p>
      <div class="sidebar"><a name="svn.advanced.locking.meanings"></a><p class="title"><b>&#8220;<span class="quote">&#38145;&#23450;</span>&#8221;&#30340;&#19977;&#31181;&#21547;&#20041;</b></p>
        
        <p>&#22312;&#26412;&#23567;&#33410;&#65292;&#21644;&#20960;&#20046;&#26412;&#20070;&#30340;&#27599;&#19968;&#20010;&#22320;&#26041;&#8220;<span class="quote">lock</span>&#8221;&#21644;&#8220;<span class="quote">locking</span>&#8221;&#25551;&#36848;&#20102;&#19968;&#31181;&#36991;&#20813;&#29992;&#25143;&#20043;&#38388;&#20914;&#31361;&#25552;&#20132;&#30340;&#25490;&#20182;&#26426;&#21046;&#65292;&#20294;&#26159;&#20343;&#19981;&#24184;&#65292;Subversion&#20013;&#36824;&#26377;&#21478;&#22806;&#20004;&#31181;&#38145;&#65292;&#22240;&#27492;&#38656;&#35201;&#22312;&#26412;&#20070;&#26684;&#22806;&#20851;&#24515;&#12290;</p>
        <p>&#31532;&#19968;&#31181;&#26159;<em class="firstterm">&#24037;&#20316;&#25335;&#36125;&#38145;</em>&#65292;Subversion&#20869;&#37096;&#29992;&#26469;&#38450;&#27490;&#19981;&#21516;&#23458;&#25143;&#31471;&#21516;&#26102;&#25805;&#20316;&#21516;&#19968;&#20221;&#24037;&#20316;&#25335;&#36125;&#30340;&#38145;&#65292;&#36825;&#31181;&#38145;&#20351;&#29992;<span class="command"><strong>svn status</strong></span>&#36755;&#20986;&#20013;&#31532;&#19977;&#21015;&#20986;&#29616;&#30340;<code class="computeroutput">L</code>&#34920;&#31034;&#65292;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn cleanup</strong></span>&#21024;&#38500;&#65292;<a class="xref" href="svn.tour.cleanup.html" title="&#26377;&#26102;&#20320;&#21482;&#38656;&#35201;&#28165;&#29702;">&#8220;&#26377;&#26102;&#20320;&#21482;&#38656;&#35201;&#28165;&#29702;&#8221;&#19968;&#33410;</a>&#26377;&#20171;&#32461;&#12290;</p>
        <p>&#31532;&#20108;&#31181;&#65292;<em class="firstterm">&#25968;&#25454;&#24211;&#38145;</em>&#65292;&#22312;Berkeley DB&#21518;&#31471;&#20869;&#37096;&#20351;&#29992;&#65292;&#38450;&#27490;&#22810;&#20010;&#31243;&#24207;&#35775;&#38382;&#25968;&#25454;&#24211;&#21457;&#29983;&#20914;&#31361;&#65292;&#19968;&#20010;&#23548;&#33268;&#29256;&#26412;&#24211;&#8220;<span class="quote">&#26964;&#20303;</span>&#8221;&#30340;&#38169;&#35823;&#21457;&#29983;&#21518;&#20135;&#29983;&#65292;<a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.recovery" title="Berkeley DB &#24674;&#22797;">&#8220;Berkeley DB &#24674;&#22797;&#8221;&#19968;&#33410;</a>&#26377;&#25551;&#36848;&#12290;</p>
        <p>&#22312;&#21457;&#29983;&#38382;&#39064;&#20043;&#21069;&#20320;&#23436;&#20840;&#21487;&#20197;&#24536;&#35760;&#19978;&#38754;&#20004;&#31181;&#38145;&#65292;&#22312;&#26412;&#20070;&#65292;&#8220;<span class="quote">&#38145;&#23450;</span>&#8221;&#24847;&#21619;&#30528;&#31532;&#19968;&#31181;&#38145;&#65292;&#38500;&#38750;&#26159;&#22312;&#20174;&#19978;&#19979;&#25991;&#20013;&#21313;&#20998;&#26126;&#30830;&#25110;&#26126;&#30830;&#25351;&#20986;&#30340;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.locking.creation"></a>&#21019;&#24314;&#38145;&#23450;</h3></div></div></div>
        
        <p>&#22312;Subversion&#30340;&#29256;&#26412;&#24211;&#65292;&#19968;&#20010;<em class="firstterm">&#38145;</em>&#26159;&#19968;&#20221;&#20803;&#25968;&#25454;&#65292;&#21487;&#20197;&#25490;&#23427;&#36171;&#20104;&#26576;&#20010;&#29992;&#25143;&#20462;&#25913;&#26435;&#65292;&#36825;&#20010;&#29992;&#25143;&#34987;&#31216;&#20316;<em class="firstterm">&#38145;&#30340;&#25317;&#26377;&#32773;</em>&#12290;&#27599;&#20010;&#38145;&#37117;&#26377;&#19968;&#20010;&#21807;&#19968;&#26631;&#35782;&#65292;&#36890;&#24120;&#26159;&#19968;&#38271;&#20018;&#23383;&#31526;&#65292;&#21483;&#20570;<em class="firstterm">&#38145;&#20196;&#29260;</em>&#12290;&#29256;&#26412;&#24211;&#31649;&#29702;&#38145;&#65292;&#25511;&#21046;&#30528;&#38145;&#30340;&#21019;&#24314;&#65292;&#26435;&#38480;&#25511;&#21046;&#21644;&#21024;&#38500;&#12290;&#22914;&#26524;&#25552;&#20132;&#21253;&#21547;&#20102;&#20462;&#25913;&#25110;&#32773;&#21024;&#38500;&#38145;</p>
        <p>&#20026;&#20102;&#25551;&#36848;&#38145;&#30340;&#20135;&#29983;&#65292;&#25105;&#20204;&#22238;&#21040;&#21069;&#38754;&#37027;&#20010;&#20851;&#20110;&#22810;&#20010;&#22270;&#24418;&#35774;&#35745;&#24072;&#20849;&#21516;&#24037;&#20316;&#30340;&#20363;&#23376;&#65292;Harry&#20915;&#23450;&#20462;&#25913;&#19968;&#20010;JPEG&#22270;&#20687;&#65292;&#20026;&#20102;&#38450;&#27490;&#20854;&#20182;&#29992;&#25143;&#27492;&#26102;&#25552;&#20132;&#36825;&#20010;&#25991;&#20214;&#30340;&#20462;&#25913;(&#20063;&#26159;&#35686;&#21578;&#21035;&#20154;&#20182;&#27491;&#22312;&#20462;&#25913;&#23427;)&#65292;&#20182;&#20351;&#29992;<span class="command"><strong>svn lock</strong></span>&#21629;&#20196;&#38145;&#23450;&#20102;&#29256;&#26412;&#24211;&#20013;&#30340;&#36825;&#20010;&#25991;&#20214;&#65306;</p>
        <pre class="screen">
$ svn lock banana.jpg -m "Editing file for tomorrow's release."
'banana.jpg' locked by user 'harry'.
$
</pre>
        <p>&#21069;&#19968;&#20010;&#20363;&#23376;&#25551;&#36848;&#20102;&#35768;&#22810;&#26032;&#20107;&#29289;&#65292;&#31532;&#19968;&#65292;&#27880;&#24847;Harry&#22312;<span class="command"><strong>svn lock</strong></span>&#20013;&#20351;&#29992;&#20102;<code class="option">--message (-m)</code>&#36873;&#39033;&#65292;&#31867;&#20284;&#20110;<span class="command"><strong>svn commit</strong></span>&#65292;<span class="command"><strong>svn lock</strong></span>&#21629;&#20196;&#21487;&#20197;&#26377;&#25551;&#36848;&#38145;&#23450;&#21407;&#22240;&#30340;&#27880;&#37322;(&#36890;&#36807;<code class="option">--message (-m)</code>&#25110;<code class="option">--file (-F)</code>)&#12290;&#28982;&#32780;&#19981;&#20687;<span class="command"><strong>svn commit</strong></span>&#65292;<span class="command"><strong>svn lock</strong></span>&#19981;&#20250;&#33258;&#21160;&#24378;&#21046;&#21551;&#21160;&#20320;&#21916;&#27426;&#30340;&#32534;&#36753;&#22120;&#65292;&#38145;&#23450;&#27880;&#37322;&#26159;&#21487;&#36873;&#30340;&#65292;&#20294;&#26159;&#20026;&#20102;&#26041;&#20415;&#20132;&#27969;&#25105;&#20204;&#36824;&#26159;&#25512;&#33616;&#20351;&#29992;&#12290;</p>
        <p>&#31532;&#20108;&#65292;&#38145;&#23450;&#25104;&#21151;&#20102;&#65292;&#36825;&#24847;&#21619;&#30528;&#25991;&#20214;&#27809;&#26377;&#34987;&#21035;&#20154;&#38145;&#23450;&#65292;Harry&#30340;&#25991;&#20214;&#26159;&#26368;&#26032;&#30340;&#29256;&#26412;&#12290;&#22914;&#26524;Harry&#30340;&#24037;&#20316;&#25335;&#36125;&#25991;&#20214;&#19981;&#26159;&#26368;&#26032;&#30340;&#65292;&#29256;&#26412;&#24211;&#20250;&#25298;&#32477;&#35831;&#27714;&#65292;&#24378;&#21046;Harry&#25191;&#34892;<span class="command"><strong>svn update</strong></span>&#24182;&#37325;&#26032;&#36816;&#34892;&#38145;&#23450;&#21629;&#20196;&#65292;&#21516;&#26679;&#65292;&#22914;&#26524;&#27492;&#25991;&#20214;&#24050;&#32463;&#34987;&#21035;&#30340;&#29992;&#25143;&#38145;&#23450;&#20102;&#65292;&#38145;&#23450;&#21629;&#20196;&#20063;&#20250;&#22833;&#36133;&#12290;</p>
        <p>&#23601;&#20687;&#20320;&#30475;&#21040;&#30340;&#65292;<span class="command"><strong>svn lock</strong></span>&#25171;&#21360;&#20102;&#38145;&#23450;&#25104;&#21151;&#30340;&#30830;&#35748;&#20449;&#24687;&#12290;&#27492;&#26102;&#65292;&#36890;&#36807;<span class="command"><strong>svn status</strong></span>&#21644;<span class="command"><strong>svn info</strong></span>&#30340;&#36755;&#20986;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#25991;&#20214;&#24050;&#32463;&#38145;&#23450;&#12290;</p>
        <pre class="screen">
$ svn status
     K banana.jpg

$ svn info banana.jpg
Path: banana.jpg
Name: banana.jpg
URL: http://svn.example.com/repos/project/banana.jpg
Repository UUID: edb2f264-5ef2-0310-a47a-87b0ce17a8ec
Revision: 2198
Node Kind: file
Schedule: normal
Last Changed Author: frank
Last Changed Rev: 1950
Last Changed Date: 2006-03-15 12:43:04 -0600 (Wed, 15 Mar 2006)
Text Last Updated: 2006-06-08 19:23:07 -0500 (Thu, 08 Jun 2006)
Properties Last Updated: 2006-06-08 19:23:07 -0500 (Thu, 08 Jun 2006)
Checksum: 3b110d3b10638f5d1f4fe0f436a5a2a5
Lock Token: opaquelocktoken:0c0f600b-88f9-0310-9e48-355b44d4a58e
Lock Owner: harry
Lock Created: 2006-06-14 17:20:31 -0500 (Wed, 14 Jun 2006)
Lock Comment (1 line):
Editing file for tomorrow's release.

$
</pre>
        <p><span class="command"><strong>svn info</strong></span>&#21629;&#20196;&#19981;&#20250;&#32852;&#31995;&#29256;&#26412;&#24211;&#65292;&#24403;&#23545;&#24037;&#20316;&#25335;&#36125;&#36335;&#24452;&#24212;&#29992;<span class="command"><strong>svn info</strong></span>&#21629;&#20196;&#26102;&#65292;&#21487;&#20197;&#25581;&#31034;&#20196;&#29260;&#30340;&#19968;&#20010;&#37325;&#35201;&#20107;&#23454;&#8212;&#23427;&#20204;&#32531;&#23384;&#22312;&#24037;&#20316;&#25335;&#36125;&#12290;&#26377;&#38145;&#23450;&#20196;&#29260;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#65292;&#36825;&#32473;&#20102;&#24037;&#20316;&#25335;&#36125;&#26435;&#21033;&#21033;&#29992;&#36825;&#20010;&#38145;&#30340;&#33021;&#21147;&#12290;<span class="command"><strong>svn status</strong></span>&#20250;&#22312;&#25991;&#20214;&#21518;&#38754;&#26174;&#31034;&#19968;&#20010;<code class="literal">K</code>(locKed&#30340;&#32553;&#20889;)&#65292;&#34920;&#26126;&#20102;&#25317;&#26377;&#38145;&#23450;&#20196;&#29260;&#12290;</p>
        <div class="sidebar"><p class="title"><b>&#20851;&#20110;&#38145;&#23450;&#20196;&#29260;</b></p>
          
          <p>&#19968;&#20010;&#38145;&#19981;&#26159;&#19968;&#20010;&#35748;&#35777;&#20196;&#29260;&#65292;&#32780;&#26159;&#19968;&#20010;<span class="emphasis"><em>&#25480;&#26435;</em></span>&#20196;&#29260;&#65292;&#36825;&#20010;&#20196;&#29260;&#19981;&#26159;&#19968;&#20010;&#21463;&#20445;&#25252;&#30340;&#31192;&#23494;&#65292;&#20107;&#23454;&#19978;&#65292;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#36890;&#36807;<span class="command"><strong>svn info URL</strong></span>&#21457;&#29616;&#36825;&#20010;&#21807;&#19968;&#20196;&#29260;&#12290;&#19968;&#20010;&#38145;&#23450;&#20196;&#29260;&#21482;&#26377;&#22312;&#24037;&#20316;&#25335;&#36125;&#20013;&#25165;&#26377;&#29305;&#21035;&#30340;&#24847;&#20041;&#65292;&#23427;&#26159;&#38145;&#23450;&#24314;&#31435;&#22312;&#36825;&#20010;&#24037;&#20316;&#25335;&#36125;&#30340;&#35777;&#25454;&#65292;&#32780;&#19981;&#26159;&#20854;&#23427;&#29992;&#25143;&#22312;&#20854;&#20182;&#22320;&#26041;&#65292;&#20165;&#20165;&#26816;&#39564;&#38145;&#23450;&#25317;&#26377;&#32773;&#36824;&#19981;&#33021;&#38450;&#27490;&#20986;&#29616;&#24847;&#22806;&#12290;</p>
          <p>&#20363;&#22914;&#65292;&#20320;&#22312;&#21150;&#20844;&#23460;&#30005;&#33041;&#19978;&#38145;&#23450;&#20102;&#19968;&#20010;&#25991;&#20214;&#65292;&#25110;&#35768;&#20462;&#25913;&#27491;&#22312;&#36827;&#34892;&#20013;&#12290;&#24456;&#26377;&#21487;&#33021;&#22312;&#20320;&#30340;&#23478;&#29992;&#35745;&#31639;&#26426;&#19978;&#30340;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;(&#25110;&#21035;&#30340;Subversion&#23458;&#25143;&#31471;)&#37324;&#20320;&#21448;&#19981;&#23567;&#24515;&#20462;&#25913;&#20102;&#21516;&#19968;&#20010;&#25991;&#20214;&#65292;&#20165;&#20165;&#22240;&#20026;&#26816;&#39564;&#20102;&#20320;&#23601;&#26159;&#38145;&#23450;&#30340;&#25317;&#26377;&#32773;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#38145;&#23450;&#20196;&#29260;&#38450;&#27490;&#20320;&#36890;&#36807;&#19968;&#20010;Subversion&#30456;&#20851;&#36719;&#20214;&#30340;&#24037;&#20316;&#30772;&#22351;&#21478;&#19968;&#20010;&#30340;&#24037;&#20316;&#12290;(&#22312;&#25105;&#20204;&#30340;&#20363;&#23376;&#37324;&#65292;&#22914;&#26524;&#20320;&#30495;&#30340;&#38656;&#35201;&#22312;&#21478;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#20462;&#25913;&#36825;&#20010;&#25991;&#20214;&#65292;&#20320;&#24517;&#39035;<em class="firstterm">&#25171;&#30772;</em>&#38145;&#23450;&#20877;&#37325;&#26032;&#38145;&#23450;&#25991;&#20214;&#12290;)</p>
        </div>
        <p>&#29616;&#22312;Harry&#24050;&#32463;&#38145;&#23450;&#20102;<code class="filename">banana.jpg</code>&#65292;Sally&#19981;&#33021;&#20462;&#25913;&#25110;&#21024;&#38500;&#36825;&#20010;&#25991;&#20214;&#65306;</p>
        <pre class="screen">
$ svn delete banana.jpg
D         banana.jpg
$ svn commit -m "Delete useless file."
Deleting       banana.jpg
svn: Commit failed (details follow):
svn: DELETE of
'/repos/project/!svn/wrk/64bad3a9-96f9-0310-818a-df4224ddc35d/banana.jpg':
423 Locked (http://svn.example.com)
$
</pre>
        <p>&#20294;&#26159;&#65292;&#24403;&#23436;&#25104;&#20102;&#39321;&#34121;&#30340;&#40644;&#33394;&#28176;&#21464;&#65292;&#23601;&#21487;&#20197;&#25552;&#20132;&#25991;&#20214;&#30340;&#20462;&#25913;&#65292;&#22240;&#20026;&#35748;&#35777;&#20026;&#38145;&#23450;&#30340;&#25317;&#26377;&#32773;&#65292;&#20063;&#22240;&#20026;&#20182;&#30340;&#24037;&#20316;&#25335;&#36125;&#26377;&#27491;&#30830;&#30340;&#38145;&#23450;&#20196;&#29260;&#65306;</p>
        <pre class="screen">
$ svn status
M    K banana.jpg
$ svn commit -m "Make banana more yellow"
Sending        banana.jpg
Transmitting file data .
Committed revision 2201.
$ svn status
$
</pre>
        <p>&#38656;&#35201;&#27880;&#24847;&#21040;&#25552;&#20132;&#20043;&#21518;&#65292;<span class="command"><strong>svn status</strong></span>&#26174;&#31034;&#24037;&#20316;&#25335;&#36125;&#24050;&#32463;&#27809;&#26377;&#38145;&#23450;&#20196;&#29260;&#20102;&#65292;&#36825;&#26159;<span class="command"><strong>svn commit</strong></span>&#30340;&#26631;&#20934;&#34892;&#20026;&#26041;&#24335;&#8212;&#23427;&#20250;&#36941;&#21382;&#24037;&#20316;&#25335;&#36125;(&#25110;&#32773;&#20174;&#30446;&#26631;&#21015;&#34920;&#65292;&#22914;&#26524;&#26377;&#21015;&#34920;&#30340;&#35805;)&#65292;&#24182;&#19988;&#20316;&#20026;&#25552;&#20132;&#30340;&#19968;&#37096;&#20998;&#21457;&#36865;&#25152;&#26377;&#36935;&#21040;&#30340;&#38145;&#23450;&#20196;&#29260;&#21040;&#26381;&#21153;&#22120;&#12290;&#24403;&#25552;&#20132;&#23436;&#20840;&#25104;&#21151;&#65292;&#21069;&#38754;&#29992;&#21040;&#30340;&#25152;&#26377;&#29256;&#26412;&#24211;&#38145;&#23450;&#37117;&#20250;&#34987;&#37322;&#25918;&#8212;<span class="emphasis"><em>&#21363;&#20351;&#26159;&#27809;&#26377;&#25552;&#20132;&#30340;&#25991;&#20214;&#12290;</em></span>&#36825;&#26679;&#30340;&#21407;&#22240;&#26159;&#19981;&#40723;&#21169;&#29992;&#25143;&#28389;&#29992;&#38145;&#23450;&#65292;&#25110;&#32773;&#26159;&#38271;&#26102;&#38388;&#30340;&#20445;&#25345;&#38145;&#23450;&#12290;&#20363;&#22914;&#65292;&#20551;&#23450;Harry&#19981;&#23567;&#24515;&#38145;&#23450;&#20102;<code class="filename">images</code>&#30446;&#24405;&#30340;30&#20010;&#25991;&#20214;&#65292;&#22240;&#20026;&#20182;&#19981;&#30830;&#23450;&#35201;&#20462;&#25913;&#20160;&#20040;&#25991;&#20214;&#65292;&#20182;&#26368;&#21518;&#21482;&#20462;&#25913;&#20102;&#22235;&#20010;&#25991;&#20214;&#65292;&#24403;&#20182;&#36816;&#34892;<span class="command"><strong>svn commit images</strong></span>&#65292;&#20250;&#37322;&#25918;&#25152;&#26377;&#30340;30&#20010;&#38145;&#23450;&#12290;</p>
        <p>&#33258;&#21160;&#37322;&#25918;&#38145;&#23450;&#30340;&#29305;&#24615;&#21487;&#20197;&#36890;&#36807;<span class="command"><strong>svn commit</strong></span>&#30340;<code class="option">--no-unlock</code>&#36873;&#39033;&#20851;&#38381;&#65292;&#24403;&#20320;&#35201;&#25552;&#20132;&#25991;&#20214;&#65292;&#21516;&#26102;&#26399;&#26395;&#32487;&#32493;&#20462;&#25913;&#32780;&#24517;&#39035;&#20445;&#30041;&#38145;&#23450;&#26102;&#38750;&#24120;&#26377;&#29992;&#12290;&#36825;&#20010;&#29305;&#24615;&#20063;&#21487;&#20197;&#21322;&#27704;&#20037;&#24615;&#30340;&#35774;&#23450;&#65292;&#26041;&#27861;&#26159;&#35774;&#32622;&#36816;&#34892;&#20013;<code class="filename">config</code>&#25991;&#20214;(&#35265;<a class="xref" href="svn.customization.html#svn.advanced.confarea" title="&#36816;&#34892;&#37197;&#32622;&#21306;">&#8220;&#36816;&#34892;&#37197;&#32622;&#21306;&#8221;&#19968;&#33410;</a>)&#30340;<code class="literal">no-unlock = yes</code>&#12290;</p>
        <p>&#24403;&#28982;&#65292;&#38145;&#23450;&#19968;&#20010;&#25991;&#20214;&#19981;&#20250;&#24378;&#21046;&#19968;&#20010;&#20154;&#35201;&#25552;&#20132;&#20462;&#25913;&#65292;&#20219;&#20309;&#26102;&#20505;&#37117;&#21487;&#20197;&#36890;&#36807;&#36816;&#34892;<span class="command"><strong>svn unlock</strong></span>&#21629;&#20196;&#37322;&#25918;&#38145;&#23450;&#65306;</p>
        <pre class="screen">
$ svn unlock banana.c
'banana.c' unlocked.
</pre>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.locking.discovery"></a>&#21457;&#29616;&#38145;&#23450;</h3></div></div></div>
        
        <p>&#26368;&#26126;&#26174;&#30340;&#26041;&#24335;&#23601;&#26159;&#22240;&#20026;&#38145;&#23450;&#32780;&#19981;&#33021;&#25552;&#20132;&#19968;&#20010;&#25991;&#20214;&#65292;&#26368;&#31616;&#21333;&#30340;&#26041;&#24335;&#26159;<span class="command"><strong>svn status --show-updates</strong></span>&#65306;</p>
        <pre class="screen">
$ svn status -u
M              23   bar.c
M    O         32   raisin.jpg
       *       72   foo.h
Status against revision:     105
$
</pre>
        <p>&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;Sally&#21487;&#20197;&#35265;&#21040;&#19981;&#20165;&#22905;&#30340;<code class="filename">foo.h</code>&#26159;&#36807;&#26399;&#30340;&#65292;&#32780;&#19988;&#21457;&#29616;&#20004;&#20010;&#35745;&#21010;&#35201;&#25552;&#20132;&#30340;&#25991;&#20214;&#34987;&#38145;&#23450;&#20102;&#12290;<code class="literal">O</code>&#31526;&#21495;&#34920;&#31034;&#20854;&#20182;&#20154;&#25152;&#35746;&#20102;&#25991;&#20214;&#12290;&#22914;&#26524;&#22905;&#23581;&#35797;&#25552;&#20132;&#65292;<code class="filename">raisin.jpg</code>&#30340;&#38145;&#23450;&#20250;&#38459;&#27490;&#22905;&#65292;Sally&#20250;&#32435;&#38391;&#35841;&#38145;&#23450;&#20102;&#25991;&#20214;&#65292;&#20160;&#20040;&#26102;&#20505;&#65292;&#20026;&#20160;&#20040;&#12290;&#20877;&#19968;&#27425;&#65292;<span class="command"><strong>svn info</strong></span>&#25317;&#26377;&#31572;&#26696;&#65306;</p>
        <pre class="screen">
$ svn info http://svn.example.com/repos/project/raisin.jpg
Path: raisin.jpg
Name: raisin.jpg
URL: http://svn.example.com/repos/project/raisin.jpg
Repository UUID: edb2f264-5ef2-0310-a47a-87b0ce17a8ec
Revision: 105
Node Kind: file
Last Changed Author: sally
Last Changed Rev: 32
Last Changed Date: 2006-01-25 12:43:04 -0600 (Sun, 25 Jan 2006)
Lock Token: opaquelocktoken:fc2b4dee-98f9-0310-abf3-653ff3226e6b
Lock Owner: harry
Lock Created: 2006-02-16 13:29:18 -0500 (Thu, 16 Feb 2006)
Lock Comment (1 line):
Need to make a quick tweak to this image.
$
</pre>
        <p>&#23601;&#20687;<span class="command"><strong>svn info</strong></span>&#21487;&#20197;&#26816;&#39564;&#24037;&#20316;&#25335;&#36125;&#30340;&#23545;&#35937;&#65292;&#23427;&#20063;&#21487;&#20197;&#26816;&#39564;&#29256;&#26412;&#24211;&#30340;&#23545;&#35937;&#65292;&#22914;&#26524;<span class="command"><strong>svn info</strong></span>&#30340;&#20027;&#35201;&#21442;&#25968;&#26159;&#24037;&#20316;&#25335;&#36125;&#36335;&#24452;&#65292;&#25152;&#26377;&#24037;&#20316;&#25335;&#36125;&#30340;&#32531;&#23384;&#20449;&#24687;&#37117;&#20250;&#26174;&#31034;&#65292;&#21457;&#29616;&#20102;&#38145;&#23450;&#23601;&#24847;&#21619;&#30528;&#24037;&#20316;&#25335;&#36125;&#25317;&#26377;&#38145;&#23450;&#20196;&#29260;(&#22914;&#26524;&#19968;&#20010;&#25991;&#20214;&#34987;&#21478;&#19968;&#20010;&#29992;&#25143;&#22312;&#21478;&#19968;&#20010;&#24037;&#20316;&#25335;&#36125;&#38145;&#23450;&#65292;&#24037;&#20316;&#25335;&#36125;&#36335;&#24452;&#19978;&#36816;&#34892;<span class="command"><strong>svn info</strong></span>&#19981;&#20250;&#26174;&#31034;&#38145;&#23450;&#20449;&#24687;)&#12290;&#22914;&#26524;<span class="command"><strong>svn info</strong></span>&#30340;&#20027;&#21442;&#25968;&#26159;URL&#65292;&#23601;&#20250;&#21453;&#26144;&#29256;&#26412;&#24211;&#20013;&#26368;&#26032;&#29256;&#26412;&#30340;&#23545;&#35937;&#20449;&#24687;&#65292;&#20219;&#20309;&#23545;&#38145;&#23450;&#30340;&#25552;&#21450;&#25551;&#36848;&#20102;&#24403;&#21069;&#23545;&#35937;&#30340;&#38145;&#23450;&#12290;</p>
        <p>&#25152;&#20197;&#22312;&#36825;&#20010;&#29305;&#23450;&#30340;&#20363;&#23376;&#37324;&#65292;Sally&#21487;&#20197;&#30475;&#21040;Harry&#22312;&#20108;&#26376;&#21313;&#20845;&#26085;&#20026;&#20102;&#8220;<span class="quote">&#20570;&#20462;&#25913;</span>&#8221;&#32780;&#38145;&#23450;&#20102;&#36825;&#20010;&#25991;&#20214;&#65292;&#29616;&#22312;&#24050;&#32463;&#20845;&#26376;&#20102;&#65292;&#22905;&#24576;&#30097;&#20182;&#21487;&#33021;&#26159;&#24536;&#35760;&#20102;&#36825;&#20010;&#38145;&#23450;&#65292;&#22905;&#20250;&#25171;&#30005;&#35805;&#32473;Harry&#21435;&#35810;&#38382;&#20182;&#24212;&#35813;&#37322;&#25918;&#36825;&#20010;&#38145;&#23450;&#65292;&#22914;&#26524;&#20182;&#19981;&#20877;&#65292;&#22905;&#23601;&#35201;&#33258;&#24049;&#24378;&#21046;&#35299;&#38500;&#36825;&#20010;&#38145;&#23450;&#25110;&#32773;&#26159;&#25214;&#31649;&#29702;&#21592;&#21435;&#20570;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.locking.break-steal"></a>&#35299;&#38500;&#21644;&#20599;&#31363;&#38145;&#23450;</h3></div></div></div>
        
        <p>&#29256;&#26412;&#24211;&#38145;&#23450;&#24182;&#19981;&#26159;&#31070;&#22307;&#19981;&#21487;&#20405;&#29359;&#30340;&#65292;&#22312;Subversion&#30340;&#32570;&#30465;&#37197;&#32622;&#29366;&#24577;&#65292;&#19981;&#21482;&#26159;&#21019;&#24314;&#32773;&#21487;&#20197;&#37322;&#25918;&#38145;&#23450;&#65292;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#12290;&#24403;&#26377;&#20854;&#20182;&#20154;&#26399;&#26395;&#28040;&#28781;&#38145;&#23450;&#26102;&#65292;&#25105;&#20204;&#31216;&#20043;&#20026;<em class="firstterm">&#25171;&#30772;</em>&#38145;&#23450;&#12290;</p>
        <p>&#20174;&#31649;&#29702;&#21592;&#30340;&#20301;&#23376;&#19978;&#24456;&#23481;&#26131;&#25171;&#30772;&#38145;&#23450;&#65292;<span class="command"><strong>svnlook</strong></span>&#21644;<span class="command"><strong>svnadmin</strong></span>&#31243;&#24207;&#37117;&#26377;&#33021;&#21147;&#20174;&#29256;&#26412;&#24211;&#30452;&#25509;&#26174;&#31034;&#21644;&#21024;&#38500;&#38145;&#23450;&#12290;(&#20851;&#20110;&#36825;&#20123;&#24037;&#20855;&#30340;&#20449;&#24687;&#21487;&#20197;&#30475;<a class="xref" href="svn.reposadmin.maint.html#svn.reposadmin.maint.tk" title="&#31649;&#29702;&#21592;&#30340;&#24037;&#20855;&#31665;">&#8220;&#31649;&#29702;&#21592;&#30340;&#24037;&#20855;&#31665;&#8221;&#19968;&#33410;</a>&#12290;)</p>
        <pre class="screen">
$ svnadmin lslocks /usr/local/svn/repos
Path: /project2/images/banana.jpg
UUID Token: opaquelocktoken:c32b4d88-e8fb-2310-abb3-153ff1236923
Owner: frank
Created: 2006-06-15 13:29:18 -0500 (Thu, 15 Jun 2006)
Expires: 
Comment (1 line):
Still improving the yellow color.

Path: /project/raisin.jpg
UUID Token: opaquelocktoken:fc2b4dee-98f9-0310-abf3-653ff3226e6b
Owner: harry
Created: 2006-02-16 13:29:18 -0500 (Thu, 16 Feb 2006)
Expires: 
Comment (1 line):
Need to make a quick tweak to this image.

$ svnadmin rmlocks /usr/local/svn/repos /project/raisin.jpg
Removed lock on '/project/raisin.jpg'.
$
</pre>
        <p>&#26356;&#26377;&#36259;&#30340;&#36873;&#39033;&#26159;&#20801;&#35768;&#29992;&#25143;&#20114;&#30456;&#25171;&#30772;&#38145;&#23450;&#65292;&#20026;&#27492;&#65292;Sally&#21482;&#38656;&#35201;&#20351;&#29992;unlock&#21629;&#20196;&#30340;<code class="option">--force</code>&#36873;&#39033;&#65306;</p>
        <pre class="screen">
$ svn status -u
M              23   bar.c
M    O         32   raisin.jpg
       *       72   foo.h
Status against revision:     105
$ svn unlock raisin.jpg
svn: 'raisin.jpg' is not locked in this working copy
$ svn info raisin.jpg | grep URL
URL: http://svn.example.com/repos/project/raisin.jpg
$ svn unlock http://svn.example.com/repos/project/raisin.jpg
svn: Unlock request failed: 403 Forbidden (http://svn.example.com)
$ svn unlock --force http://svn.example.com/repos/project/raisin.jpg
'raisin.jpg' unlocked.
$
</pre>
        <p>Sally&#21021;&#22987;&#30340;unlock&#21629;&#20196;&#22833;&#36133;&#20102;&#65292;&#22240;&#20026;&#22905;&#30452;&#25509;&#22312;&#33258;&#24049;&#30340;&#24037;&#20316;&#25335;&#36125;&#19978;&#36816;&#34892;&#20102;<span class="command"><strong>svn unlock</strong></span>&#65292;&#32780;&#36825;&#37324;&#27809;&#26377;&#38145;&#23450;&#20196;&#29260;&#12290;&#20026;&#20102;&#30452;&#25509;&#20174;&#29256;&#26412;&#24211;&#21024;&#38500;&#38145;&#23450;&#65292;&#22905;&#38656;&#35201;&#32473;<span class="command"><strong>svn unlock</strong></span>&#20256;&#36882;URL&#21442;&#25968;&#65292;&#22905;&#30340;&#36825;&#19968;&#27425;&#23581;&#35797;&#21448;&#22833;&#36133;&#20102;&#65292;&#22240;&#20026;&#22905;&#19981;&#26159;&#38145;&#23450;&#30340;&#25317;&#26377;&#32773;(&#20063;&#27809;&#26377;&#38145;&#23450;&#20196;&#29260;)&#12290;&#24403;&#22905;&#20351;&#29992;&#20102;<code class="option">--force</code>&#36873;&#39033;&#21518;&#65292;&#35748;&#35777;&#21644;&#25480;&#26435;&#30340;&#35201;&#27714;&#34987;&#24573;&#30053;&#20102;&#65292;&#36828;&#31243;&#30340;&#38145;&#23450;&#34987;&#25171;&#30772;&#20102;&#12290;</p>
        <p>&#24403;&#28982;&#65292;&#31616;&#21333;&#30340;&#25171;&#30772;&#38145;&#23450;&#20063;&#35768;&#36824;&#19981;&#22815;&#65292;&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;Sally&#19981;&#20165;&#24819;&#35201;&#25171;&#30772;Harry&#36951;&#24536;&#30340;&#38145;&#23450;&#65292;&#22905;&#20063;&#24076;&#26395;&#33258;&#24049;&#37325;&#26032;&#38145;&#23450;&#12290;&#22905;&#21487;&#20197;&#36890;&#36807;&#36816;&#34892;<span class="command"><strong>svn unlock --force</strong></span>&#32039;&#25509;&#30528;<span class="command"><strong>svn lock</strong></span>&#65292;&#20294;&#26159;&#26377;&#21487;&#33021;&#26377;&#20154;&#22312;&#36825;&#20004;&#27425;&#21629;&#20196;&#20043;&#38388;&#38145;&#23450;&#20102;&#25991;&#20214;&#65292;&#26368;&#31616;&#21333;&#30340;&#26041;&#24335;&#26159;<em class="firstterm">&#31363;&#21462;</em>&#36825;&#20010;&#38145;&#23450;&#65292;&#23558;&#25171;&#30772;&#21644;&#37325;&#26032;&#38145;&#23450;&#21464;&#25104;&#19968;&#31181;&#21407;&#23376;&#25805;&#20316;&#65292;&#20026;&#27492;&#38656;&#35201;&#36816;&#34892;<span class="command"><strong>svn lock</strong></span>&#21152;<code class="option">--force</code>&#36873;&#39033;&#65306;</p>
        <pre class="screen">
$ svn lock raisin.jpg
svn: Lock request failed: 423 Locked (http://svn.example.com)
$ svn lock --force raisin.jpg
'raisin.jpg' locked by user 'sally'.
$
</pre>
        <p>&#22312;&#20219;&#20309;&#24773;&#20917;&#19979;&#65292;&#26080;&#35770;&#38145;&#23450;&#34987;&#25171;&#30772;&#36824;&#26159;&#31363;&#21462;&#65292;Harry&#37117;&#20250;&#24863;&#21040;&#24778;&#35766;&#12290;Harry&#30340;&#24037;&#20316;&#25335;&#36125;&#36824;&#20445;&#30041;&#26377;&#21407;&#26469;&#30340;&#38145;&#23450;&#20196;&#29260;&#65292;&#20294;&#26159;&#38145;&#23450;&#24050;&#32463;&#19981;&#23384;&#22312;&#20102;&#65292;&#38145;&#23450;&#20196;&#29260;&#21487;&#20197;&#35828;&#24050;&#32463;<em class="firstterm">&#27515;&#25481;&#20102;</em>&#12290;&#38145;&#23450;&#20196;&#29260;&#25351;&#20195;&#30340;&#38145;&#23450;&#34987;&#25171;&#30772;(&#29256;&#26412;&#24211;&#20013;&#19981;&#20877;&#23384;&#22312;)&#25110;&#32773;&#26159;&#31363;&#21462;&#20102;(&#34987;&#21478;&#19968;&#20010;&#38145;&#23450;&#20195;&#26367;&#20102;)&#65292;&#20219;&#20309;&#19968;&#31181;&#24773;&#20917;&#19979;&#65292;Harry&#37117;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn status</strong></span>&#35810;&#38382;&#29256;&#26412;&#24211;&#65306;</p>
        <pre class="screen">
$ svn status
     K raisin.jpg
$ svn status -u
     B         32   raisin.jpg
$ svn update
  B  raisin.jpg
$ svn status
$
</pre>
        <p>&#22914;&#26524;&#29256;&#26412;&#24211;&#38145;&#23450;&#34987;&#25171;&#30772;&#20102;&#65292;<span class="command"><strong>svn status --show-updates</strong></span>&#20250;&#22312;&#25991;&#20214;&#26049;&#36793;&#26174;&#31034;&#19968;&#20010;<code class="literal">B</code> (Broken)&#12290;&#22914;&#26524;&#26377;&#19968;&#20010;&#26032;&#30340;&#38145;&#65292;&#23601;&#20250;&#26174;&#31034;&#19968;&#20010;<code class="literal">T</code> (sTolen)&#31526;&#21495;&#12290;&#26368;&#32456;&#65292;<span class="command"><strong>svn update</strong></span>&#20250;&#27880;&#24847;&#21040;&#25152;&#26377;&#27515;&#25481;&#30340;&#38145;&#23450;&#24182;&#19988;&#25226;&#23427;&#20204;&#20174;&#24037;&#20316;&#25335;&#36125;&#20013;&#21024;&#38500;&#25481;&#12290;</p>
        <div class="sidebar"><p class="title"><b>&#38145;&#23450;&#31574;&#30053;</b></p>
          
          <p>&#19981;&#21516;&#30340;&#31995;&#32479;&#26377;&#19981;&#21516;&#30340;&#38145;&#23450;&#38480;&#21046;&#31243;&#24230;&#30340;&#35266;&#24565;&#12290;&#26377;&#20123;&#20154;&#35748;&#20026;&#38145;&#23450;&#24517;&#39035;&#19981;&#39038;&#20219;&#20309;&#20195;&#20215;&#30340;&#20005;&#26684;&#25191;&#34892;&#65292;&#21482;&#26377;&#21407;&#22987;&#30340;&#21019;&#24314;&#32773;&#21644;&#31649;&#29702;&#21592;&#21487;&#20197;&#37322;&#25918;&#12290;&#20182;&#20204;&#35748;&#20026;&#22914;&#26524;&#26377;&#20154;&#25171;&#30772;&#20102;&#38145;&#23450;&#65292;&#28151;&#20081;&#23601;&#20250;&#25918;&#20219;&#65292;&#38145;&#23450;&#23601;&#23436;&#20840;&#22833;&#21435;&#20102;&#24847;&#20041;&#12290;&#21478;&#22806;&#19968;&#20123;&#20154;&#35748;&#20026;&#38145;&#23450;&#26159;&#31532;&#19968;&#20010;&#21644;&#26368;&#39318;&#35201;&#30340;&#20132;&#27969;&#24037;&#20855;&#65292;&#22914;&#26524;&#29992;&#25143;&#32463;&#24120;&#30340;&#25171;&#30772;&#21035;&#20154;&#30340;&#38145;&#23450;&#65292;&#20195;&#34920;&#20102;&#22242;&#38431;&#30340;&#25991;&#21270;&#22833;&#36133;&#21644;&#36719;&#20214;&#20043;&#22806;&#30340;&#38382;&#39064;&#12290;</p>
          <p>Subversion&#32570;&#30465;&#26159;&#27604;&#36739;&#8220;<span class="quote">&#23485;&#26494;&#30340;</span>&#8221;&#26041;&#24335;&#65292;&#20294;&#20063;&#20801;&#35768;&#31649;&#29702;&#21592;&#21019;&#24314;&#38057;&#23376;&#33050;&#26412;&#26469;&#24314;&#31435;&#20005;&#26684;&#30340;&#25511;&#21046;&#31574;&#30053;&#12290;&#20855;&#20307;&#26469;&#35828;&#65292;<code class="filename">pre-lock</code>&#21644;<code class="filename">pre-unlock</code>&#38057;&#23376;&#20801;&#35768;&#31649;&#29702;&#21592;&#20915;&#23450;&#20160;&#20040;&#26102;&#20505;&#21019;&#24314;&#21644;&#37322;&#25918;&#38145;&#23450;&#12290;&#26681;&#25454;&#38145;&#23450;&#26159;&#21542;&#24050;&#32463;&#23384;&#22312;&#65292;&#36825;&#20004;&#20010;&#38057;&#23376;&#33050;&#26412;&#21487;&#20197;&#20915;&#23450;&#26159;&#21542;&#20801;&#35768;&#29305;&#23450;&#29992;&#25143;&#25171;&#30772;&#25110;&#31363;&#21462;&#38145;&#23450;&#12290;&#20063;&#26377;<code class="filename">post-lock</code>&#21644;<code class="filename">post-unlock</code>&#38057;&#23376;&#65292;&#21487;&#20197;&#29992;&#26469;&#21457;&#36865;&#38145;&#23450;&#21160;&#20316;&#30340;&#36890;&#30693;&#37038;&#20214;&#12290;&#20851;&#20110;&#29256;&#26412;&#24211;&#38057;&#23376;&#30340;&#26356;&#22810;&#20449;&#24687;&#21487;&#20197;&#30475;<a class="xref" href="svn.reposadmin.create.html#svn.reposadmin.create.hooks" title="&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;">&#8220;&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;&#8221;&#19968;&#33410;</a>&#12290;</p>
        </div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.advanced.locking.lock-communication"></a>&#38145;&#23450;&#20132;&#27969;</h3></div></div></div>
        
        <p>&#25105;&#20204;&#24050;&#32463;&#35265;&#21040;&#20102;&#22914;&#20309;&#21033;&#29992;<span class="command"><strong>svn lock</strong></span>&#21644;<span class="command"><strong>svn unlock</strong></span>&#26469;&#21019;&#24314;&#12289;&#37322;&#25918;&#12289;&#25171;&#30772;&#21644;&#31363;&#21462;&#38145;&#23450;&#65292;&#36825;&#23601;&#28385;&#36275;&#20102;&#39034;&#24207;&#35775;&#38382;&#25991;&#20214;&#30340;&#35201;&#27714;&#65292;&#20294;&#26159;&#28010;&#36153;&#26102;&#38388;&#36825;&#20010;&#22823;&#38382;&#39064;&#35813;&#22914;&#20309;&#21602;&#65311;</p>
        <p>&#20363;&#22914;&#65292;&#20551;&#23450;Harry&#38145;&#23450;&#20102;&#19968;&#20010;&#22270;&#29255;&#65292;&#24182;&#24320;&#22987;&#32534;&#36753;&#12290;&#21516;&#26102;&#65292;&#20960;&#33521;&#37324;&#20043;&#22806;&#30340;Sally&#24076;&#26395;&#20570;&#21516;&#26679;&#30340;&#24037;&#20316;&#65292;&#22905;&#27809;&#24819;&#21040;&#36816;&#34892;<span class="command"><strong>svn status --show-updates</strong></span>&#65292;&#22905;&#19981;&#30693;&#36947;Harry&#24050;&#32463;&#38145;&#23450;&#20102;&#25991;&#20214;&#12290;&#22905;&#33457;&#36153;&#20102;&#25968;&#23567;&#26102;&#26469;&#20462;&#25913;&#25991;&#20214;&#65292;&#24403;&#22905;&#30495;&#34987;&#25552;&#20132;&#26102;&#21457;&#29616;&#25991;&#20214;&#24050;&#32463;&#34987;&#38145;&#23450;&#25110;&#32773;&#26159;&#22905;&#30340;&#25991;&#20214;&#24050;&#32463;&#36807;&#26399;&#20102;&#12290;&#22905;&#30340;&#20462;&#25913;&#19981;&#33021;&#21644;Harry&#30340;&#21512;&#24182;&#65292;&#20182;&#20204;&#20013;&#30340;&#19968;&#20154;&#38656;&#35201;&#25243;&#24323;&#33258;&#24049;&#30340;&#24037;&#20316;&#65292;&#35768;&#22810;&#26102;&#38388;&#34987;&#28010;&#36153;&#20102;&#12290;</p>
        <p>Subversion&#38024;&#23545;&#27492;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#26159;&#25552;&#20379;&#19968;&#31181;&#26426;&#21046;&#65292;&#25552;&#37266;&#29992;&#25143;&#22312;&#24320;&#22987;&#32534;&#36753;<span class="emphasis"><em>&#20197;&#21069;</em></span>&#24517;&#39035;&#38145;&#23450;&#36825;&#20010;&#25991;&#20214;&#65292;&#36825;&#20010;&#26426;&#21046;&#23601;&#26159;&#25552;&#20379;&#19968;&#31181;&#29305;&#21035;&#30340;&#23646;&#24615;--<code class="literal">svn:needs-lock</code>&#12290;&#24403;&#26377;&#36825;&#20010;&#20540;&#26102;&#65292;<span class="emphasis"><em>&#38500;&#38750;</em></span>&#29992;&#25143;&#38145;&#23450;&#36825;&#20010;&#25991;&#20214;&#65292;&#21542;&#21017;&#25991;&#20214;&#19968;&#30452;&#26159;&#21482;&#35835;&#30340;&#12290;&#24403;&#24471;&#21040;&#19968;&#20010;&#38145;&#23450;&#20196;&#29260;(&#36816;&#34892;<span class="command"><strong>svn lock</strong></span>&#30340;&#32467;&#26524;)&#65292;&#25991;&#20214;&#21464;&#25104;&#21487;&#35835;&#20889;&#65292;&#24403;&#37322;&#25918;&#36825;&#20010;&#38145;&#21518;&#65292;&#25991;&#20214;&#21448;&#21464;&#25104;&#21482;&#35835;&#12290;</p>
        <p>&#26681;&#25454;&#36825;&#20010;&#21407;&#29702;&#65292;&#22914;&#26524;&#19968;&#20010;&#22270;&#20687;&#25991;&#20214;&#26377;&#36825;&#20010;&#23646;&#24615;&#65292;Sally&#25171;&#24320;&#32534;&#36753;&#25991;&#20214;&#23601;&#20250;&#31435;&#21051;&#27880;&#24847;&#21040;&#26377;&#20123;&#29305;&#21035;&#65292;&#22823;&#22810;&#25968;&#31243;&#24207;&#20250;&#22312;&#25171;&#24320;&#21482;&#35835;&#25991;&#20214;&#26102;&#31435;&#21051;&#35686;&#21578;&#65292;&#33267;&#23569;&#25152;&#26377;&#30340;&#31243;&#24207;&#20250;&#38450;&#27490;&#22905;&#20445;&#23384;&#20462;&#25913;&#65292;&#36825;&#25552;&#37266;&#20102;&#22905;&#32534;&#36753;&#20043;&#21069;&#38656;&#35201;&#38145;&#23450;&#25991;&#20214;&#65292;&#36825;&#26679;&#22905;&#23601;&#21457;&#29616;&#20102;&#21407;&#26469;&#23384;&#22312;&#30340;&#38145;&#23450;&#65306;</p>
        <pre class="screen">
$ /usr/local/bin/gimp raisin.jpg
gimp: error: file is read-only!
$ ls -l raisin.jpg
-r--r--r--   1 sally   sally   215589 Jun  8 19:23 raisin.jpg
$ svn lock raisin.jpg
svn: Lock request failed: 423 Locked (http://svn.example.com)
$ svn info http://svn.example.com/repos/project/raisin.jpg | grep Lock
Lock Token: opaquelocktoken:fc2b4dee-98f9-0310-abf3-653ff3226e6b
Lock Owner: harry
Lock Created: 2006-06-08 07:29:18 -0500 (Thu, 08 June 2006)
Lock Comment (1 line):
Making some tweaks.  Locking for the next two hours.
$
</pre>
        <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
          <p>&#25105;&#20204;&#40723;&#21169;&#29992;&#25143;&#21644;&#31649;&#29702;&#21592;&#37117;&#24212;&#35813;&#32473;&#19981;&#33021;&#26681;&#25454;&#19978;&#19979;&#25991;&#30340;&#25991;&#20214;&#28155;&#21152;<code class="literal">svn:needs-lock</code>&#23646;&#24615;&#65292;&#36825;&#26159;&#40723;&#21169;&#22909;&#30340;&#38145;&#23450;&#20064;&#24815;&#21644;&#38450;&#27490;&#28010;&#36153;&#30340;&#20027;&#35201;&#25216;&#26415;&#25163;&#27573;&#12290;</p>
        </div>
        <p>&#38656;&#35201;&#27880;&#24847;&#21040;&#36825;&#20010;&#23646;&#24615;&#26159;&#20381;&#36182;&#20110;&#38145;&#23450;&#31995;&#32479;&#30340;&#20132;&#27969;&#24037;&#20855;&#65292;&#19981;&#31649;&#26159;&#21542;&#26377;&#36825;&#20010;&#23646;&#24615;&#65292;&#25991;&#20214;&#37117;&#21487;&#20197;&#38145;&#23450;&#12290;&#30456;&#21453;&#30340;&#65292;&#26080;&#35770;&#26377;&#27809;&#26377;&#36825;&#20010;&#23646;&#24615;&#65292;&#24182;&#19981;&#20250;&#35201;&#27714;&#25552;&#20132;&#38656;&#35201;&#39318;&#20808;&#38145;&#23450;&#25991;&#20214;&#12290;</p>
        <p>&#36825;&#20010;&#31995;&#32479;&#24182;&#19981;&#26159;&#27627;&#26080;&#29781;&#30133;&#65292;&#21363;&#20351;&#26377;&#36825;&#20010;&#23646;&#24615;&#65292;&#21482;&#35835;&#25552;&#37266;&#20063;&#26377;&#21487;&#33021;&#22833;&#25928;&#12290;&#26377;&#20123;&#31243;&#24207;&#8220;<span class="quote">&#20599;&#20599;&#30340;&#31713;&#25913;&#20102;</span>&#8221;&#25991;&#20214;&#30340;&#21482;&#35835;&#23646;&#24615;&#65292;&#24708;&#26080;&#22768;&#24687;&#30340;&#20801;&#35768;&#29992;&#25143;&#32534;&#36753;&#21644;&#20445;&#23384;&#25991;&#20214;&#65292;&#19981;&#24184;&#30340;&#26159;&#65292;Subversion&#23545;&#27492;&#26080;&#33021;&#20026;&#21147;&#8212;&#21363;&#20351;&#21040;&#20102;&#29616;&#20170;&#65292;&#36824;&#26159;&#27809;&#26377;&#20219;&#20309;&#24037;&#20855;&#33021;&#22815;&#20195;&#26367;&#20154;&#19982;&#20154;&#30340;&#33391;&#22909;&#20132;&#27969;&#12290;<sup>[<a name="d4e2359" href="#ftn.d4e2359" class="footnote">17</a>]</sup></p>
      </div>
    <div class="footnotes"><br><hr width="100" align="left"><div class="footnote"><p><sup>[<a name="ftn.d4e2178" href="#d4e2178" class="para">15</a>] </sup>Communication wouldn't have been such bad medicine for
          Harry and Sally's Hollywood namesakes, either, for that
          matter.</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e2191" href="#d4e2191" class="para">16</a>] </sup>Subversion&#30446;&#21069;&#19981;&#20801;&#35768;&#38145;&#23450;&#30446;&#24405;&#12290;</p></div><div class="footnote"><p><sup>[<a name="ftn.d4e2359" href="#d4e2359" class="para">17</a>] </sup>&#38500;&#38750;&#26159;&#65292;&#25110;&#35768;&#19968;&#20010;&#32463;&#20856;&#30340;&#28779;&#31070;&#31934;&#31070;&#34701;&#21512;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.advanced.props.special.keywords.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.advanced.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.advanced.externals.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20851;&#38190;&#23383;&#26367;&#25442;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#22806;&#37096;&#23450;&#20041;</td></tr></table></div></body></html>