<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#26631;&#31614;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;"><link rel="prev" href="svn.branchmerge.switchwc.html" title="&#20351;&#29992;&#20998;&#25903;"><link rel="next" href="svn.branchmerge.maint.html" title="&#32500;&#25252;&#20998;&#25903;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#26631;&#31614;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.switchwc.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.maint.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.branchmerge.tags"></a>&#26631;&#31614;</h2></div></div></div>
      
      <p>&#21478;&#19968;&#20010;&#24120;&#35265;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#27010;&#24565;&#26159;&#26631;&shy;&frac34;(<em class="firstterm">tag</em>)&#65292;&#19968;&#20010;&#26631;&#31614;&#21482;&#26159;&#19968;&#20010;&#39033;&#30446;&#26576;&#19968;&#26102;&#38388;&#30340;&#8220;<span class="quote">&#24555;&#29031;</span>&#8221;&#65292;&#22312;Subversion&#37324;&#36825;&#20010;&#27010;&#24565;&#26080;&#22788;&#19981;&#22312;&#8212;&#27599;&#19968;&#27425;&#25552;&#20132;&#30340;&#20462;&#35746;&#29256;&#26412;&#37117;&#26159;&#19968;&#20010;&#31934;&#30830;&#30340;&#24555;&#29031;&#12290;</p>
      <p>&#28982;&#32780;&#20154;&#20204;&#24076;&#26395;&#26356;&#20154;&#24615;&#21270;&#30340;&#26631;&#31614;&#21517;&#31216;&#65292;&#20687;<code class="literal">release-1.0</code>&#12290;&#20182;&#20204;&#20063;&#24076;&#26395;&#21487;&#20197;&#23545;&#19968;&#20010;&#23376;&#30446;&#24405;&#24555;&#29031;&#65292;&#27605;&#31455;&#65292;&#35760;&#20303;release-1.0&#26159;&#20462;&#35746;&#29256;&#26412;4822&#30340;&#26576;&#19968;&#23567;&#37096;&#20998;&#19981;&#26159;&#20214;&#24456;&#23481;&#26131;&#30340;&#20107;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.tags.mksimple"></a>&#24314;&#31435;&#31616;&#21333;&#26631;&#31614;</h3></div></div></div>
        
        <p><span class="command"><strong>svn copy</strong></span>&#20877;&#27425;&#30331;&#22330;&#65292;&#20320;&#24076;&#26395;&#24314;&#31435;&#19968;&#20010;<code class="filename">/calc/trunk</code>&#30340;&#19968;&#20010;&#24555;&#29031;&#65292;&#23601;&#20687;<code class="literal">HEAD</code>&#20462;&#35746;&#29256;&#26412;&#65292;&#24314;&#31435;&#36825;&#26679;&#19968;&#20010;&#25335;&#36125;&#65306;</p>
        <pre class="screen">
$ svn copy http://svn.example.com/repos/calc/trunk \
           http://svn.example.com/repos/calc/tags/release-1.0 \
      -m "Tagging the 1.0 release of the 'calc' project."

Committed revision 351.
</pre>
        <p>&#36825;&#20010;&#20363;&#23376;&#20551;&#23450;<code class="filename">/calc/tags</code>&#30446;&#24405;&#24050;&#32463;&#23384;&#22312;(&#22914;&#26524;&#19981;&#26159;&#65292;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn mkdir</strong></span>&#21019;&#24314;&#12290;)&#65292;&#25335;&#36125;&#23436;&#25104;&#20043;&#21518;&#65292;&#19968;&#20010;&#34920;&#31034;&#24403;&#26102;<code class="literal">HEAD</code>&#29256;&#26412;&#30340;/calc/trunk&#30446;&#24405;&#30340;&#38236;&#20687;&#24050;&#32463;&#27704;&#20037;&#30340;&#25335;&#36125;&#21040;<code class="filename">release-1.0</code>&#30446;&#24405;&#12290;&#24403;&#28982;&#65292;&#20320;&#20250;&#24076;&#26395;&#26356;&#31934;&#30830;&#19968;&#28857;&#65292;&#20197;&#38450;&#20854;&#20182;&#20154;&#22312;&#20320;&#19981;&#27880;&#24847;&#30340;&#26102;&#20505;&#25552;&#20132;&#20462;&#25913;&#65292;&#25152;&#20197;&#65292;&#22914;&#26524;&#20320;&#30693;&#36947;<code class="filename">/calc/trunk</code>&#30340;&#29256;&#26412;350&#26159;&#20320;&#24819;&#35201;&#30340;&#24555;&#29031;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svn copy</strong></span>&#21152;&#21442;&#25968; <code class="option">-r 350</code>&#12290;</p>
        <p>&#20294;&#26159;&#31561;&#19968;&#19979;&#65306;&#26631;&#31614;&#30340;&#20135;&#29983;&#36807;&#31243;&#19982;&#24314;&#31435;&#20998;&#25903;&#26159;&#19968;&#26679;&#30340;&#65311;&#26159;&#30340;&#65292;&#23454;&#38469;&#19978;&#22312;Subversion&#20013;&#26631;&#31614;&#19982;&#20998;&#25903;&#27809;&#26377;&#21306;&#21035;&#65292;&#37117;&#26159;&#26222;&#36890;&#30340;&#30446;&#24405;&#65292;&#36890;&#36807;copy&#21629;&#20196;&#24471;&#21040;&#65292;&#19982;&#20998;&#25903;&#19968;&#26679;&#65292;&#19968;&#20010;&#30446;&#24405;&#20043;&#25152;&#20197;&#26159;&#26631;&#31614;&#21482;&#26159;<span class="emphasis"><em>&#20154;&#20204;</em></span>&#20915;&#23450;&#36825;&#26679;&#20351;&#29992;&#23427;&#65292;&#21482;&#35201;&#27809;&#26377;&#20154;&#25552;&#20132;&#36825;&#20010;&#30446;&#24405;&#65292;&#23427;&#27704;&#36828;&#26159;&#19968;&#20010;&#24555;&#29031;&#65292;&#20294;&#22914;&#26524;&#20154;&#20204;&#24320;&#22987;&#25552;&#20132;&#65292;&#23427;&#23601;&#21464;&#25104;&#20102;&#20998;&#25903;&#12290;</p>
        <p>&#22914;&#26524;&#20320;&#31649;&#29702;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#20320;&#26377;&#20004;&#31181;&#26041;&#24335;&#31649;&#29702;&#26631;&#31614;&#65292;&#31532;&#19968;&#31181;&#26041;&#27861;&#26159;&#31105;&#27490;&#21629;&#20196;&#65306;&#20316;&#20026;&#39033;&#30446;&#30340;&#25919;&#31574;&#65292;&#25105;&#20204;&#35201;&#20915;&#23450;&#26631;&#31614;&#25152;&#22312;&#30340;&#20301;&#32622;&#65292;&#30830;&#23450;&#25152;&#26377;&#29992;&#25143;&#30693;&#36947;&#22914;&#20309;&#22788;&#29702;&#25335;&#36125;&#30340;&#30446;&#24405;(&#20063;&#23601;&#26159;&#30830;&#20445;&#20182;&#20204;&#19981;&#20250;&#25552;&#20132;&#20182;&#20204;)&#65292;&#31532;&#20108;&#31181;&#26041;&#27861;&#30475;&#26469;&#24456;&#36807;&#20998;&#65306;&#20351;&#29992;&#35775;&#38382;&#25511;&#21046;&#33050;&#26412;&#26469;&#38459;&#27490;&#20219;&#20309;&#24819;&#23545;&#26631;&#31614;&#30446;&#24405;&#20570;&#30340;&#38750;&#25335;&#36125;&#30340;&#25805;&#20316;(&#35265;<a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>)&#36825;&#31181;&#26041;&#27861;&#36890;&#24120;&#26159;&#19981;&#24517;&#35201;&#30340;&#65292;&#22914;&#26524;&#19968;&#20010;&#20154;&#19981;&#23567;&#24515;&#25552;&#20132;&#20102;&#21040;&#26631;&#31614;&#30446;&#24405;&#19968;&#20010;&#20462;&#25913;&#65292;&#20320;&#21487;&#20197;&#31616;&#21333;&#30340;&#21462;&#28040;&#65292;&#27605;&#31455;&#36825;&#26159;&#29256;&#26412;&#25511;&#21046;&#21834;&#12290;</p>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.branchmerge.tags.mkcomplex"></a>&#24314;&#31435;&#22797;&#26434;&#26631;&#31614;</h3></div></div></div>
        
        <p>&#26377;&#26102;&#20505;&#20320;&#24076;&#26395;&#20320;&#30340;&#8220;<span class="quote">&#24555;&#29031;</span>&#8221;&#33021;&#22815;&#24456;&#22797;&#26434;&#65292;&#32780;&#19981;&#21482;&#26159;&#19968;&#20010;&#21333;&#29420;&#20462;&#35746;&#29256;&#26412;&#30340;&#19968;&#20010;&#21333;&#29420;&#30446;&#24405;&#12290;</p>
        <p>&#20030;&#20010;&#20363;&#23376;&#65292;&#20551;&#23450;&#20320;&#30340;&#39033;&#30446;&#27604;&#25105;&#20204;&#30340;&#30340;&#20363;&#23376;<code class="filename">calc</code>&#22823;&#30340;&#22810;&#65306;&#20551;&#35774;&#23427;&#20445;&#23384;&#20102;&#19968;&#32452;&#23376;&#30446;&#24405;&#21644;&#35768;&#22810;&#25991;&#20214;&#65292;&#22312;&#20320;&#24037;&#20316;&#26102;&#65292;&#20320;&#25110;&#35768;&#20915;&#23450;&#21019;&#24314;&#19968;&#20010;&#21253;&#25324;&#29305;&#23450;&#29305;&#24615;&#21644;Bug&#20462;&#27491;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#36873;&#25321;&#24615;&#30340;&#22238;&#28335;&#25991;&#20214;&#21644;&#30446;&#24405;&#21040;&#29305;&#23450;&#20462;&#35746;&#29256;&#26412;(&#20351;&#29992;<span class="command"><strong>svn update -r</strong></span>)&#26469;&#23454;&#29616;&#65292;&#25110;&#32773;&#36716;&#25442;&#25991;&#20214;&#21644;&#30446;&#24405;&#21040;&#29305;&#23450;&#20998;&#25903;(&#20351;&#29992;<span class="command"><strong>svn switch</strong></span>)&#65292;&#36825;&#26679;&#20570;&#20043;&#21518;&#65292;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#25104;&#20026;&#29256;&#26412;&#24211;&#19981;&#21516;&#29256;&#26412;&#21644;&#20998;&#25903;&#30340;&#21496;&#20196;&#37096;&#65292;&#20294;&#26159;&#32463;&#36807;&#27979;&#35797;&#65292;&#20320;&#20250;&#30693;&#36947;&#36825;&#26159;&#20320;&#38656;&#35201;&#30340;&#19968;&#31181;&#31934;&#30830;&#25968;&#25454;&#32452;&#21512;&#12290;</p>
        <p>&#26159;&#26102;&#20505;&#36827;&#34892;&#24555;&#29031;&#20102;&#65292;&#25335;&#36125;URL&#22312;&#36825;&#37324;&#19981;&#33021;&#24037;&#20316;&#65292;&#22312;&#36825;&#20010;&#20363;&#23376;&#37324;&#65292;&#20320;&#24076;&#26395;&#25226;&#26412;&#22320;&#25335;&#36125;&#30340;&#24067;&#23616;&#20570;&#38236;&#20687;&#24182;&#19988;&#20445;&#23384;&#21040;&#29256;&#26412;&#24211;&#20013;&#65292;&#24184;&#36816;&#30340;&#26159;&#65292;<span class="command"><strong>svn copy</strong></span>&#21253;&#25324;&#22235;&#31181;&#19981;&#21516;&#30340;&#20351;&#29992;&#26041;&#24335;(&#22312;<a class="xref" href="svn.ref.html" title="&#31532;&nbsp;9&nbsp;&#31456;&nbsp;Subversion &#23436;&#20840;&#21442;&#32771;">&#31532;&nbsp;9&nbsp;&#31456; <i>Subversion &#23436;&#20840;&#21442;&#32771;</i></a>&#21487;&#20197;&#35814;&#32454;&#38405;&#35835;)&#65292;&#21253;&#25324;&#25335;&#36125;&#24037;&#20316;&#25335;&#36125;&#21040;&#29256;&#26412;&#24211;&#65306;</p>
        <pre class="screen">
$ ls
my-working-copy/

$ svn copy my-working-copy http://svn.example.com/repos/calc/tags/mytag

Committed revision 352.
</pre>
        <p>&#29616;&#22312;&#22312;&#29256;&#26412;&#24211;&#26377;&#19968;&#20010;&#26032;&#30340;&#30446;&#24405;<code class="filename">/calc/tags/mytag</code>&#65292;&#36825;&#26159;&#20320;&#30340;&#26412;&#22320;&#25335;&#36125;&#30340;&#19968;&#20010;&#24555;&#29031;&#8212;&#28151;&#21512;&#20102;&#20462;&#35746;&#29256;&#26412;&#65292;URL&#31561;&#31561;&#12290;</p>
        <p>&#19968;&#20123;&#20154;&#20063;&#21457;&#29616;&#36825;&#19968;&#29305;&#24615;&#19968;&#20123;&#26377;&#36259;&#30340;&#20351;&#29992;&#26041;&#24335;&#65292;&#26377;&#20123;&#26102;&#20505;&#26412;&#22320;&#25335;&#36125;&#26377;&#19968;&#32452;&#26412;&#22320;&#20462;&#25913;&#65292;&#20320;&#24076;&#26395;&#20320;&#30340;&#21327;&#20316;&#32773;&#30475;&#21040;&#36825;&#20123;&#65292;&#19981;&#20351;&#29992;<span class="command"><strong>svn diff</strong></span>&#24182;&#21457;&#36865;&#19968;&#20010;&#34917;&#23450;&#25991;&#20214;(&#19981;&#20250;&#25429;&#25417;&#21040;&#30446;&#24405;&#12289;&#31526;&#21495;&#38142;&#21644;&#23646;&#24615;&#30340;&#20462;&#25913;)&#65292;&#32780;&#26159;&#20351;&#29992;<span class="command"><strong>svn copy</strong></span>&#26469;&#8220;<span class="quote">&#19978;&#20256;</span>&#8221;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#21040;&#19968;&#20010;&#29256;&#26412;&#24211;&#30340;&#31169;&#26377;&#21306;&#22495;&#65292;&#20320;&#30340;&#21327;&#20316;&#32773;&#21487;&#20197;&#36873;&#25321;&#23436;&#25972;&#30340;&#21462;&#20986;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#65292;&#25110;&#20351;&#29992;<span class="command"><strong>svn merge</strong></span>&#26469;&#25509;&#21463;&#20320;&#30340;&#31934;&#30830;&#20462;&#25913;&#12290;</p>
        <p>&#34429;&#28982;&#36825;&#26159;&#19978;&#20256;&#24555;&#36895;&#24037;&#20316;&#25335;&#36125;&#24555;&#29031;&#30340;&#19968;&#20010;&#22909;&#26041;&#27861;&#65292;&#20294;&#36825;<span class="emphasis"><em>&#19981;&#26159;</em></span>&#21021;&#22987;&#21019;&#24314;&#20998;&#25903;&#30340;&#22909;&#26041;&#27861;&#12290;&#20998;&#25903;&#21019;&#24314;&#24517;&#39035;&#26159;&#23427;&#26412;&#36523;&#30340;&#20107;&#20214;&#65292;&#32780;&#36825;&#20010;&#26041;&#27861;&#21019;&#24314;&#30340;&#20998;&#25903;&#21253;&#21547;&#20102;&#39069;&#22806;&#20462;&#25913;&#65292;&#37117;&#21253;&#21547;&#22312;&#19968;&#20010;&#21333;&#29420;&#20462;&#35746;&#29256;&#26412;&#37324;&#12290;&#36825;&#35753;&#25105;&#20204;&#24456;&#38590;&#35782;&#21035;&#20998;&#25903;&#28857;&#30340;&#21333;&#20010;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#12290;</p>
        <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
          <p>&#20320;&#26159;&#21542;&#21457;&#29616;&#20320;&#20570;&#20986;&#20102;&#22797;&#26434;&#30340;&#20462;&#25913;(&#22312;<code class="filename">/trunk</code>&#30340;&#24037;&#20316;&#25335;&#36125;)&#65292;&#24182;&#31361;&#28982;&#21457;&#29616;&#65292;&#8220;<span class="quote">&#36825;&#20123;&#20462;&#25913;&#24517;&#39035;&#22312;&#23427;&#20204;&#33258;&#24049;&#30340;&#20998;&#25903;&#65311;</span>&#8221;&#22788;&#29702;&#36825;&#20010;&#38382;&#39064;&#30340;&#25216;&#26415;&#21487;&#20197;&#24635;&#32467;&#20026;&#20004;&#27493;&#65306;</p>
          <pre class="screen">
$ svn copy http://svn.example.com/repos/calc/trunk \
           http://svn.example.com/repos/calc/branches/newbranch
Committed revision 353.

$ svn switch http://svn.example.com/repos/calc/branches/newbranch
At revision 353.
</pre>
          <p>&#23601;&#20687;<span class="command"><strong>svn update</strong></span>&#21629;&#20196;&#65292;<span class="command"><strong>svn switch</strong></span>&#20250;&#20445;&#30041;&#24037;&#20316;&#25335;&#36125;&#30340;&#26412;&#22320;&#20462;&#25913;&#65292;&#27492;&#21051;&#65292;&#20320;&#30340;&#24037;&#20316;&#25335;&#36125;&#21453;&#26144;&#21040;&#26032;&#24314;&#30340;&#20998;&#25903;&#19978;&#65292;&#32780;&#20320;&#30340;&#19979;&#19968;&#27425;<span class="command"><strong>svn commit</strong></span>&#20250;&#21457;&#36865;&#20462;&#25913;&#21040;&#26381;&#21153;&#22120;&#12290;</p>
        </div>
      </div>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.switchwc.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.branchmerge.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.branchmerge.maint.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#20351;&#29992;&#20998;&#25903;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#32500;&#25252;&#20998;&#25903;</td></tr></table></div></body></html>