<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#21069;&#35328;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="prev" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="next" href="svn.preface.html" title="&#24207;&#35328;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21069;&#35328;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.preface.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="preface" lang="zh-cn"><div class="titlepage"><div><div><h1 class="title"><a name="svn.foreword"></a>&#21069;&#35328;</h1></div><div><div class="author"><h3 class="author"><span class="firstname">Karl</span> <span class="surname">Fogel</span></h3></div></div><div><p class="pubdate">&#33437;&#21152;&#21733;&#65292;2004&#24180;3&#26376;14&#26085;</p></div></div></div>
    
    <p>&#19968;&#20010;&#24046;&#21170;&#30340;&#24120;&#35265;&#38382;&#39064;&#21015;&#34920;(FAQ)&#24635;&#26159;&#20805;&#26021;&#30528;&#20316;&#32773;<span class="emphasis"><em>&#28212;&#26395;&#34987;&#38382;&#21040;&#30340;</em></span>&#38382;&#39064;&#65292;&#32780;&#19981;&#26159;&#20154;&#20204;&#30495;&#27491;&#24819;&#35201;&#20102;&#35299;&#30340;&#38382;&#39064;&#12290;&#20063;&#35768;&#20320;&#26366;&#32463;&#35265;&#36807;&#19979;&#38754;&#36825;&#26679;&#30340;&#38382;&#39064;&#65306;</p>
    <div class="blockquote"><blockquote class="blockquote">
      <p>Q&#65306;&#24590;&#26679;&#20351;&#29992;Glorbosoft XYZ&#26368;&#22823;&#31243;&#24230;&#30340;&#25552;&#39640;&#22242;&#38431;&#29983;&#20135;&#29575;&#65311;</p>
    </blockquote></div>
    <div class="blockquote"><blockquote class="blockquote">
      <p>A&#65306;&#35768;&#22810;&#23458;&#25143;&#24076;&#26395;&#30693;&#36947;&#24590;&#26679;&#21033;&#29992;&#25105;&#20204;&#38761;&#21629;&#24615;&#30340;&#19987;&#21033;&#21150;&#20844;&#22871;&#20214;&#26368;&#22823;&#31243;&#24230;&#30340;&#25552;&#39640;&#29983;&#20135;&#29575;&#12290;&#31572;&#26696;&#38750;&#24120;&#31616;&#21333;&#65306;&#39318;&#20808;&#65292;&#28857;&#20987;&#8220;<span class="quote"><code class="literal">&#25991;&#20214;</code></span>&#8221; &#33756;&#21333;&#65292;&#25214;&#21040;&#8220;<span class="quote"><code class="literal">&#25552;&#39640;&#29983;&#20135;&#29575;</code></span>&#8221;&#33756;&#21333;&#39033;&#65292;&#28982;&#21518;&#8230;</p>
    </blockquote></div>
    <p>&#31867;&#20284;&#30340;&#38382;&#39064;&#23436;&#20840;&#19981;&#31526;&#21512;FAQ&#30340;&#31934;&#31070;&#12290;&#27809;&#20154;&#20250;&#25171;&#30005;&#35805;&#32473;&#25216;&#26415;&#25903;&#25345;&#20013;&#24515;&#65292;&#35810;&#38382;&#8220;<span class="quote">&#24590;&#26679;&#25552;&#39640;&#29983;&#20135;&#29575;&#65311;</span>&#8221;&#30456;&#21453;&#65292;&#20154;&#20204;&#32463;&#24120;&#35810;&#38382;&#19968;&#20123;&#38750;&#24120;&#20855;&#20307;&#30340;&#38382;&#39064;&#65292;&#20687;&#8220;<span class="quote">&#24590;&#26679;&#35753;&#26085;&#31243;&#31995;&#32479;&#25552;&#21069;&#20004;&#22825;&#32780;&#19981;&#26159;&#19968;&#22825;&#25552;&#37266;&#30456;&#20851;&#29992;&#25143;&#65311;</span>&#8221;&#31561;&#31561;&#12290;&#20294;&#26159;&#24819;&#35937;&#27604;&#21457;&#29616;&#30495;&#27491;&#30340;&#38382;&#39064;&#26356;&#23481;&#26131;&#12290;&#26500;&#24314;&#19968;&#20010;&#30495;&#23454;&#30340;&#38382;&#39064;&#21015;&#34920;&#38656;&#35201;&#25345;&#20043;&#20197;&#24658;&#30340;&#12289;&#26377;&#32452;&#32455;&#30340;&#36763;&#21220;&#24037;&#20316;&#65306;&#36328;&#36234;&#25972;&#20010;&#36719;&#20214;&#29983;&#21629;&#21608;&#26399;&#65292;&#36861;&#36394;&#26032;&#25552;&#20986;&#30340;&#38382;&#39064;&#65292;&#30417;&#25511;&#21453;&#39304;&#20449;&#24687;&#65292;&#25152;&#26377;&#30340;&#38382;&#39064;&#35201;&#25972;&#29702;&#25104;&#19968;&#20010;&#32479;&#19968;&#30340;&#12289;&#21487;&#26597;&#35810;&#30340;&#25972;&#20307;&#65292;&#24182;&#19988;&#33021;&#22815;&#30495;&#23454;&#30340;&#21453;&#26144;&#25152;&#26377;&#29992;&#25143;&#30340;&#24863;&#21463;&#12290;&#36825;&#38656;&#35201;&#32784;&#24515;&#65292;&#22914;&#33258;&#28982;&#23398;&#23478;&#19968;&#26679;&#20005;&#35880;&#30340;&#24577;&#24230;&#65292;&#27809;&#26377;&#28014;&#21326;&#30340;&#20551;&#35774;&#65292;&#27809;&#26377;&#34394;&#24187;&#30340;&#26029;&#35328;&#8212;&#30456;&#21453;&#30340;&#65292;&#38656;&#35201;&#24320;&#25918;&#30340;&#35270;&#37326;&#21644;&#31934;&#30830;&#30340;&#35760;&#24405;&#12290;</p>
    <p>&#25105;&#24456;&#21916;&#27426;&#36825;&#26412;&#20070;&#65292;&#22240;&#20026;&#23427;&#27491;&#26159;&#25353;&#29031;&#36825;&#31181;&#31934;&#31070;&#24314;&#31435;&#36215;&#26469;&#30340;&#65292;&#36825;&#31181;&#31934;&#31070;&#20307;&#29616;&#22312;&#26412;&#20070;&#30340;&#27599;&#19968;&#39029;&#20013;&#12290;&#36825;&#26159;&#20316;&#32773;&#19982;&#29992;&#25143;&#30452;&#25509;&#20132;&#27969;&#30340;&#32467;&#26524;&#12290;&#32780;&#36825;&#19968;&#20999;&#26159;&#28304;&#20110;Ben Collins-Sussman's&#23545;&#20110;Subversion&#24120;&#35265;&#38382;&#39064;&#37038;&#20214;&#21015;&#34920;&#30340;&#30740;&#31350;&#12290;&#20182;&#21457;&#29616;&#20154;&#20204;&#24635;&#26159;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#37325;&#22797;&#35810;&#38382;&#19968;&#20123;&#22522;&#26412;&#38382;&#39064;&#65306;&#20351;&#29992;subversion&#30340;&#19968;&#33324;&#31243;&#24207;&#26159;&#24590;&#26679;&#30340;&#65311;&#20998;&#25903;&#19982;&#26631;&#31614;&#21516;&#20854;&#23427;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#24037;&#20316;&#26041;&#24335;&#19968;&#26679;&#21527;&#65311;&#25105;&#24590;&#26679;&#30693;&#36947;&#26576;&#19968;&#22788;&#20462;&#25913;&#26159;&#35841;&#20570;&#30340;&#65311;</p>
    <p>&#26085;&#22797;&#19968;&#26085;&#30475;&#21040;&#30456;&#21516;&#38382;&#39064;&#30340;&#28902;&#38391;&#65292;&#20419;&#20351;Ben&#22312;2002&#24180;&#30340;&#22799;&#22825;&#21162;&#21147;&#24037;&#20316;&#20102;&#19968;&#20010;&#26376;&#65292;&#25776;&#20889;&#20102;&#19968;&#26412;<em class="citetitle">Subversion&#25163;&#20876;</em>&#65292;&#19968;&#26412;&#20845;&#21313;&#39029;&#21402;&#30340;&#12289;&#28085;&#30422;&#20102;&#25152;&#26377;Subversion&#20351;&#29992;&#22522;&#30784;&#30693;&#35782;&#30340;&#25163;&#20876;&#12290;&#36825;&#26412;&#25163;&#20876;&#27809;&#26377;&#35828;&#26126;&#26368;&#32456;&#23450;&#31295;&#30340;&#26102;&#38388;&#65292;&#20294;&#23427;&#38543;&#30528;Subversion&#30340;&#27599;&#20010;&#29256;&#26412;&#19968;&#36215;&#21457;&#24067;&#65292;&#24110;&#21161;&#35768;&#22810;&#29992;&#25143;&#36328;&#36807;&#23398;&#20064;&#20043;&#21021;&#30340;&#33392;&#38590;&#12290;&#24403;O'Reilly&#21644;Associates&#20915;&#23450;&#20986;&#29256;&#19968;&#26412;&#23436;&#22791;&#30340;Subversion&#22270;&#20070;&#30340;&#26102;&#20505;&#65292;&#19968;&#26465;&#25463;&#24452;&#28014;&#20986;&#27700;&#38754;&#65306;&#25193;&#20805;Subversion&#25163;&#20876;&#12290;</p>
    <p>&#26032;&#20070;&#30340;&#19977;&#20301;&#21512;&#33879;&#32773;&#22240;&#32780;&#38754;&#20020;&#30528;&#19968;&#20010;&#19981;&#23547;&#24120;&#30340;&#26426;&#20250;&#12290;&#20174;&#32844;&#36131;&#19978;&#35762;&#65292;&#20182;&#20204;&#30340;&#20219;&#21153;&#26159;&#20174;&#19968;&#20010;&#30446;&#24405;&#21644;&#19968;&#20123;&#33609;&#31295;&#20026;&#22522;&#30784;&#65292;&#33258;&#19978;&#32780;&#19979;&#30340;&#20889;&#19968;&#37096;&#19987;&#33879;&#12290;&#20294;&#20107;&#23454;&#19978;&#65292;&#20182;&#20204;&#30340;&#28789;&#24863;&#28304;&#27849;&#21017;&#26469;&#33258;&#19968;&#20123;&#20855;&#20307;&#30340;&#20869;&#23481;&#65292;&#31283;&#23450;&#21364;&#38590;&#20197;&#32452;&#32455;&#12290;Subversion&#34987;&#25968;&#20197;&#21315;&#35745;&#30340;&#26089;&#26399;&#29992;&#25143;&#37319;&#29992;&#65292;&#36825;&#20123;&#29992;&#25143;&#25552;&#20379;&#20102;&#22823;&#37327;&#30340;&#21453;&#39304;&#65292;&#19981;&#20165;&#20165;&#38024;&#23545;Subversion&#65292;&#36824;&#21253;&#25324;&#19994;&#24050;&#23384;&#22312;&#30340;&#25991;&#26723;&#12290;</p>
    <p>&#22312;&#20889;&#36825;&#26412;&#20070;&#30340;&#36807;&#31243;&#37324;&#65292;Ben&#65292;Mike &#21644; Brian&#19968;&#30452;&#20687;&#39740;&#39746;&#19968;&#26679;&#28216;&#33633;&#22312;Subversion&#37038;&#20214;&#21015;&#34920;&#21644;&#32842;&#22825;&#23460;&#20013;&#65292;&#20180;&#32454;&#30340;&#30740;&#31350;&#29992;&#25143;&#23454;&#38469;&#36935;&#21040;&#30340;&#38382;&#39064;&#12290;&#30417;&#35270;&#36825;&#20123;&#21453;&#39304;&#20063;&#26159;&#20182;&#20204;&#22312;CollabNet&#24037;&#20316;&#30340;&#19968;&#37096;&#20998;&#65292;&#36825;&#32473;&#20182;&#20204;&#25776;&#20889;Subversion&#25991;&#26723;&#25552;&#20379;&#20102;&#24040;&#22823;&#30340;&#20415;&#21033;&#12290;&#36825;&#26412;&#20070;&#24314;&#31435;&#22312;&#20016;&#23500;&#30340;&#20351;&#29992;&#32463;&#39564;&#65292;&#32780;&#38750;&#22312;&#27969;&#27801;&#33324;&#33030;&#24369;&#30340;&#24819;&#35937;&#20043;&#19978;&#65292;&#23427;&#32467;&#21512;&#20102;&#29992;&#25143;&#25163;&#20876;&#21644;FAQ&#30340;&#20248;&#28857;&#12290;&#21021;&#27425;&#38405;&#35835;&#26102;&#65292;&#36825;&#31181;&#20108;&#20803;&#24615;&#30340;&#20248;&#21183;&#24182;&#19981;&#26126;&#26174;&#65292;&#25353;&#29031;&#39034;&#24207;&#65292;&#20174;&#21069;&#21040;&#21518;&#65292;&#36825;&#26412;&#20070;&#21482;&#26159;&#31616;&#21333;&#30340;&#20174;&#22836;&#21040;&#23614;&#25551;&#36848;&#20102;&#36719;&#20214;&#30340;&#32454;&#33410;&#12290;&#20070;&#20013;&#30340;&#20869;&#23481;&#21253;&#25324;&#19968;&#31456;&#27010;&#36848;&#65292;&#19968;&#31456;&#24517;&#19981;&#21487;&#23569;&#30340;&#24555;&#36895;&#25351;&#21335;&#65292;&#19968;&#31456;&#20851;&#20110;&#31649;&#29702;&#37197;&#32622;&#65292;&#19968;&#20123;&#39640;&#32423;&#20027;&#39064;&#65292;&#24403;&#28982;&#36824;&#21253;&#25324;&#21629;&#20196;&#21442;&#32771;&#25163;&#20876;&#21644;&#25925;&#38556;&#25490;&#38500;&#25351;&#21335;&#12290;&#32780;&#24403;&#20320;&#36807;&#19968;&#27573;&#26102;&#38388;&#20043;&#21518;&#65292;&#20877;&#27425;&#32763;&#24320;&#26412;&#20070;&#26597;&#25214;&#19968;&#20123;&#29305;&#23450;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#26696;&#26102;&#65292;&#36825;&#31181;&#20108;&#20803;&#24615;&#25165;&#24471;&#20197;&#26174;&#29616;&#65306;&#36825;&#20123;&#29983;&#21160;&#30340;&#32454;&#33410;&#19968;&#23450;&#26469;&#33258;&#19981;&#21487;&#39044;&#27979;&#30340;&#23454;&#38469;&#29992;&#20363;&#30340;&#25552;&#28860;&#65292;&#22823;&#22810;&#26159;&#28304;&#20110;&#29992;&#25143;&#30340;&#38656;&#35201;&#21644;&#35270;&#28857;&#12290;</p>
    <p>&#24403;&#28982;&#65292;&#27809;&#20154;&#21487;&#20197;&#25215;&#35834;&#36825;&#26412;&#20070;&#21487;&#20197;&#22238;&#31572;&#25152;&#26377;&#38382;&#39064;&#12290;&#23613;&#31649;&#26377;&#26102;&#20505;&#19968;&#20123;&#21069;&#20154;&#25552;&#38382;&#30340;&#24778;&#20154;&#19968;&#33268;&#24615;&#35753;&#20320;&#24863;&#35273;&#26159;&#24515;&#28789;&#24863;&#24212;&#65307;&#20320;&#20173;&#26377;&#21487;&#33021;&#22312;&#31038;&#21306;&#30340;&#30693;&#35782;&#24211;&#37324;&#25684;&#36324;&#65292;&#31354;&#25163;&#32780;&#24402;&#12290;&#22914;&#26524;&#26377;&#36825;&#31181;&#24773;&#20917;&#65292;&#26368;&#22909;&#30340;&#21150;&#27861;&#26159;&#20889;&#26126;&#38382;&#39064;&#21457;&#36865;email&#21040;<code class="email">&lt;<a class="email" href="mailto:users@subversion.tigris.org">users@subversion.tigris.org</a>&gt;</code>&#65292;&#20316;&#32773;&#36824;&#22312;&#37027;&#37324;&#20851;&#27880;&#30528;&#31038;&#21306;&#65292;&#19981;&#20165;&#20165;&#23553;&#38754;&#25552;&#21040;&#30340;&#19977;&#20301;&#65292;&#36824;&#21253;&#25324;&#35768;&#22810;&#26366;&#32463;&#20316;&#20986;&#20462;&#27491;&#19982;&#25552;&#20379;&#21407;&#22987;&#26448;&#26009;&#30340;&#20154;&#12290;&#20174;&#31038;&#21306;&#30340;&#35270;&#35282;&#65292;&#24110;&#20320;&#35299;&#20915;&#38382;&#39064;&#21482;&#26159;&#36880;&#27493;&#30340;&#35843;&#25972;&#36825;&#26412;&#20070;&#65292;&#36827;&#19968;&#27493;&#35843;&#25972;Subversion&#26412;&#36523;&#20197;&#26356;&#21512;&#29702;&#30340;&#36866;&#21512;&#29992;&#25143;&#20351;&#29992;&#36825;&#26679;&#19968;&#20010;&#22823;&#24037;&#31243;&#30340;&#19968;&#20010;&#26377;&#36259;&#30340;&#39069;&#22806;&#25928;&#29992;&#12290;&#20182;&#20204;&#28212;&#26395;&#20320;&#30340;&#20449;&#24687;&#65292;&#19981;&#20165;&#20165;&#21487;&#20197;&#24110;&#21161;&#20320;&#65292;&#20063;&#22240;&#20026;&#21487;&#20197;&#24110;&#21161;&#20182;&#20204;&#12290;&#19982;Subversion&#36825;&#26679;&#27963;&#36291;&#30340;&#33258;&#30001;&#36719;&#20214;&#39033;&#30446;&#19968;&#36215;&#65292;<span class="emphasis"><em>&#20320;&#24182;&#19981;&#23396;&#21333;</em></span>&#12290;</p>
    <p>&#35753;&#36825;&#26412;&#20070;&#23558;&#25104;&#20026;&#20320;&#30340;&#31532;&#19968;&#20010;&#20249;&#20276;&#12290;</p>
  </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.preface.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">Subversion &#26435;&#23041;&#25351;&#21335;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#24207;&#35328;</td></tr></table></div></body></html>