<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets Vsnapshot_8167"><link rel="home" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;"><link rel="up" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;"><link rel="prev" href="svn.reposadmin.planning.html" title="&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;"><link rel="next" href="svn.reposadmin.maint.html" title="&#29256;&#26412;&#24211;&#32500;&#25252;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="svn.reposadmin.planning.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.reposadmin.maint.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="section" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="svn.reposadmin.create"></a>&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;</h2></div></div></div>
      
      <p>&#22312;<a class="xref" href="svn.reposadmin.planning.html" title="&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;">&#8220;&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;&#8221;&#19968;&#33410;</a>&#65292;&#25105;&#20204;&#25105;&#20204;&#30475;&#20102;&#19968;&#20123;&#22312;&#21019;&#24314;&#21644;&#37197;&#32622;Subversion&#29256;&#26412;&#24211;&#20043;&#21069;&#38656;&#35201;&#20570;&#30340;&#37325;&#35201;&#20915;&#23450;&#65292;&#29616;&#22312;&#25105;&#20204;&#26368;&#32456;&#35201;&#24178;&#27963;&#20102;&#65281;&#22312;&#26412;&#23567;&#33410;&#65292;&#25105;&#20204;&#35201;&#30475;&#30475;&#22914;&#20309;&#30495;&#23454;&#30340;&#21019;&#24314;&#19968;&#20010;Subversion&#29256;&#26412;&#24211;&#65292;&#24182;&#37197;&#32622;&#23427;&#22312;&#29305;&#23450;&#29256;&#26412;&#24211;&#20107;&#20214;&#25191;&#34892;&#33258;&#23450;&#20041;&#21160;&#20316;&#12290;</p>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.basics.creating"></a>&#21019;&#24314;&#29256;&#26412;&#24211;</h3></div></div></div>
        
        <p>&#21019;&#24314;&#19968;&#20010; Subversion &#29256;&#26412;&#24211;&#20986;&#20046;&#23547;&#24120;&#30340;&#31616;&#21333;&#12290; Subversion &#25552;&#20379;&#30340;<span class="command"><strong>svnadmin</strong></span> &#24037;&#20855;&#65292;&#26377;&#19968;&#20010;&#25191;&#34892;&#36825;&#20010;&#21151;&#33021;&#30340;&#23376;&#21629;&#20196;(<code class="literal">create</code>)&#12290;</p>
        <pre class="screen">
$ svnadmin create /path/to/repos
</pre>
        <p> &#36825;&#26679;&#22312;&#30446;&#24405;<code class="filename">/path/to/repos</code>&#20351;&#29992;&#40664;&#35748;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#24211;&#12290;&#22312;Subversion 1.2&#20043;&#21069;&#65292;&#32570;&#30465;&#20540;&#26159;Berkeley DB&#65307;&#32780;&#29616;&#22312;&#26159;FSFS&#12290;&#20320;&#21487;&#20197;&#36890;&#36807;<code class="option">--fs-type</code>&#21442;&#25968;&#26126;&#30830;&#22320;&#25351;&#23450;&#25991;&#20214;&#31995;&#32479;&#31867;&#22411;&#65292;&#21487;&#36873;&#30340;&#20540;&#21253;&#25324;<code class="literal">fsfs</code>&#21644;<code class="literal">bdb</code>&#12290;</p>
        <pre class="screen">
$ # Create an FSFS-backed repository
$ svnadmin create --fs-type fsfs /path/to/repos
$
</pre>
        <pre class="screen">
# Create a Berkeley-DB-backed repository
$ svnadmin create --fs-type bdb /path/to/repos
$
</pre>
        <p>&#36816;&#34892;&#36825;&#20010;&#21629;&#20196;&#20043;&#21518;&#65292;&#20320;&#26377;&#20102;&#19968;&#20010;Subversion&#29256;&#26412;&#24211;&#12290;</p>
        <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
          <p>&#20320;&#21487;&#33021;&#24050;&#32463;&#27880;&#24847;&#21040;&#20102;&#65292;<span class="command"><strong>svnadmin</strong></span>&#21629;&#20196;&#30340;&#36335;&#24452;&#21442;&#25968;&#21482;&#26159;&#19968;&#20010;&#26222;&#36890;&#30340;&#25991;&#20214;&#31995;&#32479;&#36335;&#24452;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;<span class="command"><strong>svn</strong></span>&#23458;&#25143;&#31471;&#31243;&#24207;&#35775;&#38382;&#29256;&#26412;&#24211;&#26102;&#20351;&#29992;&#30340;URL&#12290;<span class="command"><strong>svnadmin</strong></span>&#21644;<span class="command"><strong>svnlook</strong></span>&#37117;&#34987;&#35748;&#20026;&#26159;&#26381;&#21153;&#22120;&#31471;&#24037;&#20855;&#8212;&#23427;&#20204;&#22312;&#29256;&#26412;&#24211;&#25152;&#22312;&#30340;&#26426;&#22120;&#19978;&#20351;&#29992;&#65292;&#29992;&#26469;&#26816;&#26597;&#25110;&#20462;&#25913;&#29256;&#26412;&#24211;&#65292;&#19981;&#33021;&#36890;&#36807;&#32593;&#32476;&#26469;&#25191;&#34892;&#20219;&#21153;&#12290;&#19968;&#20010;Subversion&#30340;&#26032;&#25163;&#36890;&#24120;&#20250;&#29359;&#30340;&#38169;&#35823;&#65292;&#23601;&#26159;&#35797;&#22270;&#23558;URL(&#29978;&#33267;&#8220;<span class="quote">&#26412;&#22320;</span>&#8221;<code class="literal">file:</code>&#36335;&#24452;)&#20256;&#32473;&#36825;&#20004;&#20010;&#31243;&#24207;&#12290;</p>
        </div>
        <p>&#36825;&#20010;&#21629;&#20196;&#22312;&#30446;&#24405;<code class="filename">/path/to/repos</code>&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#24211;&#12290;&#36825;&#20010;&#26032;&#30340;&#29256;&#26412;&#24211;&#20250;&#20197;&#20462;&#35746;&#29256;&#26412;&#29256;&#26412;0&#24320;&#22987;&#20854;&#29983;&#21629;&#21608;&#26399;&#65292;&#37324;&#38754;&#38500;&#20102;&#26368;&#19978;&#23618;&#30340;&#26681;&#30446;&#24405;(<code class="filename">/</code>)&#65292;&#20160;&#20040;&#37117;&#27809;&#26377;&#12290;&#21018;&#24320;&#22987;&#65292;&#20462;&#35746;&#29256;&#26412;0&#26377;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;<code class="literal">svn:date</code>&#65292;&#35774;&#32622;&#20026;&#29256;&#26412;&#24211;&#21019;&#24314;&#30340;&#26102;&#38388;&#12290;</p>
        <p>&#29616;&#22312;&#20320;&#26377;&#20102;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#21487;&#20197;&#29992;&#25143;&#21270;&#20102;&#12290;</p>
        <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#35686;&#21578;</h3>
          <p>&#19968;&#33324;&#26469;&#35828;&#65292;&#29256;&#26412;&#24211;&#38500;&#20102;&#19968;&#23567;&#37096;&#20998;&#8212;&#20363;&#22914;&#37197;&#32622;&#25991;&#20214;&#21644;&#38057;&#23376;&#33050;&#26412;&#65292;&#20320;&#19981;&#35201;(&#20063;&#19981;&#38656;&#35201;)&#25163;&#21160;&#24178;&#39044;&#29256;&#26412;&#24211;&#12290;<span class="command"><strong>svnadmin</strong></span>&#24037;&#20855;&#24212;&#35813;&#36275;&#20197;&#29992;&#26469;&#22788;&#29702;&#23545;&#29256;&#26412;&#24211;&#30340;&#20219;&#20309;&#20462;&#25913;&#65292;&#25110;&#32773;&#20320;&#20063;&#21487;&#20197;&#20351;&#29992;&#31532;&#19977;&#26041;&#24037;&#20855;(&#27604;&#22914;Berkeley DB&#30340;&#24037;&#20855;&#21253;)&#26469;&#35843;&#25972;&#37096;&#20998;&#29256;&#26412;&#24211;&#12290;<span class="emphasis"><em>&#19981;</em></span>&#35201;&#23581;&#35797;&#36890;&#36807;&#22788;&#29702;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#25991;&#20214;&#25163;&#24037;&#20462;&#25913;&#29256;&#26412;&#25511;&#21046;&#21382;&#21490;&#65292;</p>
        </div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.create.hooks"></a>&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;</h3></div></div></div>
        
        <p><em class="firstterm">&#38057;&#23376;</em>&#26159;&#36890;&#36807;&#29256;&#26412;&#24211;&#20107;&#20214;&#35302;&#21457;&#65292;&#20363;&#22914;&#26032;&#29256;&#26412;&#30340;&#21019;&#24314;&#25110;&#19968;&#20010;&#26410;&#29256;&#26412;&#21270;&#23646;&#24615;&#30340;&#20462;&#25913;&#12290;&#19968;&#20123;&#38057;&#23376;(&#21483;&#20570;&#8220;<span class="quote">pre hooks</span>&#8221;)&#22312;&#20107;&#20214;&#21457;&#29983;&#21069;&#36816;&#34892;&#65292;&#21487;&#20197;&#29992;&#26469;&#25253;&#21578;&#21457;&#29983;&#20102;&#20160;&#20040;&#20197;&#21450;&#38450;&#27490;&#23427;&#21457;&#29983;&#12290;&#36824;&#26377;&#19968;&#20123;&#38057;&#23376;(&#8220;<span class="quote">post hooks</span>&#8221;)&#22312;&#29256;&#26412;&#24211;&#20107;&#20214;&#20043;&#21518;&#21457;&#29983;&#65292;&#21482;&#26159;&#29992;&#26469;&#25253;&#21578;&#12290;&#27599;&#20010;&#38057;&#23376;&#33021;&#22815;&#33719;&#24471;&#20107;&#20214;&#30340;&#36275;&#22815;&#20449;&#24687;&#65292;&#20363;&#22914;&#25552;&#20986;&#30340;(&#25110;&#23436;&#25104;&#30340;)&#29256;&#26412;&#24211;&#20462;&#25913;&#32454;&#33410;&#65292;&#36824;&#26377;&#35302;&#21457;&#20107;&#20214;&#30340;&#29992;&#25143;&#21517;&#12290;</p>
        <p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;<code class="filename">hooks</code>&#23376;&#30446;&#24405;&#20013;&#21253;&#21547;&#21508;&#31181;&#29256;&#26412;&#24211;&#38057;&#23376;&#27169;&#26495;&#12290;</p>
        <pre class="screen">
$ ls repos/hooks/
post-commit.tmpl	  post-unlock.tmpl  pre-revprop-change.tmpl
post-lock.tmpl		  pre-commit.tmpl   pre-unlock.tmpl
post-revprop-change.tmpl  pre-lock.tmpl     start-commit.tmpl
</pre>
        <p>&#23545;&#27599;&#31181;Subversion&#29256;&#26412;&#24211;&#25903;&#25345;&#30340;&#38057;&#23376;&#30340;&#37117;&#26377;&#19968;&#20010;&#27169;&#26495;&#65292;&#36890;&#36807;&#26597;&#30475;&#36825;&#20123;&#33050;&#26412;&#30340;&#20869;&#23481;&#65292;&#20320;&#33021;&#30475;&#21040;&#26159;&#20160;&#20040;&#20107;&#20214;&#35302;&#21457;&#20102;&#33050;&#26412;&#21450;&#22914;&#20309;&#32473;&#20256;&#33050;&#26412;&#20256;&#36882;&#25968;&#25454;&#12290;&#21516;&#26102;&#65292;&#36825;&#20123;&#27169;&#29256;&#20063;&#26159;&#22914;&#20309;&#20351;&#29992;&#36825;&#20123;&#33050;&#26412;&#65292;&#32467;&#21512;Subversion&#25903;&#25345;&#30340;&#24037;&#20855;&#26469;&#23436;&#25104;&#26377;&#29992;&#20219;&#21153;&#30340;&#20363;&#23376;&#12290;&#35201;&#23454;&#38469;&#23433;&#35013;&#19968;&#20010;&#21487;&#29992;&#30340;&#38057;&#23376;&#65292;&#20320;&#38656;&#35201;&#22312;<code class="filename">repos/hooks</code>&#30446;&#24405;&#19979;&#23433;&#35013;&#19968;&#20123;&#19982;&#38057;&#23376;&#21516;&#21517;(&#22914; <span class="command"><strong>start-commit</strong></span>&#25110;&#32773;<span class="command"><strong>post-commit</strong></span>)&#30340;&#21487;&#25191;&#34892;&#31243;&#24207;&#25110;&#33050;&#26412;&#12290;</p>
        <p>&#22312;Unix&#24179;&#21488;&#19978;&#65292;&#36825;&#24847;&#21619;&#30528;&#35201;&#25552;&#20379;&#19968;&#20010;&#19982;&#38057;&#23376;&#21516;&#21517;&#30340;&#33050;&#26412;&#25110;&#31243;&#24207;(&#21487;&#33021;&#26159;shell &#33050;&#26412;&#65292;Python &#31243;&#24207;&#65292;&#32534;&#35793;&#36807;&#30340;c&#35821;&#35328;&#20108;&#36827;&#21046;&#25991;&#20214;&#25110;&#20854;&#20182;&#19996;&#35199;)&#12290;&#24403;&#28982;&#65292;&#33050;&#26412;&#27169;&#26495;&#25991;&#20214;&#19981;&#20165;&#20165;&#26159;&#23637;&#31034;&#20102;&#19968;&#20123;&#20449;&#24687;&#8212;&#22312;Unix&#19979;&#23433;&#35013;&#38057;&#23376;&#26368;&#31616;&#21333;&#30340;&#21150;&#27861;&#23601;&#26159;&#25335;&#36125;&#36825;&#20123;&#27169;&#26495;&#65292;&#24182;&#19988;&#21435;&#25481;<code class="literal">.tmpl</code>&#25193;&#23637;&#21517;&#65292;&#28982;&#21518;&#33258;&#23450;&#20041;&#38057;&#23376;&#30340;&#20869;&#23481;&#65292;&#30830;&#23450;&#33050;&#26412;&#26159;&#21487;&#36816;&#34892;&#30340;&#12290;Windows&#29992;&#25991;&#20214;&#30340;&#25193;&#23637;&#21517;&#26469;&#20915;&#23450;&#19968;&#20010;&#31243;&#24207;&#26159;&#21542;&#21487;&#36816;&#34892;&#65292;&#25152;&#20197;&#20320;&#35201;&#20351;&#31243;&#24207;&#30340;&#22522;&#26412;&#21517;&#19982;&#38057;&#23376;&#21516;&#21517;&#65292;&#21516;&#26102;&#65292;&#23427;&#30340;&#25193;&#23637;&#21517;&#26159;Windows&#31995;&#32479;&#25152;&#33021;&#36776;&#35748;&#30340;&#65292;&#20363;&#22914;<code class="filename">exe</code>&#12289;<code class="filename">com</code>&#21644;&#25209;&#22788;&#29702;&#30340;<code class="filename">bat</code>&#12290;</p>
        <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#25552;&#31034;</h3>
          <p>&#30001;&#20110;&#23433;&#20840;&#21407;&#22240;&#65292;Subversion&#29256;&#26412;&#24211;&#22312;&#19968;&#20010;&#31354;&#29615;&#22659;&#20013;&#25191;&#34892;&#38057;&#23376;&#33050;&#26412;&#8212;&#23601;&#26159;&#27809;&#26377;&#35774;&#32622;&#20219;&#20309;&#29615;&#22659;&#21464;&#37327;&#65292;&#29978;&#33267;&#27809;&#26377;<code class="literal">$PATH</code>&#25110;<code class="literal">%PATH%</code>&#12290;&#30001;&#20110;&#36825;&#20010;&#21407;&#22240;&#65292;&#35768;&#22810;&#31649;&#29702;&#21592;&#20250;&#24863;&#21040;&#24456;&#22256;&#24785;&#65292;&#23427;&#20204;&#30340;&#38057;&#23376;&#33050;&#26412;&#25163;&#24037;&#36816;&#34892;&#26102;&#27491;&#24120;&#65292;&#21487;&#22312;Subversion&#20013;&#21364;&#19981;&#33021;&#36816;&#34892;&#12290;&#35201;&#27880;&#24847;&#65292;&#24517;&#39035;&#22312;&#20320;&#30340;&#38057;&#23376;&#20013;&#35774;&#32622;&#22909;&#29615;&#22659;&#21464;&#37327;&#25110;&#20026;&#20320;&#30340;&#31243;&#24207;&#25351;&#23450;&#22909;&#32477;&#23545;&#36335;&#24452;&#12290;</p>
        </div>
        <p>Subversion&#20250;&#35797;&#22270;&#20197;&#24403;&#21069;&#35775;&#38382;&#29256;&#26412;&#24211;&#30340;&#29992;&#25143;&#36523;&#20221;&#25191;&#34892;&#38057;&#23376;&#12290;&#36890;&#24120;&#65292;&#23545;&#29256;&#26412;&#24211;&#30340;&#35775;&#38382;&#24635;&#26159;&#36890;&#36807;Apache HTTP&#26381;&#21153;&#22120;&#21644;mod_dav_svn&#36827;&#34892;&#65292;&#22240;&#27492;&#65292;&#25191;&#34892;&#38057;&#23376;&#30340;&#29992;&#25143;&#23601;&#26159;&#36816;&#34892;Apache&#30340;&#29992;&#25143;&#12290;&#38057;&#23376;&#26412;&#36523;&#38656;&#35201;&#20855;&#26377;&#25805;&#20316;&#31995;&#32479;&#32423;&#30340;&#35775;&#38382;&#35768;&#21487;&#65292;&#29992;&#25143;&#21487;&#20197;&#36816;&#34892;&#23427;&#12290;&#21478;&#22806;&#65292;&#20854;&#23427;&#34987;&#38057;&#23376;&#30452;&#25509;&#25110;&#38388;&#25509;&#20351;&#29992;&#30340;&#25991;&#20214;&#25110;&#31243;&#24207;(&#21253;&#25324;Subversion&#29256;&#26412;&#24211;&#26412;&#36523;)&#20063;&#35201;&#34987;&#21516;&#19968;&#20010;&#29992;&#25143;&#35775;&#38382;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#35201;&#27880;&#24847;&#28508;&#22312;&#30340;&#35775;&#38382;&#25511;&#21046;&#38382;&#39064;&#65292;&#23427;&#21487;&#33021;&#20250;&#35753;&#20320;&#30340;&#38057;&#23376;&#26080;&#27861;&#25353;&#29031;&#20320;&#30340;&#30446;&#30340;&#39034;&#21033;&#25191;&#34892;&#12290;</p>
        <p>Subversion&#29256;&#26412;&#24211;&#26377;9&#31181;&#38057;&#23376;&#23454;&#29616;&#65292;&#20320;&#21487;&#20197;&#22312;<a class="xref" href="svn.ref.reposhooks.html" title="&#29256;&#26412;&#24211;&#38057;&#23376;">&#8220;&#29256;&#26412;&#24211;&#38057;&#23376;&#8221;&#19968;&#33410;</a>&#33719;&#24471;&#27599;&#20010;&#30340;&#20449;&#24687;&#12290;&#20316;&#20026;&#19968;&#20010;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#65292;&#20320;&#38656;&#35201;&#20915;&#23450;&#20320;&#35201;&#23454;&#29616;&#30340;&#38057;&#23376;(&#36890;&#36807;&#25552;&#20379;&#23478;&#24403;&#21517;&#31216;&#21644;&#25191;&#34892;&#35768;&#21487;&#30340;&#31243;&#24207;)&#31867;&#22411;&#21644;&#26041;&#27861;&#65292;&#36825;&#31181;&#20915;&#31574;&#38656;&#35201;&#23545;&#29256;&#26412;&#24211;&#30340;&#37096;&#32626;&#38750;&#24120;&#29087;&#24713;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#20351;&#29992;&#26381;&#21153;&#22120;&#37197;&#32622;&#26041;&#24335;&#65292;&#36890;&#36807;&#29256;&#26412;&#24211;&#26816;&#27979;&#29992;&#25143;&#21517;&#31216;&#21644;&#26435;&#38480;&#65292;&#20320;&#19981;&#38656;&#35201;&#36890;&#36807;&#38057;&#23376;&#31995;&#32479;&#23454;&#29616;&#35775;&#38382;&#25511;&#21046;&#12290;</p>
        <p>&#22312;Subversion&#31038;&#21306;&#21644;&#20854;&#20182;&#22320;&#26041;&#37117;&#19981;&#32570;Subversion&#38057;&#23376;&#65292;&#36825;&#20123;&#33050;&#26412;&#35206;&#30422;&#20102;&#24191;&#27867;&#30340;&#24037;&#20855;&#8212;&#22522;&#26412;&#30340;&#35775;&#38382;&#25511;&#21046;&#65292;&#25919;&#31574;&#30456;&#20851;&#26816;&#26597;&#65292;&#38382;&#39064;&#36861;&#36394;&#38598;&#25104;&#65292;email&#25110;&#25552;&#20132;&#36890;&#30693;&#31561;&#31561;&#12290;&#20851;&#20110;&#26368;&#24120;&#29992;&#30340;&#38057;&#23376;&#31243;&#24207;&#30340;&#35752;&#35770;&#65292;&#21487;&#20197;&#30475;<a class="xref" href="svn.3rdparty.html" title="&#38468;&#24405;&nbsp;D.&nbsp;&#31532;&#19977;&#26041;&#24037;&#20855;">&#38468;&#24405;&nbsp;D, <i>&#31532;&#19977;&#26041;&#24037;&#20855;</i></a>&#65292;&#22914;&#26524;&#20320;&#24076;&#26395;&#20889;&#20320;&#33258;&#24049;&#30340;&#65292;&#21487;&#20197;&#30475;<a class="xref" href="svn.developer.html" title="&#31532;&nbsp;8&nbsp;&#31456;&nbsp;&#23884;&#20837; Subversion">&#31532;&nbsp;8&nbsp;&#31456; <i>&#23884;&#20837; Subversion</i></a>&#12290;</p>
        <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#35686;&#21578;</h3>
          <p>&#23613;&#31649;&#32463;&#36807;&#35843;&#25972;&#38057;&#23376;&#33050;&#26412;&#21487;&#20197;&#20316;&#20219;&#20309;&#20107;&#24773;&#65292;&#20294;&#38057;&#23376;&#33050;&#26412;&#30340;&#20316;&#32773;&#20173;&#20250;&#21463;&#21040;&#19968;&#20123;&#38480;&#21046;&#65306;&#19981;&#35201;&#20462;&#25913;&#20351;&#29992;&#38057;&#23376;&#33050;&#26412;&#20462;&#25913;&#25552;&#20132;&#20107;&#21153;&#65292;&#22240;&#20026;&#20351;&#29992;&#38057;&#23376;&#33050;&#26412;&#33258;&#21160;&#20462;&#25913;&#38169;&#35823;&#25110;&#25552;&#20132;&#25991;&#20214;&#30340;&#25919;&#31574;&#36829;&#20363;&#30340;&#23581;&#35797;&#20250;&#23548;&#33268;&#38382;&#39064;&#12290;Subversion&#20250;&#22312;&#23458;&#25143;&#31471;&#32531;&#23384;&#23545;&#24212;&#30340;&#29256;&#26412;&#24211;&#25968;&#25454;&#65292;&#22914;&#26524;&#20320;&#36825;&#26679;&#20462;&#25913;&#20102;&#25552;&#20132;&#20107;&#21153;&#65292;&#36825;&#20123;&#32531;&#23384;&#23601;&#36827;&#20837;&#20102;&#26410;&#30693;&#30340;&#29366;&#24577;&#65292;&#36825;&#31181;&#19981;&#19968;&#33268;&#20250;&#23548;&#33268;&#20196;&#20154;&#21507;&#24778;&#21644;&#39044;&#24819;&#19981;&#21040;&#30340;&#34892;&#20026;&#12290;&#20316;&#20026;&#23545;&#20107;&#29289;&#20462;&#25913;&#30340;&#26367;&#25442;&#65292;&#20320;&#21487;&#20197;&#31616;&#21333;&#30340;&#22312;<code class="filename">pre-commit</code>&#30830;&#35748;&#20107;&#29289;&#20449;&#24687;&#24182;&#19988;&#25298;&#32477;&#25552;&#20132;&#65292;&#22914;&#26524;&#36825;&#26679;&#28385;&#36275;&#19981;&#20102;&#38656;&#27714;&#65292;&#20316;&#20026;&#39069;&#22806;&#30340;&#22870;&#36175;&#65292;&#20320;&#30340;&#29992;&#25143;&#20250;&#23398;&#20250;&#23567;&#24515;&#39034;&#20174;&#30340;&#24037;&#20316;&#20064;&#24815;&#12290;</p>
        </div>
      </div>
      
      <div class="section" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="svn.reposadmin.create.bdb"></a>Berkeley DB &#37197;&#32622;</h3></div></div></div>
        
        <p>Berkeley DB&#29615;&#22659;&#26159;&#23545;&#19968;&#20010;&#25110;&#22810;&#20010;&#25968;&#25454;&#24211;&#12289;&#26085;&#24535;&#25991;&#20214;&#12289;&#21306;&#22495;&#25991;&#20214;&#21644;&#37197;&#32622;&#25991;&#20214;&#30340;&#23553;&#35013;&#12290;Berkeley DB&#29615;&#22659;&#23545;&#35768;&#22810;&#21442;&#25968;&#26377;&#33258;&#24049;&#30340;&#32570;&#30465;&#20540;&#65292;&#20363;&#22914;&#20219;&#20309;&#26102;&#38388;&#37324;&#21487;&#29992;&#30340;&#25968;&#25454;&#24211;&#38145;&#23450;&#25968;&#30446;&#12289;&#26085;&#24535;&#25991;&#20214;&#30340;&#26368;&#22823;&#20540;&#31561;&#12290;Subversion&#25991;&#20214;&#31995;&#32479;&#20250;&#20351;&#29992;Berkeley DB&#30340;&#40664;&#35748;&#20540;&#12290; &#19981;&#36807;&#65292;&#26377;&#26102;&#20505;&#20320;&#30340;&#29305;&#23450;&#29256;&#26412;&#24211;&#19982;&#23427;&#29420;&#29305;&#30340;&#25968;&#25454;&#38598;&#21512;&#21644;&#35775;&#38382;&#31867;&#22411;&#65292;&#21487;&#33021;&#38656;&#35201;&#19981;&#21516;&#30340;&#37197;&#32622;&#36873;&#39033;&#12290;</p>
        <p>&#20320;&#30340;&#29256;&#26412;&#24211;&#30340;Berkeley&#37197;&#32622;&#25991;&#20214;&#20301;&#20110;<code class="filename">db</code>&#30446;&#24405;&#30340;<code class="filename">db/DB_CONFIG</code>&#65292; Subversion&#22312;&#21019;&#24314;&#29256;&#26412;&#24211;&#26102;&#33258;&#24049;&#21019;&#24314;&#20102;&#36825;&#20010;&#25991;&#20214;&#12290;&#36825;&#20010;&#25991;&#20214;&#21021;&#22987;&#26102;&#21253;&#21547;&#20102;&#19968;&#20123;&#40664;&#35748;&#36873;&#39033;&#65292;&#20063;&#21253;&#21547;&#20102;Berkeley DB&#22312;&#32447;&#25991;&#26723;&#65292;&#20351;&#20320;&#33021;&#22815;&#20102;&#35299;&#36825;&#20123;&#36873;&#39033;&#26159;&#20570;&#20160;&#20040;&#30340;&#12290;&#24403;&#28982;&#65292;&#20320;&#20063;&#21487;&#20197;&#20026;&#20320;&#30340;<code class="filename">DB_CONFIG</code> &#25991;&#20214;&#28155;&#21152;&#20219;&#20309;Berkeley DB&#25903;&#25345;&#30340;&#36873;&#39033;&#12290;&#38656;&#35201;&#27880;&#24847;&#21040;&#65292;&#34429;&#28982;Subversion&#19981;&#20250;&#23581;&#35797;&#35835;&#21462;&#24182;&#35299;&#26512;&#36825;&#20010;&#25991;&#20214;&#65292;&#25110;&#20351;&#29992;&#20854;&#20013;&#30340;&#35774;&#32622;&#65292;&#20320;&#19968;&#23450;&#35201;&#36991;&#20813;&#20250;&#23548;&#33268;Berkeley DB&#25353;&#29031;Subversion&#20195;&#30721;&#19981;&#20064;&#24815;&#30340;&#26041;&#24335;&#24037;&#20316;&#30340;&#20462;&#25913;&#12290;&#21478;&#22806;&#65292;<code class="filename">DB_CONFIG</code>&#30340;&#20462;&#25913;&#22312;&#22797;&#21407;&#25968;&#25454;&#24211;&#29615;&#22659;(&#29992;<span class="command"><strong>svnadmin recover</strong></span>)&#20043;&#21069;&#19981;&#20250;&#20135;&#29983;&#20219;&#20309;&#25928;&#26524;&#12290;</p>
      </div>
    </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="svn.reposadmin.planning.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="svn.reposadmin.html">&#19978;&#19968;&#32423;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.reposadmin.maint.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#29256;&#26412;&#24211;&#32500;&#25252;</td></tr></table></div></body></html>