<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;</title>
      <meta name="generator" content="DocBook XSL Stylesheets V1.73.2">
      <link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;">
      <link rel="up" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;">
      <link rel="prev" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;">
      <link rel="next" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="svn.branchmerge.html">&#19978;&#19968;&#39029;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.serverconfig.html">&#19979;&#19968;&#39029;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="chapter" lang="zh-cn">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="svn.reposadmin"></a>&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;
                  </h2>
               </div>
            </div>
         </div>
         <div class="toc">
            <p><b>&#30446;&#24405;</b></p>
            <dl>
               <dt><span class="sect1"><a href="svn.reposadmin.html#svn.reposadmin.basics">5.1. Subversion &#29256;&#26412;&#24211;&#30340;&#23450;&#20041;</a></span></dt>
               <dt><span class="sect1"><a href="svn.reposadmin.html#svn.reposadmin.planning">5.2. &#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;</a></span></dt>
               <dd>
                  <dl>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.projects.chooselayout">5.2.1. &#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.basics.hosting">5.2.2. &#20915;&#23450;&#22312;&#21738;&#37324;&#19982;&#22914;&#20309;&#37096;&#32626;&#20320;&#30340;&#29256;&#26412;&#24211;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.basics.backends">5.2.3. &#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;</a></span></dt>
                  </dl>
               </dd>
               <dt><span class="sect1"><a href="svn.reposadmin.html#svn.reposadmin.create">5.3. &#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;</a></span></dt>
               <dd>
                  <dl>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.basics.creating">5.3.1. &#21019;&#24314;&#29256;&#26412;&#24211;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.create.hooks">5.3.2. &#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.create.bdb">5.3.3. Berkeley DB &#37197;&#32622;</a></span></dt>
                  </dl>
               </dd>
               <dt><span class="sect1"><a href="svn.reposadmin.html#svn.reposadmin.maint">5.4. &#29256;&#26412;&#24211;&#32500;&#25252;</a></span></dt>
               <dd>
                  <dl>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.tk">5.4.1. &#31649;&#29702;&#21592;&#30340;&#24037;&#20855;&#31665;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.setlog">5.4.2. &#20462;&#27491;&#25552;&#20132;&#28040;&#24687;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.diskspace">5.4.3. &#31649;&#29702;&#30913;&#30424;&#31354;&#38388;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.recovery">5.4.4. Berkeley DB &#24674;&#22797;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.migrate">5.4.5. &#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.filtering">5.4.6. &#36807;&#28388;&#29256;&#26412;&#24211;&#21382;&#21490;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.replication">5.4.7. &#29256;&#26412;&#24211;&#22797;&#21046;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.backup">5.4.8. &#29256;&#26412;&#24211;&#22791;&#20221;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.reposadmin.html#svn.reposadmin.maint.uuids">5.4.9. &#31649;&#29702;&#29256;&#26412;&#24211;&#30340; UUID</a></span></dt>
                  </dl>
               </dd>
               <dt><span class="sect1"><a href="svn.reposadmin.html#svn.reposadmin.maint.moving-and-removing">5.5. &#31227;&#21160;&#21644;&#21024;&#38500;&#29256;&#26412;&#24211;</a></span></dt>
               <dt><span class="sect1"><a href="svn.reposadmin.html#svn.reposadmin.summary">5.6. &#24635;&#32467;</a></span></dt>
            </dl>
         </div>
         <p>Subversion&#29256;&#26412;&#24211;&#26159;&#20445;&#23384;&#20219;&#24847;&#25968;&#37327;&#39033;&#30446;&#29256;&#26412;&#21270;&#25968;&#25454;&#30340;&#20013;&#22830;&#20179;&#24211;&#65292;&#22240;&#27492;&#65292;&#29256;&#26412;&#24211;&#25104;&#20026;&#31649;&#29702;&#21592;&#20851;&#27880;&#30340;&#23545;&#35937;&#12290;&#29256;&#26412;&#24211;&#30340;&#32500;&#25252;&#19968;&#33324;&#24182;&#19981;&#38656;&#35201;&#22826;&#22810;&#30340;&#20851;&#27880;&#65292;&#20294;&#20026;&#20102;&#36991;&#20813;&#19968;&#20123;&#28508;&#22312;&#30340;&#38382;&#39064;&#21644;&#35299;&#20915;&#19968;&#20123;&#23454;&#38469;&#38382;&#39064;&#65292;&#29702;&#35299;&#24590;&#26679;&#36866;&#24403;&#30340;&#37197;&#32622;&#21644;&#32500;&#25252;&#36824;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#12290;</p>
         <p>&#22312;&#36825;&#19968;&#31456;&#37324;&#65292;&#25105;&#20204;&#23558;&#35752;&#35770;&#22914;&#20309;&#24314;&#31435;&#21644;&#37197;&#32622;&#19968;&#20010;Subversion&#29256;&#26412;&#24211;&#65292;&#36824;&#20250;&#35752;&#35770;&#29256;&#26412;&#24211;&#30340;&#32500;&#25252;&#65292;&#21253;&#25324;<span class="command"><strong>svnlook</strong></span>&#21644;<span class="command"><strong>svnadmin</strong></span>&#24037;&#20855;&#30340;&#20351;&#29992;&#23454;&#20363;&#12290;&#25105;&#20204;&#23558;&#35828;&#26126;&#19968;&#20123;&#24120;&#35265;&#30340;&#38382;&#39064;&#21644;&#38169;&#35823;&#65292;&#24182;&#25552;&#20379;&#19968;&#20123;&#23433;&#25490;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#24314;&#35758;&#12290;
         </p>
         <p>If you plan to access a Subversion repository only in the
                role of a user whose data is under version control (i.e., via
                a Subversion client), you can skip this chapter altogether.
                However, if you are, or wish to become, a Subversion repository
                administrator,
                <sup>[<a name="d0e9179" href="#ftn.d0e9179" class="footnote">27</a>]</sup>
                this chapter is for you.
         </p>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.reposadmin.basics"></a>5.1.&nbsp;Subversion &#29256;&#26412;&#24211;&#30340;&#23450;&#20041;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#22312;&#36827;&#20837;&#29256;&#26412;&#24211;&#31649;&#29702;&#36825;&#22359;&#23485;&#27867;&#30340;&#20027;&#39064;&#20043;&#21069;&#65292;&#35753;&#25105;&#20204;&#36827;&#19968;&#27493;&#30830;&#23450;&#19968;&#19979;&#29256;&#26412;&#24211;&#30340;&#23450;&#20041;&#65292;&#23427;&#26159;&#24590;&#26679;&#24037;&#20316;&#30340;&#65311;&#35753;&#20154;&#26377;&#20160;&#20040;&#24863;&#35273;&#65311;&#23427;&#24076;&#26395;&#33590;&#26159;&#28909;&#30340;&#36824;&#26159;&#20912;&#30340;&#65292;&#21152;&#31958;&#25110;&#26592;&#27308;&#21527;&#65311;&#20316;&#20026;&#19968;&#21517;&#31649;&#29702;&#21592;&#65292;&#20320;&#24212;&#35813;&#26082;&#33021;&#22815;&#20174;&#29289;&#29702;&#20855;&#20307;&#32454;&#33410;&#30340;&#35270;&#35282;&#65293;&#29256;&#26412;&#24211;&#22914;&#20309;&#21709;&#24212;&#19968;&#20010;&#38750;Subversion&#30340;&#24037;&#20855;&#65292;&#20063;&#33021;&#22815;&#20174;&#36923;&#36753;&#35270;&#35282;&#65293;&#25968;&#25454;&#22312;&#29256;&#26412;&#24211;&#20013;&#22914;&#20309;&#23637;&#31034;&#12290;</p>
            <p>Seen through the eyes of a typical file browser application
                     (such as Windows Explorer) or command-line based filesystem
                     navigation tools, the Subversion repository is just another
                     directory full of stuff.  There are some subdirectories with
                     human-readable configuration files in them, some subdirectories
                     with some not-so-human-readable data files, and so on.  As in
                     other areas of the Subversion design, modularity is given high
                     regard, and hierarchical organization is preferred to cluttered
                     chaos.  So a shallow glance into a typical repository from a
                     nuts-and-bolts perspective is sufficient to reveal the basic
                     components of the repository:
            </p><pre class="screen">
$ ls repos
conf/  dav/  db/  format  hooks/  locks/  README.txt
</pre><p>&#19979;&#38754;&#26159;&#19968;&#20010;&#20320;&#30475;&#21040;&#21015;&#20986;&#30446;&#24405;&#30340;&#24555;&#36895;&#24635;&#25597;&#12290;(&#19981;&#35201;&#22240;&#20026;&#26415;&#35821;&#38519;&#20837;&#22256;&#22659;&#8212;&#36825;&#20123;&#32452;&#20214;&#30340;&#32454;&#33410;&#20171;&#32461;&#21487;&#20197;&#20174;&#26412;&#31456;&#25110;&#20854;&#20182;&#31456;&#33410;&#25214;&#21040;&#12290;)</p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term">conf</span></dt>
                  <dd>
                     <p>A directory containing configuration files</p>
                  </dd>
                  <dt><span class="term">dav</span></dt>
                  <dd>
                     <p>A directory provided to
                                    <code class="filename">mod_dav_svn</code> for its private
                                    housekeeping data
                     </p>
                  </dd>
                  <dt><span class="term">db</span></dt>
                  <dd>
                     <p>The data store for all of your versioned data</p>
                  </dd>
                  <dt><span class="term">format</span></dt>
                  <dd>
                     <p>A file that contains a single integer that
                                    indicates the version number of the repository layout
                     </p>
                  </dd>
                  <dt><span class="term">hooks</span></dt>
                  <dd>
                     <p>A directory full of hook script templates (and hook
                                    scripts themselves, once you've installed some)
                     </p>
                  </dd>
                  <dt><span class="term">locks</span></dt>
                  <dd>
                     <p>A directory for Subversion's repository lock
                                    files, used for tracking accessors to the repository
                     </p>
                  </dd>
                  <dt><span class="term">README.txt</span></dt>
                  <dd>
                     <p>A file whose contents merely inform its readers that
                                    they are looking at a Subversion repository
                     </p>
                  </dd>
               </dl>
            </div>
            <p>Of course, when accessed via the Subversion libraries, this
                     otherwise unremarkable collection of files and directories
                     suddenly becomes an implementation of a virtual, versioned
                     filesystem, complete with customizable event triggers.  This
                     filesystem has its own notions of directories and files, very
                     similar to the notions of such things held by real filesystems
                     (such as NTFS, FAT32, ext3, etc.).  But this is a special
                     filesystem&#8212;it hangs these directories and files from
                     revisions, keeping all the changes you've ever made to them
                     safely stored and forever accessible.  This is where the
                     entirety of your versioned data lives.
            </p>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.reposadmin.planning"></a>5.2.&nbsp;&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Due largely to the simplicity of the overall design of the
                     Subversion repository and the technologies on which it relies,
                     creating and configuring a repository are fairly straightforward
                     tasks.  There are a few preliminary decisions you'll want to
                     make, but the actual work involved in any given setup of a
                     Subversion repository is pretty basic, tending toward
                     mindless repetition if you find yourself setting up multiples of
                     these things.
            </p>
            <p>Some things you'll want to consider beforehand, though, are:</p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#20320;&#30340;&#29256;&#26412;&#24211;&#23558;&#35201;&#23384;&#25918;&#20160;&#20040;&#25968;&#25454;(&#25110;&#22810;&#20010;&#29256;&#26412;&#24211;)&#65292;&#36825;&#20123;&#25968;&#25454;&#22914;&#20309;&#32452;&#32455;&#65311;</p>
                  </li>
                  <li>
                     <p>&#29256;&#26412;&#24211;&#23384;&#25918;&#22312;&#21738;&#37324;&#65292;&#22914;&#20309;&#34987;&#35775;&#38382;&#65311;</p>
                  </li>
                  <li>
                     <p>&#20320;&#38656;&#35201;&#20160;&#20040;&#31867;&#22411;&#30340;&#35775;&#38382;&#25511;&#21046;&#21644;&#29256;&#26412;&#24211;&#20107;&#20214;&#25253;&#21578;&#65311;</p>
                  </li>
                  <li>
                     <p>&#20320;&#24076;&#26395;&#20351;&#29992;&#21738;&#31181;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#65311;</p>
                  </li>
               </ul>
            </div>
            <p>&#22312;&#26412;&#33410;&#65292;&#25105;&#20204;&#35201;&#23581;&#35797;&#24110;&#20320;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#12290;</p>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.projects.chooselayout"></a>5.2.1.&nbsp;&#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#22312;Subversion&#29256;&#26412;&#24211;&#20013;&#65292;&#31227;&#21160;&#29256;&#26412;&#21270;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#20449;&#24687;&#65292;&#29978;&#33267;&#20063;&#21487;&#20197;&#23558;&#29256;&#26412;&#24211;&#30340;&#30340;&#19968;&#32452;&#25968;&#25454;&#26080;&#25439;&#21382;&#21490;&#30340;&#31227;&#26893;&#21040;&#21478;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#20294;&#26159;&#36825;&#26679;&#19968;&#26469;&#37027;&#20123;&#32463;&#24120;&#35775;&#38382;&#29256;&#26412;&#24211;&#24182;&#19988;&#20197;&#20026;&#25991;&#20214;&#24635;&#26159;&#22312;&#21516;&#19968;&#20010;&#36335;&#24452;&#30340;&#29992;&#25143;&#21487;&#33021;&#20250;&#21463;&#21040;&#24178;&#25200;&#12290;&#20026;&#23558;&#26469;&#30528;&#24819;&#65292;&#26368;&#22909;&#39044;&#20808;&#23545;&#20320;&#30340;&#29256;&#26412;&#24211;&#24067;&#23616;&#36827;&#34892;&#35268;&#21010;&#12290;&#20197;&#19968;&#31181;&#39640;&#25928;&#30340;&#8220;<span class="quote">&#24067;&#23616;</span>&#8221;&#24320;&#22987;&#39033;&#30446;&#65292;&#21487;&#20197;&#20943;&#23569;&#23558;&#26469;&#24456;&#22810;&#19981;&#24517;&#35201;&#30340;&#40635;&#28902;&#12290;
               </p>
               <p>&#20551;&#22914;&#20320;&#26159;&#19968;&#20010;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#65292;&#38656;&#35201;&#21521;&#22810;&#20010;&#39033;&#30446;&#25552;&#20379;&#29256;&#26412;&#25511;&#21046;&#25903;&#25345;&#12290;&#37027;&#20040;&#65292;&#20320;&#39318;&#20808;&#35201;&#20915;&#23450;&#30340;&#26159;&#65292;&#29992;&#19968;&#20010;&#29256;&#26412;&#24211;&#25903;&#25345;&#22810;&#20010;&#39033;&#30446;&#65292;&#36824;&#26159;&#20026;&#27599;&#20010;&#39033;&#30446;&#24314;&#31435;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#36824;&#26159;&#20004;&#31181;&#26041;&#27861;&#30340;&#28151;&#21512;&#26041;&#24335;&#12290;</p>
               <p>&#20351;&#29992;&#19968;&#20010;&#29256;&#26412;&#24211;&#25903;&#25345;&#22810;&#20010;&#39033;&#30446;&#26377;&#24456;&#22810;&#22909;&#22788;&#65292;&#26368;&#26126;&#26174;&#30340;&#26080;&#36807;&#20110;&#19981;&#38656;&#35201;&#32500;&#25252;&#22909;&#20960;&#20010;&#29256;&#26412;&#24211;&#12290;&#21333;&#19968;&#29256;&#26412;&#24211;&#23601;&#24847;&#21619;&#30528;&#21482;&#26377;&#19968;&#20010;&#38057;&#23376;&#31243;&#24207;&#65292;&#21482;&#38656;&#35201;&#22791;&#20221;&#19968;&#20010;&#25968;&#25454;&#24211;&#65292;&#24403;Subversion&#36827;&#34892;&#19981;&#20860;&#23481;&#21319;&#32423;&#26102;&#65292;&#21482;&#38656;&#35201;&#19968;&#27425;&#36716;&#20648;&#21644;&#35013;&#36733;&#25805;&#20316;&#65292;&#31561;&#31561;&#12290;&#36824;&#26377;&#65292;&#20320;&#21487;&#20197;&#36731;&#26131;&#30340;&#22312;&#39033;&#30446;&#20043;&#38388;&#31227;&#21160;&#25968;&#25454;&#65292;&#36824;&#19981;&#20250;&#25439;&#22833;&#20219;&#20309;&#21382;&#21490;&#29256;&#26412;&#20449;&#24687;&#12290;</p>
               <p>&#21333;&#19968;&#29256;&#26412;&#24211;&#30340;&#32570;&#28857;&#26159;&#65292;&#19981;&#21516;&#30340;&#39033;&#30446;&#36890;&#24120;&#37117;&#26377;&#19981;&#21516;&#30340;&#29256;&#26412;&#24211;&#35302;&#21457;&#20107;&#20214;&#38656;&#27714;&#65292;&#20363;&#22914;&#38656;&#35201;&#21457;&#36865;&#25552;&#20132;&#36890;&#30693;&#37038;&#20214;&#21040;&#19981;&#21516;&#30340;&#37038;&#20214;&#21015;&#34920;&#65292;&#38656;&#35201;&#19981;&#21516;&#30340;&#37492;&#23450;&#25552;&#20132;&#26159;&#21542;&#21512;&#27861;&#30340;&#23450;&#20041;&#12290;&#36825;&#20123;&#37117;&#19981;&#26159;&#19981;&#21487;&#36926;&#36234;&#30340;&#38382;&#39064;&#65292;&#24403;&#28982;&#8212;&#20043;&#38656;&#35201;&#20320;&#30340;&#38057;&#23376;&#31243;&#24207;&#33021;&#22815;&#23519;&#30475;&#29256;&#26412;&#24211;&#30340;&#24067;&#23616;&#65292;&#32780;&#19981;&#26159;&#20551;&#23450;&#25972;&#20010;&#29256;&#26412;&#24211;&#19982;&#21516;&#19968;&#32452;&#20154;&#20851;&#32852;&#12290;&#36824;&#26377;&#65292;&#21035;&#24536;&#20102;Subversion&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#26159;&#38024;&#23545;&#25972;&#20010;&#29256;&#26412;&#24211;&#30340;&#65292;&#36825;&#20123;&#21495;&#30721;&#27809;&#26377;&#20219;&#20309;&#39764;&#21147;&#12290;&#21363;&#20351;&#26368;&#36817;&#27809;&#26377;&#23545;&#26576;&#20010;&#39033;&#30446;&#20316;&#20986;&#20462;&#25913;&#65292;&#29256;&#26412;&#24211;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#36824;&#26159;&#20250;&#22240;&#20026;&#20854;&#23427;&#39033;&#30446;&#30340;&#20462;&#25913;&#32780;&#19981;&#20572;&#30340;&#25552;&#21319;&#65292;&#35768;&#22810;&#20154;&#24182;&#19981;&#21916;&#27426;&#36825;&#26679;&#30340;&#20107;&#23454;&#12290;<sup>[<a name="d0e9285" href="#ftn.d0e9285" class="footnote">28</a>]</sup></p>
               <p>&#21487;&#20197;&#37319;&#29992;&#25240;&#20013;&#30340;&#21150;&#27861;&#12290;&#27604;&#22914;&#65292;&#21487;&#20197;&#25226;&#35768;&#22810;&#39033;&#30446;&#25353;&#29031;&#24444;&#27492;&#20043;&#38388;&#30340;&#20851;&#32852;&#31243;&#24230;&#21010;&#20998;&#20026;&#20960;&#20010;&#32452;&#21512;&#65292;&#28982;&#21518;&#20026;&#27599;&#19968;&#20010;&#39033;&#30446;&#32452;&#21512;&#24314;&#31435;&#19968;&#20010;&#29256;&#26412;&#24211;&#12290;&#36825;&#26679;&#65292;&#22312;&#30456;&#20851;&#39033;&#30446;&#20043;&#38388;&#20849;&#20139;&#25968;&#25454;&#20381;&#26087;&#24456;&#31616;&#21333;&#65292;&#32780;&#22914;&#26524;&#20462;&#35746;&#29256;&#26412;&#21495;&#26377;&#20102;&#21464;&#21270;&#65292;&#33267;&#23569;&#24320;&#21457;&#20154;&#21592;&#30693;&#36947;&#65292;&#25913;&#21464;&#30340;&#19996;&#35199;&#22810;&#23569;&#21644;&#20182;&#20204;&#26377;&#20123;&#20851;&#31995;&#12290;</p>
               <p>After deciding how to organize your projects with respect
                          to repositories, you'll probably want to think about directory
                          hierarchies within the repositories themselves.  Because
                          Subversion uses regular directory copies for branching and
                          tagging (see <a class="xref" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;">&#31532;&nbsp;4&nbsp;&#31456; <i>&#20998;&#25903;&#19982;&#21512;&#24182;</i></a>), the
                          Subversion community recommends that you choose a repository
                          location for each <em class="firstterm">project
                             root</em>&#8212;the &#8220;<span class="quote">topmost</span>&#8221; directory
                          that contains data related to that project&#8212;and then
                          create three subdirectories beneath that root:
                          <code class="filename">trunk</code>, meaning the directory under which
                          the main project development occurs;
                          <code class="filename">branches</code>, which is a directory in which
                          to create various named branches of the main development line;
                          and <code class="filename">tags</code>, which is a collection of tree
                          snapshots that are created, and perhaps destroyed, but never
                          changed.
                          <sup>[<a name="d0e9309" href="#ftn.d0e9309" class="footnote">29</a>]</sup>
                          
               </p>
               <p>For example, your repository might look like this:</p><pre class="screen">
/
   calc/
      trunk/
      tags/
      branches/
   calendar/
      trunk/
      tags/
      branches/
   spreadsheet/
      trunk/
      tags/
      branches/
   &#8230;
</pre><p>Note that it doesn't matter where in your repository each
                          project root is.  If you have only one project per repository,
                          the logical place to put each project root is at the root of
                          that project's respective repository.  If you have multiple
                          projects, you might want to arrange them in groups inside the
                          repository, perhaps putting projects with similar goals or
                          shared code in the same subdirectory, or maybe just grouping
                          them alphabetically.  Such an arrangement might look
                          like this:
               </p><pre class="screen">
/
   utils/
      calc/
         trunk/
         tags/
         branches/
      calendar/
         trunk/
         tags/
         branches/
      &#8230;
   office/
      spreadsheet/
         trunk/
         tags/
         branches/
      &#8230;
</pre><p>&#25353;&#29031;&#20320;&#35748;&#20026;&#21512;&#36866;&#30340;&#26041;&#24335;&#23433;&#25490;&#29256;&#26412;&#24211;&#30340;&#24067;&#23616;&#65292;Subversion&#33258;&#36523;&#24182;&#19981;&#24378;&#21046;&#25110;&#32773;&#20559;&#22909;&#26576;&#19968;&#31181;&#24067;&#23616;&#24418;&#24335;&#65292;&#23545;&#20110;Subversion&#26469;&#35828;&#65292;&#30446;&#24405;&#23601;&#26159;&#30446;&#24405;&#12290;&#26368;&#21518;&#65292;&#22312;&#35774;&#35745;&#29256;&#26412;&#24211;&#24067;&#23616;&#30340;&#26102;&#20505;&#65292;&#19981;&#35201;&#24536;&#20102;&#32771;&#34385;&#19968;&#19979;&#39033;&#30446;&#21442;&#19982;&#32773;&#20204;&#30340;&#24847;&#35265;&#12290;</p>
               <p>In the name of full disclosure, though, we'll mention
                          another very common layout.  In this layout, the
                          <code class="filename">trunk</code>, <code class="filename">tags</code>, and
                          <code class="filename">branches</code> directories live in the root
                          directory of your repository, and your projects are in
                          subdirectories beneath those, like so:
               </p><pre class="screen">
/
   trunk/
      calc/
      calendar/
      spreadsheet/
      &#8230;
   tags/
      calc/
      calendar/
      spreadsheet/
      &#8230;
   branches/
      calc/
      calendar/
      spreadsheet/
      &#8230;
</pre><p>There's nothing particularly incorrect about such a
                          layout, but it may or may not seem as intuitive for your
                          users.  Especially in large, multiproject situations with
                          many users, those users may tend to be familiar with only one
                          or two of the projects in the repository.  But the
                          projects-as-branch-siblings approach tends to deemphasize project
                          individuality and focus on the entire set of projects as a
                          single entity.  That's a social issue, though.  We like our
                          originally suggested arrangement for purely practical
                          reasons&#8212;it's easier to ask about (or modify, or migrate
                          elsewhere) the entire history of a single project when there's
                          a single repository path that holds the entire
                          history&#8212;past, present, tagged, and branched&#8212;for
                          that project and that project alone.
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.basics.hosting"></a>5.2.2.&nbsp;&#20915;&#23450;&#22312;&#21738;&#37324;&#19982;&#22914;&#20309;&#37096;&#32626;&#20320;&#30340;&#29256;&#26412;&#24211;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Before creating your Subversion repository, an obvious
                          question you'll need to answer is where the thing is going to
                          live.  This is strongly connected to myriad other
                          questions involving how the repository will be accessed (via a
                          Subversion server or directly), by whom (users behind your
                          corporate firewall or the whole world out on the open
                          Internet), what other services you'll be providing around
                          Subversion (repository browsing interfaces, email-based
                          commit notification, etc.), your data backup strategy, and so
                          on.
               </p>
               <p>&#25105;&#20204;&#22312;<a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>&#35206;&#30422;&#20102;&#26381;&#21153;&#22120;&#30340;&#36873;&#25321;&#21644;&#37197;&#32622;&#65292;&#25105;&#20204;&#20063;&#25552;&#20379;&#19968;&#20123;&#21487;&#33021;&#20250;&#20351;&#20320;&#24517;&#39035;&#20915;&#23450;&#20351;&#29992;&#26576;&#31181;&#26381;&#21153;&#22120;&#30340;&#38382;&#39064;&#30340;&#31572;&#26696;&#12290;&#20363;&#22914;&#65292;&#29305;&#23450;&#30340;&#37096;&#32626;&#31574;&#30053;&#21487;&#33021;&#20250;&#38656;&#35201;&#20174;&#22810;&#20010;&#35745;&#31639;&#26426;&#36890;&#36807;&#36828;&#31243;&#25991;&#20214;&#31995;&#32479;&#35775;&#38382;&#29256;&#26412;&#24211;&#65292;&#36825;&#20010;&#24773;&#20917;&#19979;(&#19979;&#19968;&#23567;&#33410;&#20250;&#35835;&#21040;)&#35201;&#27714;&#20320;&#19981;&#33021;&#36873;&#25321;&#19968;&#31181;&#29256;&#26412;&#24211;&#21518;&#31471;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#65292;&#22240;&#20026;&#21482;&#26377;&#19968;&#31181;&#21518;&#31471;&#22312;&#36825;&#31181;&#22330;&#26223;&#19979;&#21487;&#20197;&#24037;&#20316;&#12290;
               </p>
               <p>&#21015;&#20986;&#25152;&#26377;&#30340;Subversion&#21487;&#33021;&#30340;&#37096;&#32626;&#26041;&#27861;&#26159;&#19981;&#21487;&#33021;&#30340;&#65292;&#36229;&#20986;&#20102;&#26412;&#20070;&#30340;&#33539;&#22260;&#65292;&#25105;&#20204;&#21482;&#26159;&#31616;&#21333;&#30340;&#40723;&#21169;&#20320;&#20351;&#29992;&#36825;&#37096;&#20998;&#20869;&#23481;&#21644;&#21442;&#32771;&#26448;&#26009;&#39564;&#35777;&#20320;&#30340;&#24819;&#27861;&#65292;&#24182;&#39044;&#20808;&#35745;&#21010;&#12290;</p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.basics.backends"></a>5.2.3.&nbsp;&#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Subversion provides two options for the
                          type of underlying data store&#8212;often referred to as
                          &#8220;<span class="quote">the backend</span>&#8221; or, somewhat confusingly,
                          &#8220;<span class="quote">the (versioned) filesystem</span>&#8221;&#8212;that each
                          repository uses.  One type of data store keeps everything in a
                          Berkeley DB (or BDB) database environment; repositories that
                          use this type are often referred to as being
                          &#8220;<span class="quote">BDB-backed.</span>&#8221;  The other type stores data in
                          ordinary flat files, using a custom format.  Subversion
                          developers have adopted the habit of referring to this latter
                          data storage mechanism as <em class="firstterm">FSFS</em>
                          <sup>[<a name="d0e9379" href="#ftn.d0e9379" class="footnote">30</a>]</sup> 
                          &#8212;a versioned filesystem implementation that uses the
                          native OS filesystem directly&#8212;rather than via a database
                          library or some other abstraction layer&#8212;to store data.
               </p>
               <p><a class="xref" href="svn.reposadmin.html#svn.reposadmin.basics.backends.tbl-1" title="&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;">&#34920;&nbsp;5.1 &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;&#8221;</a>&#20174;&#24635;&#20307;&#19978;&#27604;&#36739;&#20102;Berkeley DB&#21644;FSFS&#29256;&#26412;&#24211;&#12290;
               </p>
               <div class="table"><a name="svn.reposadmin.basics.backends.tbl-1"></a><p class="title"><b>&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;</b></p>
                  <div class="table-contents">
                     <table summary="&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;" border="1">
                        <colgroup>
                           <col width="25%">
                           <col width="25%">
                           <col width="25%">
                           <col width="25%">
                        </colgroup>
                        <thead>
                           <tr>
                              <th>&#20998;&#31867;</th>
                              <th>&#29305;&#24615;</th>
                              <th>Berkeley DB</th>
                              <th>FSFS</th>
                           </tr>
                        </thead>
                        <tbody>
                           <tr>
                              <td rowspan="2">&#21487;&#38752;&#24615;</td>
                              <td>&#25968;&#25454;&#23436;&#25972;&#24615;</td>
                              <td>When properly deployed, extremely reliable;
                                                 Berkeley DB 4.4 brings auto-recovery
                              </td>
                              <td>Older versions had some rarely demonstrated, but
                                                 data-destroying bugs
                              </td>
                           </tr>
                           <tr>
                              <td>&#23545;&#25805;&#20316;&#20013;&#26029;&#30340;&#25935;&#24863;</td>
                              <td>Very; crashes and permission problems can leave the
                                                 database &#8220;<span class="quote">&#26964;&#20303;</span>&#8221; requiring journaled
                                                 recovery procedures
                              </td>
                              <td>Quite insensitive</td>
                           </tr>
                           <tr>
                              <td rowspan="4">&#21487;&#29992;&#24615;</td>
                              <td>&#21487;&#21482;&#35835;&#21152;&#36733;</td>
                              <td>&#21542;</td>
                              <td>&#26159;</td>
                           </tr>
                           <tr>
                              <td>&#23384;&#20648;&#24179;&#21488;&#26080;&#20851;</td>
                              <td>&#21542;</td>
                              <td>&#26159;</td>
                           </tr>
                           <tr>
                              <td>&#21487;&#20174;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#35775;&#38382;</td>
                              <td>Generally, no</td>
                              <td>&#26159;</td>
                           </tr>
                           <tr>
                              <td>&#32452;&#35775;&#38382;&#26435;&#22788;&#29702;</td>
                              <td>Sensitive to user umask problems; best if accessed
                                                 by only one user
                              </td>
                              <td>Works around umask problems</td>
                           </tr>
                           <tr>
                              <td rowspan="3">&#20280;&#32553;&#24615;</td>
                              <td>&#29256;&#26412;&#24211;&#30913;&#30424;&#20351;&#29992;&#24773;&#20917;</td>
                              <td>Larger (especially if logfiles aren't purged)</td>
                              <td>Smaller</td>
                           </tr>
                           <tr>
                              <td>&#20462;&#35746;&#29256;&#26412;&#26641;&#30340;&#25968;&#37327;</td>
                              <td>Database; no problems</td>
                              <td>Some older native filesystems don't scale well with
                                                 thousands of entries in a single directory
                              </td>
                           </tr>
                           <tr>
                              <td>&#26377;&#24456;&#22810;&#25991;&#20214;&#30340;&#30446;&#24405;</td>
                              <td>Slower</td>
                              <td>Faster</td>
                           </tr>
                           <tr>
                              <td rowspan="2">&#24615;&#33021;</td>
                              <td>&#26816;&#20986;&#26368;&#26032;&#30340;&#20195;&#30721;</td>
                              <td>No meaningful difference</td>
                              <td>No meaningful difference</td>
                           </tr>
                           <tr>
                              <td>&#22823;&#30340;&#25552;&#20132;</td>
                              <td>Slower overall, but cost is amortized across the
                                                 lifetime of the commit
                              </td>
                              <td>Faster overall, but finalization delay may cause 
                                                 client timeouts
                              </td>
                           </tr>
                        </tbody>
                     </table>
                  </div>
               </div><br class="table-break"><p>&#20004;&#31181;&#21518;&#31471;&#37117;&#26377;&#20248;&#28857;&#21644;&#32570;&#28857;&#65292;&#27809;&#26377;&#19968;&#31181;&#26356;&#21152;&#8220;<span class="quote">&#27491;&#24335;</span>&#8221;&#65292;&#23613;&#31649;&#26032;&#30340;FSFS&#22312;Subversion1.2&#25104;&#20026;&#32570;&#30465;&#25968;&#25454;&#23384;&#20648;&#65292;&#20004;&#32773;&#29992;&#26469;&#23384;&#20648;&#29256;&#26412;&#21270;&#25968;&#25454;&#37117;&#26159;&#21487;&#38752;&#30340;&#12290;&#20294;&#26159;&#23601;&#35937;&#20320;&#22312;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.basics.backends.tbl-1" title="&#34920;&nbsp;5.1.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;">&#34920;&nbsp;5.1 &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#23545;&#29031;&#34920;&#8221;</a>&#30475;&#21040;&#30340;&#65292;FSFS&#21518;&#31471;&#22312;&#37096;&#32626;&#22330;&#26223;&#20013;&#25552;&#20379;&#20102;&#26356;&#22810;&#30340;&#28789;&#27963;&#24615;&#65292;&#26356;&#28789;&#27963;&#24847;&#21619;&#30528;&#20320;&#24456;&#38590;&#38169;&#35823;&#30340;&#37197;&#32622;&#12290;&#37027;&#20123;&#21407;&#22240;&#8212;&#21152;&#19978;&#19981;&#20351;&#29992;Berkeley DB&#24847;&#21619;&#30528;&#22312;&#36825;&#20010;&#31995;&#32479;&#26377;&#26356;&#23569;&#30340;&#32452;&#20214;&#8212;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#20170;&#22825;&#20960;&#20046;&#25152;&#26377;&#30340;&#20154;&#37117;&#20351;&#29992;FSFS&#26469;&#21019;&#24314;&#26032;&#30340;&#29256;&#26412;&#24211;&#12290;
               </p>
               <p>&#24184;&#36816;&#30340;&#26159;&#65292;&#22823;&#22810;&#25968;&#35775;&#38382;Subversion&#30340;&#31243;&#24207;&#19981;&#20250;&#22312;&#24847;&#20854;&#25152;&#29992;&#30340;&#21518;&#31471;&#25968;&#25454;&#23384;&#20648;&#12290;&#32780;&#19988;&#20320;&#19981;&#24517;&#19968;&#23450;&#35201;&#20351;&#29992;&#20320;&#26368;&#21021;&#30340;&#25968;&#25454;&#23384;&#20648;&#26041;&#27861;&#8212;&#22914;&#26524;&#21518;&#26469;&#20320;&#25913;&#21464;&#20102;&#20027;&#24847;&#65292;Subversion&#25552;&#20379;&#20102;&#31227;&#26893;&#29256;&#26412;&#24211;&#25968;&#25454;&#21040;&#21478;&#19968;&#20010;&#29256;&#26412;&#24211;&#30340;&#26041;&#27861;&#65292;&#25105;&#20204;&#20250;&#22312;&#21518;&#38754;&#35814;&#32454;&#35752;&#35770;&#12290;</p>
               <p>&#19979;&#38754;&#30340;&#23567;&#33410;&#25552;&#20379;&#20102;&#25968;&#25454;&#23384;&#20648;&#31867;&#22411;&#26356;&#21152;&#35814;&#32454;&#30340;&#20171;&#32461;&#12290;</p>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.basics.backends.bdb"></a>5.2.3.1.&nbsp;Berkeley DB
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>When the initial design phase of Subversion was in
                               progress, the developers decided to use Berkeley DB for a
                               variety of reasons, including its open source license,
                               transaction support, reliability, performance, API
                               simplicity, thread safety, support for cursors, and so
                               on.
                  </p>
                  <p>Berkeley DB provides real transaction
                               support&#8212;perhaps its most powerful feature.  Multiple
                               processes accessing your Subversion repositories don't have
                               to worry about accidentally clobbering each other's data.
                               The isolation provided by the transaction system is such
                               that for any given operation, the Subversion repository code
                               sees a static view of the database&#8212;not a database that
                               is constantly changing at the hand of some other
                               process&#8212;and can make decisions based on that view.  If
                               the decision made happens to conflict with what another
                               process is doing, the entire operation is rolled back as though
                               it never happened, and Subversion gracefully retries the
                               operation against a new, updated (and yet still static) view
                               of the database.
                  </p>
                  <p>Berkeley DB&#21478;&#19968;&#20010;&#24378;&#22823;&#30340;&#29305;&#24615;&#26159;&#28909;&#22791;&#20221;&#65293;&#19981;&#24517;&#8220;<span class="quote">&#33073;&#26426;</span>&#8221;&#23601;&#21487;&#20197;&#22791;&#20221;&#25968;&#25454;&#24211;&#29615;&#22659;&#30340;&#33021;&#21147;&#12290;&#25105;&#20204;&#23558;&#20250;&#22312;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.backup" title="5.4.8.&nbsp;&#29256;&#26412;&#24211;&#22791;&#20221;">&#31532;&nbsp;5.4.8&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#22791;&#20221;&#8221;</a>&#35752;&#35770;&#22914;&#20309;&#22791;&#20221;&#20320;&#30340;&#29256;&#26412;&#24211;&#65292;&#33021;&#22815;&#19981;&#20572;&#27490;&#31995;&#32479;&#23545;&#29256;&#26412;&#24211;&#20570;&#20840;&#38754;&#22791;&#20221;&#30340;&#22909;&#22788;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#12290;
                  </p>
                  <p>Berkeley DB&#21516;&#26102;&#26159;&#19968;&#20010;&#21487;&#20449;&#36182;&#30340;&#25968;&#25454;&#24211;&#31995;&#32479;&#12290;Subversion&#21033;&#29992;&#20102;Berkeley DB&#21487;&#20197;&#35760;&#26085;&#24535;&#30340;&#20415;&#21033;&#65292;&#36825;&#24847;&#21619;&#30528;&#25968;&#25454;&#24211;&#20808;&#22312;&#30913;&#30424;&#19978;&#20889;&#19968;&#20010;&#26085;&#24535;&#25991;&#20214;&#65292;&#25551;&#36848;&#23427;&#23558;&#35201;&#20570;&#30340;&#20462;&#25913;&#65292;&#28982;&#21518;&#20877;&#20570;&#36825;&#20123;&#20462;&#25913;&#12290;&#36825;&#26159;&#20026;&#20102;&#30830;&#20445;&#22914;&#26524;&#22914;&#26524;&#20219;&#20309;&#22320;&#26041;&#20986;&#20102;&#24046;&#38169;&#65292;&#25968;&#25454;&#24211;&#31995;&#32479;&#33021;&#24674;&#22797;&#21040;&#20808;&#21069;&#30340;<em class="firstterm">&#26816;&#26597;&#28857;</em>&#8212;&#19968;&#20010;&#26085;&#24535;&#25991;&#20214;&#35748;&#20026;&#27809;&#26377;&#38169;&#35823;&#30340;&#20301;&#32622;&#65292;&#37325;&#26032;&#24320;&#22987;&#20107;&#21153;&#30452;&#21040;&#25968;&#25454;&#24674;&#22797;&#20026;&#19968;&#20010;&#21487;&#29992;&#30340;&#29366;&#24577;&#12290;&#20851;&#20110;Berkeley DB&#26085;&#24535;&#25991;&#20214;&#30340;&#26356;&#22810;&#20449;&#24687;&#35831;&#26597;&#30475;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.diskspace" title="5.4.3.&nbsp;&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;">&#31532;&nbsp;5.4.3&nbsp;&#33410; &#8220;&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;&#8221;</a>&#12290;
                  </p>
                  <p>But every rose has its thorn, and so we must note some
                               known limitations of Berkeley DB.  First, Berkeley DB
                               environments are not portable.  You cannot simply copy a
                               Subversion repository that was created on a Unix system onto
                               a Windows system and expect it to work.  While much of the
                               Berkeley DB database format is architecture-independent,
                               other aspects of the environment are not.
                               Second, Subversion uses Berkeley DB in a way that will not
                               operate on Windows 95/98 systems&#8212;if you need to house
                               a BDB-backed repository on a Windows machine, stick with
                               Windows 2000 or later.
                  </p>
                  <p>&#28982;&#32780;Berkeley DB&#23545;&#20110;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#24037;&#20316;&#25552;&#20986;&#20102;&#19968;&#32452;&#35268;&#33539;&#65292;<sup>[<a name="d0e9532" href="#ftn.d0e9532" class="footnote">31</a>]</sup>&#22823;&#22810;&#25968;&#32593;&#32476;&#25991;&#20214;&#31995;&#32479;&#21644;&#24212;&#29992;&#27809;&#26377;&#23454;&#29616;&#36825;&#20010;&#35201;&#27714;&#65292;&#25152;&#20197;&#19981;&#33021;&#20801;&#35768;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#30340;BDB&#21518;&#31471;&#29256;&#26412;&#24211;&#34987;&#22810;&#20010;&#23458;&#25143;&#31471;&#21516;&#26102;&#35775;&#38382;(&#39318;&#20808;&#35201;&#30693;&#36947;&#29256;&#26412;&#24211;&#23384;&#25918;&#22312;&#32593;&#32476;&#20849;&#20139;&#19978;&#26159;&#38750;&#24120;&#26222;&#36941;&#30340;)&#12290;
                  </p>
                  <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
                     <table border="0" summary="Warning">
                        <tr>
                           <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                           <th align="left">&#35686;&#21578;</th>
                        </tr>
                        <tr>
                           <td align="left" valign="top">
                              <p>&#22914;&#26524;&#20320;&#23581;&#35797;&#22312;&#19981;&#39034;&#20174;&#30340;&#36828;&#31243;&#25991;&#20214;&#31995;&#32479;&#19978;&#20351;&#29992;Berkeley DB&#65292;&#32467;&#26524;&#26159;&#19981;&#21487;&#39044;&#30693;&#30340;&#8212;&#20320;&#20250;&#31435;&#21051;&#30475;&#21040;&#31070;&#31192;&#30340;&#38169;&#35823;&#65292;&#25110;&#32773;&#26159;&#22312;&#21457;&#29983;&#38544;&#21547;&#38169;&#35823;&#20043;&#21518;&#20960;&#20010;&#26376;&#20043;&#21518;&#25165;&#21457;&#29616;&#12290;&#20320;&#24517;&#39035;&#35748;&#30495;&#32771;&#34385;&#22312;&#32593;&#32476;&#20849;&#20139;&#24773;&#20917;&#19979;&#20351;&#29992;FSFS&#25968;&#25454;&#23384;&#20648;&#12290;</p>
                           </td>
                        </tr>
                     </table>
                  </div>
                  <p>&#26368;&#21518;&#65292;&#22240;&#20026;Berkeley DB&#30340;&#24211;&#30452;&#25509;&#38142;&#25509;&#21040;&#20102;Subversion&#20013;&#65292;&#23427;&#23545;&#20110;&#20013;&#26029;&#27604;&#20856;&#22411;&#30340;&#20851;&#31995;&#22411;&#25968;&#25454;&#24211;&#31995;&#32479;&#26356;&#20026;&#25935;&#24863;&#12290;&#22823;&#22810;&#25968;SQL&#31995;&#32479;&#65292;&#20030;&#20363;&#26469;&#35828;&#65292;&#26377;&#19968;&#20010;&#20027;&#26381;&#21153;&#36827;&#31243;&#26469;&#21327;&#35843;&#23545;&#25968;&#25454;&#24211;&#34920;&#30340;&#35775;&#38382;&#12290;&#22914;&#26524;&#19968;&#20010;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#31243;&#24207;&#22240;&#20026;&#26576;&#31181;&#21407;&#22240;&#20986;&#29616;&#38382;&#39064;&#65292;&#25968;&#25454;&#24211;&#23432;&#25252;&#36827;&#31243;&#23519;&#35273;&#21040;&#36830;&#25509;&#20013;&#26029;&#20250;&#20570;&#19968;&#20123;&#28165;&#29702;&#12290;&#22240;&#20026;&#25968;&#25454;&#24211;&#23432;&#25252;&#36827;&#31243;&#26159;&#21807;&#19968;&#35775;&#38382;&#25968;&#25454;&#24211;&#34920;&#30340;&#36827;&#31243;&#65292;&#24212;&#29992;&#31243;&#24207;&#19981;&#38656;&#35201;&#25285;&#24515;&#35775;&#38382;&#35768;&#21487;&#30340;&#20914;&#31361;&#12290;&#20294;&#26159;&#65292;&#36825;&#20123;&#24773;&#20917;&#19982;Berkeley
                     DB&#19981;&#21516;&#12290;Subversion(&#21644;&#20351;&#29992;Subversion&#24211;&#30340;&#31243;&#24207;)&#30452;&#25509;&#35775;&#38382;&#25968;&#25454;&#24211;&#30340;&#34920;&#65292;&#36825;&#24847;&#21619;&#30528;&#22914;&#26524;&#26377;&#19968;&#20010;&#31243;&#24207;&#23849;&#28291;&#65292;&#23601;&#20250;&#20351;&#25968;&#25454;&#24211;&#22788;&#20110;&#19968;&#20010;&#26242;&#26102;&#30340;&#19981;&#19968;&#33268;&#12289;&#19981;&#21487;&#35775;&#38382;&#30340;&#29366;&#24577;&#12290;&#24403;&#36825;&#31181;&#24773;&#20917;&#21457;&#29983;&#26102;&#65292;&#31649;&#29702;&#21592;&#38656;&#35201;&#35753;Berkeley DB&#24674;&#22797;&#21040;&#19968;&#20010;&#26816;&#26597;&#28857;&#65292;&#36825;&#30340;&#30830;&#26377;&#28857;&#35752;&#21388;&#12290;&#38500;&#20102;&#23849;&#28291;&#30340;&#36827;&#31243;&#65292;&#36824;&#26377;&#19968;&#20123;&#24773;&#20917;&#33021;&#35753;&#29256;&#26412;&#24211;&#20986;&#29616;&#24322;&#24120;&#65292;&#27604;&#22914;&#31243;&#24207;&#22312;&#25968;&#25454;&#24211;&#25991;&#20214;&#30340;&#25152;&#26377;&#26435;&#25110;&#35775;&#38382;&#26435;&#38480;&#19978;&#21457;&#29983;&#20914;&#31361;&#12290;
                  </p>
                  <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
                     <table border="0" summary="Note">
                        <tr>
                           <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="images/note.png"></td>
                           <th align="left">&#27880;&#24847;</th>
                        </tr>
                        <tr>
                           <td align="left" valign="top">
                              <p>Berkeley DB 4.4 brings (to Subversion 1.4 and later)
                                             the ability for Subversion to automatically and
                                             transparently recover Berkeley DB environments in need of
                                             such recovery.  When a Subversion process attaches to a
                                             repository's Berkeley DB environment, it uses some process
                                             accounting mechanisms to detect any unclean disconnections
                                             by previous processes, performs any necessary recovery,
                                             and then continues on as though nothing happened.  This
                                             doesn't completely eliminate instances of repository
                                             wedging, but it does drastically reduce the amount of
                                             human interaction required to recover from them.
                              </p>
                           </td>
                        </tr>
                     </table>
                  </div>
                  <p>So while a Berkeley DB repository is quite fast and
                               scalable, it's best used by a single server process running
                               as one user&#8212;such as Apache's <span class="command"><strong>httpd</strong></span>
                               or <span class="command"><strong>svnserve</strong></span> (see <a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>)&#8212;rather than accessing it
                               as many different users via <code class="literal">file://</code> or
                               <code class="literal">svn+ssh://</code> URLs.  If you're accessing a Berkeley
                               DB repository directly as multiple users, be sure to read
                               <a class="xref" href="svn.serverconfig.html#svn.serverconfig.multimethod" title="6.6.&nbsp;&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;">&#31532;&nbsp;6.6&nbsp;&#33410; &#8220;&#25903;&#25345;&#22810;&#31181;&#29256;&#26412;&#24211;&#35775;&#38382;&#26041;&#27861;&#8221;</a> later in this
                               chapter.
                  </p>
               </div>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.basics.backends.fsfs"></a>5.2.3.2.&nbsp;FSFS
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>&#22312;2004&#24180;&#20013;&#26399;&#65292;&#21478;&#19968;&#31181;&#29256;&#26412;&#24211;&#23384;&#20648;&#31995;&#32479;&#24930;&#24930;&#24418;&#25104;&#20102;&#65306;&#19968;&#31181;&#19981;&#38656;&#35201;&#25968;&#25454;&#24211;&#30340;&#23384;&#20648;&#31995;&#32479;&#12290;FSFS&#29256;&#26412;&#24211;&#22312;&#21333;&#19968;&#25991;&#20214;&#20013;&#23384;&#20648;&#20462;&#35746;&#29256;&#26412;&#26641;&#65292;&#25152;&#20197;&#29256;&#26412;&#24211;&#20013;&#25152;&#26377;&#30340;&#20462;&#35746;&#29256;&#26412;&#37117;&#22312;&#19968;&#20010;&#23376;&#25991;&#20214;&#22841;&#20013;&#26377;&#38480;&#30340;&#20960;&#20010;&#25991;&#20214;&#37324;&#12290;&#20107;&#21153;&#22312;&#21333;&#29420;&#30340;&#23376;&#30446;&#24405;&#20013;&#34987;&#21019;&#24314;&#65292;&#21019;&#24314;&#23436;&#25104;&#21518;&#65292;&#19968;&#20010;&#21333;&#29420;&#30340;&#20107;&#21153;&#25991;&#20214;&#34987;&#21019;&#24314;&#24182;&#31227;&#21160;&#21040;&#20462;&#35746;&#29256;&#26412;&#30446;&#24405;&#65292;&#36825;&#20445;&#35777;&#25552;&#20132;&#26159;&#21407;&#23376;&#24615;&#30340;&#12290;&#22240;&#20026;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#25991;&#20214;&#26159;&#25345;&#20037;&#19981;&#21487;&#25913;&#21464;&#30340;&#65292;&#29256;&#26412;&#24211;&#20063;&#21487;&#20197;&#20570;&#21040;&#8220;<span class="quote">&#28909;</span>&#8221;&#22791;&#20221;&#65292;&#23601;&#35937;Berkeley DB&#29256;&#26412;&#24211;&#19968;&#26679;&#12290;
                  </p>
                  <p>The FSFS revision files describe a revision's
                               directory structure, file contents, and deltas against files
                               in other revision trees.  Unlike a Berkeley DB database,
                               this storage format is portable across different operating
                               systems and isn't sensitive to CPU architecture.  Because
                               no journaling or shared-memory files are being used, the
                               repository can be safely accessed over a network filesystem
                               and examined in a read-only environment.  The lack of
                               database overhead also means the overall repository
                               size is a bit smaller.
                  </p>
                  <p>FSFS has different performance characteristics, too.
                               When committing a directory with a huge number of files,
                               FSFS is able to more quickly append directory entries.  On
                               the other hand, FSFS writes the latest version of a file as
                               a delta against an earlier version, which means that
                               checking out the latest tree is a bit slower than fetching
                               the full-texts stored in a Berkeley DB HEAD revision.  FSFS
                               also has a longer delay when finalizing a commit, which
                               could in extreme cases cause clients to time out while
                               waiting for a response.
                  </p>
                  <p>&#26368;&#37325;&#35201;&#30340;&#21306;&#21035;&#26159;&#24403;&#20986;&#29616;&#38169;&#35823;&#26102;FSFS&#19981;&#20250;&#26964;&#20303;&#30340;&#33021;&#21147;&#12290;&#22914;&#26524;&#20351;&#29992;Berkeley DB&#30340;&#36827;&#31243;&#21457;&#29983;&#35768;&#21487;&#38169;&#35823;&#25110;&#31361;&#28982;&#23849;&#28291;&#65292;&#25968;&#25454;&#24211;&#20250;&#19968;&#30452;&#26080;&#27861;&#20351;&#29992;&#65292;&#30452;&#21040;&#31649;&#29702;&#21592;&#24674;&#22797;&#12290;&#20551;&#22914;&#22312;&#24212;&#29992;FSFS&#29256;&#26412;&#24211;&#26102;&#21457;&#29983;&#21516;&#26679;&#30340;&#24773;&#20917;&#65292;&#29256;&#26412;&#24211;&#19981;&#20250;&#21463;&#21040;&#20219;&#20309;&#24178;&#25200;&#65292;&#26368;&#22351;&#24773;&#20917;&#19979;&#20063;&#23601;&#26159;&#20250;&#30041;&#19979;&#19968;&#20123;&#20107;&#21153;&#25968;&#25454;&#12290;</p>
                  <p>The only real argument against FSFS is its relative
                               immaturity compared to Berkeley DB.  Unlike Berkeley DB,
                               which has years of history, its own dedicated development
                               team, and, now, Oracle's mighty name attached to it,
                               <sup>[<a name="d0e9579" href="#ftn.d0e9579" class="footnote">32</a>]</sup>
                               FSFS is a newer bit of engineering.  Prior to Subversion
                               1.4, it was still shaking out some pretty serious data
                               integrity bugs, which, while triggered in only very rare
                               cases, nonetheless did occur.  That said, FSFS has quickly
                               become the backend of choice for some of the largest public
                               and private Subversion repositories, and it promises a lower
                               barrier to entry for Subversion across the board.
                  </p>
               </div>
            </div>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.reposadmin.create"></a>5.3.&nbsp;&#21019;&#24314;&#21644;&#37197;&#32622;&#20320;&#30340;&#29256;&#26412;&#24211;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Earlier in this chapter (in <a class="xref" href="svn.reposadmin.html#svn.reposadmin.planning" title="5.2.&nbsp;&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;">&#31532;&nbsp;5.2&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#24320;&#21457;&#31574;&#30053;&#8221;</a>), we
                     looked at some of the important decisions that should be made
                     before creating and configuring your Subversion repository.
                     Now, we finally get to get our hands dirty!  In this section,
                     we'll see how to actually create a Subversion repository and
                     configure it to perform custom actions when special repository
                     events occur.
            </p>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.basics.creating"></a>5.3.1.&nbsp;&#21019;&#24314;&#29256;&#26412;&#24211;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#21019;&#24314;&#19968;&#20010;Subversion&#29256;&#26412;&#24211;&#20986;&#20046;&#23547;&#24120;&#30340;&#31616;&#21333;&#12290; Subversion&#25552;&#20379;&#30340;<span class="command"><strong>svnadmin</strong></span> &#24037;&#20855;&#65292;&#26377;&#19968;&#20010;&#25191;&#34892;&#36825;&#20010;&#21151;&#33021;&#30340;&#23376;&#21629;&#20196;(<span class="command"><strong>svnadmin create</strong></span>)&#12290;
               </p><pre class="screen">
$ # Create a repository
$ svnadmin create /var/svn/repos
$
</pre><p> &#36825;&#26679;&#22312;&#30446;&#24405;<code class="filename">/path/to/repos</code>&#20351;&#29992;&#40664;&#35748;&#25968;&#25454;&#23384;&#20648;&#26041;&#24335;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#24211;&#12290;&#22312;Subversion 1.2&#20043;&#21069;&#65292;&#32570;&#30465;&#20540;&#26159;Berkeley DB&#65307;&#32780;&#29616;&#22312;&#26159;FSFS&#12290;&#20320;&#21487;&#20197;&#36890;&#36807;<code class="option">--fs-type</code>&#21442;&#25968;&#26126;&#30830;&#22320;&#25351;&#23450;&#25991;&#20214;&#31995;&#32479;&#31867;&#22411;&#65292;&#21487;&#36873;&#30340;&#20540;&#21253;&#25324;<code class="literal">fsfs</code>&#21644;<code class="literal">bdb</code>&#12290;
               </p><pre class="screen">
$ # Create an FSFS-backed repository
$ svnadmin create --fs-type fsfs /var/svn/repos
$
</pre><pre class="screen">
# Create a Berkeley-DB-backed repository
$ svnadmin create --fs-type bdb /var/svn/repos
$
</pre><p>&#36816;&#34892;&#36825;&#20010;&#21629;&#20196;&#20043;&#21518;&#65292;&#20320;&#26377;&#20102;&#19968;&#20010;Subversion&#29256;&#26412;&#24211;&#12290;</p>
               <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Tip">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#25552;&#31034;]" src="images/tip.png"></td>
                        <th align="left">&#25552;&#31034;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>&#20320;&#21487;&#33021;&#24050;&#32463;&#27880;&#24847;&#21040;&#20102;&#65292;<span class="command"><strong>svnadmin</strong></span>&#21629;&#20196;&#30340;&#36335;&#24452;&#21442;&#25968;&#21482;&#26159;&#19968;&#20010;&#26222;&#36890;&#30340;&#25991;&#20214;&#31995;&#32479;&#36335;&#24452;&#65292;&#32780;&#19981;&#26159;&#19968;&#20010;<span class="command"><strong>svn</strong></span>&#23458;&#25143;&#31471;&#31243;&#24207;&#35775;&#38382;&#29256;&#26412;&#24211;&#26102;&#20351;&#29992;&#30340;URL&#12290;<span class="command"><strong>svnadmin</strong></span>&#21644;<span class="command"><strong>svnlook</strong></span>&#37117;&#34987;&#35748;&#20026;&#26159;&#26381;&#21153;&#22120;&#31471;&#24037;&#20855;&#8212;&#23427;&#20204;&#22312;&#29256;&#26412;&#24211;&#25152;&#22312;&#30340;&#26426;&#22120;&#19978;&#20351;&#29992;&#65292;&#29992;&#26469;&#26816;&#26597;&#25110;&#20462;&#25913;&#29256;&#26412;&#24211;&#65292;&#19981;&#33021;&#36890;&#36807;&#32593;&#32476;&#26469;&#25191;&#34892;&#20219;&#21153;&#12290;&#19968;&#20010;Subversion&#30340;&#26032;&#25163;&#36890;&#24120;&#20250;&#29359;&#30340;&#38169;&#35823;&#65292;&#23601;&#26159;&#35797;&#22270;&#23558;URL(&#29978;&#33267;&#8220;<span class="quote">&#26412;&#22320;</span>&#8221;<code class="literal">file:</code>&#36335;&#24452;)&#20256;&#32473;&#36825;&#20004;&#20010;&#31243;&#24207;&#12290;
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>&#36825;&#20010;&#21629;&#20196;&#22312;&#30446;&#24405;<code class="filename">/path/to/repos</code>&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#24211;&#12290;&#36825;&#20010;&#26032;&#30340;&#29256;&#26412;&#24211;&#20250;&#20197;&#20462;&#35746;&#29256;&#26412;&#29256;&#26412;0&#24320;&#22987;&#20854;&#29983;&#21629;&#21608;&#26399;&#65292;&#37324;&#38754;&#38500;&#20102;&#26368;&#19978;&#23618;&#30340;&#26681;&#30446;&#24405;(<code class="filename">/</code>)&#65292;&#20160;&#20040;&#37117;&#27809;&#26377;&#12290;&#21018;&#24320;&#22987;&#65292;&#20462;&#35746;&#29256;&#26412;0&#26377;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;<code class="literal">svn:date</code>&#65292;&#35774;&#32622;&#20026;&#29256;&#26412;&#24211;&#21019;&#24314;&#30340;&#26102;&#38388;&#12290;
               </p>
               <p>&#29616;&#22312;&#20320;&#26377;&#20102;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#21487;&#20197;&#29992;&#25143;&#21270;&#20102;&#12290;</p>
               <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Warning">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                        <th align="left">&#35686;&#21578;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>&#19968;&#33324;&#26469;&#35828;&#65292;&#29256;&#26412;&#24211;&#38500;&#20102;&#19968;&#23567;&#37096;&#20998;&#8212;&#20363;&#22914;&#37197;&#32622;&#25991;&#20214;&#21644;&#38057;&#23376;&#33050;&#26412;&#65292;&#20320;&#19981;&#35201;(&#20063;&#19981;&#38656;&#35201;)&#25163;&#21160;&#24178;&#39044;&#29256;&#26412;&#24211;&#12290;<span class="command"><strong>svnadmin</strong></span>&#24037;&#20855;&#24212;&#35813;&#36275;&#20197;&#29992;&#26469;&#22788;&#29702;&#23545;&#29256;&#26412;&#24211;&#30340;&#20219;&#20309;&#20462;&#25913;&#65292;&#25110;&#32773;&#20320;&#20063;&#21487;&#20197;&#20351;&#29992;&#31532;&#19977;&#26041;&#24037;&#20855;(&#27604;&#22914;Berkeley DB&#30340;&#24037;&#20855;&#21253;)&#26469;&#35843;&#25972;&#37096;&#20998;&#29256;&#26412;&#24211;&#12290;<span class="emphasis"><em>&#19981;</em></span>&#35201;&#23581;&#35797;&#36890;&#36807;&#22788;&#29702;&#29256;&#26412;&#24211;&#25968;&#25454;&#23384;&#20648;&#25991;&#20214;&#25163;&#24037;&#20462;&#25913;&#29256;&#26412;&#25511;&#21046;&#21382;&#21490;&#65281;
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.create.hooks"></a>5.3.2.&nbsp;&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>A <em class="firstterm">hook</em> is a program triggered by
                          some repository event, such as the creation of a new revision
                          or the modification of an unversioned property.  Some hooks
                          (the so-called &#8220;<span class="quote">pre hooks</span>&#8221;) run in advance of a
                          repository operation and provide a means by which to both
                          report what is about to happen and prevent it from
                          happening at all.  Other hooks (the &#8220;<span class="quote">post hooks</span>&#8221;)
                          run after the completion of a repository event and are useful
                          for performing tasks that examine&#8212;but don't
                          modify&#8212;the repository.  Each hook is handed enough
                          information to tell what that event is (or was), the specific
                          repository changes proposed (or completed), and the username
                          of the person who triggered the event.
               </p>
               <p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;<code class="filename">hooks</code>&#23376;&#30446;&#24405;&#20013;&#21253;&#21547;&#21508;&#31181;&#29256;&#26412;&#24211;&#38057;&#23376;&#27169;&#26495;&#12290;
               </p><pre class="screen">
$ ls repos/hooks/
post-commit.tmpl          post-unlock.tmpl  pre-revprop-change.tmpl
post-lock.tmpl            pre-commit.tmpl   pre-unlock.tmpl
post-revprop-change.tmpl  pre-lock.tmpl     start-commit.tmpl
$
</pre><p>&#23545;&#27599;&#31181;Subversion&#29256;&#26412;&#24211;&#25903;&#25345;&#30340;&#38057;&#23376;&#30340;&#37117;&#26377;&#19968;&#20010;&#27169;&#26495;&#65292;&#36890;&#36807;&#26597;&#30475;&#36825;&#20123;&#33050;&#26412;&#30340;&#20869;&#23481;&#65292;&#20320;&#33021;&#30475;&#21040;&#26159;&#20160;&#20040;&#20107;&#20214;&#35302;&#21457;&#20102;&#33050;&#26412;&#21450;&#22914;&#20309;&#32473;&#20256;&#33050;&#26412;&#20256;&#36882;&#25968;&#25454;&#12290;&#21516;&#26102;&#65292;&#36825;&#20123;&#27169;&#29256;&#20063;&#26159;&#22914;&#20309;&#20351;&#29992;&#36825;&#20123;&#33050;&#26412;&#65292;&#32467;&#21512;Subversion&#25903;&#25345;&#30340;&#24037;&#20855;&#26469;&#23436;&#25104;&#26377;&#29992;&#20219;&#21153;&#30340;&#20363;&#23376;&#12290;&#35201;&#23454;&#38469;&#23433;&#35013;&#19968;&#20010;&#21487;&#29992;&#30340;&#38057;&#23376;&#65292;&#20320;&#38656;&#35201;&#22312;<code class="filename">repos/hooks</code>&#30446;&#24405;&#19979;&#23433;&#35013;&#19968;&#20123;&#19982;&#38057;&#23376;&#21516;&#21517;(&#22914; <span class="command"><strong>start-commit</strong></span>&#25110;&#32773;<span class="command"><strong>post-commit</strong></span>)&#30340;&#21487;&#25191;&#34892;&#31243;&#24207;&#25110;&#33050;&#26412;&#12290;
               </p>
               <p>&#22312;Unix&#24179;&#21488;&#19978;&#65292;&#36825;&#24847;&#21619;&#30528;&#35201;&#25552;&#20379;&#19968;&#20010;&#19982;&#38057;&#23376;&#21516;&#21517;&#30340;&#33050;&#26412;&#25110;&#31243;&#24207;(&#21487;&#33021;&#26159;shell &#33050;&#26412;&#65292;Python &#31243;&#24207;&#65292;&#32534;&#35793;&#36807;&#30340;c&#35821;&#35328;&#20108;&#36827;&#21046;&#25991;&#20214;&#25110;&#20854;&#20182;&#19996;&#35199;)&#12290;&#24403;&#28982;&#65292;&#33050;&#26412;&#27169;&#26495;&#25991;&#20214;&#19981;&#20165;&#20165;&#26159;&#23637;&#31034;&#20102;&#19968;&#20123;&#20449;&#24687;&#8212;&#22312;Unix&#19979;&#23433;&#35013;&#38057;&#23376;&#26368;&#31616;&#21333;&#30340;&#21150;&#27861;&#23601;&#26159;&#25335;&#36125;&#36825;&#20123;&#27169;&#26495;&#65292;&#24182;&#19988;&#21435;&#25481;<code class="literal">.tmpl</code>&#25193;&#23637;&#21517;&#65292;&#28982;&#21518;&#33258;&#23450;&#20041;&#38057;&#23376;&#30340;&#20869;&#23481;&#65292;&#30830;&#23450;&#33050;&#26412;&#26159;&#21487;&#36816;&#34892;&#30340;&#12290;Windows&#29992;&#25991;&#20214;&#30340;&#25193;&#23637;&#21517;&#26469;&#20915;&#23450;&#19968;&#20010;&#31243;&#24207;&#26159;&#21542;&#21487;&#36816;&#34892;&#65292;&#25152;&#20197;&#20320;&#35201;&#20351;&#31243;&#24207;&#30340;&#22522;&#26412;&#21517;&#19982;&#38057;&#23376;&#21516;&#21517;&#65292;&#21516;&#26102;&#65292;&#23427;&#30340;&#25193;&#23637;&#21517;&#26159;Windows&#31995;&#32479;&#25152;&#33021;&#36776;&#35748;&#30340;&#65292;&#20363;&#22914;<code class="filename">exe</code>&#12289;<code class="filename">com</code>&#21644;&#25209;&#22788;&#29702;&#30340;<code class="filename">bat</code>&#12290;
               </p>
               <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Tip">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#25552;&#31034;]" src="images/tip.png"></td>
                        <th align="left">&#25552;&#31034;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>&#30001;&#20110;&#23433;&#20840;&#21407;&#22240;&#65292;Subversion&#29256;&#26412;&#24211;&#22312;&#19968;&#20010;&#31354;&#29615;&#22659;&#20013;&#25191;&#34892;&#38057;&#23376;&#33050;&#26412;&#8212;&#23601;&#26159;&#27809;&#26377;&#35774;&#32622;&#20219;&#20309;&#29615;&#22659;&#21464;&#37327;&#65292;&#29978;&#33267;&#27809;&#26377;<code class="literal">$PATH</code>&#25110;<code class="literal">%PATH%</code>&#12290;&#30001;&#20110;&#36825;&#20010;&#21407;&#22240;&#65292;&#35768;&#22810;&#31649;&#29702;&#21592;&#20250;&#24863;&#21040;&#24456;&#22256;&#24785;&#65292;&#23427;&#20204;&#30340;&#38057;&#23376;&#33050;&#26412;&#25163;&#24037;&#36816;&#34892;&#26102;&#27491;&#24120;&#65292;&#21487;&#22312;Subversion&#20013;&#21364;&#19981;&#33021;&#36816;&#34892;&#12290;&#35201;&#27880;&#24847;&#65292;&#24517;&#39035;&#22312;&#20320;&#30340;&#38057;&#23376;&#20013;&#35774;&#32622;&#22909;&#29615;&#22659;&#21464;&#37327;&#25110;&#20026;&#20320;&#30340;&#31243;&#24207;&#25351;&#23450;&#22909;&#32477;&#23545;&#36335;&#24452;&#12290;
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>Subversion&#20250;&#35797;&#22270;&#20197;&#24403;&#21069;&#35775;&#38382;&#29256;&#26412;&#24211;&#30340;&#29992;&#25143;&#36523;&#20221;&#25191;&#34892;&#38057;&#23376;&#12290;&#36890;&#24120;&#65292;&#23545;&#29256;&#26412;&#24211;&#30340;&#35775;&#38382;&#24635;&#26159;&#36890;&#36807;Apache HTTP&#26381;&#21153;&#22120;&#21644;mod_dav_svn&#36827;&#34892;&#65292;&#22240;&#27492;&#65292;&#25191;&#34892;&#38057;&#23376;&#30340;&#29992;&#25143;&#23601;&#26159;&#36816;&#34892;Apache&#30340;&#29992;&#25143;&#12290;&#38057;&#23376;&#26412;&#36523;&#38656;&#35201;&#20855;&#26377;&#25805;&#20316;&#31995;&#32479;&#32423;&#30340;&#35775;&#38382;&#35768;&#21487;&#65292;&#29992;&#25143;&#21487;&#20197;&#36816;&#34892;&#23427;&#12290;&#21478;&#22806;&#65292;&#20854;&#23427;&#34987;&#38057;&#23376;&#30452;&#25509;&#25110;&#38388;&#25509;&#20351;&#29992;&#30340;&#25991;&#20214;&#25110;&#31243;&#24207;(&#21253;&#25324;Subversion&#29256;&#26412;&#24211;&#26412;&#36523;)&#20063;&#35201;&#34987;&#21516;&#19968;&#20010;&#29992;&#25143;&#35775;&#38382;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#35201;&#27880;&#24847;&#28508;&#22312;&#30340;&#35775;&#38382;&#25511;&#21046;&#38382;&#39064;&#65292;&#23427;&#21487;&#33021;&#20250;&#35753;&#20320;&#30340;&#38057;&#23376;&#26080;&#27861;&#25353;&#29031;&#20320;&#30340;&#30446;&#30340;&#39034;&#21033;&#25191;&#34892;&#12290;</p>
               <p>There are serveral hooks implemented by the Subversion
                          repository, and you can get details about each of them in
                          <a class="xref" href="svn.ref.html#svn.ref.reposhooks" title="9.11.&nbsp;&#29256;&#26412;&#24211;&#38057;&#23376;">&#31532;&nbsp;9.11&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#38057;&#23376;&#8221;</a>.  As a repository
                          administrator, you'll need to decide which hooks you wish
                          to implement (by way of providing an appropriately named and
                          permissioned hook program), and how.  When you make this
                          decision, keep in mind
                          the big picture of how your repository is deployed.
                          For example, if you are using server configuration
                          to determine which users are permitted to commit
                          changes to your repository, you don't need to do this
                          sort of access control via the hook system.
               </p>
               <p>There is no shortage of Subversion hook programs and
                          scripts that are freely available either from the Subversion community
                          itself or elsewhere.  These scripts cover a wide range of
                          utility&#8212;basic access control, policy adherence checking,
                          issue tracker integration, email- or syndication-based commit
                          notification, and beyond.  Or, if you wish to write your own,
                          see <a class="xref" href="svn.developer.html" title="&#31532;&nbsp;8&nbsp;&#31456;&nbsp;&#23884;&#20837; Subversion">&#31532;&nbsp;8&nbsp;&#31456; <i>&#23884;&#20837; Subversion</i></a>.
               </p>
               <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Warning">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                        <th align="left">&#35686;&#21578;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>&#23613;&#31649;&#32463;&#36807;&#35843;&#25972;&#38057;&#23376;&#33050;&#26412;&#21487;&#20197;&#20316;&#20219;&#20309;&#20107;&#24773;&#65292;&#20294;&#38057;&#23376;&#33050;&#26412;&#30340;&#20316;&#32773;&#20173;&#20250;&#21463;&#21040;&#19968;&#20123;&#38480;&#21046;&#65306;&#19981;&#35201;&#20462;&#25913;&#20351;&#29992;&#38057;&#23376;&#33050;&#26412;&#20462;&#25913;&#25552;&#20132;&#20107;&#21153;&#65292;&#22240;&#20026;&#20351;&#29992;&#38057;&#23376;&#33050;&#26412;&#33258;&#21160;&#20462;&#25913;&#38169;&#35823;&#25110;&#25552;&#20132;&#25991;&#20214;&#30340;&#25919;&#31574;&#36829;&#20363;&#30340;&#23581;&#35797;&#20250;&#23548;&#33268;&#38382;&#39064;&#12290;Subversion&#20250;&#22312;&#23458;&#25143;&#31471;&#32531;&#23384;&#23545;&#24212;&#30340;&#29256;&#26412;&#24211;&#25968;&#25454;&#65292;&#22914;&#26524;&#20320;&#36825;&#26679;&#20462;&#25913;&#20102;&#25552;&#20132;&#20107;&#21153;&#65292;&#36825;&#20123;&#32531;&#23384;&#23601;&#36827;&#20837;&#20102;&#26410;&#30693;&#30340;&#29366;&#24577;&#65292;&#36825;&#31181;&#19981;&#19968;&#33268;&#20250;&#23548;&#33268;&#20196;&#20154;&#21507;&#24778;&#21644;&#39044;&#24819;&#19981;&#21040;&#30340;&#34892;&#20026;&#12290;&#20316;&#20026;&#23545;&#20107;&#29289;&#20462;&#25913;&#30340;&#26367;&#25442;&#65292;&#20320;&#21487;&#20197;&#31616;&#21333;&#30340;&#22312;<code class="filename">pre-commit</code>&#30830;&#35748;&#20107;&#29289;&#20449;&#24687;&#24182;&#19988;&#25298;&#32477;&#25552;&#20132;&#65292;&#22914;&#26524;&#36825;&#26679;&#28385;&#36275;&#19981;&#20102;&#38656;&#27714;&#65292;&#20316;&#20026;&#39069;&#22806;&#30340;&#22870;&#36175;&#65292;&#20320;&#30340;&#29992;&#25143;&#20250;&#23398;&#20250;&#23567;&#24515;&#39034;&#20174;&#30340;&#24037;&#20316;&#20064;&#24815;&#12290;
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.create.bdb"></a>5.3.3.&nbsp;Berkeley DB &#37197;&#32622;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>A Berkeley DB environment is an encapsulation of one or
                          more databases, logfiles, region files, and configuration
                          files.  The Berkeley DB environment has its own set of default
                          configuration values for things such as the number of database
                          locks allowed to be taken out at any given time, the maximum
                          size of the journaling logfiles, and so on.  Subversion's
                          filesystem logic additionally chooses default values for some
                          of the Berkeley DB configuration options.  However, sometimes
                          your particular repository, with its unique collection of data
                          and access patterns, might require a different set of
                          configuration option values.
               </p>
               <p>The producers of Berkeley DB understand that different
                          applications and database environments have different
                          requirements, so they have provided a mechanism for overriding
                          at runtime many of the configuration values for the Berkeley
                          DB environment.  BDB checks for the presence of a file named
                          <code class="filename">DB_CONFIG</code> in the environment directory
                          (namely, the repository's <code class="filename">db</code>
                          subdirectory), and parses the options found in that file.
                          Subversion itself creates this file when it creates the rest
                          of the repository.  The file initially contains some default
                          options, as well as pointers to the Berkeley DB online
                          documentation so that you can read about what those options do.  Of
                          course, you are free to add any of the supported Berkeley DB
                          options to your <code class="filename">DB_CONFIG</code> file.  Just be
                          aware that while Subversion never attempts to read or
                          interpret the contents of the file and makes no direct use of
                          the option settings in it, you'll want to avoid any
                          configuration changes that may cause Berkeley DB to behave in
                          a fashion that is at odds with what Subversion might expect.
                          Also, changes made to <code class="filename">DB_CONFIG</code> won't
                          take effect until you recover the database environment (using
                          <span class="command"><strong>svnadmin recover</strong></span>).
               </p>
            </div>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.reposadmin.maint"></a>5.4.&nbsp;&#29256;&#26412;&#24211;&#32500;&#25252;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Maintaining a Subversion repository can be daunting, mostly
                     due to the complexities inherent in systems that have a database
                     backend.  Doing the task well is all about knowing the
                     tools&#8212;what they are, when to use them, and how.  This
                     section will introduce you to the repository administration
                     tools provided by Subversion and discuss how to wield them to
                     accomplish tasks such as repository data migration, upgrades,
                     backups, and cleanups.
            </p>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.tk"></a>5.4.1.&nbsp;&#31649;&#29702;&#21592;&#30340;&#24037;&#20855;&#31665;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Subversion&#25552;&#20379;&#20102;&#19968;&#20123;&#29992;&#26469;&#21019;&#24314;&#12289;&#26597;&#30475;&#12289;&#20462;&#25913;&#21644;&#20462;&#22797;&#29256;&#26412;&#24211;&#30340;&#24037;&#20855;&#12290;&#35753;&#25105;&#20204;&#39318;&#20808;&#35814;&#32454;&#20102;&#35299;&#19968;&#19979;&#27599;&#20010;&#24037;&#20855;&#65292;&#28982;&#21518;&#65292;&#25105;&#20204;&#20877;&#30475;&#19968;&#19979;&#20165;&#22312;Berkeley DB&#21518;&#31471;&#20998;&#21457;&#29256;&#26412;&#20013;&#25552;&#20379;&#30340;&#29256;&#26412;&#25968;&#25454;&#24211;&#24037;&#20855;&#12290;&#39318;&#20808;&#65292;&#25105;&#20204;&#31616;&#30701;&#26816;&#26597;&#19968;&#19979;Berkeley DB&#21457;&#24067;&#21253;&#21547;&#30340;&#38024;&#23545;&#29256;&#26412;&#24211;&#21518;&#31471;&#25968;&#25454;&#24211;&#30340;&#24037;&#20855;&#65292;&#19981;&#26159;Subversion&#26412;&#36523;&#25552;&#20379;&#30340;&#24037;&#20855;&#12290;</p>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.tk.svnadmin"></a>5.4.1.1.&nbsp;svnadmin
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p><span class="command"><strong>svnadmin</strong></span>&#31243;&#24207;&#26159;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#26368;&#22909;&#30340;&#26379;&#21451;&#12290;&#38500;&#20102;&#25552;&#20379;&#21019;&#24314;Subversion&#29256;&#26412;&#24211;&#30340;&#21151;&#33021;&#65292;&#36825;&#20010;&#31243;&#24207;&#20351;&#20320;&#21487;&#20197;&#32500;&#25252;&#36825;&#20123;&#29256;&#26412;&#24211;&#12290;<span class="command"><strong>svnadmin</strong></span>&#30340;&#35821;&#27861;&#21516;&#20854;&#20182;Subversion&#21629;&#20196;&#31867;&#20284;&#65306;
                  </p><pre class="screen">
$ svnadmin help
general usage: svnadmin SUBCOMMAND REPOS_PATH  [ARGS &amp; OPTIONS ...]
Type 'svnadmin help &lt;subcommand&gt;' for help on a specific subcommand.
Type 'svnadmin --version' to see the program version and FS modules.

Available subcommands:
   crashtest
   create
   deltify
&#8230;
</pre><p>&#22312;&#26412;&#31456;&#30340;&#21069;&#38754;)(&#22312;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.basics.creating" title="5.3.1.&nbsp;&#21019;&#24314;&#29256;&#26412;&#24211;">&#31532;&nbsp;5.3.1&nbsp;&#33410; &#8220;&#21019;&#24314;&#29256;&#26412;&#24211;&#8221;</a>)&#65292;&#25105;&#20204;&#24050;&#32463;&#35752;&#35770;&#20102;<span class="command"><strong>svnadmin</strong></span>&#30340;<code class="literal">create</code>&#23376;&#21629;&#20196;&#65292;&#26412;&#31456;&#21518;&#38754;&#25105;&#20204;&#20250;&#35814;&#32454;&#35762;&#35299;&#22823;&#22810;&#25968;&#20854;&#20182;&#30340;&#23376;&#21629;&#20196;&#65292;&#20851;&#20110;&#25152;&#26377;&#30340;&#23376;&#21629;&#20196;&#20320;&#21487;&#20197;&#21442;&#32771;<a class="xref" href="svn.ref.html#svn.ref.svnadmin" title="9.2.&nbsp;svnadmin">&#31532;&nbsp;9.2&nbsp;&#33410; &#8220;svnadmin&#8221;</a>&#12290;
                  </p>
               </div>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.tk.svnlook"></a>5.4.1.2.&nbsp;svnlook
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p><span class="command"><strong>svnlook</strong></span>&#26159;Subversion&#25552;&#20379;&#30340;&#29992;&#26469;&#26597;&#30475;&#29256;&#26412;&#24211;&#20013;&#19981;&#21516;&#30340;&#20462;&#35746;&#29256;&#26412;&#21644;&#20107;&#21153;(&#27491;&#22312;&#20135;&#29983;&#30340;&#20462;&#35746;&#29256;&#26412;)&#12290;&#36825;&#20010;&#31243;&#24207;&#19981;&#20250;&#20462;&#25913;&#29256;&#26412;&#24211;&#20869;&#23481;&#65293;&#36825;&#26159;&#20010;&#8220;<span class="quote">&#21482;&#35835;</span>&#8221;&#30340;&#24037;&#20855;&#12290;<span class="command"><strong>svnlook</strong></span>&#36890;&#24120;&#29992;&#22312;&#29256;&#26412;&#24211;&#38057;&#23376;&#31243;&#24207;&#20013;&#65292;&#29992;&#26469;&#35760;&#24405;&#29256;&#26412;&#24211;&#21363;&#23558;&#25552;&#20132;(<span class="command"><strong>&#29992;&#22312;pre-commit&#38057;&#23376;&#26102;)</strong></span>&#25110;&#32773;&#24050;&#32463;&#25552;&#20132;&#30340;(&#29992;&#22312;<span class="command"><strong>post-commit</strong></span>&#38057;&#23376;&#26102;)&#20462;&#25913;&#12290;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#21487;&#20197;&#23558;&#36825;&#20010;&#24037;&#20855;&#29992;&#20110;&#35786;&#26029;&#12290;
                  </p>
                  <p><span class="command"><strong>svnlook</strong></span>&#30340;&#35821;&#27861;&#24456;&#30452;&#25509;&#65306;
                  </p><pre class="screen">
$ svnlook help
general usage: svnlook SUBCOMMAND REPOS_PATH [ARGS &amp; OPTIONS ...]
Note: any subcommand which takes the '--revision' and '--transaction'
      options will, if invoked without one of those options, act on
      the repository's youngest revision.
Type 'svnlook help &lt;subcommand&gt;' for help on a specific subcommand.
Type 'svnlook --version' to see the program version and FS modules.
&#8230;
</pre><p>&#20960;&#20046;<span class="command"><strong>svnlook</strong></span>&#30340;&#27599;&#19968;&#20010;&#23376;&#21629;&#20196;&#37117;&#33021;&#25805;&#20316;&#20462;&#35746;&#29256;&#26412;&#25110;&#20107;&#21153;&#26641;&#65292;&#26174;&#31034;&#26641;&#26412;&#36523;&#30340;&#20449;&#24687;&#65292;&#25110;&#26159;&#23427;&#19982;&#29256;&#26412;&#24211;&#20013;&#19978;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#30340;&#19981;&#21516;&#12290;&#20320;&#21487;&#20197;&#29992;<code class="option">--revision</code>(<code class="option">-r</code>)&#21644;<code class="option">--transaction</code>(<code class="option">-t</code>)&#36873;&#39033;&#25351;&#23450;&#35201;&#26597;&#30475;&#30340;&#20462;&#35746;&#29256;&#26412;&#25110;&#20107;&#21153;&#12290;&#22914;&#26524;&#27809;&#26377;&#25351;&#23450;<code class="option">--revision</code>(<code class="option">-r</code>)&#21644;<code class="option">--transaction</code>(<code class="option">-t</code>)&#36873;&#39033;&#65292;<span class="command"><strong>svnlook</strong></span>&#20250;&#26816;&#26597;&#29256;&#26412;&#24211;&#26368;&#26032;&#30340;(&#25110;&#32773;&#35828;&#8220;<span class="quote">HEAD</span>&#8221;)&#20462;&#35746;&#29256;&#26412;&#12290;&#25152;&#20197;&#24403;19&#26159;&#20301;&#20110;<code class="filename">/path/to/repos</code>&#30340;&#29256;&#26412;&#24211;&#30340;&#26368;&#26032;&#29256;&#26412;&#26102;&#65292;&#22914;&#19979;&#30340;&#20004;&#20010;&#21629;&#20196;&#36215;&#21040;&#30456;&#21516;&#30340;&#25928;&#26524;&#65306;
                  </p><pre class="screen">
$ svnlook info /var/svn/repos
$ svnlook info /var/svn/repos -r 19
</pre><p>&#36825;&#20123;&#23376;&#21629;&#20196;&#30340;&#21807;&#19968;&#20363;&#22806;&#26159;<span class="command"><strong>svnlook youngest</strong></span>&#65292;&#23427;&#19981;&#38656;&#35201;&#20219;&#20309;&#36873;&#39033;&#65292;&#21482;&#20250;&#25171;&#21360;&#20986;&#29256;&#26412;&#24211;&#30340;&#26368;&#26032;&#20462;&#35746;&#29256;&#26412;&#21495;&#65306;
                  </p><pre class="screen">
$ svnlook youngest /var/svn/repos
19
$
</pre><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
                     <table border="0" summary="Note">
                        <tr>
                           <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="images/note.png"></td>
                           <th align="left">&#27880;&#24847;</th>
                        </tr>
                        <tr>
                           <td align="left" valign="top">
                              <p>&#35831;&#35760;&#20303;&#21482;&#33021;&#27983;&#35272;&#26410;&#25552;&#20132;&#30340;&#20107;&#29289;&#65292;&#22823;&#22810;&#25968;&#29256;&#26412;&#24211;&#27809;&#26377;&#36825;&#26679;&#30340;&#20107;&#29289;&#65292;&#22240;&#20026;&#20107;&#29289;&#35201;&#20040;&#26159;&#24050;&#32463;&#25552;&#20132;&#30340;(&#20063;&#23601;&#26159;&#20320;&#21487;&#20197;<code class="option">--revision</code>(<code class="option">-r</code>)&#35775;&#38382;&#30340;&#20462;&#35746;&#29256;&#26412;)&#65292;&#35201;&#20040;&#26159;&#36864;&#20986;&#30340;&#21644;&#21024;&#38500;&#30340;&#12290;
                              </p>
                           </td>
                        </tr>
                     </table>
                  </div>
                  <p><span class="command"><strong>svnlook</strong></span>&#30340;&#36755;&#20986;&#34987;&#35774;&#35745;&#20026;&#20154;&#21644;&#26426;&#22120;&#37117;&#26131;&#29702;&#35299;&#65292;&#25343;<span class="command"><strong>svnlook info</strong></span>&#23376;&#21629;&#20196;&#20030;&#20363;&#26469;&#35828;&#65306;
                  </p><pre class="screen">
$ svnlook info /var/svn/repos
sally
2002-11-04 09:29:13 -0600 (Mon, 04 Nov 2002)
27
Added the usual
Greek tree.
$
</pre><p><span class="command"><strong>svnlook info</strong></span>&#30340;&#36755;&#20986;&#21253;&#21547;&#22914;&#19979;&#30340;&#20869;&#23481;&#65292;&#25353;&#29031;&#32473;&#23450;&#30340;&#39034;&#24207;&#65306;
                  </p>
                  <div class="orderedlist">
                     <ol type="1">
                        <li>
                           <p>The author, followed by a newline</p>
                        </li>
                        <li>
                           <p>The date, followed by a newline</p>
                        </li>
                        <li>
                           <p>The number of characters in the log message,
                                            followed by a newline
                           </p>
                        </li>
                        <li>
                           <p>The log message itself, followed by a newline</p>
                        </li>
                     </ol>
                  </div>
                  <p>This output is human-readable, meaning items such as the
                               datestamp are displayed using a textual representation
                               instead of something more obscure (such as the number of
                               nanoseconds since the Tastee Freez guy drove by).  But the
                               output is also machine-parsable&#8212;because the log
                               message can contain multiple lines and be unbounded in
                               length, <span class="command"><strong>svnlook</strong></span> provides the length of
                               that message before the message itself.  This allows scripts
                               and other wrappers around this command to make intelligent
                               decisions about the log message, such as how much memory to
                               allocate for the message, or at least how many bytes to skip
                               in the event that this output is not the last bit of data in
                               the stream.
                  </p>
                  <p><span class="command"><strong>svnlook</strong></span>&#36824;&#21487;&#20197;&#20570;&#24456;&#22810;&#21035;&#30340;&#26597;&#35810;&#65306;&#26174;&#31034;&#25105;&#20204;&#20808;&#21069;&#25552;&#21040;&#30340;&#20449;&#24687;&#30340;&#19968;&#20123;&#23376;&#38598;&#65292;&#36882;&#24402;&#26174;&#31034;&#29256;&#26412;&#30446;&#24405;&#26641;&#65292;&#25253;&#21578;&#25351;&#23450;&#30340;&#20462;&#35746;&#29256;&#26412;&#25110;&#20107;&#21153;&#20013;&#21738;&#20123;&#36335;&#24452;&#26366;&#32463;&#34987;&#20462;&#25913;&#36807;&#65292;&#26174;&#31034;&#23545;&#25991;&#20214;&#21644;&#30446;&#24405;&#20570;&#36807;&#30340;&#25991;&#26412;&#21644;&#23646;&#24615;&#30340;&#20462;&#25913;&#65292;&#31561;&#31561;&#12290;<a class="xref" href="svn.ref.html#svn.ref.svnlook" title="9.3.&nbsp;svnlook">&#31532;&nbsp;9.3&nbsp;&#33410; &#8220;svnlook&#8221;</a>&#26159;<span class="command"><strong>svnlook</strong></span>&#21629;&#20196;&#33021;&#25509;&#21463;&#23376;&#21629;&#20196;&#30340;&#23436;&#20840;&#29305;&#24615;&#21442;&#32771;&#12290;
                  </p>
               </div>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.tk.svndumpfilter"></a>5.4.1.3.&nbsp;svndumpfilter
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>&#34429;&#28982;&#22312;&#31649;&#29702;&#21592;&#30340;&#26085;&#24120;&#24037;&#20316;&#20013;&#24182;&#19981;&#20250;&#32463;&#24120;&#20351;&#29992;&#65292;&#19981;&#36807;<span class="command"><strong>svndumpfilter</strong></span>&#25552;&#20379;&#20102;&#19968;&#39033;&#29305;&#21035;&#26377;&#29992;&#30340;&#21151;&#33021;&#8212;&#21487;&#20197;&#31616;&#21333;&#24555;&#36895;&#30340;&#20316;&#20026;Subversion&#29256;&#26412;&#24211;&#21382;&#21490;&#30340;&#20197;&#36335;&#24452;&#20026;&#22522;&#30784;&#30340;&#36807;&#28388;&#22120;&#12290;
                  </p>
                  <p><span class="command"><strong>svndumpfilter</strong></span>&#30340;&#35821;&#27861;&#22914;&#19979;&#65306;
                  </p><pre class="screen">
$ svndumpfilter help
general usage: svndumpfilter SUBCOMMAND [ARGS &amp; OPTIONS ...]
Type "svndumpfilter help &lt;subcommand&gt;" for help on a specific subcommand.
Type 'svndumpfilter --version' to see the program version.
  
Available subcommands:
   exclude
   include
   help (?, h)
</pre><p>There are only two interesting subcommands:
                               <span class="command"><strong>svndumpfilter exclude</strong></span> and
                               <span class="command"><strong>svndumpfilter include</strong></span>.  They allow you to
                               make the choice between implicit or explicit inclusion of
                               paths in the stream.  You can learn more about these
                               subcommands and <span class="command"><strong>svndumpfilter</strong></span>'s unique
                               purpose later in this chapter, in <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.filtering" title="5.4.6.&nbsp;&#36807;&#28388;&#29256;&#26412;&#24211;&#21382;&#21490;">&#31532;&nbsp;5.4.6&nbsp;&#33410; &#8220;&#36807;&#28388;&#29256;&#26412;&#24211;&#21382;&#21490;&#8221;</a>.
                  </p>
               </div>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.tk.svnsync"></a>5.4.1.4.&nbsp;svnsync
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p><span class="command"><strong>svnsync</strong></span>&#31243;&#24207;&#26159;Subversion 1.4&#29256;&#30340;&#26032;&#29305;&#24615;&#65292;&#25552;&#20379;&#20102;&#32500;&#25252;&#19968;&#20010;&#21482;&#35835;&#29256;&#26412;&#24211;&#38236;&#20687;&#30340;&#20840;&#37096;&#21151;&#33021;&#12290;&#36825;&#20010;&#31243;&#24207;&#21482;&#26377;&#19968;&#20010;&#24037;&#20316;&#8212;&#23558;&#19968;&#20010;&#29256;&#26412;&#24211;&#30340;&#21382;&#21490;&#36716;&#31227;&#21040;&#21478;&#19968;&#20010;&#65292;&#23613;&#31649;&#26377;&#20960;&#31181;&#26041;&#27861;&#65292;&#20294;&#36825;&#31181;&#26041;&#27861;&#30340;&#20027;&#35201;&#29305;&#28857;&#26159;&#21487;&#20197;&#36828;&#31243;&#25805;&#20316;&#8212;&#8220;<span class="quote">&#28304;</span>&#8221;&#65292;&#8220;<span class="quote">&#30446;&#26631;</span>&#8221;<sup>[<a name="d0e9966" href="#ftn.d0e9966" class="footnote">33</a>]</sup>&#29256;&#26412;&#24211;&#20197;&#21450;<span class="command"><strong>svnsync</strong></span>&#31243;&#24207;&#21487;&#33021;&#22312;&#19981;&#21516;&#30340;&#35745;&#31639;&#26426;&#19978;&#12290;
                  </p>
                  <p>&#23601;&#20687;&#20320;&#26399;&#26395;&#30340;&#65292;<span class="command"><strong>svnsync</strong></span>&#30340;&#35821;&#27861;&#19982;&#26412;&#33410;&#25552;&#21040;&#30340;&#20854;&#20182;&#21629;&#20196;&#38750;&#24120;&#31867;&#20284;&#12290;
                  </p><pre class="screen">
$ svnsync help
general usage: svnsync SUBCOMMAND DEST_URL  [ARGS &amp; OPTIONS ...]
Type 'svnsync help &lt;subcommand&gt;' for help on a specific subcommand.
Type 'svnsync --version' to see the program version and RA modules.

Available subcommands:
   initialize (init)
   synchronize (sync)
   copy-revprops
   help (?, h)
$
</pre><p>&#25105;&#20204;&#20250;&#22312;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.replication" title="5.4.7.&nbsp;&#29256;&#26412;&#24211;&#22797;&#21046;">&#31532;&nbsp;5.4.7&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#22797;&#21046;&#8221;</a>&#35814;&#32454;&#35752;&#35770;&#20351;&#29992;<span class="command"><strong>svnsync</strong></span>&#23454;&#29616;&#29256;&#26412;&#24211;&#22797;&#21046;&#12290;
                  </p>
               </div>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.tk.fsfsreshard"></a>5.4.1.5.&nbsp;fsfs-reshard.py
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>While not an official member of the Subversion
                               toolchain, the <span class="command"><strong>fsfs-reshard.py</strong></span> script
                               (found in the <code class="filename">tools/server-side</code>
                               directory of the Subversion source distribution) is a useful
                               performance tuning tool for administrators of FSFS-backed
                               Subversion repositories.  FSFS repositories contain files
                               that describe the changes made in a single revision, and
                               files that contain the revision properties associated with
                               a single revision.  Repositories created in versions of
                               Subversion prior to 1.5 keep these files in two
                               directories&#8212;one for each type of file.  As new
                               revisions are committed to the repository, Subversion drops
                               more files into these two directories&#8212;over time, the
                               number of these files in each directory can grow to be quite
                               large.  This has been observed to cause performance problems
                               on certain network-based filesystems.
                  </p>
                  <p>Subversion 1.5 creates FSFS-backed repositories using a
                               slightly modified layout in which the contents of these two
                               directories are <em class="firstterm">sharded</em>, or scattered
                               across several subdirectories.  This can greatly reduce the
                               time it takes the system to locate any one of these files,
                               and therefore increases the overall performance of
                               Subversion when reading from the repository.  The number of
                               subdirectories used to house these files is configurable,
                               though, and that's where
                               <span class="command"><strong>fsfs-reshard.py</strong></span> comes in.  This script
                               reshuffles the repository's file structure into a new
                               arrangement that reflects the requested number of sharding
                               subdirectories.  This is especially useful for converting an
                               older Subversion repository into the new Subversion 1.5
                               sharded layout (which Subversion will not automatically do
                               for you) or for fine-tuning an already sharded
                               repository.
                  </p>
               </div>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.tk.bdbutil"></a>5.4.1.6.&nbsp;Berkeley DB &#24037;&#20855;
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>If you're using a Berkeley DB repository, all of
                               your versioned filesystem's structure and data live in a set
                               of database tables within the <code class="filename">db/</code>
                               subdirectory of your repository.  This subdirectory is a
                               regular Berkeley DB environment directory and can therefore
                               be used in conjunction with any of the Berkeley database
                               tools, typically provided as part of the Berkeley DB
                               distribution.
                  </p>
                  <p>For day-to-day Subversion use, these tools are
                               unnecessary.  Most of the functionality typically needed for
                               Subversion repositories has been duplicated in the
                               <span class="command"><strong>svnadmin</strong></span> tool.  For example,
                               <span class="command"><strong>svnadmin list-unused-dblogs</strong></span> and
                               <span class="command"><strong>svnadmin list-dblogs</strong></span> perform a
                               subset of what is provided by the Berkeley
                               <span class="command"><strong>db_archive</strong></span> utility, and <span class="command"><strong>svnadmin
                                     recover</strong></span> reflects the common use cases of the
                               <span class="command"><strong>db_recover</strong></span> utility.
                  </p>
                  <p>&#24403;&#28982;&#65292;&#36824;&#26377;&#19968;&#20123;Berkeley DB&#24037;&#20855;&#26377;&#26102;&#26159;&#26377;&#29992;&#30340;&#12290;<span class="command"><strong>db_load</strong></span>&#21644;<span class="command"><strong>db_dump</strong></span>&#20998;&#21035;&#23558;Berkeley DB&#25968;&#25454;&#24211;&#20013;&#30340;&#38190;&#20540;&#23545;&#20197;&#29305;&#23450;&#30340;&#26684;&#24335;&#35835;&#20889;&#25991;&#20214;&#12290;Berkeley&#25968;&#25454;&#24211;&#26412;&#36523;&#19981;&#25903;&#25345;&#36328;&#24179;&#21488;&#36716;&#31227;&#65292;&#36825;&#20004;&#20010;&#24037;&#20855;&#22312;&#36825;&#26679;&#30340;&#24773;&#20917;&#19979;&#23601;&#21487;&#20197;&#23454;&#29616;&#22312;&#24179;&#21488;&#38388;&#36716;&#31227;&#25968;&#25454;&#24211;&#30340;&#21151;&#33021;&#65292;&#32780;&#26080;&#38656;&#20851;&#24515;&#25805;&#20316;&#31995;&#32479;&#25110;&#26426;&#22120;&#26550;&#26500;&#12290;&#23601;&#20687;&#25105;&#20204;&#20197;&#21069;&#25551;&#36848;&#30340;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svnadmin dump</strong></span>&#21644;<span class="command"><strong>svnadmin load</strong></span>&#23454;&#29616;&#31867;&#20284;&#30340;&#30446;&#30340;&#65292;&#20294;&#26159;<span class="command"><strong>db_dump</strong></span>&#21644;<span class="command"><strong>db_load</strong></span>&#21487;&#20197;&#26356;&#24555;&#19968;&#28857;&#65292;&#23427;&#20204;&#20063;&#21487;&#20197;&#21327;&#21161;Berkeley DB&#30340;hacker&#26469;&#31713;&#25913;BDB&#21518;&#31471;&#30340;&#25968;&#25454;&#65292;&#36825;&#26159;Subversion&#24037;&#20855;&#19981;&#20801;&#35768;&#30340;&#12290;&#27492;&#22806;&#65292;<span class="command"><strong>db_stat</strong></span>&#24037;&#20855;&#33021;&#22815;&#25552;&#20379;&#20851;&#20110;Berkeley DB&#29615;&#22659;&#30340;&#35768;&#22810;&#26377;&#29992;&#20449;&#24687;&#65292;&#21253;&#25324;&#35814;&#32454;&#30340;&#38145;&#23450;&#21644;&#23384;&#20648;&#23376;&#31995;&#32479;&#30340;&#32479;&#35745;&#20449;&#24687;&#12290;
                  </p>
                  <p>For more information on the Berkeley DB tool chain,
                               visit the documentation section of the Berkeley DB section
                               of Oracle's web site, located at <a class="ulink" href="http://www.oracle.com/technology/documentation/berkeley-db/db/" target="_top">http://www.oracle.com/technology/documentation/berkeley-db/db/</a>.
                  </p>
               </div>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.setlog"></a>5.4.2.&nbsp;&#20462;&#27491;&#25552;&#20132;&#28040;&#24687;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Sometimes a user will have an error in her log message (a
                          misspelling or some misinformation, perhaps).  If the
                          repository is configured (using the
                          <code class="literal">pre-revprop-change</code> hook; see <a class="xref" href="svn.reposadmin.html#svn.reposadmin.create.hooks" title="5.3.2.&nbsp;&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;">&#31532;&nbsp;5.3.2&nbsp;&#33410; &#8220;&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;&#8221;</a>) to accept changes to
                          this log message after the commit is finished, the user
                          can &#8220;<span class="quote">fix</span>&#8221; her log message remotely using
                          <span class="command"><strong>svn propset</strong></span> (see <a class="xref" href="svn.ref.svn.c.propset.html" title="svn propset">svn propset</a>).  However, because of the
                          potential to lose information forever, Subversion repositories
                          are not, by default, configured to allow changes to
                          unversioned properties&#8212;except by an
                          administrator.
               </p>
               <p>&#22914;&#26524;&#31649;&#29702;&#21592;&#24819;&#35201;&#20462;&#25913;&#26085;&#24535;&#20449;&#24687;&#65292;&#37027;&#20040;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svnadmin setlog</strong></span>&#21629;&#20196;&#12290;&#36825;&#20010;&#21629;&#20196;&#20174;&#25351;&#23450;&#30340;&#25991;&#20214;&#20013;&#35835;&#21462;&#20449;&#24687;&#65292;&#21462;&#20195;&#29256;&#26412;&#24211;&#20013;&#26576;&#20010;&#20462;&#35746;&#29256;&#26412;&#30340;&#26085;&#24535;&#20449;&#24687;(<code class="literal">svn:log</code>&#23646;&#24615;)&#12290;
               </p><pre class="screen">
$ echo "Here is the new, correct log message" &gt; newlog.txt
$ svnadmin setlog myrepos newlog.txt -r 388
</pre><p>&#21363;&#20351;&#26159;<span class="command"><strong>svnadmin setlog</strong></span>&#21629;&#20196;&#20063;&#21463;&#21040;&#38480;&#21046;&#12290;<code class="literal">pre-</code>&#21644; <code class="literal">post-revprop-change</code>&#38057;&#23376;&#21516;&#26679;&#20250;&#34987;&#35302;&#21457;&#65292;&#22240;&#27492;&#24517;&#39035;&#36827;&#34892;&#30456;&#24212;&#30340;&#35774;&#32622;&#25165;&#33021;&#20801;&#35768;&#20462;&#25913;&#38750;&#29256;&#26412;&#21270;&#23646;&#24615;&#12290;&#19981;&#36807;&#31649;&#29702;&#21592;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svnadmin setlog</strong></span>&#21629;&#20196;&#30340;<code class="option">--bypass-hooks</code>&#36873;&#39033;&#36339;&#36807;&#38057;&#23376;&#12290;
               </p>
               <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Warning">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                        <th align="left">&#35686;&#21578;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>&#19981;&#36807;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#19968;&#26086;&#36339;&#36807;&#38057;&#23376;&#20063;&#23601;&#36339;&#36807;&#20102;&#38057;&#23376;&#25152;&#25552;&#20379;&#30340;&#25152;&#26377;&#21151;&#33021;&#65292;&#27604;&#22914;&#37038;&#20214;&#36890;&#30693;(&#36890;&#30693;&#23646;&#24615;&#26377;&#25913;&#21160;)&#12289;&#31995;&#32479;&#22791;&#20221;(&#21487;&#20197;&#29992;&#26469;&#36319;&#36394;&#38750;&#29256;&#26412;&#21270;&#30340;&#23646;&#24615;&#21464;&#26356;)&#31561;&#31561;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#35201;&#30041;&#24515;&#20320;&#25152;&#20316;&#20986;&#30340;&#20462;&#25913;&#65292;&#20197;&#21450;&#20320;&#20316;&#20986;&#20462;&#25913;&#30340;&#26041;&#24335;&#12290;</p>
                        </td>
                     </tr>
                  </table>
               </div>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.diskspace"></a>5.4.3.&nbsp;&#31649;&#29702;&#30913;&#30424;&#31354;&#38388;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#34429;&#28982;&#23384;&#20648;&#22120;&#30340;&#20215;&#26684;&#22312;&#36807;&#21435;&#30340;&#20960;&#24180;&#37324;&#20197;&#35753;&#20154;&#38590;&#20197;&#33268;&#20449;&#30340;&#36895;&#24230;&#28369;&#33853;&#65292;&#20294;&#26159;&#23545;&#20110;&#37027;&#20123;&#38656;&#35201;&#23545;&#22823;&#37327;&#25968;&#25454;&#36827;&#34892;&#29256;&#26412;&#31649;&#29702;&#30340;&#31649;&#29702;&#21592;&#20204;&#26469;&#35828;&#65292;&#30913;&#30424;&#31354;&#38388;&#30340;&#28040;&#32791;&#20381;&#28982;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#22240;&#32032;&#12290;&#29256;&#26412;&#24211;&#27599;&#22686;&#21152;&#19968;&#20010;&#23383;&#33410;&#37117;&#24847;&#21619;&#30528;&#38656;&#35201;&#22810;&#19968;&#20010;&#23383;&#33410;&#30340;&#30913;&#30424;&#31354;&#38388;&#36827;&#34892;&#22791;&#20221;&#65292;&#23545;&#20110;&#22810;&#37325;&#22791;&#20221;&#26469;&#35828;&#65292;&#23601;&#38656;&#35201;&#28040;&#32791;&#26356;&#22810;&#30340;&#30913;&#30424;&#31354;&#38388;&#12290;Berkeley
                  DB&#29256;&#26412;&#24211;&#30340;&#20027;&#35201;&#23384;&#20648;&#26426;&#21046;&#26159;&#22522;&#20110;&#19968;&#20010;&#22797;&#26434;&#30340;&#25968;&#25454;&#24211;&#31995;&#32479;&#24314;&#31435;&#30340;&#65292;&#22240;&#27492;&#20102;&#35299;&#19968;&#20123;&#25968;&#25454;&#24615;&#36136;&#26159;&#26377;&#24847;&#20041;&#30340;&#65292;&#27604;&#22914;&#21738;&#20123;&#25968;&#25454;&#24517;&#39035;&#20445;&#25345;&#22312;&#32447;&#65292;&#21738;&#20123;&#25968;&#25454;&#38656;&#35201;&#22791;&#20221;&#12289;&#21738;&#20123;&#25968;&#25454;&#21487;&#20197;&#23433;&#20840;&#30340;&#21024;&#38500;&#31561;&#31561;&#12290;
               </p>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.diskspace.deltas"></a>5.4.3.1.&nbsp;&#35753; Subversion &#33410;&#32422;&#30913;&#30424;&#31354;&#38388;
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>To keep the repository small,
                               Subversion uses <em class="firstterm">deltification</em> (or
                               deltified storage) within the repository
                               itself.  Deltification involves encoding the representation
                               of a chunk of data as a collection of differences against
                               some other chunk of data.  If the two pieces of data are
                               very similar, this deltification results in storage savings
                               for the deltified chunk&#8212;rather than taking up space
                               equal to the size of the original data, it takes up only
                               enough space to say, &#8220;<span class="quote">I look just like this other
                                  piece of data over here, except for the following couple of
                                  changes.</span>&#8221;  The result is that most of the repository
                               data that tends to be bulky&#8212;namely, the contents of
                               versioned files&#8212;is stored at a much smaller size than
                               the original full-text representation of that
                               data.  And for repositories created with Subversion 1.4 or
                               later, the space savings are even better&#8212;now those
                               full-text representations of file contents are themselves
                               compressed.
                  </p>
                  <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
                     <table border="0" summary="Note">
                        <tr>
                           <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="images/note.png"></td>
                           <th align="left">&#27880;&#24847;</th>
                        </tr>
                        <tr>
                           <td align="left" valign="top">
                              <p>&#30001;&#20110;Subversion&#29256;&#26412;&#24211;&#30340;&#22686;&#37327;&#21270;&#25968;&#25454;&#20445;&#23384;&#22312;&#21333;&#19968;Berkeley DB&#25968;&#25454;&#24211;&#25991;&#20214;&#20013;&#65292;&#20943;&#23569;&#25968;&#25454;&#30340;&#20307;&#31215;&#24182;&#19981;&#19968;&#23450;&#33021;&#22815;&#20943;&#23567;&#25968;&#25454;&#24211;&#25991;&#20214;&#30340;&#22823;&#23567;&#12290;&#20294;&#26159;&#65292;Berkeley DB&#20250;&#22312;&#20869;&#37096;&#35760;&#24405;&#26410;&#20351;&#29992;&#30340;&#25968;&#25454;&#24211;&#25991;&#20214;&#21306;&#22495;&#65292;&#24182;&#19988;&#22312;&#22686;&#21152;&#25968;&#25454;&#24211;&#25991;&#20214;&#22823;&#23567;&#20043;&#21069;&#20250;&#39318;&#20808;&#20351;&#29992;&#36825;&#20123;&#26410;&#20351;&#29992;&#30340;&#21306;&#22495;&#12290;&#22240;&#27492;&#65292;&#21363;&#20351;&#22686;&#37327;&#21270;&#25216;&#26415;&#19981;&#33021;&#31435;&#26438;&#35265;&#24433;&#30340;&#33410;&#30465;&#30913;&#30424;&#31354;&#38388;&#65292;&#20063;&#21487;&#20197;&#26497;&#22823;&#30340;&#20943;&#24930;&#25968;&#25454;&#24211;&#30340;&#33192;&#32960;&#36895;&#24230;&#12290;</p>
                           </td>
                        </tr>
                     </table>
                  </div>
               </div>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.diskspace.deadtxns"></a>5.4.3.2.&nbsp;&#21024;&#38500;&#32456;&#27490;&#30340;&#20107;&#21153;
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>&#23613;&#31649;&#19981;&#22826;&#24120;&#35265;&#65292;Subversion&#30340;&#25552;&#20132;&#36827;&#31243;&#20063;&#26377;&#22833;&#36133;&#65292;&#21516;&#26102;&#30041;&#19979;&#23558;&#35201;&#29983;&#25104;&#30340;&#20462;&#35746;&#29256;&#26412;&#8212;&#26410;&#25552;&#20132;&#30340;&#20107;&#29289;&#21644;&#25152;&#26377;&#38543;&#20043;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#20462;&#25913;&#12290;&#20986;&#29616;&#36825;&#31181;&#24773;&#20917;&#21487;&#33021;&#26377;&#20197;&#19979;&#21407;&#22240;&#65306;&#23458;&#25143;&#31471;&#30340;&#29992;&#25143;&#31895;&#26292;&#30340;&#32467;&#26463;&#20102;&#25805;&#20316;&#65292;&#25805;&#20316;&#36807;&#31243;&#20013;&#20986;&#29616;&#32593;&#32476;&#25925;&#38556;&#65292;&#31561;&#31561;&#12290;&#19981;&#31649;&#26159;&#20160;&#20040;&#21407;&#22240;&#65292;&#27515;&#20129;&#30340;&#20107;&#21153;&#24635;&#26159;&#26377;&#21487;&#33021;&#20250;&#20986;&#29616;&#12290;&#36825;&#31867;&#20107;&#21153;&#19981;&#20250;&#20135;&#29983;&#20160;&#20040;&#36127;&#38754;&#24433;&#21709;&#65292;&#20165;&#20165;&#26159;&#28040;&#32791;&#20102;&#19968;&#28857;&#28857;&#30913;&#30424;&#31354;&#38388;&#12290;&#19981;&#36807;&#65292;&#20005;&#21385;&#30340;&#31649;&#29702;&#21592;&#24635;&#26159;&#24076;&#26395;&#33021;&#22815;&#23558;&#23427;&#20204;&#28165;&#38500;&#20986;&#21435;&#12290;</p>
                  <p>&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svnadmin lstxns</strong></span>&#21629;&#20196;&#21015;&#20986;&#24403;&#21069;&#30340;&#20107;&#21153;&#21517;&#12290;
                  </p><pre class="screen">
$ svnadmin lstxns myrepos
19
3a1
a45
$
</pre><p>Each item in the resultant output can then be used with
                               <span class="command"><strong>svnlook</strong></span> (and its
                               <code class="option">--transaction</code> (<code class="option">-t</code>) option)
                               to determine who created the transaction, when it was
                               created, what types of changes were made in the
                               transaction&#8212;information that is helpful in determining
                               whether the transaction is a safe candidate for
                               removal!  If you do indeed want to remove a transaction, its
                               name can be passed to <span class="command"><strong>svnadmin rmtxns</strong></span>,
                               which will perform the cleanup of the transaction.  In fact,
                               <span class="command"><strong>svnadmin rmtxns</strong></span> can take its input
                               directly from the output of
                               <span class="command"><strong>svnadmin lstxns</strong></span>!
                  </p><pre class="screen">
$ svnadmin rmtxns myrepos `svnadmin lstxns myrepos`
$
</pre><p>&#22312;&#25353;&#29031;&#19978;&#38754;&#20363;&#23376;&#20013;&#30340;&#26041;&#27861;&#28165;&#29702;&#29256;&#26412;&#24211;&#20043;&#21069;&#65292;&#20320;&#25110;&#35768;&#24212;&#35813;&#26242;&#26102;&#20851;&#38381;&#29256;&#26412;&#24211;&#21644;&#23458;&#25143;&#31471;&#30340;&#36830;&#25509;&#12290;&#36825;&#26679;&#22312;&#20320;&#24320;&#22987;&#28165;&#29702;&#20043;&#21069;&#65292;&#19981;&#20250;&#26377;&#27491;&#24120;&#30340;&#20107;&#21153;&#36827;&#20837;&#29256;&#26412;&#24211;&#12290;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.diskspace.deadtxns.ex-1" title="&#20363;&nbsp;5.1.&nbsp;txn-info.sh (&#25253;&#21578;&#24322;&#24120;&#20107;&#21153;)">&#20363;&nbsp;5.1 &#8220;txn-info.sh (&#25253;&#21578;&#24322;&#24120;&#20107;&#21153;)&#8221;</a>&#20013;&#30340;shell&#33050;&#26412;&#21487;&#20197;&#29992;&#26469;&#36805;&#36895;&#33719;&#24471;&#29256;&#26412;&#24211;&#20013;&#24322;&#24120;&#20107;&#21153;&#30340;&#20449;&#24687;&#12290;
                  </p>
                  <div class="example"><a name="svn.reposadmin.maint.diskspace.deadtxns.ex-1"></a><p class="title"><b>&#20363;&nbsp;5.1.&nbsp;txn-info.sh (&#25253;&#21578;&#24322;&#24120;&#20107;&#21153;)</b></p>
                     <div class="example-contents"><pre class="programlisting">
#!/bin/sh

### Generate informational output for all outstanding transactions in
### a Subversion repository.

REPOS="${1}"
if [ "x$REPOS" = x ] ; then
  echo "usage: $0 REPOS_PATH"
  exit
fi

for TXN in `svnadmin lstxns ${REPOS}`; do 
  echo "---[ Transaction ${TXN} ]-------------------------------------------"
  svnlook info "${REPOS}" -t "${TXN}"
done
</pre></div>
                  </div><br class="example-break"><p>The output of the script is basically a concatenation of
                               several chunks of <span class="command"><strong>svnlook info</strong></span> output
                               (see <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.tk.svnlook" title="5.4.1.2.&nbsp;svnlook">&#31532;&nbsp;5.4.1.2&nbsp;&#33410; &#8220;svnlook&#8221;</a>) and
                               will look something like this:
                  </p><pre class="screen">
$ txn-info.sh myrepos
---[ Transaction 19 ]-------------------------------------------
sally
2001-09-04 11:57:19 -0500 (Tue, 04 Sep 2001)
0
---[ Transaction 3a1 ]-------------------------------------------
harry
2001-09-10 16:50:30 -0500 (Mon, 10 Sep 2001)
39
Trying to commit over a faulty network.
---[ Transaction a45 ]-------------------------------------------
sally
2001-09-12 11:09:28 -0500 (Wed, 12 Sep 2001)
0
$
</pre><p>&#19968;&#20010;&#24223;&#24323;&#20102;&#24456;&#38271;&#26102;&#38388;&#30340;&#20107;&#21153;&#36890;&#24120;&#26159;&#25552;&#20132;&#38169;&#35823;&#25110;&#24322;&#24120;&#20013;&#26029;&#30340;&#32467;&#26524;&#12290;&#20107;&#21153;&#30340;&#26102;&#38388;&#25139;&#21487;&#20197;&#25552;&#20379;&#32473;&#25105;&#20204;&#19968;&#20123;&#26377;&#36259;&#30340;&#20449;&#24687;&#65292;&#27604;&#22914;&#19968;&#20010;&#36827;&#34892;&#20102;9&#20010;&#26376;&#30340;&#25805;&#20316;&#23621;&#28982;&#36824;&#26159;&#27963;&#21160;&#30340;&#31561;&#31561;&#12290;</p>
                  <p>In short, transaction cleanup decisions need not be made
                               unwisely.  Various sources of information&#8212;including
                               Apache's error and access logs, Subversion's operational
                               logs, Subversion revision history, and so on&#8212;can be
                               employed in the decision-making process.  And of course, an
                               administrator can often simply communicate with a seemingly
                               dead transaction's owner (via email, e.g.) to verify
                               that the transaction is, in fact, in a zombie state.
                  </p>
               </div>
               <div class="sect3" lang="zh-cn">
                  <div class="titlepage">
                     <div>
                        <div>
                           <h4 class="title"><a name="svn.reposadmin.maint.diskspace.bdblogs"></a>5.4.3.3.&nbsp;&#21024;&#38500;&#19981;&#20351;&#29992;&#30340; Berkeley DB &#26085;&#24535;&#25991;&#20214;
                           </h4>
                        </div>
                     </div>
                  </div>
                  <p>Until recently, the largest offender of disk space usage
                               with respect to BDB-backed Subversion repositories were the
                               logfiles in which Berkeley DB performs its prewrites before
                               modifying the actual database files.  These files capture
                               all the actions taken along the route of changing the
                               database from one state to another&#8212;while the database
                               files, at any given time, reflect a particular state, the
                               logfiles contain all of the many changes along the way
                               <span class="emphasis"><em>between</em></span> states.  Thus, they can grow
                               and accumulate quite rapidly.
                  </p>
                  <p>Fortunately, beginning with the 4.2 release of Berkeley
                               DB, the database environment has the ability to remove its
                               own unused logfiles automatically.  Any
                               repositories created using <span class="command"><strong>svnadmin</strong></span>
                               when compiled against Berkeley DB version 4.2 or later
                               will be configured for this automatic logfile removal.  If
                               you don't want this feature enabled, simply pass the
                               <code class="option">--bdb-log-keep</code> option to the
                               <span class="command"><strong>svnadmin create</strong></span> command.  If you forget
                               to do this or change your mind at a later time, simply edit
                               the <code class="filename">DB_CONFIG</code> file found in your
                               repository's <code class="filename">db</code> directory, comment out
                               the line that contains the <code class="literal">set_flags
                                  DB_LOG_AUTOREMOVE</code> directive, and then run
                               <span class="command"><strong>svnadmin recover</strong></span> on your repository to
                               force the configuration changes to take effect.  See <a class="xref" href="svn.reposadmin.html#svn.reposadmin.create.bdb" title="5.3.3.&nbsp;Berkeley DB &#37197;&#32622;">&#31532;&nbsp;5.3.3&nbsp;&#33410; &#8220;Berkeley DB &#37197;&#32622;&#8221;</a> for more information about
                               database configuration.
                  </p>
                  <p>Without some sort of automatic logfile removal in
                               place, logfiles will accumulate as you use your repository.
                               This is actually somewhat of a feature of the database
                               system&#8212;you should be able to recreate your entire
                               database using nothing but the logfiles, so these files can
                               be useful for catastrophic database recovery.  But
                               typically, you'll want to archive the logfiles that are no
                               longer in use by Berkeley DB, and then remove them from disk
                               to conserve space.  Use the <span class="command"><strong>svnadmin
                                     list-unused-dblogs</strong></span> command to list the unused
                               logfiles:
                  </p><pre class="screen">
$ svnadmin list-unused-dblogs /var/svn/repos
/var/svn/repos/log.0000000031
/var/svn/repos/log.0000000032
/var/svn/repos/log.0000000033
&#8230;
$ rm `svnadmin list-unused-dblogs /var/svn/repos`
## disk space reclaimed!
</pre><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
                     <table border="0" summary="Warning">
                        <tr>
                           <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                           <th align="left">&#35686;&#21578;</th>
                        </tr>
                        <tr>
                           <td align="left" valign="top">
                              <p>BDB-backed repositories whose logfiles are used as
                                             part of a backup or disaster recovery plan should
                                             <span class="emphasis"><em>not</em></span> make use of the logfile
                                             autoremoval feature.  Reconstruction of a repository's
                                             data from logfiles can only be accomplished only when
                                             <span class="emphasis"><em>all</em></span> the logfiles are available.  If
                                             some of the logfiles are removed from disk before the
                                             backup system has a chance to copy them elsewhere, the
                                             incomplete set of backed-up logfiles is essentially
                                             useless.
                              </p>
                           </td>
                        </tr>
                     </table>
                  </div>
               </div>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.recovery"></a>5.4.4.&nbsp;Berkeley DB &#24674;&#22797;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>As mentioned in <a class="xref" href="svn.reposadmin.html#svn.reposadmin.basics.backends.bdb" title="5.2.3.1.&nbsp;Berkeley DB">&#31532;&nbsp;5.2.3.1&nbsp;&#33410; &#8220;Berkeley DB&#8221;</a>, a Berkeley DB
                          repository can sometimes be left in a frozen state if not closed
                          properly.  When this happens, an administrator needs to rewind
                          the database back into a consistent state.  This is unique to
                          BDB-backed repositories, though&#8212;if you are using
                          FSFS-backed ones instead, this won't apply to you.  And for
                          those of you using Subversion 1.4 with Berkeley DB 4.4 or
                          later, you should find that Subversion has become much more
                          resilient in these types of situations.  Still, wedged
                          Berkeley DB repositories do occur, and an administrator needs
                          to know how to safely deal with this circumstance.
               </p>
               <p>To protect the data in your repository, Berkeley
                          DB uses a locking mechanism.  This mechanism ensures that
                          portions of the database are not simultaneously modified by
                          multiple database accessors, and that each process sees the
                          data in the correct state when that data is being read from
                          the database.  When a process needs to change something in the
                          database, it first checks for the existence of a lock on the
                          target data.  If the data is not locked, the process locks the
                          data, makes the change it wants to make, and then unlocks the
                          data.  Other processes are forced to wait until that lock is
                          removed before they are permitted to continue accessing that
                          section of the database.  (This has nothing to do with the
                          locks that you, as a user, can apply to versioned files within
                          the repository; we try to clear up the confusion caused by
                          this terminology collision in the sidebar <a class="xref" href="svn.advanced.html#svn.advanced.locking.meanings" title="&#8220;&#38145;&#23450;&#8221;&#30340;&#19977;&#31181;&#21547;&#20041;">&#8220;<span class="quote">&#38145;&#23450;</span>&#8221;&#30340;&#19977;&#31181;&#21547;&#20041;</a>.)
               </p>
               <p>&#22312;&#25805;&#20316;Subversion&#29256;&#26412;&#24211;&#30340;&#36807;&#31243;&#20013;&#65292;&#33268;&#21629;&#38169;&#35823;(&#22914;&#20869;&#23384;&#25110;&#30828;&#30424;&#31354;&#38388;&#19981;&#36275;)&#25110;&#24322;&#24120;&#20013;&#26029;&#21487;&#33021;&#20250;&#23548;&#33268;&#26576;&#20010;&#36827;&#31243;&#27809;&#33021;&#21450;&#26102;&#23558;&#38145;&#35299;&#38500;&#12290;&#32467;&#26524;&#23601;&#26159;&#21518;&#31471;&#30340;&#25968;&#25454;&#24211;&#31995;&#32479;&#34987;&#8220;<span class="quote">&#26964;&#20303;</span>&#8221;&#20102;&#12290;&#19968;&#26086;&#21457;&#29983;&#36825;&#31181;&#24773;&#20917;&#65292;&#20219;&#20309;&#35775;&#38382;&#29256;&#26412;&#24211;&#30340;&#36827;&#31243;&#37117;&#20250;&#25346;&#36215;(&#27599;&#20010;&#35775;&#38382;&#36827;&#31243;&#37117;&#22312;&#31561;&#24453;&#38145;&#34987;&#35299;&#38500;&#65292;&#20294;&#26159;&#38145;&#24050;&#32463;&#26080;&#27861;&#35299;&#38500;&#20102;)&#12290;
               </p>
               <p>&#22914;&#26524;&#20320;&#30340;&#29256;&#26412;&#24211;&#20986;&#29616;&#36825;&#31181;&#24773;&#20917;&#65292;&#27809;&#20160;&#20040;&#22909;&#24778;&#24908;&#30340;&#12290;Berkeley DB&#30340;&#25991;&#20214;&#31995;&#32479;&#37319;&#29992;&#20102;&#25968;&#25454;&#24211;&#20107;&#21153;&#12289;&#26816;&#26597;&#28857;&#20197;&#21450;&#39044;&#20889;&#20837;&#26085;&#24535;&#31561;&#25216;&#26415;&#26469;&#30830;&#20445;&#21482;&#26377;&#28798;&#38590;&#24615;&#30340;&#20107;&#20214;<sup>[<a name="d0e10262" href="#ftn.d0e10262" class="footnote">34</a>]</sup>&#25165;&#33021;&#27704;&#20037;&#24615;&#30340;&#30772;&#22351;&#25968;&#25454;&#24211;&#29615;&#22659;&#12290;&#25152;&#20197;&#34429;&#28982;&#19968;&#20010;&#36807;&#20110;&#31283;&#37325;&#30340;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#36890;&#24120;&#37117;&#20250;&#25353;&#29031;&#26576;&#31181;&#26041;&#26696;&#36827;&#34892;&#22823;&#37327;&#30340;&#29256;&#26412;&#24211;&#31163;&#32447;&#22791;&#20221;&#65292;&#19981;&#36807;&#19981;&#35201;&#24613;&#30528;&#36890;&#30693;&#20320;&#30340;&#31649;&#29702;&#21592;&#36827;&#34892;&#24674;&#22797;&#12290;
               </p>
               <p>&#28982;&#21518;&#65292;&#20351;&#29992;&#19979;&#38754;&#30340;&#26041;&#27861;&#35797;&#30528;&#8220;<span class="quote">&#24674;&#22797;</span>&#8221;&#20320;&#30340;&#29256;&#26412;&#24211;&#65306;
               </p>
               <div class="orderedlist">
                  <ol type="1">
                     <li>
                        <p>Make sure no processes are accessing (or
                                       attempting to access) the repository.  For networked
                                       repositories, this also means shutting down the Apache HTTP
                                       Server or svnserve daemon.
                        </p>
                     </li>
                     <li>
                        <p>&#25104;&#20026;&#29256;&#26412;&#24211;&#30340;&#25317;&#26377;&#32773;&#21644;&#31649;&#29702;&#21592;&#12290;&#36825;&#19968;&#28857;&#24456;&#37325;&#35201;&#65292;&#22914;&#26524;&#20197;&#20854;&#23427;&#29992;&#25143;&#30340;&#36523;&#20221;&#24674;&#22797;&#29256;&#26412;&#24211;&#65292;&#21487;&#33021;&#20250;&#25913;&#21464;&#29256;&#26412;&#24211;&#25991;&#20214;&#30340;&#35775;&#38382;&#26435;&#38480;&#65292;&#23548;&#33268;&#22312;&#29256;&#26412;&#24211;&#8220;<span class="quote">&#24674;&#22797;</span>&#8221;&#21518;&#20381;&#26087;&#26080;&#27861;&#35775;&#38382;&#12290;
                        </p>
                     </li>
                     <li>
                        <p>Run the command <strong class="userinput"><code>svnadmin recover
                                             /var/svn/repos</code></strong>.  You should see output such as
                                       this:
                        </p><pre class="screen">
Repository lock acquired.
Please wait; recovering the repository may take some time...

Recovery completed.
The latest repos revision is 19.
</pre><p>&#27492;&#21629;&#20196;&#21487;&#33021;&#38656;&#35201;&#25968;&#20998;&#38047;&#25165;&#33021;&#23436;&#25104;&#12290;</p>
                     </li>
                     <li>
                        <p>&#37325;&#26032;&#21551;&#21160;&#26381;&#21153;&#36827;&#31243;&#12290;</p>
                     </li>
                  </ol>
               </div>
               <p>This procedure fixes almost every case of repository
                          wedging.  Make sure that you run this command as the user that
                          owns and manages the database, not just as
                          <code class="literal">root</code>.  Part of the recovery process might
                          involve re-creating from scratch various database files (shared
                          memory regions, e.g.).  Recovering as
                          <code class="literal">root</code> will create those files such that they
                          are owned by <code class="literal">root</code>, which means that even
                          after you restore connectivity to your repository, regular
                          users will be unable to access it.
               </p>
               <p>&#22914;&#26524;&#22240;&#20026;&#26576;&#20123;&#21407;&#22240;&#65292;&#19978;&#38754;&#30340;&#26041;&#27861;&#27809;&#33021;&#25104;&#21151;&#30340;&#24674;&#22797;&#29256;&#26412;&#24211;&#65292;&#37027;&#20040;&#20320;&#21487;&#20197;&#20570;&#20004;&#20214;&#20107;&#12290;&#39318;&#20808;&#65292;&#23558;&#30772;&#25439;&#30340;&#29256;&#26412;&#24211;&#20445;&#23384;&#21040;&#20854;&#23427;&#22320;&#26041;&#65292;&#28982;&#21518;&#20174;&#26368;&#26032;&#30340;&#22791;&#20221;&#20013;&#24674;&#22797;&#29256;&#26412;&#24211;&#12290;&#28982;&#21518;&#65292;&#21457;&#36865;&#19968;&#23553;&#37038;&#20214;&#21040;Subversion&#29992;&#25143;&#21015;&#34920;(&#22320;&#22336;&#26159;&#65306;<code class="email">&lt;<a class="email" href="mailto:users@subversion.tigris.org">users@subversion.tigris.org</a>&gt;</code>)&#65292;&#20889;&#28165;&#20320;&#25152;&#36935;&#21040;&#30340;&#38382;&#39064;&#12290;&#23545;&#20110;Subversion&#30340;&#24320;&#21457;&#32773;&#26469;&#35828;&#65292;&#25968;&#25454;&#23433;&#20840;&#26159;&#26368;&#37325;&#35201;&#30340;&#38382;&#39064;&#12290;
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.migrate"></a>5.4.5.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Subversion&#25991;&#20214;&#31995;&#32479;&#23558;&#25968;&#25454;&#20445;&#23384;&#22312;&#35768;&#22810;&#25968;&#25454;&#24211;&#34920;&#20013;&#65292;&#32780;&#36825;&#20123;&#34920;&#30340;&#32467;&#26500;&#21482;&#26377;Subversion&#24320;&#21457;&#32773;&#20204;&#25165;&#20102;&#35299;(&#20063;&#21482;&#26377;&#20182;&#20204;&#25165;&#24863;&#20852;&#36259;)&#65292;&#19981;&#36807;&#65292;&#26377;&#20123;&#26102;&#20505;&#25105;&#20204;&#20250;&#24819;&#21040;&#25226;&#25152;&#26377;&#25110;&#19968;&#37096;&#20998;&#25968;&#25454;&#36716;&#31227;&#21040;&#21478;&#19968;&#20010;&#29256;&#26412;&#24211;&#12290;</p>
               <p>Subversion provides such functionality by way of
                          <em class="firstterm">repository dump streams</em>.  A repository
                          dump stream (often referred to as a &#8220;<span class="quote">dump file</span>&#8221;
                          when stored as a file on disk) is a portable, flat file format
                          that describes the various revisions in your
                          repository&#8212;what was changed, by whom, when, and so on.
                          This dump stream is the primary mechanism used to marshal
                          versioned history&#8212;in whole or in part, with or without
                          modification&#8212;between repositories.  And Subversion
                          provides the tools necessary for creating and loading these
                          dump streams: the <span class="command"><strong>svnadmin dump</strong></span> and
                          <span class="command"><strong>svnadmin load</strong></span> subcommands,
                          respectively.
               </p>
               <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Warning">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                        <th align="left">&#35686;&#21578;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>While the Subversion repository dump format contains
                                        human-readable portions and a familiar structure (it
                                        resembles an RFC 822 format, the same type of format used
                                        for most email), it is <span class="emphasis"><em>not</em></span> a plain-text
                                        file format.  It is a binary file format, highly sensitive
                                        to meddling.  For example, many text editors will corrupt
                                        the file by automatically converting line endings.
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>There are many reasons for dumping and loading Subversion
                          repository data.  Early in Subversion's life, the most common
                          reason was due to the evolution of Subversion itself.  As
                          Subversion matured, there were times when changes made to the
                          backend database schema caused compatibility issues with
                          previous versions of the repository, so users had to dump
                          their repository data using the previous version of
                          Subversion and load it into a freshly created repository with
                          the new version of Subversion.  Now, these types of schema
                          changes haven't occurred since Subversion's 1.0 release, and
                          the Subversion developers promise not to force users to dump
                          and load their repositories when upgrading between minor
                          versions (such as from 1.3 to 1.4) of Subversion.  But there
                          are still other reasons for dumping and loading, including
                          re-deploying a Berkeley DB repository on a new OS or CPU
                          architecture, switching between the Berkeley DB and FSFS
                          backends, or (as we'll cover later in this chapter in <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.filtering" title="5.4.6.&nbsp;&#36807;&#28388;&#29256;&#26412;&#24211;&#21382;&#21490;">&#31532;&nbsp;5.4.6&nbsp;&#33410; &#8220;&#36807;&#28388;&#29256;&#26412;&#24211;&#21382;&#21490;&#8221;</a>) purging versioned
                          data from repository history.
               </p>
               <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Note">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="images/note.png"></td>
                        <th align="left">&#27880;&#24847;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>The Subversion repository dump format describes
                                        versioned repository changes only.  It will not carry any
                                        information about uncommitted transactions, user locks on
                                        filesystem paths, repository or server configuration
                                        customizations (including hook scripts), and so on.
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>&#26080;&#35770;&#20320;&#26159;&#20160;&#20040;&#21407;&#22240;&#38656;&#35201;&#31227;&#26893;&#29256;&#26412;&#24211;&#21382;&#21490;&#65292;&#37117;&#21487;&#20197;&#30452;&#25509;&#20351;&#29992;<span class="command"><strong>svnadmin dump</strong></span>&#21644;<span class="command"><strong>svnadmin load</strong></span>&#12290;<span class="command"><strong>svnadmin dump</strong></span>&#21629;&#20196;&#20250;&#23558;&#29256;&#26412;&#24211;&#20013;&#30340;&#20462;&#35746;&#29256;&#26412;&#25968;&#25454;&#25353;&#29031;&#29305;&#23450;&#30340;&#26684;&#24335;&#36755;&#20986;&#21040;&#36716;&#20648;&#27969;&#20013;&#65292;&#36716;&#20648;&#25968;&#25454;&#20250;&#36755;&#20986;&#21040;&#26631;&#20934;&#36755;&#20986;&#65292;&#32780;&#25552;&#31034;&#20449;&#24687;&#20250;&#36755;&#20986;&#21040;&#26631;&#20934;&#38169;&#35823;&#12290;&#36825;&#23601;&#26159;&#35828;&#65292;&#21487;&#20197;&#23558;&#36716;&#20648;&#25968;&#25454;&#23384;&#20648;&#21040;&#25991;&#20214;&#20013;&#65292;&#32780;&#21516;&#26102;&#22312;&#32456;&#31471;&#31383;&#21475;&#20013;&#30417;&#35270;&#36816;&#34892;&#29366;&#24577;&#65292;&#20363;&#22914;&#65306;
               </p><pre class="screen">
$ svnlook youngest myrepos
26
$ svnadmin dump myrepos &gt; dumpfile
* Dumped revision 0.
* Dumped revision 1.
* Dumped revision 2.
&#8230;
* Dumped revision 25.
* Dumped revision 26.
</pre><p>At the end of the process, you will have a single file
                          (<code class="filename">dumpfile</code> in the previous example) that
                          contains all the data stored in your repository in the
                          requested range of revisions.  Note that <span class="command"><strong>svnadmin
                                dump</strong></span> is reading revision trees from the repository
                          just like any other &#8220;<span class="quote">reader</span>&#8221; process would
                          (e.g., <span class="command"><strong>svn checkout</strong></span>), so it's safe
                          to run this command at any time.
               </p>
               <p>&#21478;&#19968;&#20010;&#21629;&#20196;&#65292;<span class="command"><strong>svnadmin load</strong></span>&#65292;&#20174;&#26631;&#20934;&#36755;&#20837;&#27969;&#20013;&#35835;&#21462;Subversion&#36716;&#20648;&#25968;&#25454;&#65292;&#24182;&#19988;&#39640;&#25928;&#30340;&#23558;&#25968;&#25454;&#36716;&#36733;&#21040;&#30446;&#26631;&#29256;&#26412;&#24211;&#20013;&#12290;&#36825;&#20010;&#21629;&#20196;&#30340;&#25552;&#31034;&#20449;&#24687;&#36755;&#20986;&#21040;&#26631;&#20934;&#36755;&#20986;&#27969;&#20013;&#65306;
               </p><pre class="screen">
$ svnadmin load newrepos &lt; dumpfile
&lt;&lt;&lt; Started new txn, based on original revision 1
     * adding path : A ... done.
     * adding path : A/B ... done.
     &#8230;
------- Committed new rev 1 (loaded from original rev 1) &gt;&gt;&gt;

&lt;&lt;&lt; Started new txn, based on original revision 2
     * editing path : A/mu ... done.
     * editing path : A/D/G/rho ... done.

------- Committed new rev 2 (loaded from original rev 2) &gt;&gt;&gt;

&#8230;

&lt;&lt;&lt; Started new txn, based on original revision 25
     * editing path : A/D/gamma ... done.

------- Committed new rev 25 (loaded from original rev 25) &gt;&gt;&gt;

&lt;&lt;&lt; Started new txn, based on original revision 26
     * adding path : A/Z/zeta ... done.
     * editing path : A/mu ... done.

------- Committed new rev 26 (loaded from original rev 26) &gt;&gt;&gt;

</pre><p>load&#21629;&#20196;&#30340;&#32467;&#26524;&#23601;&#26159;&#28155;&#21152;&#19968;&#20123;&#26032;&#30340;&#20462;&#35746;&#29256;&#26412;&#8212;&#19982;&#20351;&#29992;&#26222;&#36890;Subversion&#23458;&#25143;&#31471;&#30452;&#25509;&#25552;&#20132;&#21040;&#29256;&#26412;&#24211;&#30456;&#21516;&#12290;&#27491;&#20687;&#19968;&#27425;&#31616;&#21333;&#30340;&#25552;&#20132;&#65292;&#20320;&#20063;&#21487;&#20197;&#20351;&#29992;&#38057;&#23376;&#33050;&#26412;&#22312;&#27599;&#27425;load&#30340;&#24320;&#22987;&#21644;&#32467;&#26463;&#25191;&#34892;&#19968;&#20123;&#25805;&#20316;&#12290;&#36890;&#36807;&#20256;&#36882;<code class="option">--use-pre-commit-hook</code>&#21644;<code class="option">--use-post-commit-hook</code>&#36873;&#39033;&#32473;<span class="command"><strong>svnadmin load</strong></span>&#65292;&#20320;&#21487;&#20197;&#21578;&#35785;Subversion&#30340;&#23545;&#27599;&#19968;&#20010;&#21152;&#36733;&#20462;&#35746;&#29256;&#26412;&#25191;&#34892;pre-commit&#21644;post-commit&#38057;&#23376;&#33050;&#26412;&#65292;&#21487;&#20197;&#21033;&#29992;&#36825;&#20010;&#36873;&#39033;&#30830;&#20445;&#36825;&#31181;&#25552;&#20132;&#20063;&#33021;&#36890;&#36807;&#19968;&#33324;&#25552;&#20132;&#30340;&#26816;&#39564;&#12290;&#24403;&#28982;&#65292;&#20320;&#35201;&#23567;&#24515;&#20351;&#29992;&#36825;&#20010;&#36873;&#39033;&#65292;&#20320;&#19968;&#23450;&#19981;&#24819;&#25509;&#21463;&#19968;&#22823;&#22534;&#25552;&#20132;&#37038;&#20214;&#12290;&#20320;&#21487;&#20197;&#26597;&#30475;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.create.hooks" title="5.3.2.&nbsp;&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;">&#31532;&nbsp;5.3.2&nbsp;&#33410; &#8220;&#23454;&#29616;&#29256;&#26412;&#24211;&#38057;&#23376;&#8221;</a>&#26469;&#24471;&#21040;&#26356;&#22810;&#30456;&#20851;&#20449;&#24687;&#12290;
               </p>
               <p>Note that because <span class="command"><strong>svnadmin</strong></span> uses
                          standard input and output streams for the repository dump and
                          load processes, people who are feeling especially saucy can try
                          things such as this (perhaps even using different versions of
                          <span class="command"><strong>svnadmin</strong></span> on each side of the pipe):
               </p><pre class="screen">
$ svnadmin create newrepos
$ svnadmin dump oldrepos | svnadmin load newrepos
</pre><p>By default, the dump file will be quite large&#8212;much
                          larger than the repository itself.  That's because by default
                          every version of every file is expressed as a full text in the
                          dump file.  This is the fastest and simplest behavior, and
                          it's nice if you're piping the dump data directly into some other
                          process (such as a compression program, filtering program, or
                          loading process).  But if you're creating a dump file
                          for longer-term storage, you'll likely want to save disk space
                          by using the <code class="option">--deltas</code> option.  With this
                          option, successive revisions of files will be output as
                          compressed, binary differences&#8212;just as file revisions
                          are stored in a repository.  This option is slower, but it
                          results in a dump file much closer in size to the original
                          repository.
               </p>
               <p>&#20043;&#21069;&#25105;&#20204;&#25552;&#21040;<span class="command"><strong>svnadmin dump</strong></span>&#36755;&#20986;&#25351;&#23450;&#33539;&#22260;&#20869;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#20351;&#29992;<code class="option">--revision </code> (<code class="option">-r</code>) &#36873;&#39033;&#21487;&#20197;&#25351;&#23450;&#19968;&#20010;&#21333;&#29420;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#25110;&#32773;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#30340;&#33539;&#22260;&#12290;&#22914;&#26524;&#24573;&#30053;&#36825;&#20010;&#36873;&#39033;&#65292;&#25152;&#26377;&#29256;&#26412;&#24211;&#20013;&#30340;&#20462;&#35746;&#29256;&#26412;&#37117;&#20250;&#34987;&#36716;&#20648;&#12290;
               </p><pre class="screen">
$ svnadmin dump myrepos -r 23 &gt; rev-23.dumpfile
$ svnadmin dump myrepos -r 100:200 &gt; revs-100-200.dumpfile
</pre><p>Subversion&#22312;&#36716;&#20648;&#20462;&#35746;&#29256;&#26412;&#26102;&#65292;&#20165;&#20250;&#36755;&#20986;&#19982;&#21069;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#20043;&#38388;&#30340;&#24046;&#24322;&#65292;&#36890;&#36807;&#36825;&#20123;&#24046;&#24322;&#36275;&#20197;&#20174;&#21069;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#20013;&#37325;&#24314;&#24403;&#21069;&#30340;&#20462;&#35746;&#29256;&#26412;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#22312;&#36716;&#20648;&#25991;&#20214;&#20013;&#30340;&#27599;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#20165;&#21253;&#21547;&#36825;&#20010;&#20462;&#35746;&#29256;&#26412;&#20316;&#20986;&#30340;&#20462;&#25913;&#12290;&#36825;&#20010;&#35268;&#21017;&#30340;&#21807;&#19968;&#19968;&#20010;&#20363;&#22806;&#26159;&#24403;&#21069;<span class="command"><strong>svnadmin dump</strong></span>&#36716;&#20648;&#30340;&#31532;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#12290;
               </p>
               <p>By default, Subversion will not express the first dumped
                          revision as merely differences to be applied to the previous
                          revision.  For one thing, there is no previous revision in the
                          dump file!  And second, Subversion cannot know the state of
                          the repository into which the dump data will be loaded (if it
                          ever is).  To ensure that the output of each
                          execution of <span class="command"><strong>svnadmin dump</strong></span> is
                          self-sufficient, the first dumped revision is, by default, a
                          full representation of every directory, file, and property in
                          that revision of the repository.
               </p>
               <p>&#19981;&#36807;&#65292;&#36825;&#20123;&#37117;&#26159;&#21487;&#20197;&#25913;&#21464;&#30340;&#12290;&#22914;&#26524;&#36716;&#20648;&#26102;&#35774;&#32622;&#20102;<code class="option">--incremental</code>&#36873;&#39033;&#65292;<span class="command"><strong>svnadmin</strong></span>&#20250;&#27604;&#36739;&#31532;&#19968;&#20010;&#36716;&#20648;&#30340;&#20462;&#35746;&#29256;&#26412;&#21644;&#29256;&#26412;&#24211;&#20013;&#21069;&#19968;&#20010;&#20462;&#35746;&#29256;&#26412;&#65292;&#23601;&#20687;&#23545;&#24453;&#20854;&#23427;&#36716;&#20648;&#30340;&#20462;&#35746;&#29256;&#26412;&#19968;&#26679;&#12290;&#36716;&#20648;&#26102;&#20063;&#26159;&#19968;&#26679;&#65292;&#36716;&#20648;&#25991;&#20214;&#20013;&#23558;&#20165;&#21253;&#21547;&#31532;&#19968;&#20010;&#36716;&#20648;&#30340;&#20462;&#35746;&#29256;&#26412;&#30340;&#22686;&#37327;&#20449;&#24687;&#12290;&#36825;&#26679;&#30340;&#22909;&#22788;&#26159;&#65292;&#21487;&#20197;&#21019;&#24314;&#20960;&#20010;&#36830;&#32493;&#30340;&#23567;&#20307;&#31215;&#30340;&#36716;&#20648;&#25991;&#20214;&#20195;&#26367;&#19968;&#20010;&#22823;&#25991;&#20214;&#65292;&#27604;&#22914;&#65306;
               </p><pre class="screen">
$ svnadmin dump myrepos -r 0:1000 &gt; dumpfile1
$ svnadmin dump myrepos -r 1001:2000 --incremental &gt; dumpfile2
$ svnadmin dump myrepos -r 2001:3000 --incremental &gt; dumpfile3
</pre><p>&#36825;&#20123;&#36716;&#20648;&#25991;&#20214;&#21487;&#20197;&#20351;&#29992;&#19979;&#21015;&#21629;&#20196;&#35013;&#36733;&#21040;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#24211;&#20013;&#65306;</p><pre class="screen">
$ svnadmin load newrepos &lt; dumpfile1
$ svnadmin load newrepos &lt; dumpfile2
$ svnadmin load newrepos &lt; dumpfile3
</pre><p>&#21478;&#19968;&#20010;&#26377;&#20851;&#30340;&#25216;&#24039;&#26159;&#65292;&#21487;&#20197;&#20351;&#29992;<code class="option">--incremental</code>&#36873;&#39033;&#22312;&#19968;&#20010;&#36716;&#20648;&#25991;&#20214;&#20013;&#22686;&#21152;&#26032;&#30340;&#36716;&#20648;&#20462;&#35746;&#29256;&#26412;&#12290;&#20030;&#20010;&#20363;&#23376;&#65292;&#21487;&#20197;&#20351;&#29992;<code class="literal">post-commit</code>&#38057;&#23376;&#22312;&#27599;&#27425;&#26032;&#30340;&#20462;&#35746;&#29256;&#26412;&#25552;&#20132;&#21518;&#23558;&#20854;&#36716;&#20648;&#21040;&#25991;&#20214;&#20013;&#12290;&#25110;&#32773;&#65292;&#21487;&#20197;&#32534;&#20889;&#19968;&#20010;&#33050;&#26412;&#65292;&#22312;&#27599;&#22825;&#22812;&#37324;&#23558;&#25152;&#26377;&#26032;&#22686;&#30340;&#20462;&#35746;&#29256;&#26412;&#36716;&#20648;&#21040;&#25991;&#20214;&#20013;&#12290;&#36825;&#26679;&#65292;<span class="command"><strong>svnadmin dump</strong></span>&#21629;&#20196;&#23601;&#21464;&#25104;&#20102;&#24456;&#22909;&#30340;&#29256;&#26412;&#24211;&#22791;&#20221;&#24037;&#20855;&#65292;&#20197;&#38450;&#19975;&#19968;&#20986;&#29616;&#31995;&#32479;&#23849;&#28291;&#25110;&#20854;&#23427;&#28798;&#38590;&#24615;&#20107;&#20214;&#12290;
               </p>
               <p>The dump format can also be used to merge the contents of
                          several different repositories into a single repository.  By
                          using the <code class="option">--parent-dir</code> option of
                          <span class="command"><strong>svnadmin load</strong></span>, you can specify a new
                          virtual root directory for the load process.  That means if
                          you have dump files for three repositories&#8212;say
                          <code class="filename">calc-dumpfile</code>,
                          <code class="filename">cal-dumpfile</code>, and
                          <code class="filename">ss-dumpfile</code>&#8212;you can first create a new
                          repository to hold them all:
               </p><pre class="screen">
$ svnadmin create /var/svn/projects
$
</pre><p>&#28982;&#21518;&#22312;&#29256;&#26412;&#24211;&#20013;&#21019;&#24314;&#19977;&#20010;&#30446;&#24405;&#20998;&#21035;&#20445;&#23384;&#26469;&#33258;&#19977;&#20010;&#19981;&#21516;&#29256;&#26412;&#24211;&#30340;&#25968;&#25454;&#65306;</p><pre class="screen">
$ svn mkdir -m "Initial project roots" \
      file:///var/svn/projects/calc \
      file:///var/svn/projects/calendar \
      file:///var/svn/projects/spreadsheet
Committed revision 1.
$ 
</pre><p>&#26368;&#21518;&#65292;&#23558;&#36716;&#20648;&#25991;&#20214;&#20998;&#21035;&#35013;&#36733;&#21040;&#21508;&#33258;&#30340;&#30446;&#24405;&#20013;&#65306;</p><pre class="screen">
$ svnadmin load /var/svn/projects --parent-dir calc &lt; calc-dumpfile
&#8230;
$ svnadmin load /var/svn/projects --parent-dir calendar &lt; cal-dumpfile
&#8230;
$ svnadmin load /var/svn/projects --parent-dir spreadsheet &lt; ss-dumpfile
&#8230;
$
</pre><p>&#25105;&#20204;&#20877;&#20171;&#32461;&#19968;&#19979;Subversion&#29256;&#26412;&#24211;&#36716;&#20648;&#25968;&#25454;&#30340;&#26368;&#21518;&#19968;&#31181;&#29992;&#36884;&#8212;&#8212;&#22312;&#19981;&#21516;&#30340;&#23384;&#20648;&#26426;&#21046;&#25110;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20043;&#38388;&#36716;&#25442;&#12290;&#22240;&#20026;&#36716;&#20648;&#25968;&#25454;&#30340;&#26684;&#24335;&#30340;&#22823;&#37096;&#20998;&#26159;&#21487;&#20197;&#38405;&#35835;&#30340;&#65292;&#25152;&#20197;&#20351;&#29992;&#36825;&#31181;&#26684;&#24335;&#25551;&#36848;&#21464;&#26356;&#38598;(&#27599;&#20010;&#21464;&#26356;&#38598;&#23545;&#24212;&#19968;&#20010;&#26032;&#30340;&#20462;&#35746;&#29256;&#26412;)&#20250;&#30456;&#23545;&#23481;&#26131;&#19968;&#20123;&#12290;&#20107;&#23454;&#19978;&#65292;<span class="command"><strong>cvs2svn</strong></span>&#24037;&#20855;(&#21442;&#35265; <a class="xref" href="svn.forcvs.html#svn.forcvs.convert" title="B.11.&nbsp;&#36801;&#31227; CVS &#29256;&#26412;&#24211;&#21040; Subversion">&#31532;&nbsp;B.11&nbsp;&#33410; &#8220;&#36801;&#31227; CVS &#29256;&#26412;&#24211;&#21040; Subversion&#8221;</a>)&#27491;&#26159;&#23558;CVS&#29256;&#26412;&#24211;&#30340;&#20869;&#23481;&#36716;&#25442;&#20026;&#36716;&#20648;&#25968;&#25454;&#26684;&#24335;&#65292;&#22914;&#27492;&#25165;&#33021;&#23558;CVS&#29256;&#26412;&#24211;&#30340;&#25968;&#25454;&#23548;&#20837;Subversion&#29256;&#26412;&#24211;&#20043;&#20013;&#12290;
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.filtering"></a>5.4.6.&nbsp;&#36807;&#28388;&#29256;&#26412;&#24211;&#21382;&#21490;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#22240;&#20026;Subversion&#20351;&#29992;&#24213;&#23618;&#30340;&#20108;&#36827;&#21046;&#21306;&#21035;&#21644;&#21387;&#32553;&#31639;&#27861;(&#20063;&#21487;&#20197;&#36873;&#25321;&#23436;&#20840;&#38750;&#36879;&#26126;&#25968;&#25454;&#24211;&#31995;&#32479;)&#20648;&#23384;&#21508;&#31867;&#25968;&#25454;&#65292;&#25163;&#24037;&#35843;&#25972;&#26159;&#19981;&#26126;&#26234;&#30340;&#65292;&#21363;&#20351;&#36825;&#26679;&#20570;&#24182;&#19981;&#22256;&#38590;&#65292;&#25105;&#20204;&#20063;&#19981;&#40723;&#21169;&#36825;&#26679;&#20570;&#12290;&#28982;&#32780;&#65292;&#19968;&#26086;&#20320;&#30340;&#25968;&#25454;&#23384;&#36827;&#20102;&#29256;&#26412;&#24211;&#65292;Subversion&#27809;&#26377;&#25552;&#20379;&#21024;&#38500;&#25968;&#25454;&#30340;&#31616;&#21333;&#21150;&#27861;&#12290;<sup>[<a name="d0e10493" href="#ftn.d0e10493" class="footnote">35</a>]</sup>&#20294;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#24635;&#20250;&#26377;&#20123;&#26102;&#20505;&#20320;&#38656;&#35201;&#22788;&#29702;&#29256;&#26412;&#24211;&#30340;&#21382;&#21490;&#25968;&#25454;&#12290;&#20320;&#20063;&#35768;&#24819;&#25226;&#19968;&#20010;&#19981;&#24212;&#35813;&#20986;&#29616;&#30340;&#25991;&#20214;&#20174;&#29256;&#26412;&#24211;&#20013;&#24443;&#24213;&#28165;&#38500;(&#26080;&#35770;&#20219;&#20309;&#21407;&#22240;&#19981;&#24212;&#35813;&#22312;&#37027;&#20010;&#20301;&#32622;&#20986;&#29616;)&#12290;&#25110;&#32773;&#65292;&#20320;&#26366;&#32463;&#29992;&#19968;&#20010;&#29256;&#26412;&#24211;&#31649;&#29702;&#22810;&#20010;&#24037;&#31243;&#65292;&#29616;&#22312;&#21448;&#24819;&#25226;&#23427;&#20204;&#20998;&#24320;&#12290;&#35201;&#23436;&#25104;&#36825;&#26679;&#30340;&#24037;&#20316;&#65292;&#31649;&#29702;&#21592;&#20204;&#38656;&#35201;&#26356;&#26131;&#20110;&#31649;&#29702;&#21644;&#25193;&#23637;&#30340;&#26041;&#27861;&#34920;&#31034;&#29256;&#26412;&#24211;&#20013;&#30340;&#25968;&#25454;&#65292;Subversion&#29256;&#26412;&#24211;&#36716;&#20648;&#25991;&#20214;&#26684;&#24335;&#23601;&#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#36873;&#25321;&#12290;
               </p>
               <p>&#23601;&#20687;&#25105;&#20204;&#22312;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.migrate" title="5.4.5.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;">&#31532;&nbsp;5.4.5&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;&#8221;</a>&#20013;&#35828;&#30340;&#65292;Subversion&#29256;&#26412;&#24211;&#36716;&#20648;&#25991;&#20214;&#35760;&#24405;&#20102;&#25152;&#26377;&#29256;&#26412;&#25968;&#25454;&#30340;&#21464;&#26356;&#20449;&#24687;&#65292;&#32780;&#19988;&#20197;&#26131;&#20110;&#38405;&#35835;&#30340;&#26684;&#24335;&#20445;&#23384;&#12290;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svnadmin dump</strong></span>&#21629;&#20196;&#29983;&#25104;&#36716;&#20648;&#25991;&#20214;&#65292;&#28982;&#21518;&#29992;<span class="command"><strong>svnadmin load</strong></span>&#21629;&#20196;&#29983;&#25104;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#24211;&#12290;(&#21442;&#35265; <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.migrate" title="5.4.5.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;">&#31532;&nbsp;5.4.5&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;&#8221;</a>)&#12290;&#36716;&#20648;&#25991;&#20214;&#26131;&#20110;&#38405;&#35835;&#24847;&#21619;&#30528;&#20320;&#21487;&#20197;&#26597;&#30475;&#21644;&#20462;&#25913;&#23427;&#12290;&#24403;&#28982;&#65292;&#38382;&#39064;&#26159;&#22914;&#26524;&#20320;&#26377;&#19968;&#20010;&#36816;&#34892;&#20102;&#19977;&#24180;&#30340;&#29256;&#26412;&#24211;&#65292;&#37027;&#20040;&#29983;&#25104;&#30340;&#36716;&#20648;&#25991;&#20214;&#20250;&#24456;&#24222;&#22823;&#65292;&#38405;&#35835;&#21644;&#25163;&#24037;&#20462;&#25913;&#36215;&#26469;&#37117;&#20250;&#33457;&#36153;&#24456;&#22810;&#26102;&#38388;&#12290;
               </p>
               <p>That's where <span class="command"><strong>svndumpfilter</strong></span> becomes
                          useful.  This program acts as a path-based filter for
                          repository dump streams.  Simply give it either a list of
                          paths you wish to keep or a list of paths you wish to not
                          keep, and then pipe your repository dump data through this
                          filter.  The result will be a modified stream of dump data
                          that contains only the versioned paths you (explicitly or
                          implicitly) requested.
               </p>
               <p>Let's look at a realistic example of how you might use this
                          program.  Earlier in this chapter (see <a class="xref" href="svn.reposadmin.html#svn.reposadmin.projects.chooselayout" title="5.2.1.&nbsp;&#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;">&#31532;&nbsp;5.2.1&nbsp;&#33410; &#8220;&#35268;&#21010;&#20320;&#30340;&#29256;&#26412;&#24211;&#32467;&#26500;&#8221;</a>), we discussed the
                          process of deciding how to choose a layout for the data in
                          your repositories&#8212;using one repository per project or
                          combining them, arranging stuff within your repository, and
                          so on.  But sometimes after new revisions start flying in,
                          you rethink your layout and would like to make some changes.
                          A common change is the decision to move multiple projects
                          that are sharing a single repository into separate
                          repositories for each project.
               </p>
               <p>&#20551;&#35774;&#26377;&#19968;&#20010;&#21253;&#21547;&#19977;&#20010;&#39033;&#30446;&#30340;&#29256;&#26412;&#24211;&#65306; <code class="literal">calc</code>&#65292;<code class="literal">calendar</code>&#65292;&#21644; <code class="literal">spreadsheet</code>&#12290;&#23427;&#20204;&#22312;&#29256;&#26412;&#24211;&#20013;&#30340;&#24067;&#23616;&#22914;&#19979;&#65306;
               </p><pre class="screen">
/
   calc/
      trunk/
      branches/
      tags/
   calendar/
      trunk/
      branches/
      tags/
   spreadsheet/
      trunk/
      branches/
      tags/
</pre><p>&#29616;&#22312;&#35201;&#25226;&#36825;&#19977;&#20010;&#39033;&#30446;&#36716;&#31227;&#21040;&#19977;&#20010;&#29420;&#31435;&#30340;&#29256;&#26412;&#24211;&#20013;&#12290;&#39318;&#20808;&#65292;&#36716;&#20648;&#25972;&#20010;&#29256;&#26412;&#24211;&#65306;</p><pre class="screen">
$ svnadmin dump /var/svn/repos &gt; repos-dumpfile
* Dumped revision 0.
* Dumped revision 1.
* Dumped revision 2.
* Dumped revision 3.
&#8230;
$
</pre><p>&#28982;&#21518;&#65292;&#23558;&#36716;&#20648;&#25991;&#20214;&#19977;&#27425;&#36865;&#20837;&#36807;&#28388;&#22120;&#65292;&#27599;&#27425;&#20165;&#20445;&#30041;&#19968;&#20010;&#39030;&#32423;&#30446;&#24405;&#65292;&#23601;&#21487;&#20197;&#24471;&#21040;&#19977;&#20010;&#36716;&#20648;&#25991;&#20214;&#65306;</p><pre class="screen">
$ svndumpfilter include calc &lt; repos-dumpfile &gt; calc-dumpfile
&#8230;
$ svndumpfilter include calendar &lt; repos-dumpfile &gt; cal-dumpfile
&#8230;
$ svndumpfilter include spreadsheet &lt; repos-dumpfile &gt; ss-dumpfile
&#8230;
$
</pre><p>At this point, you have to make a decision.  Each of your
                          dump files will create a valid repository, but will preserve
                          the paths exactly as they were in the original repository.
                          This means that even though you would have a repository solely
                          for your <code class="literal">calc</code> project, that repository
                          would still have a top-level directory named
                          <code class="filename">calc</code>.  If you want your
                          <code class="filename">trunk</code>, <code class="filename">tags</code>, and
                          <code class="filename">branches</code> directories to live in the root
                          of your repository, you might wish to edit your dump files,
                          tweaking the <code class="literal">Node-path</code> and
                          <code class="literal">Node-copyfrom-path</code> headers so that they no
                          longer have that first <code class="filename">calc/</code> path
                          component.  Also, you'll want to remove the section of dump
                          data that creates the <code class="filename">calc</code> directory.  It
                          will look something like the following:
               </p><pre class="screen">
Node-path: calc
Node-action: add
Node-kind: dir
Content-length: 0
  
</pre><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Warning">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                        <th align="left">&#35686;&#21578;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>If you do plan on manually editing the dump file to
                                        remove a top-level directory, make sure your editor is
                                        not set to automatically convert end-of-line characters to
                                        the native format (e.g., <code class="literal">\r\n</code> to
                                        <code class="literal">\n</code>), as the content will then not agree
                                        with the metadata.  This will render the dump file
                                        useless.
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>All that remains now is to create your three new
                          repositories, and load each dump file into the right
                          repository, ignoring the UUID found in the dump stream:
               </p><pre class="screen">
$ svnadmin create calc
$ svnadmin load --ignore-uuid calc &lt; calc-dumpfile
&lt;&lt;&lt; Started new transaction, based on original revision 1
     * adding path : Makefile ... done.
     * adding path : button.c ... done.
&#8230;
$ svnadmin create calendar
$ svnadmin load --ignore-uuid calendar &lt; cal-dumpfile
&lt;&lt;&lt; Started new transaction, based on original revision 1
     * adding path : Makefile ... done.
     * adding path : cal.c ... done.
&#8230;
$ svnadmin create spreadsheet
$ svnadmin load --ignore-uuid spreadsheet &lt; ss-dumpfile
&lt;&lt;&lt; Started new transaction, based on original revision 1
     * adding path : Makefile ... done.
     * adding path : ss.c ... done.
&#8230;
$
</pre><p><span class="command"><strong>svndumpfilter</strong></span>&#30340;&#20004;&#20010;&#23376;&#21629;&#20196;&#37117;&#21487;&#20197;&#36890;&#36807;&#36873;&#39033;&#35774;&#23450;&#22914;&#20309;&#22788;&#29702;&#8220;<span class="quote">&#31354;</span>&#8221;&#20462;&#35746;&#29256;&#26412;&#12290;&#22914;&#26524;&#26576;&#20010;&#25351;&#23450;&#30340;&#20462;&#35746;&#29256;&#26412;&#20165;&#21253;&#21547;&#36335;&#24452;&#30340;&#26356;&#25913;&#65292;&#36807;&#28388;&#22120;&#23601;&#20250;&#23558;&#23427;&#21024;&#38500;&#65292;&#22240;&#20026;&#24403;&#21069;&#20026;&#31354;&#30340;&#20462;&#35746;&#29256;&#26412;&#36890;&#24120;&#26159;&#26080;&#29992;&#30340;&#29978;&#33267;&#26159;&#35753;&#20154;&#35752;&#21388;&#30340;&#12290;&#20026;&#20102;&#35753;&#29992;&#25143;&#26377;&#36873;&#25321;&#30340;&#22788;&#29702;&#36825;&#20123;&#20462;&#35746;&#29256;&#26412;&#65292;<span class="command"><strong>svndumpfilter</strong></span>&#25552;&#20379;&#20102;&#20197;&#19979;&#21629;&#20196;&#34892;&#36873;&#39033;&#65306;
               </p>
               <div class="variablelist">
                  <dl>
                     <dt><span class="term"><code class="option">--drop-empty-revs</code></span></dt>
                     <dd>
                        <p>&#19981;&#29983;&#25104;&#20219;&#20309;&#31354;&#20462;&#35746;&#29256;&#26412;&#65292;&#24573;&#30053;&#23427;&#20204;&#12290;</p>
                     </dd>
                     <dt><span class="term"><code class="option">--renumber-revs</code></span></dt>
                     <dd>
                        <p>&#22914;&#26524;&#31354;&#20462;&#35746;&#29256;&#26412;&#34987;&#21076;&#38500;(&#36890;&#36807;&#20351;&#29992;<code class="option">--drop-empty-revs</code>&#36873;&#39033;)&#65292;&#20381;&#27425;&#20462;&#25913;&#20854;&#23427;&#20462;&#35746;&#29256;&#26412;&#30340;&#32534;&#21495;&#65292;&#30830;&#20445;&#32534;&#21495;&#24207;&#21015;&#26159;&#36830;&#32493;&#30340;&#12290;
                        </p>
                     </dd>
                     <dt><span class="term"><code class="option">--preserve-revprops</code></span></dt>
                     <dd>
                        <p>If empty revisions are not dropped, preserve the
                                         revision properties (log message, author, date, custom
                                         properties, etc.) for those empty revisions.
                                         Otherwise, empty revisions will contain only the
                                         original datestamp, and a generated log message that
                                         indicates that this revision was emptied by
                                         <span class="command"><strong>svndumpfilter</strong></span>.
                        </p>
                     </dd>
                  </dl>
               </div>
               <p>&#23613;&#31649;<span class="command"><strong>svndumpfilter</strong></span>&#21313;&#20998;&#26377;&#29992;&#65292;&#33021;&#33410;&#30465;&#22823;&#37327;&#30340;&#26102;&#38388;&#65292;&#20294;&#23427;&#21364;&#26159;&#25226;&#19981;&#25240;&#19981;&#25187;&#30340;&#21452;&#20995;&#21073;&#12290;&#39318;&#20808;&#65292;&#36825;&#20010;&#24037;&#20855;&#23545;&#36335;&#24452;&#35821;&#20041;&#26497;&#20026;&#25935;&#24863;&#12290;&#20180;&#32454;&#26816;&#26597;&#36716;&#20648;&#25991;&#20214;&#20013;&#30340;&#36335;&#24452;&#26159;&#19981;&#26159;&#20197;&#26012;&#32447;&#24320;&#22836;&#12290;&#20063;&#35768;<code class="literal">Node-path</code>&#21644;<code class="literal">Node-copyfrom-path</code>&#36825;&#20004;&#20010;&#22836;&#21442;&#25968;&#23545;&#20320;&#26377;&#20123;&#24110;&#21161;&#12290;
               </p><pre class="screen">
&#8230;
Node-path: spreadsheet/Makefile
&#8230;
</pre><p>If the paths have leading slashes, you should
                          include leading slashes in the paths you pass to
                          <span class="command"><strong>svndumpfilter include</strong></span> and
                          <span class="command"><strong>svndumpfilter exclude</strong></span> (and if they don't,
                          you shouldn't).  Further, if your dump file has an inconsistent
                          usage of leading slashes for some reason,
                          <sup>[<a name="d0e10642" href="#ftn.d0e10642" class="footnote">36</a>]</sup>
                          you should probably normalize those paths so that they all
                          have, or all lack, leading slashes.
               </p>
               <p>Also, copied paths can give you some trouble.
                          Subversion supports copy operations in the repository, where
                          a new path is created by copying some already existing path.
                          It is possible that at some point in the lifetime of your
                          repository, you might have copied a file or directory from
                          some location that <span class="command"><strong>svndumpfilter</strong></span> is
                          excluding, to a location that it is including.  To
                          make the dump data self-sufficient,
                          <span class="command"><strong>svndumpfilter</strong></span> needs to still show the
                          addition of the new path&#8212;including the contents of any
                          files created by the copy&#8212;and not represent that
                          addition as a copy from a source that won't exist in your
                          filtered dump data stream.  But because the Subversion
                          repository dump format shows only what was changed in each
                          revision, the contents of the copy source might not be
                          readily available.  If you suspect that you have any copies
                          of this sort in your repository, you might want to rethink
                          your set of included/excluded paths, perhaps including the
                          paths that served as sources of your troublesome copy
                          operations, too.
               </p>
               <p>Finally, <span class="command"><strong>svndumpfilter</strong></span> takes path
                          filtering quite literally.  If you are trying to copy the
                          history of a project rooted at
                          <code class="filename">trunk/my-project</code> and move it into a
                          repository of its own, you would, of course, use the
                          <span class="command"><strong>svndumpfilter include</strong></span> command to keep all
                          the changes in and under
                          <code class="filename">trunk/my-project</code>.  But the resultant
                          dump file makes no assumptions about the repository into
                          which you plan to load this data.  Specifically, the dump
                          data might begin with the revision that added the
                          <code class="filename">trunk/my-project</code> directory, but it will
                          <span class="emphasis"><em>not</em></span> contain directives that would
                          create the <code class="filename">trunk</code> directory itself
                          (because <code class="filename">trunk</code> doesn't match the
                          include filter).  You'll need to make sure that any
                          directories that the new dump stream expects to exist
                          actually do exist in the target repository before trying to
                          load the stream into that repository.
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.replication"></a>5.4.7.&nbsp;&#29256;&#26412;&#24211;&#22797;&#21046;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#26377;&#35768;&#22810;&#22330;&#26223;&#19979;&#20250;&#23384;&#22312;&#19968;&#20010;Subversion&#29256;&#26412;&#24211;&#30340;&#29256;&#26412;&#21382;&#21490;&#19982;&#21478;&#19968;&#20010;&#23436;&#20840;&#30456;&#21516;&#12290;&#25110;&#35768;&#26368;&#26126;&#26174;&#30340;&#23601;&#26159;&#22312;&#20027;&#29256;&#26412;&#24211;&#22240;&#20026;&#30828;&#20214;&#25925;&#38556;&#25110;&#32593;&#32476;&#24050;&#20986;&#25110;&#20854;&#20182;&#21407;&#22240;&#32780;&#19981;&#21487;&#29992;&#26102;&#65292;&#32500;&#25252;&#19968;&#20010;&#31616;&#21333;&#30340;&#22791;&#20221;&#29256;&#26412;&#24211;&#12290;&#20854;&#20182;&#30340;&#22330;&#26223;&#21253;&#25324;&#65292;&#37096;&#32626;&#19968;&#20010;&#38236;&#20687;&#29256;&#26412;&#24211;&#26469;&#20998;&#27969;&#21387;&#21147;&#65292;&#20316;&#20026;&#36719;&#21319;&#32423;&#26426;&#21046;&#31561;&#31561;&#12290;</p>
               <p>As of version 1.4, Subversion provides a program for
                          managing scenarios such as
                          these&#8212;<span class="command"><strong>svnsync</strong></span>.  This works by
                          essentially asking the Subversion server to
                          &#8220;<span class="quote">replay</span>&#8221; revisions, one at a time.  It then uses
                          that revision information to mimic a commit of the same to
                          another repository.  Neither repository needs to be locally
                          accessible to the machine on which <span class="command"><strong>svnsync</strong></span> is
                          running&#8212;its parameters are repository URLs, and it does
                          all its work through Subversion's Repository Access (RA)
                          interfaces.  All it requires is read access to the source
                          repository and read/write access to the destination
                          repository.
               </p>
               <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Note">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="images/note.png"></td>
                        <th align="left">&#27880;&#24847;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>When using <span class="command"><strong>svnsync</strong></span> against a remote
                                        source repository, the Subversion server for that repository
                                        must be running Subversion version 1.4 or later.
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>&#20551;&#23450;&#20320;&#24050;&#32463;&#26377;&#20102;&#19968;&#20010;&#24076;&#26395;&#38236;&#20687;&#30340;&#28304;&#29256;&#26412;&#24211;&#65292;&#19979;&#19968;&#27493;&#23601;&#26159;&#20320;&#35201;&#26377;&#19968;&#20010;&#20316;&#20026;&#38236;&#20687;&#30340;&#30446;&#26631;&#29256;&#26412;&#24211;&#12290;&#30446;&#26631;&#29256;&#26412;&#24211;&#21487;&#20197;&#20351;&#29992;&#20219;&#24847;&#25991;&#20214;&#31995;&#32479;&#25968;&#25454;&#23384;&#20648;&#21518;&#31471;(&#35265;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.basics.backends" title="5.2.3.&nbsp;&#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;">&#31532;&nbsp;5.2.3&nbsp;&#33410; &#8220;&#36873;&#25321;&#25968;&#25454;&#23384;&#20648;&#26684;&#24335;&#8221;</a>)&#65292;&#20294;&#26159;&#20854;&#20013;&#19968;&#23450;&#19981;&#33021;&#26377;&#21382;&#21490;&#29256;&#26412;&#12290;<span class="command"><strong>svnsync</strong></span>&#30340;&#36890;&#35759;&#35758;&#23545;&#20110;&#28304;&#21644;&#30446;&#26631;&#29256;&#26412;&#24211;&#29256;&#26412;&#21382;&#21490;&#30340;&#19981;&#19968;&#33268;&#38750;&#24120;&#25935;&#24863;&#65292;&#22240;&#27492;&#65292;&#34429;&#28982;<span class="command"><strong>svnsync</strong></span>&#26080;&#27861;&#35201;&#27714;&#30446;&#26631;&#29256;&#26412;&#24211;&#26159;&#21482;&#35835;&#30340;&#65292;<sup>[<a name="d0e10716" href="#ftn.d0e10716" class="footnote">37</a>]</sup>&#26368;&#22909;&#30340;&#21150;&#27861;&#23601;&#26159;&#21482;&#20801;&#35768;&#38236;&#20687;&#36827;&#31243;&#20462;&#25913;&#30446;&#26631;&#29256;&#26412;&#24211;&#20869;&#23481;&#12290;
               </p>
               <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Warning">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                        <th align="left">&#35686;&#21578;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p><span class="emphasis"><em>&#19981;&#35201;</em></span>&#20570;&#20986;&#20250;&#23545;&#38236;&#20687;&#29256;&#26412;&#24211;&#20135;&#29983;&#29256;&#26412;&#24211;&#21382;&#21490;&#20559;&#31227;&#30340;&#20462;&#25913;&#65292;&#25152;&#26377;&#25552;&#20132;&#21644;&#29256;&#26412;&#24211;&#30340;&#23646;&#24615;&#20462;&#25913;&#24517;&#39035;&#26159;&#30001;<span class="command"><strong>svnsync</strong></span>&#25191;&#34892;&#30340;&#12290;
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>&#23545;&#20110;&#30446;&#26631;&#29256;&#26412;&#24211;&#30340;&#21478;&#19968;&#31181;&#38656;&#27714;&#26159;<span class="command"><strong>svnsync</strong></span>&#21487;&#20197;&#20462;&#25913;&#29305;&#23450;&#29256;&#26412;&#21270;&#23646;&#24615;&#12290;<span class="command"><strong>svnsync</strong></span>&#22312;&#30446;&#26631;&#29256;&#26412;&#24211;&#30340;&#20462;&#35746;&#29256;&#26412;0&#30340;&#29305;&#21035;&#23646;&#24615;&#19978;&#35760;&#24405;&#20102;&#31807;&#35760;&#20449;&#24687;&#65292;&#22240;&#20026;<span class="command"><strong>svnsync</strong></span>&#22312;&#29256;&#26412;&#24211;&#30340;&#38057;&#23376;&#31995;&#32479;&#30340;&#26694;&#26550;&#19979;&#24037;&#20316;&#30340;&#65292;&#29256;&#26412;&#24211;&#32570;&#30465;&#30340;&#29366;&#24577;(&#20851;&#38381;&#20102;&#29256;&#26412;&#24211;&#23646;&#24615;&#20462;&#25913;&#65307;&#35265;<a class="xref" href="svn.ref.reposhooks.pre-revprop-change.html" title="pre-revprop-change">pre-revprop-change</a>)&#26159;&#19981;&#22815;&#30340;&#12290;&#20320;&#20250;&#38656;&#35201;&#26126;&#30830;&#30340;&#23454;&#29616;pre-revprop-change&#38057;&#23376;&#65292;&#32780;&#19988;&#20320;&#30340;&#33050;&#26412;&#24517;&#39035;&#20801;&#35768;<span class="command"><strong>svnsync</strong></span>&#35774;&#32622;&#23427;&#30340;&#29305;&#21035;&#23646;&#24615;&#65292;&#26377;&#20102;&#36825;&#20123;&#20934;&#22791;&#24037;&#20316;&#65292;&#20320;&#23601;&#21487;&#20197;&#24320;&#22987;&#38236;&#20687;&#29256;&#26412;&#24211;&#20462;&#35746;&#29256;&#26412;&#20102;&#12290;
               </p>
               <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Tip">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#25552;&#31034;]" src="images/tip.png"></td>
                        <th align="left">&#25552;&#31034;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p>&#23454;&#29616;&#25480;&#26435;&#25514;&#26045;&#20801;&#35768;&#22797;&#21046;&#36827;&#31243;&#30340;&#25805;&#20316;&#65292;&#21516;&#26102;&#38450;&#27490;&#20854;&#20182;&#29992;&#25143;&#20462;&#25913;&#38236;&#20687;&#29256;&#26412;&#24211;&#20869;&#23481;&#26159;&#19968;&#20010;&#22909;&#20027;&#24847;&#12290;</p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>&#35753;&#25105;&#20204;&#22312;&#19968;&#20010;&#20856;&#22411;&#30340;&#38236;&#20687;&#22330;&#26223;&#20013;&#27983;&#35272;&#19968;&#19979;<span class="command"><strong>svnsync</strong></span>&#30340;&#20351;&#29992;&#65292;&#25105;&#20204;&#24613;&#30528;&#35752;&#35770;&#23454;&#36341;&#25512;&#33616;&#65292;&#20294;&#26159;&#22914;&#26524;&#20320;&#20204;&#19981;&#38656;&#35201;&#25110;&#32773;&#24863;&#21040;&#19981;&#36866;&#21512;&#20320;&#20204;&#30340;&#29615;&#22659;&#65292;&#20320;&#21487;&#20197;&#19981;&#24517;&#21435;&#20851;&#27880;&#12290;
               </p>
               <p>As a service to the fine developers of our favorite
                          version control system, we will be mirroring the public
                          Subversion source code repository and exposing that mirror
                          publicly on the Internet, hosted on a different machine than
                          the one on which the original Subversion source code
                          repository lives.  This remote host has a global configuration
                          that permits anonymous users to read the contents of
                          repositories on the host, but requires users to authenticate
                          to modify those repositories.  (Please forgive us for
                          glossing over the details of Subversion server configuration
                          for the moment&#8212;those are covered thoroughly in <a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>.)  And for no other reason than
                          that it makes for a more interesting example, we'll be driving
                          the replication process from a third machine&#8212;the one that
                          we currently find ourselves using.
               </p>
               <p>&#39318;&#20808;&#65292;&#25105;&#20204;&#20250;&#21019;&#24314;&#19968;&#20010;&#20316;&#20026;&#38236;&#20687;&#30340;&#29256;&#26412;&#24211;&#65292;&#19979;&#38754;&#20004;&#27493;&#38656;&#35201;&#25105;&#20204;&#33021;&#22815;&#36890;&#36807;shell&#35775;&#38382;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340;&#26426;&#22120;&#12290;&#19968;&#26086;&#29256;&#26412;&#24211;&#37197;&#32622;&#23436;&#25104;&#65292;&#25105;&#20204;&#19981;&#24517;&#20877;&#30452;&#25509;&#30896;&#23427;&#20102;&#12290;</p><pre class="screen">
$ ssh admin@svn.example.com \
      "svnadmin create /var/svn/svn-mirror"
admin@svn.example.com's password: ********
$
</pre><p>&#27492;&#21051;&#65292;&#25105;&#20204;&#26377;&#20102;&#25105;&#20204;&#30340;&#29256;&#26412;&#24211;&#65292;&#22240;&#20026;&#25105;&#20204;&#26381;&#21153;&#22120;&#30340;&#37197;&#32622;&#65292;&#36825;&#20010;&#29256;&#26412;&#24211;&#29616;&#22312;&#8220;<span class="quote">&#23384;&#22312;&#20110;</span>&#8221;Internet&#12290;&#29616;&#22312;&#65292;&#22240;&#20026;&#38500;&#20102;&#22797;&#21046;&#36827;&#31243;&#25105;&#20204;&#19981;&#24076;&#26395;&#20219;&#20309;&#20854;&#20182;&#20462;&#25913;&#65292;&#25105;&#20204;&#38656;&#35201;&#23558;&#36825;&#20010;&#36827;&#31243;&#21516;&#20854;&#20182;&#21487;&#33021;&#30340;&#25552;&#20132;&#32773;&#21306;&#20998;&#24320;&#26469;&#12290;&#20026;&#27492;&#65292;&#25105;&#20204;&#30340;&#36827;&#31243;&#20351;&#29992;&#19987;&#29992;&#30340;&#29992;&#25143;&#65292;&#21482;&#26377;&#29305;&#23450;&#29992;&#25143;<code class="literal">syncuser</code>&#30340;&#25552;&#20132;&#21644;&#23646;&#24615;&#20462;&#25913;&#21487;&#20197;&#34987;&#25191;&#34892;&#12290;
               </p>
               <p>&#25105;&#20204;&#20250;&#20351;&#29992;&#29256;&#26412;&#24211;&#30340;&#38057;&#23376;&#31995;&#32479;&#26469;&#20801;&#35768;&#22797;&#21046;&#36827;&#31243;&#23436;&#25104;&#25105;&#20204;&#30340;&#20219;&#21153;&#65292;&#25105;&#20204;&#36890;&#36807;&#23454;&#29616;&#20004;&#20010;&#29256;&#26412;&#24211;&#20107;&#20214;&#38057;&#23376;pre-revprop-change&#21644;start-commit&#26469;&#24378;&#21046;&#36825;&#20010;&#36807;&#31243;&#12290;&#25105;&#20204;&#30340;<code class="filename">pre-revprop-change</code>&#38057;&#23376;&#33050;&#26412;&#21487;&#20197;&#22312;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.replication.pre-revprop-change" title="&#20363;&nbsp;5.2.&nbsp;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340; pre-revprop-change &#38057;&#23376;">&#20363;&nbsp;5.2 &#8220;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340; pre-revprop-change &#38057;&#23376;&#8221;</a>&#25214;&#21040;&#65292;&#21482;&#26159;&#39564;&#35777;&#23581;&#35797;&#20462;&#25913;&#23646;&#24615;&#30340;&#29992;&#25143;&#26159;<code class="literal">syncuser</code>&#65292;&#22914;&#26524;&#26159;&#65292;&#21017;&#20801;&#35768;&#20462;&#25913;&#65307;&#21542;&#21017;&#65292;&#25298;&#32477;&#20462;&#25913;&#12290;
               </p>
               <div class="example"><a name="svn.reposadmin.maint.replication.pre-revprop-change"></a><p class="title"><b>&#20363;&nbsp;5.2.&nbsp;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340; pre-revprop-change &#38057;&#23376;</b></p>
                  <div class="example-contents"><pre class="programlisting">
#!/bin/sh 

USER="$3"

if [ "$USER" = "syncuser" ]; then exit 0; fi

echo "Only the syncuser user may change revision properties" &gt;&amp;2
exit 1
</pre></div>
               </div><br class="example-break"><p>That covers revision property changes.  Now we need to
                          ensure that only the <code class="literal">syncuser</code> user is
                          permitted to commit new revisions to the repository.  We do
                          this using a <code class="filename">start-commit</code> hook scripts
                          such as the one in <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.replication.start-commit" title="&#20363;&nbsp;5.3.&nbsp;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340; start-commit &#38057;&#23376;">&#20363;&nbsp;5.3 &#8220;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340; start-commit &#38057;&#23376;&#8221;</a>.
               </p>
               <div class="example"><a name="svn.reposadmin.maint.replication.start-commit"></a><p class="title"><b>&#20363;&nbsp;5.3.&nbsp;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340; start-commit &#38057;&#23376;</b></p>
                  <div class="example-contents"><pre class="programlisting">
#!/bin/sh 

USER="$2"

if [ "$USER" = "syncuser" ]; then exit 0; fi

echo "Only the syncuser user may commit new revisions" &gt;&amp;2
exit 1
</pre></div>
               </div><br class="example-break"><p>&#22312;&#23433;&#35013;&#20102;&#25105;&#20204;&#30340;&#38057;&#23376;&#33050;&#26412;&#21644;&#30830;&#23450;&#23427;&#20204;&#21487;&#20197;&#34987;Subversion&#26381;&#21153;&#22120;&#25191;&#34892;&#21518;&#65292;&#25105;&#20204;&#23436;&#25104;&#20102;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340;&#37197;&#32622;&#65292;&#29616;&#22312;&#25105;&#20204;&#24320;&#22987;&#23454;&#38469;&#30340;&#38236;&#20687;&#12290;</p>
               <p>&#23545;&#20110;<span class="command"><strong>svnsync</strong></span>&#65292;&#25105;&#20204;&#39318;&#20808;&#38656;&#35201;&#22312;&#30446;&#26631;&#29256;&#26412;&#24211;&#19978;&#27880;&#20876;&#28304;&#29256;&#26412;&#24211;&#65292;&#25105;&#20204;&#36890;&#36807;<span class="command"><strong>svnsync initialize</strong></span>&#23454;&#29616;&#36825;&#19968;&#27493;&#12290;&#25552;&#20379;&#30340;URL&#20998;&#21035;&#25351;&#21521;&#30446;&#26631;&#21644;&#28304;&#29256;&#26412;&#24211;&#65292;&#22312;Subversion1.4&#65292;&#36825;&#26159;&#24517;&#39035;&#30340;&#8212;&#21482;&#20801;&#35768;&#23436;&#20840;&#30340;&#29256;&#26412;&#24211;&#38236;&#20687;&#12290;&#22312;Subversion1.5&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;<span class="command"><strong>svnsync</strong></span>&#38236;&#20687;&#29256;&#26412;&#24211;&#30340;&#23376;&#26641;&#12290;
               </p><pre class="screen">
$ svnsync help init
initialize (init): usage: svnsync initialize DEST_URL SOURCE_URL

Initialize a destination repository for synchronization from
another repository.
&#8230;
$ svnsync initialize http://svn.example.com/svn-mirror \
                     http://svn.collab.net/repos/svn \
                     --sync-username syncuser --sync-password syncpass
Copied properties for revision 0.
$
</pre><p>&#25105;&#20204;&#30340;&#30446;&#26631;&#29256;&#26412;&#24211;&#29616;&#22312;&#35760;&#20303;&#20102;&#23427;&#26159;Subversion&#20844;&#20849;&#28304;&#20195;&#30721;&#29256;&#26412;&#24211;&#30340;&#38236;&#20687;&#65292;&#27880;&#24847;&#25105;&#20204;&#22312;<span class="command"><strong>svnsync</strong></span>&#25552;&#20379;&#20102;&#19968;&#20010;&#29992;&#25143;&#21517;&#21644;&#23494;&#30721;&#8212;&#36825;&#26159;&#25105;&#20204;&#30340;&#38236;&#20687;&#29256;&#26412;&#24211;pre-revprop-change&#38057;&#23376;&#30340;&#35201;&#27714;&#12290;
               </p>
               <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
                  <table border="0" summary="Note">
                     <tr>
                        <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="images/note.png"></td>
                        <th align="left">&#27880;&#24847;</th>
                     </tr>
                     <tr>
                        <td align="left" valign="top">
                           <p><span class="command"><strong>svnsync</strong></span>&#30340;&#26368;&#21021;&#29256;&#26412;(&#22312;Subversion 1.4)&#26377;&#19968;&#20123;&#32570;&#38519;&#8212;&#29992;&#26469;&#35748;&#35777;&#30340;<code class="option">--username</code>&#21644;<code class="option">--password</code>&#21629;&#20196;&#34892;&#21442;&#25968;&#21516;&#26102;&#20316;&#29992;&#20110;&#28304;&#21644;&#30446;&#26631;&#29256;&#26412;&#24211;&#12290;&#26174;&#28982;&#65292;&#25105;&#20204;&#26080;&#27861;&#20445;&#35777;&#21516;&#27493;&#30340;&#29992;&#25143;&#35748;&#35777;&#20449;&#24687;&#26159;&#30456;&#21516;&#30340;&#65292;&#22914;&#26524;&#19981;&#19968;&#26679;&#65292;&#29992;&#25143;&#20351;&#29992;&#38750;&#20132;&#20114;&#27169;&#24335;(<code class="option">--non-interactive</code>&#36873;&#39033;)&#26469;&#36816;&#34892;<span class="command"><strong>svnsync</strong></span>&#26102;&#20250;&#36935;&#21040;&#36825;&#20010;&#38382;&#39064;&#12290;
                           </p>
                           <p>This has been fixed in Subversion 1.5 with the
                                        introduction of two new pairs of options.  Use
                                        <code class="option">--source-username</code> and
                                        <code class="option">--source-password</code> to provide authentication
                                        credentials for the source repository; use
                                        <code class="option">--sync-username</code> and
                                        <code class="option">--sync-password</code> to provide credentials for
                                        the destination repository.  (The old
                                        <code class="option">--username</code> and <code class="option">--password</code>
                                        options still exist for compatibility, but we advise against
                                        using them.)
                           </p>
                        </td>
                     </tr>
                  </table>
               </div>
               <p>And now comes the fun part.  With a single subcommand, we
                          can tell <span class="command"><strong>svnsync</strong></span> to copy all the
                          as-yet-unmirrored revisions from the source repository to the
                          target.
                          <sup>[<a name="d0e10863" href="#ftn.d0e10863" class="footnote">38</a>]</sup>
                          The <span class="command"><strong>svnsync synchronize</strong></span> subcommand will
                          peek into the special revision properties previously stored on
                          the target repository, and determine both what repository it
                          is mirroring as well as that the most recently mirrored
                          revision was revision 0.  Then it will query the source
                          repository and determine what the latest revision in that
                          repository is.  Finally, it asks the source repository's
                          server to start replaying all the revisions between 0 and that
                          latest revision.  As <span class="command"><strong>svnsync</strong></span> get the
                          resultant response from the source repository's server, it
                          begins forwarding those revisions to the target repository's
                          server as new commits.
               </p><pre class="screen">
$ svnsync help synchronize
synchronize (sync): usage: svnsync synchronize DEST_URL

Transfer all pending revisions to the destination from the source
with which it was initialized.
&#8230;
$ svnsync synchronize http://svn.example.com/svn-mirror
Transmitting file data ........................................
Committed revision 1.
Copied properties for revision 1.
Transmitting file data ..
Committed revision 2.
Copied properties for revision 2.
Transmitting file data .....
Committed revision 3.
Copied properties for revision 3.
&#8230;
Transmitting file data ..
Committed revision 23406.
Copied properties for revision 23406.
Transmitting file data .
Committed revision 23407.
Copied properties for revision 23407.
Transmitting file data ....
Committed revision 23408.
Copied properties for revision 23408.
$
</pre><p>&#38236;&#20687;&#20462;&#35746;&#29256;&#26412;&#26377;&#19968;&#28857;&#29305;&#21035;&#26377;&#36259;&#65292;&#39318;&#20808;&#26159;&#21040;&#30446;&#26631;&#29256;&#26412;&#24211;&#30340;&#20462;&#35746;&#29256;&#26412;&#25552;&#20132;&#65292;&#28982;&#21518;&#36319;&#30528;&#23646;&#24615;&#20462;&#25913;&#12290;&#36825;&#26159;&#22240;&#20026;&#26368;&#21021;&#30340;&#25552;&#20132;&#26159;&#36890;&#36807;&#29992;&#25143;<code class="literal">syncuser</code>&#25191;&#34892;&#30340;&#65292;&#32780;&#26102;&#38388;&#25139;&#26159;&#25552;&#20132;&#30340;&#26102;&#38388;&#65292;&#32780;&#19988;Subversion&#24213;&#23618;&#30340;&#29256;&#26412;&#24211;&#35775;&#38382;&#25509;&#21475;&#19981;&#20801;&#35768;&#22312;&#25552;&#20132;&#26102;&#20219;&#24847;&#20462;&#25913;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#65292;&#25152;&#20197;<span class="command"><strong>svnsync</strong></span>&#20250;&#31435;&#21363;&#20351;&#29992;&#23646;&#24615;&#20462;&#25913;&#65292;&#23558;&#28304;&#29256;&#26412;&#24211;&#21457;&#29616;&#30340;&#25152;&#26377;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#25335;&#36125;&#21040;&#30446;&#26631;&#29256;&#26412;&#24211;&#65292;&#36825;&#20854;&#20013;&#23601;&#21253;&#25324;&#20102;&#20462;&#25913;&#20316;&#32773;&#21644;&#26102;&#38388;&#25139;&#20351;&#20043;&#19982;&#28304;&#29256;&#26412;&#24211;&#19968;&#33268;&#30340;&#25928;&#26524;&#12290;
               </p>
               <p>Also noteworthy is that <span class="command"><strong>svnsync</strong></span>
                          performs careful bookkeeping that allows it to be safely
                          interrupted and restarted without ruining the integrity of the
                          mirrored data.  If a network glitch occurs while mirroring a
                          repository, simply repeat the <span class="command"><strong>svnsync
                                synchronize</strong></span> command, and it will happily pick up
                          right where it left off.  In fact, as new revisions appear in
                          the source repository, this is exactly what you to do
                          to keep your mirror up to date.
               </p>
               <div class="sidebar">
                  <p class="title"><b>&#20851;&#20110; svnsync</b></p>
                  <p><span class="command"><strong>svnsync</strong></span> needs to be able to set and
                               modify revision properties on the mirror repository because
                               those properties are part of the data it is tasked with
                               mirroring.  As those properties change in the source
                               repository, those changes need to be reflected in the mirror
                               repository, too.  But <span class="command"><strong>svnsync</strong></span> also uses a
                               set of custom revision properties&#8212;stored in revision 0
                               of the mirror repository&#8212;for its own internal
                               bookkeeping.  These properties contain information such as
                               the URL and UUID of the source repository, plus some
                               additional state-tracking information.
                  </p>
                  <p>One of those pieces of state-tracking information is a
                               flag that essentially just means &#8220;<span class="quote">there's a
                                  synchronization in progress right now.</span>&#8221;  This is used
                               to prevent multiple <span class="command"><strong>svnsync</strong></span> processes
                               from colliding with each other while trying to mirror data
                               to the same destination repository.  Now, generally you
                               won't need to pay any attention whatsoever to
                               <span class="emphasis"><em>any</em></span> of these special properties (all of
                               which begin with the prefix <code class="literal">svn:sync-</code>).
                               Occasionally, though, if a synchronization fails
                               unexpectedly, Subversion never has a chance to remove this
                               particular state flag.  This causes all future
                               synchronization attempts to fail because it appears that a
                               synchronization is still in progress when, in fact, none is.
                               Fortunately, recovering from this situation is as simple as
                               removing the <code class="literal">svn:sync-lock</code> property which
                               serves as this flag from revision 0 of the mirror
                               repository:
                  </p><pre class="screen">
$ svn propdel --revprop -r0 svn:sync-lock http://svn.example.com/svn-mirror
property 'svn:sync-lock' deleted from repository revision 0
$
</pre><p>That <span class="command"><strong>svnsync</strong></span> stores the source
                               repository URL in a bookkeeping property on the mirror
                               repository is the reason why you have to specify that
                               URL only once, during <span class="command"><strong>svnsync init</strong></span>.  Future
                               synchronization operations against that mirror simply
                               consult the special <code class="literal">svn:sync-from-url</code>
                               property stored on the mirror itself to know where
                               to synchronize from.  This value is used literally by the
                               synchronization process, though.  So while from within
                               CollabNet's network you can perhaps access our example
                               source URL as <code class="literal">http://svn/repos/svn</code>
                               (because that first <code class="literal">svn</code> magically gets
                               <code class="literal">.collab.net</code> appended to it by DNS
                               voodoo), if you later need to update that mirror from
                               another machine outside CollabNet's network, the
                               synchronization might fail (because the hostname
                               <code class="literal">svn</code> is ambiguous).  For this reason, it's
                               best to use fully qualified source repository URLs when
                               initializing a mirror repository rather than those that
                               refer to only hostnames or IP addresses (which can change
                               over time).  But here again, if you need an existing mirror
                               to start referring to a different URL for the same source
                               repository, you can change the bookkeeping property which
                               houses that information:
                  </p><pre class="screen">
$ svn propset --revprop -r0 svn:sync-from-url <em class="replaceable"><code>NEW-SOURCE-URL</code></em> \
      http://svn.example.com/svn-mirror
property 'svn:sync-from-url' set on repository revision 0
$
</pre><p>Another interesting thing about these special
                               bookkeeping properties is that <span class="command"><strong>svnsync</strong></span>
                               will not attempt to mirror any of those properties when they
                               are found in the source repository.  The reason is probably
                               obvious, but basically boils down to
                               <span class="command"><strong>svnsync</strong></span> not being able to distinguish the
                               special properties it has merely copied from the source
                               repository from those it needs to consult and maintain for
                               its own bookkeeping needs.  This situation could occur if,
                               for example, you were maintaining a mirror of a mirror of a
                               third repository.  When <span class="command"><strong>svnsync</strong></span> sees its
                               own special properties in revision 0 of the source
                               repository, it simply ignores them.
                  </p>
               </div>
               <p>There is, however, one bit of inelegance in the process.
                          Because Subversion revision properties can be changed at any
                          time throughout the lifetime of the repository, and because
                          they don't leave an audit trail that indicates when they were
                          changed, replication processes have to pay special attention
                          to them.  If you've already mirrored the first 15 revisions of
                          a repository and someone then changes a revision property on
                          revision 12, <span class="command"><strong>svnsync</strong></span> won't know to go back
                          and patch up its copy of revision 12.  You'll need to tell it
                          to do so manually by using (or with some additional tooling
                          around) the <span class="command"><strong>svnsync copy-revprops</strong></span>
                          subcommand, which simply rereplicates all the revision
                          properties for a particular revision or range thereof.
               </p><pre class="screen">
$ svnsync help copy-revprops
copy-revprops: usage: svnsync copy-revprops DEST_URL [REV[:REV2]]

Copy the revision properties in a given range of revisions to the
destination from the source with which it was initialized.
&#8230;
$ svnsync copy-revprops http://svn.example.com/svn-mirror 12
Copied properties for revision 12.
$
</pre><p>&#29256;&#26412;&#24211;&#22797;&#21046;&#21482;&#26159;&#19968;&#20010;&#22771;&#65292;&#20320;&#19968;&#23450;&#20250;&#24076;&#26395;&#21033;&#29992;&#36825;&#20010;&#36827;&#31243;&#30340;&#33258;&#21160;&#21270;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#25105;&#20204;&#30340;&#20363;&#23376;&#26159;&#19968;&#20010;&#8220;&#25302;&#21644;&#25512;&#8221;&#35774;&#32622;&#65292;&#20320;&#25110;&#35768;&#24076;&#26395;&#22312;post-commit&#21644;post-revprop-change&#38057;&#23376;&#23454;&#29616;&#20013;&#20174;&#20320;&#30340;&#20027;&#29256;&#26412;&#24211;&#23558;&#20462;&#25913;&#25512;&#20498;&#19968;&#20010;&#25110;&#22810;&#20010;&#38236;&#20687;&#65292;&#36825;&#26679;&#23601;&#21487;&#20197;&#36817;&#20046;&#23454;&#26102;&#30340;&#20445;&#25345;&#38236;&#20687;&#30340;&#26102;&#25928;&#24615;&#12290;</p>
               <p>Also, while it isn't very commonplace to do so,
                          <span class="command"><strong>svnsync</strong></span> does gracefully mirror repositories
                          in which the user as whom it authenticates has only partial
                          read access.  It simply copies only the bits of the repository
                          that it is permitted to see.  Obviously, such a mirror is not
                          useful as a backup solution.
               </p>
               <p>In Subversion 1.5, <span class="command"><strong>svnsync</strong></span> grew the
                          ability to also mirror a subset of a repository rather than
                          the whole thing.  The process of setting up and maintaining
                          such a mirror is exactly the same as when mirroring a whole
                          repository, except that instead of specifying the source
                          repository's root URL when running <span class="command"><strong>svnsync
                                init</strong></span>, you specify the URL of some subdirectory
                          within that repository.  Synchronization to that mirror will
                          now copy only the bits that changed under that source
                          repository subdirectory.  There are some limitations to this
                          support, though.  First, you can't mirror multiple disjoint
                          subdirectories of the source repository into a single mirror
                          repository&#8212;you'd need to instead mirror some parent
                          directory that is common to both.  Second, the filtering
                          logic is entirely path-based, so if the subdirectory you are
                          mirroring was renamed at some point in the past, your mirror
                          would contain only the revisions since the directory appeared
                          at the URL you specified.  And likewise, if the source
                          subdirectory is renamed in the future, your synchronization
                          processes will stop mirroring data at the point that the
                          source URL you specified is no longer valid.
               </p>
               <p>&#21482;&#35201;&#29992;&#25143;&#19982;&#29256;&#26412;&#24211;&#21644;&#38236;&#20687;&#30340;&#20132;&#20114;&#32487;&#32493;&#65292;&#26159;&#21487;&#20197;&#26377;&#19968;&#20010;&#24037;&#20316;&#21103;&#26412;&#30452;&#25509;&#19982;&#36825;&#20004;&#20010;&#29256;&#26412;&#24211;&#20132;&#20114;&#12290;&#20294;&#26159;&#20320;&#38656;&#35201;&#36339;&#20986;&#20960;&#20010;&#22280;&#23376;&#25165;&#33021;&#20570;&#21040;&#36825;&#26679;&#12290;&#31532;&#19968;&#65292;&#20320;&#38656;&#35201;&#20445;&#35777;&#20027;&#21644;&#38236;&#20687;&#29256;&#26412;&#24211;&#26377;&#30456;&#21516;&#30340;UUID(&#36890;&#24120;&#32570;&#30465;&#19981;&#26159;&#30456;&#21516;)&#65292;&#26412;&#31456;&#21518;&#38754;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.uuids" title="5.4.9.&nbsp;&#31649;&#29702;&#29256;&#26412;&#24211;&#30340; UUID">&#31532;&nbsp;5.4.9&nbsp;&#33410; &#8220;&#31649;&#29702;&#29256;&#26412;&#24211;&#30340; UUID&#8221;</a>&#35814;&#32454;&#35752;&#35770;&#20102;&#36825;&#20010;&#38382;&#39064;&#12290;
               </p>
               <p>Once the two repositories have the same UUID, you can use
                          <span class="command"><strong>svn switch</strong></span> with the <code class="option">--relocate</code> option to point your working
                          copy to whichever of the repositories you wish to operate
                          against, a process that is described in <a class="xref" href="svn.ref.svn.c.switch.html" title="svn switch">svn switch</a>.  There is a possible danger
                          here, though, in that if the primary and mirror repositories
                          aren't in close synchronization, a working copy up to date
                          with, and pointing to, the primary repository will, if
                          relocated to point to an out-of-date mirror, become confused
                          about the apparent sudden loss of revisions it fully expects
                          to be present, and it will throw errors to that effect.  If
                          this occurs, you can relocate your working copy back to the
                          primary repository and then either wait until the mirror
                          repository is up to date, or backdate your working copy to a
                          revision you know is present in the sync repository, and then
                          retry the relocation.
               </p>
               <p>&#26368;&#21518;&#25105;&#20204;&#38656;&#35201;&#24847;&#35782;&#21040;&#65292;<span class="command"><strong>svnsync</strong></span>&#21482;&#25903;&#25345;&#20462;&#35746;&#29256;&#26412;&#20026;&#22522;&#30784;&#30340;&#22797;&#21046;&#65292;&#21482;&#26377;&#29256;&#26412;&#24211;&#36716;&#20648;&#25991;&#20214;&#21253;&#21547;&#30340;&#20869;&#23481;&#20250;&#36827;&#34892;&#22797;&#21046;&#12290;&#22240;&#27492;<span class="command"><strong>svnsync</strong></span>&#20063;&#26377;&#20102;&#29256;&#26412;&#24211;&#36716;&#20648;&#27969;&#30340;&#27492;&#31867;&#38480;&#21046;&#65292;&#23427;&#27809;&#26377;&#21253;&#25324;&#35832;&#22914;&#38057;&#23376;&#23454;&#29616;&#65292;&#29256;&#26412;&#24211;&#25110;&#26381;&#21153;&#22120;&#37197;&#32622;&#25968;&#25454;&#65292;&#26410;&#25552;&#20132;&#20107;&#21153;&#25110;&#20851;&#20110;&#29992;&#25143;&#38145;&#23450;&#29256;&#26412;&#24211;&#36335;&#24452;&#30340;&#20449;&#24687;&#65292;&#21482;&#26377;Subversion&#29256;&#26412;&#24211;&#36716;&#20648;&#25991;&#20214;&#26684;&#24335;&#22312;&#22797;&#21046;&#26102;&#21253;&#21547;&#36825;&#20123;&#20449;&#24687;&#12290;
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.backup"></a>5.4.8.&nbsp;&#29256;&#26412;&#24211;&#22791;&#20221;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Despite numerous advances in technology since the birth of
                          the modern computer, one thing unfortunately rings true with
                          crystalline clarity&#8212;sometimes things go very, very
                          awry.  Power outages, network connectivity dropouts, corrupt
                          RAM, and crashed hard drives are but a taste of the evil that
                          Fate is poised to unleash on even the most conscientious
                          administrator.  And so we arrive at a very important
                          topic&#8212;how to make backup copies of your repository
                          data.
               </p>
               <p>Subversion&#29256;&#26412;&#24211;&#31649;&#29702;&#26377;&#20004;&#31181;&#22791;&#20221;&#26041;&#27861;&#8212;&#23436;&#20840;&#21644;&#22686;&#37327;&#12290;&#19968;&#20010;&#23436;&#20840;&#30340;&#29256;&#26412;&#24211;&#22791;&#20221;&#21253;&#21547;&#20102;&#22312;&#37325;&#22823;&#28798;&#38590;&#21518;&#37325;&#24314;&#29256;&#26412;&#24211;&#25152;&#38656;&#30340;&#25152;&#26377;&#20449;&#24687;&#65292;&#36890;&#24120;&#65292;&#36825;&#24847;&#21619;&#30528;&#23545;&#29256;&#26412;&#24211;&#30446;&#24405;(&#21253;&#25324;Berkeley DB&#25110;FSFS&#29615;&#22659;)&#30340;&#23436;&#20840;&#22797;&#21046;&#65292;&#22686;&#37327;&#22791;&#20221;&#30340;&#20869;&#23481;&#35201;&#23569;&#19968;&#20123;&#65306;&#21482;&#21253;&#21547;&#22312;&#19978;&#27425;&#22791;&#20221;&#21518;&#25913;&#21464;&#30340;&#37096;&#20998;&#12290;</p>
               <p>As far as full backups go, the na&iuml;ve approach might seem
                          like a sane one, but unless you temporarily disable all other
                          access to your repository, simply doing a recursive directory
                          copy runs the risk of generating a faulty backup.  In the case
                          of Berkeley DB, the documentation describes a certain order in
                          which database files can be copied that will guarantee a valid
                          backup copy.  A similar ordering exists for FSFS data.  But
                          you don't have to implement these algorithms yourself, because
                          the Subversion development team has already done so.  The
                          <span class="command"><strong>svnadmin hotcopy</strong></span> command takes care of the
                          minutia involved in making a hot backup of your repository.
                          And its invocation is as trivial as the Unix
                          <span class="command"><strong>cp</strong></span> or Windows <span class="command"><strong>copy</strong></span>
                          operations:
               </p><pre class="screen">
$ svnadmin hotcopy /var/svn/repos /var/svn/repos-backup
</pre><p>The resultant backup is a fully functional Subversion
                          repository, able to be dropped in as a replacement for your
                          live repository should something go horribly wrong.
               </p>
               <p>&#24403;&#36827;&#34892;Berkeley DB&#29256;&#26412;&#24211;&#30340;&#22791;&#20221;&#26102;&#65292;&#20320;&#21487;&#20197;&#25351;&#23548;<span class="command"><strong>svnadmin hotcopy</strong></span>&#28165;&#29702;&#28304;&#29256;&#26412;&#24211;&#20013;&#26080;&#29992;&#30340;Berkeley DB&#26085;&#24535;&#25991;&#20214;(&#35265;<a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.diskspace.bdblogs" title="5.4.3.3.&nbsp;&#21024;&#38500;&#19981;&#20351;&#29992;&#30340; Berkeley DB &#26085;&#24535;&#25991;&#20214;">&#31532;&nbsp;5.4.3.3&nbsp;&#33410; &#8220;&#21024;&#38500;&#19981;&#20351;&#29992;&#30340; Berkeley DB &#26085;&#24535;&#25991;&#20214;&#8221;</a>)&#65292;&#21482;&#38656;&#35201;&#31616;&#21333;&#30340;&#22312;&#21629;&#20196;&#34892;&#37324;&#25552;&#20379;<code class="option">--clean-logs</code>&#12290;
               </p><pre class="screen">
$ svnadmin hotcopy --clean-logs /var/svn/bdb-repos /var/svn/bdb-repos-backup
</pre><p>Additional tooling around this command is available, too.
                          The <code class="filename">tools/backup/</code> directory of the
                          Subversion source distribution holds the
                          <span class="command"><strong>hot-backup.py</strong></span> script.  This script adds a
                          bit of backup management atop <span class="command"><strong>svnadmin
                                hotcopy</strong></span>, allowing you to keep only the most recent
                          configured number of backups of each repository.  It will
                          automatically manage the names of the backed-up repository
                          directories to avoid collisions with previous backups and
                          will &#8220;<span class="quote">rotate off</span>&#8221; older backups, deleting them so
                          that only the most recent ones remain.  Even if you also have an
                          incremental backup, you might want to run this program on a
                          regular basis.  For example, you might consider using
                          <span class="command"><strong>hot-backup.py</strong></span> from a program scheduler
                          (such as <span class="command"><strong>cron</strong></span> on Unix systems), which can
                          cause it to run nightly (or at whatever granularity of time
                          you deem safe).
               </p>
               <p>Some administrators use a different backup mechanism built
                          around generating and storing repository dump data.  We
                          described in <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.migrate" title="5.4.5.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;">&#31532;&nbsp;5.4.5&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;&#8221;</a>
                          how to use <span class="command"><strong>svnadmin dump</strong></span> with the <code class="option">--incremental</code> option to
                          perform an incremental backup of a given revision or range of
                          revisions.  And of course, you can achieve a full backup variation of
                          this by omitting the <code class="option">--incremental</code>
                          option to that command.  There is some value in these methods,
                          in that the format of your backed-up information is
                          flexible&#8212;it's not tied to a particular platform,
                          versioned filesystem type, or release of Subversion or
                          Berkeley DB.  But that flexibility comes at a cost, namely
                          that restoring that data can take a long time&#8212;longer
                          with each new revision committed to your repository.  Also, as
                          is the case with so many of the various backup methods,
                          revision property changes that are made to already backed-up
                          revisions won't get picked up by a nonoverlapping,
                          incremental dump generation.  For these reasons, we recommend
                          against relying solely on dump-based backup approaches.
               </p>
               <p>&#22914;&#20320;&#25152;&#35265;&#65292;&#20960;&#31181;&#22791;&#20221;&#26041;&#24335;&#37117;&#26377;&#21508;&#33258;&#30340;&#20248;&#28857;&#65292;&#26368;&#31616;&#21333;&#30340;&#26041;&#24335;&#26159;&#23436;&#20840;&#28909;&#22791;&#20221;&#65292;&#23558;&#20250;&#27599;&#27425;&#24314;&#31435;&#29256;&#26412;&#24211;&#30340;&#23436;&#32654;&#22797;&#21046;&#21697;&#65292;&#36825;&#24847;&#21619;&#30528;&#22914;&#26524;&#24403;&#20320;&#30340;&#27963;&#21160;&#29256;&#26412;&#24211;&#21457;&#29983;&#20102;&#20160;&#20040;&#20107;&#24773;&#65292;&#20320;&#21487;&#20197;&#29992;&#22791;&#20221;&#24674;&#22797;&#12290;&#20294;&#19981;&#24184;&#30340;&#26159;&#65292;&#22914;&#26524;&#20320;&#32500;&#25252;&#22810;&#20010;&#22791;&#20221;&#65292;&#27599;&#20010;&#23436;&#20840;&#30340;&#22791;&#20221;&#20250;&#21534;&#22124;&#25481;&#21644;&#20320;&#30340;&#27963;&#21160;&#29256;&#26412;&#24211;&#21516;&#26679;&#30340;&#31354;&#38388;&#12290;&#19982;&#20043;&#30456;&#23545;&#29031;&#30340;&#26159;&#22686;&#37327;&#22791;&#20221;&#65292;&#33021;&#22815;&#24555;&#36895;&#29983;&#25104;&#23567;&#30340;&#22791;&#20221;&#65292;&#20294;&#26159;&#24674;&#22797;&#36807;&#31243;&#23558;&#20250;&#24456;&#30171;&#33510;&#65292;&#36890;&#24120;&#35201;&#21253;&#25324;&#22810;&#20010;&#22686;&#37327;&#25335;&#36125;&#30340;&#24212;&#29992;&#12290;&#20854;&#20182;&#26041;&#27861;&#37117;&#26377;&#33258;&#24049;&#30340;&#29305;&#28857;&#65292;&#31649;&#29702;&#21592;&#38656;&#35201;&#22312;&#21019;&#24314;&#25335;&#36125;&#21644;&#24674;&#22797;&#30340;&#20195;&#20215;&#20043;&#38388;&#23547;&#27714;&#24179;&#34913;&#12290;</p>
               <p>The <span class="command"><strong>svnsync</strong></span> program (see <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.replication" title="5.4.7.&nbsp;&#29256;&#26412;&#24211;&#22797;&#21046;">&#31532;&nbsp;5.4.7&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#22797;&#21046;&#8221;</a>) actually
                          provides a rather handy middle-ground approach.  If you are
                          regularly synchronizing a read-only mirror with your main
                          repository, in a pinch your read-only mirror is probably
                          a good candidate for replacing that main repository if it
                          falls over.  The primary disadvantage of this method is that
                          only the versioned repository data gets
                          synchronized&#8212;repository configuration files,
                          user-specified repository path locks, and other items that
                          might live in the physical repository directory but not
                          <span class="emphasis"><em>inside</em></span> the repository's virtual versioned
                          filesystem are not handled by <span class="command"><strong>svnsync</strong></span>.
               </p>
               <p>&#22312;&#27599;&#19968;&#31181;&#22791;&#20221;&#24773;&#22659;&#19979;&#65292;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#38656;&#35201;&#24847;&#35782;&#21040;&#23545;&#26410;&#29256;&#26412;&#21270;&#30340;&#20462;&#35746;&#29256;&#26412;&#23646;&#24615;&#30340;&#20462;&#25913;&#23545;&#22791;&#20221;&#30340;&#24433;&#21709;&#65292;&#22240;&#20026;&#36825;&#20123;&#20462;&#25913;&#26412;&#36523;&#19981;&#20250;&#20135;&#29983;&#26032;&#30340;&#20462;&#35746;&#29256;&#26412;&#65292;&#25152;&#20197;&#19981;&#20250;&#35302;&#21457;post-commit&#30340;&#38057;&#23376;&#31243;&#24207;&#65292;&#20063;&#19981;&#20250;&#35302;&#21457;pre-revprop-change&#21644;post-revprop-change&#30340;&#38057;&#23376;&#12290;
                  <sup>[<a name="d0e11091" href="#ftn.d0e11091" class="footnote">39</a>]</sup>&#32780;&#19988;&#22240;&#20026;&#20320;&#21487;&#20197;&#25913;&#21464;&#20462;&#35746;&#29256;&#26412;&#30340;&#23646;&#24615;&#65292;&#32780;&#19981;&#38656;&#35201;&#36981;&#29031;&#26102;&#38388;&#39034;&#24207;&#8212;&#20320;&#21487;&#22312;&#20219;&#20309;&#26102;&#21051;&#20462;&#25913;&#20219;&#20309;&#20462;&#35746;&#29256;&#26412;&#30340;&#23646;&#24615;&#8212;&#22240;&#27492;&#26368;&#26032;&#29256;&#26412;&#30340;&#22686;&#37327;&#22791;&#20221;&#19981;&#20250;&#25429;&#25417;&#21040;&#20197;&#21069;&#29305;&#23450;&#20462;&#35746;&#29256;&#26412;&#30340;&#23646;&#24615;&#20462;&#25913;&#12290;
               </p>
               <p>&#36890;&#24120;&#35828;&#26469;&#65292;&#22312;&#27599;&#27425;&#25552;&#20132;&#26102;&#65292;&#21482;&#26377;&#22916;&#24819;&#29378;&#25165;&#20250;&#22791;&#20221;&#25972;&#20010;&#29256;&#26412;&#24211;&#65292;&#28982;&#32780;&#65292;&#20551;&#35774;&#19968;&#20010;&#32473;&#23450;&#30340;&#29256;&#26412;&#24211;&#25317;&#26377;&#19968;&#20123;&#24688;&#24403;&#31890;&#24230;&#30340;&#20887;&#20313;&#26426;&#21046;(&#22914;&#27599;&#27425;&#25552;&#20132;&#30340;&#37038;&#20214;)&#12290;&#29256;&#26412;&#24211;&#31649;&#29702;&#21592;&#20063;&#35768;&#20250;&#24076;&#26395;&#23558;&#29256;&#26412;&#24211;&#30340;&#28909;&#22791;&#20221;&#24341;&#20837;&#21040;&#31995;&#32479;&#32423;&#30340;&#27599;&#22812;&#22791;&#20221;&#65292;&#23545;&#22823;&#22810;&#25968;&#29256;&#26412;&#24211;&#65292;&#24402;&#26723;&#30340;&#25552;&#20132;&#37038;&#20214;&#20026;&#20445;&#23384;&#36164;&#28304;&#25552;&#20379;&#20102;&#36275;&#22815;&#30340;&#20887;&#20313;&#25514;&#26045;&#65292;&#33267;&#23569;&#23545;&#20110;&#26368;&#36817;&#30340;&#25552;&#20132;&#12290;&#20294;&#26159;&#23427;&#26159;&#20320;&#30340;&#25968;&#25454;&#8212;&#20320;&#21916;&#27426;&#24590;&#26679;&#20445;&#25252;&#37117;&#21487;&#20197;&#12290;</p>
               <p>Often, the best approach to repository backups is a
                          diversified one that leverages combinations of the methods
                          described here.  The Subversion developers, for example, back
                          up the Subversion source code repository nightly using
                          <span class="command"><strong>hot-backup.py</strong></span> and an off-site
                          <span class="command"><strong>rsync</strong></span> of those full backups; keep multiple
                          archives of all the commit and property change notification
                          emails; and have repository mirrors maintained by various
                          volunteers using <span class="command"><strong>svnsync</strong></span>.  Your solution
                          might be similar, but should be catered to your needs and that
                          delicate balance of convenience with paranoia.  And whatever
                          you do, validate your backups from time to time&#8212;what
                          good is a spare tire that has a hole in it?  While all of this
                          might not save your hardware from the iron fist of Fate,
                          <sup>[<a name="d0e11110" href="#ftn.d0e11110" class="footnote">40</a>]</sup>
                          it should certainly help you recover from those trying 
                          times.
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.reposadmin.maint.uuids"></a>5.4.9.&nbsp;&#31649;&#29702;&#29256;&#26412;&#24211;&#30340; UUID
                        </h3>
                     </div>
                  </div>
               </div>
               <p>Subversion repositories have a universally unique
                          identifier (UUID) associated with them.  This is used by
                          Subversion clients to verify the identity of a repository when
                          other forms of verification aren't good enough (such as
                          checking the repository URL, which can change over time).
                          Most Subversion repository administrators rarely, if ever,
                          need to think about repository UUIDs as anything more than a
                          trivial implementation detail of Subversion.  Sometimes,
                          however, there is cause for attention to this detail.
               </p>
               <p>As a general rule, you want the UUIDs of your live
                          repositories to be unique.  That is, after all, the point of
                          having UUIDs.  But there are times when you want the
                          repository UUIDs of two repositories to be exactly the same.
                          For example, if you make a copy of a repository for backup
                          purposes, you want the backup to be a perfect replica of the
                          original so that, in the event that you have to restore that
                          backup and replace the live repository, users don't suddenly
                          see what looks like a different repository.  When dumping and
                          loading repository history (as described earlier in <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.migrate" title="5.4.5.&nbsp;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;">&#31532;&nbsp;5.4.5&nbsp;&#33410; &#8220;&#29256;&#26412;&#24211;&#25968;&#25454;&#30340;&#31227;&#26893;&#8221;</a>), you get to decide
                          whether to apply the UUID encapsulated in the data dump
                          stream to the repository in which you are loading the data.  The
                          particular circumstance will dictate the correct
                          behavior.
               </p>
               <p>There are a couple of ways to set (or reset) a
                          repository's UUID, should you need to.  As of Subversion 1.5,
                          this is as simple as using the <span class="command"><strong>svnadmin
                                setuuid</strong></span> command.  If you provide this subcommand
                          with an explicit UUID, it will validate that the UUID is
                          well-formed and then set the repository UUID to that value.
                          If you omit the UUID, a brand-new UUID will be generated for
                          your repository.
               </p><pre class="screen">
$ svnlook uuid /var/svn/repos
cf2b9d22-acb5-11dc-bc8c-05e83ce5dbec
$ svnadmin setuuid /var/svn/repos   # generate a new UUID
$ svnlook uuid /var/svn/repos
3c3c38fe-acc0-11dc-acbc-1b37ff1c8e7c
$ svnadmin setuuid /var/svn/repos \
           cf2b9d22-acb5-11dc-bc8c-05e83ce5dbec  # restore the old UUID
$ svnlook uuid /var/svn/repos
cf2b9d22-acb5-11dc-bc8c-05e83ce5dbec
$
</pre><p>For folks using versions of Subversion earlier than 1.5,
                          these tasks are a little more complicated.  You can explicitly
                          set a repository's UUID by piping a repository dump file stub
                          that carries the new UUID specification through
                          <strong class="userinput"><code>svnadmin load --force-uuid <em class="replaceable"><code>REPOS-PATH</code></em></code></strong>.
               </p><pre class="screen">
$ svnadmin load --force-uuid /var/svn/repos &lt;&lt;EOF
SVN-fs-dump-format-version: 2

UUID: cf2b9d22-acb5-11dc-bc8c-05e83ce5dbec
EOF
$ svnlook uuid /var/svn/repos
cf2b9d22-acb5-11dc-bc8c-05e83ce5dbec
$
</pre><p>Having older versions of Subversion generate a brand-new
                          UUID is not quite as simple to do, though.  Your best bet here
                          is to find some other way to generate a UUID, and then
                          explicitly set the repository's UUID to that value.
               </p>
            </div>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.reposadmin.maint.moving-and-removing"></a>5.5.&nbsp;&#31227;&#21160;&#21644;&#21024;&#38500;&#29256;&#26412;&#24211;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Subversion repository data is wholly contained within the
                     repository directory.  As such, you can move a Subversion
                     repository to some other location on disk, rename a repository,
                     copy a repository, or delete a repository altogether using the
                     tools provided by your operating system for manipulating
                     directories&#8212;<span class="command"><strong>mv</strong></span>, <span class="command"><strong>cp
                           -a</strong></span>, and <span class="command"><strong>rm -r</strong></span> on Unix platforms;
                     <span class="command"><strong>copy</strong></span>, <span class="command"><strong>move</strong></span>, and
                     <span class="command"><strong>rmdir /s /q</strong></span> on Windows; vast numbers of mouse
                     and menu gyrations in various graphical file explorer
                     applications, and so on.
            </p>
            <p>Of course, there's often still more to be done when trying
                     to cleanly affect changes such as this.  For example, you might
                     need to update your Subversion server configuration to point to
                     the new location of a relocated repository or to remove
                     configuration bits for a now-deleted repository.  If you have
                     automated processes that publish information from or about your
                     repositories, they may need to be updated.  Hook scripts might
                     need to be reconfigured.  Users may need to be notified.  The list
                     can go on indefinitely, or at least to the extent that you've
                     built processes and procedures around your Subversion
                     repository.
            </p>
            <p>In the case of a copied repository, you should also consider
                     the fact that Subversion uses repository UUIDs to distinguish
                     repositories.  If you copy a Subversion repository using a
                     typical shell recursive copy command, you'll wind up with two
                     repositories that are identical in every way&#8212;including their UUIDs.
                     In some circumstances, this might be desirable.  But in the
                     instances where it is not, you'll need to generate a new UUID
                     for one of these identical repositories.  See <a class="xref" href="svn.reposadmin.html#svn.reposadmin.maint.uuids" title="5.4.9.&nbsp;&#31649;&#29702;&#29256;&#26412;&#24211;&#30340; UUID">&#31532;&nbsp;5.4.9&nbsp;&#33410; &#8220;&#31649;&#29702;&#29256;&#26412;&#24211;&#30340; UUID&#8221;</a> for more about managing
                     repository UUIDs.
            </p>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.reposadmin.summary"></a>5.6.&nbsp;&#24635;&#32467;
                     </h2>
                  </div>
               </div>
            </div>
            <p>By now you should have a basic understanding of how to
                     create, configure, and maintain Subversion repositories.  We
                     introduced you to the various tools that will assist you with
                     this task.  Throughout the chapter, we noted common
                     administration pitfalls and offered suggestions for avoiding
                     them.
            </p>
            <p>&#21097;&#19979;&#30340;&#65292;&#23601;&#26159;&#30001;&#20320;&#20915;&#23450;&#22312;&#20320;&#30340;&#29256;&#26412;&#24211;&#20013;&#23384;&#25918;&#19968;&#20123;&#20160;&#20040;&#26377;&#36259;&#30340;&#36164;&#26009;&#65292;&#24182;&#26368;&#32456;&#36890;&#36807;&#32593;&#32476;&#33719;&#24471;&#36825;&#20123;&#36164;&#26009;&#12290;&#19979;&#19968;&#31456;&#26159;&#20851;&#20110;&#32593;&#32476;&#30340;&#20869;&#23481;&#12290;</p>
         </div>
         <div class="footnotes"><br><hr width="100" align="left">
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e9179" href="#d0e9179" class="para">27</a>] </sup>&#36825;&#21487;&#33021;&#21548;&#36215;&#26469;&#24456;&#23815;&#39640;&#65292; &#20294;&#25105;&#20204;&#25152;&#25351;&#30340;&#21482;&#26159;&#37027;&#20123;&#23545;&#31649;&#29702;&#21035;&#20154;&#24037;&#20316;&#21103;&#26412;&#25968;&#25454;&#20043;&#22806;&#30340;&#31070;&#31192;&#39046;&#22495;&#24863;&#20852;&#36259;&#30340;&#20154;&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e9285" href="#d0e9285" class="para">28</a>] </sup>&#26080;&#35770;&#26159;&#22312;&#24573;&#30053;&#24773;&#20917;&#19979;&#24314;&#31435;&#25110;&#24456;&#23569;&#32771;&#34385;&#36807;&#22914;&#20309;&#20135;&#29983;&#27491;&#30830;&#30340;&#36719;&#20214;&#24320;&#21457;&#30697;&#38453;&#65292;&#37117;&#19981;&#24212;&#35813;&#24858;&#34850;&#30340;&#25285;&#24515;&#20840;&#23616;&#30340;&#20462;&#35746;&#29256;&#26412;&#21495;&#30721;&#65292;&#36825;&#19981;&#24212;&#35813;&#25104;&#20026;&#23433;&#25490;&#39033;&#30446;&#21644;&#29256;&#26412;&#24211;&#30340;&#29702;&#30001;&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e9309" href="#d0e9309" class="para">29</a>] </sup>The <code class="filename">trunk</code>, <code class="filename">tags</code>, 
                              and <code class="filename">branches</code> trio is sometimes referred
                              to as &#8220;<span class="quote">the TTB directories.</span>&#8221;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e9379" href="#d0e9379" class="para">30</a>] </sup>&#36890;&#24120;&#35835;&#20316;&#8220;<span class="quote">fuzz-fuzz</span>&#8221;, &#22914;&#26524;Jack Repenning&#35828;&#36215;&#36825;&#20010;&#38382;&#39064;&#12290;(&#26412;&#20070;&#65292;&#20551;&#23450;&#35835;&#32773;&#35748;&#20026;&#26159;&#8220;<span class="quote">eff-ess-eff-ess</span>&#8221;&#12290;)
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e9532" href="#d0e9532" class="para">31</a>] </sup>Berkeley DB&#38656;&#35201;&#24213;&#23618;&#30340;&#25991;&#20214;&#31995;&#32479;&#23454;&#29616;&#20005;&#26684;&#30340;POSIX&#38145;&#23450;&#35821;&#27861;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#65292;&#23558;&#25991;&#20214;&#30452;&#25509;&#26144;&#23556;&#21040;&#20869;&#23384;&#30340;&#33021;&#21147;&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e9579" href="#d0e9579" class="para">32</a>] </sup>Oracle&#22312;2006&#24773;&#20154;&#33410;&#36141;&#20080;&#20102;Sleepycat&#21644;&#23427;&#30340;&#26071;&#33328;&#36719;&#20214;Berkeley DB&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e9966" href="#d0e9966" class="para">33</a>] </sup>&#25110;&#32773;&#26159;, &#8220;<span class="quote">sync</span>&#8221; &#65311;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e10262" href="#d0e10262" class="para">34</a>] </sup>For example, hard drive + huge electromagnet = disaster.
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e10493" href="#d0e10493" class="para">35</a>] </sup>&#37027;&#23601;&#26159;&#20320;&#26159;&#29992;&#29256;&#26412;&#25511;&#21046;&#30340;&#21407;&#22240;&#65292;&#23545;&#21527;&#65311;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e10642" href="#d0e10642" class="para">36</a>] </sup>&#23613;&#31649;<span class="command"><strong>svnadmin dump</strong></span>&#23545;&#26159;&#21542;&#20197;&#26012;&#32447;&#20316;&#20026;&#36335;&#24452;&#30340;&#24320;&#22836;&#26377;&#32479;&#19968;&#30340;&#35268;&#23450;&#8212;&#36825;&#20010;&#35268;&#23450;&#23601;&#26159;&#19981;&#20197;&#26012;&#32447;&#20316;&#20026;&#36335;&#24452;&#30340;&#24320;&#22836;&#8212;&#20854;&#23427;&#29983;&#25104;&#36716;&#20648;&#25991;&#20214;&#30340;&#31243;&#24207;&#19981;&#19968;&#23450;&#20250;&#36981;&#23432;&#36825;&#20010;&#35268;&#23450;&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e10716" href="#d0e10716" class="para">37</a>] </sup>&#23454;&#38469;&#19978;&#65292;&#23427;&#19981;&#26159;&#30495;&#30340;&#23436;&#20840;&#21482;&#35835;&#65292;&#25110;&#32773;<span class="command"><strong>svnsync</strong></span>&#26412;&#36523;&#26377;&#26102;&#38388;&#23558;&#29256;&#26412;&#24211;&#21382;&#21490;&#25335;&#20837;&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e10863" href="#d0e10863" class="para">38</a>] </sup>&#35201;&#39044;&#20808;&#35686;&#21578;&#19968;&#19979;&#65292;&#23613;&#31649;&#23545;&#20110;&#26222;&#36890;&#35835;&#32773;&#21482;&#38656;&#35201;&#20960;&#31186;&#38047;&#23601;&#21487;&#20197;&#29702;&#35299;&#19979;&#38754;&#30340;&#36755;&#20986;&#65292;&#32780;&#23545;&#20110;&#25972;&#20010;&#38236;&#20687;&#36807;&#31243;&#33457;&#36153;&#30340;&#26102;&#38388;&#21487;&#33021;&#20250;&#38750;&#24120;&#38271;&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e11091" href="#d0e11091" class="para">39</a>] </sup><span class="command"><strong>svnadmin setlog</strong></span>&#21487;&#20197;&#34987;&#32469;&#36807;&#38057;&#23376;&#31243;&#24207;&#34987;&#35843;&#29992;&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e11110" href="#d0e11110" class="para">40</a>] </sup>&#20320;&#30693;&#36947;&#30340;&#8212;&#21482;&#26159;&#23545;&#21508;&#31181;&#21464;&#21270;&#33707;&#27979;&#30340;&#38382;&#39064;&#30340;&#32479;&#31216;&#12290;
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="svn.branchmerge.html">&#19978;&#19968;&#39029;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.serverconfig.html">&#19979;&#19968;&#39029;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;</td>
            </tr>
         </table>
      </div>
   </body>
</html>