<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>&#24207;&#35328;</title>
      <meta name="generator" content="DocBook XSL Stylesheets V1.73.2">
      <link rel="start" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;">
      <link rel="up" href="index.html" title="Subversion &#26435;&#23041;&#25351;&#21335;">
      <link rel="prev" href="svn.foreword.html" title="&#21069;&#35328;">
      <link rel="next" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;">
   </head>
   <body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF">
      <div class="navheader">
         <table width="100%" summary="Navigation header">
            <tr>
               <th colspan="3" align="center">&#24207;&#35328;</th>
            </tr>
            <tr>
               <td width="20%" align="left"><a accesskey="p" href="svn.foreword.html">&#19978;&#19968;&#39029;</a>&nbsp;
               </td>
               <th width="60%" align="center">&nbsp;</th>
               <td width="20%" align="right">&nbsp;<a accesskey="n" href="svn.basic.html">&#19979;&#19968;&#39029;</a></td>
            </tr>
         </table>
         <hr>
      </div>
      <div class="preface" lang="zh-cn">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title"><a name="svn.preface"></a>&#24207;&#35328;
                  </h2>
               </div>
            </div>
         </div>
         <div class="toc">
            <p><b>&#30446;&#24405;</b></p>
            <dl>
               <dt><span class="sect1"><a href="svn.preface.html#svn.preface.audience">1. &#35835;&#32773;</a></span></dt>
               <dt><span class="sect1"><a href="svn.preface.html#svn.preface.howread">2. &#24590;&#26679;&#38405;&#35835;&#26412;&#20070;</a></span></dt>
               <dt><span class="sect1"><a href="svn.preface.html#svn.preface.conventions">3. &#26412;&#20070;&#32422;&#23450;</a></span></dt>
               <dt><span class="sect1"><a href="svn.preface.html#svn.preface.organization">4. &#26412;&#20070;&#30340;&#32467;&#26500;</a></span></dt>
               <dt><span class="sect1"><a href="svn.preface.html#svn.preface.free">5. &#26412;&#20070;&#26159;&#20813;&#36153;&#30340;</a></span></dt>
               <dt><span class="sect1"><a href="svn.preface.html#svn.preface.acks">6. &#33268;&#35874;</a></span></dt>
               <dd>
                  <dl>
                     <dt><span class="sect2"><a href="svn.preface.html#svn.preface.acks.sussman">6.1. &#26469;&#33258; Ben Collins-Sussman</a></span></dt>
                     <dt><span class="sect2"><a href="svn.preface.html#svn.preface.acks.fitz">6.2. &#26469;&#33258; Brian W. Fitzpatrick</a></span></dt>
                     <dt><span class="sect2"><a href="svn.preface.html#svn.preface.acks.cmpilato">6.3. &#26469;&#33258; C. Michael Pilato</a></span></dt>
                  </dl>
               </dd>
               <dt><span class="sect1"><a href="svn.preface.html#svn.intro.whatis">7. Subversion &#26159;&#20160;&#20040;&#65311;</a></span></dt>
               <dd>
                  <dl>
                     <dt><span class="sect2"><a href="svn.preface.html#svn.intro.righttool">7.1. Subversion &#26159;&#27491;&#30830;&#30340;&#24037;&#20855;&#21527;&#65311;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.preface.html#svn.intro.history">7.2. Subversion &#30340;&#21382;&#21490;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.preface.html#svn.intro.architecture">7.3. Subversion &#30340;&#26550;&#26500;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.preface.html#svn.intro.components">7.4. Subversion &#30340;&#32452;&#20214;</a></span></dt>
                     <dt><span class="sect2"><a href="svn.preface.html#svn.intro.whatsnew">7.5. Subversion &#26377;&#20160;&#20040;&#26032;&#19996;&#35199;&#65311;</a></span></dt>
                  </dl>
               </dd>
            </dl>
         </div>
         <div class="blockquote">
            <table border="0" width="100%" cellspacing="0" cellpadding="0" class="blockquote" summary="Block quote">
               <tr>
                  <td width="10%" valign="top">&nbsp;</td>
                  <td width="80%" valign="top">
                     <p>&#8220;<span class="quote">&#21363;&#20351;&#20320;&#33021;&#30830;&#35748;&#20160;&#20040;&#26159;&#23436;&#32654;&#65292;&#20063;&#19981;&#35201;&#35753;&#23436;&#32654;&#25104;&#20026;&#22909;&#30340;&#25932;&#20154;&#65292;&#26356;&#20309;&#20917;&#20320;&#19981;&#33021;&#30830;&#35748;&#12290;&#22240;&#20026;&#33853;&#20837;&#36807;&#21435;&#38519;&#38449;&#30340;&#19981;&#24742;&#65292;&#20320;&#20250;&#22312;&#35774;&#35745;&#26102;&#22240;&#20026;&#25285;&#24515;&#33258;&#24049;&#30340;&#32570;&#38519;&#32780;&#26080;&#25152;&#20316;&#20026;&#12290;</span>&#8221;
                     </p>
                  </td>
                  <td width="10%" valign="top">&nbsp;</td>
               </tr>
               <tr>
                  <td width="10%" valign="top">&nbsp;</td>
                  <td colspan="2" align="right" valign="top">--<span class="attribution">Greg Hudson&#65292;Subversion&#24320;&#21457;&#32773;</span></td>
               </tr>
            </table>
         </div>
         <p><a class="indexterm" name="d0e177"></a>&#22312;&#24320;&#28304;&#36719;&#20214;&#19990;&#30028;&#65292;&#38271;&#20037;&#20197;&#26469;&#65292;&#24182;&#34892;&#29256;&#26412;&#31995;&#32479;(CVS)&#19968;&#30452;&#26159;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#30340;&#21807;&#19968;&#36873;&#25321;&#12290;&#20107;&#23454;&#35777;&#26126;&#65292;&#36825;&#20010;&#36873;&#25321;&#19981;&#38169;&#12290;CVS &#30340;&#33258;&#30001;&#36719;&#20214;&#36523;&#20221;&#65292;&#26080;&#32422;&#26463;&#30340;<span class="foreignphrase"><em class="foreignphrase">&#22788;&#20107;&#24577;&#24230;</em></span>&#65292;&#21644;&#23545;&#32593;&#32476;&#21270;&#25805;&#20316;&#30340;&#25903;&#25345;(&#32593;&#32476;&#20351;&#20247;&#22810;&#36523;&#22788;&#19981;&#21516;&#22320;&#26041;&#30340;&#31243;&#24207;&#21592;&#21487;&#20197;&#20849;&#20139;&#20182;&#20204;&#30340;&#24037;&#20316;&#25104;&#26524;)&#65292;&#27491;&#31526;&#21512;&#20102;&#24320;&#28304;&#19990;&#30028;&#21327;&#20316;&#30340;&#31934;&#31070;&#65292;CVS &#21644;&#23427;&#21322;&#28151;&#20081;&#29366;&#24577;&#30340;&#24320;&#21457;&#27169;&#24335;&#24050;&#25104;&#20026;&#24320;&#28304;&#25991;&#21270;&#30340;&#22522;&#30707;&#12290;
         </p>
         <p>&#20294;&#26159;&#65292;CVS &#20063;&#24182;&#19981;&#26159;&#27809;&#26377;&#32570;&#38519;&#65292;&#32780;&#20462;&#27491;&#36825;&#20123;&#32570;&#38519;&#35201;&#32791;&#36153;&#24456;&#22823;&#30340;&#31934;&#21147;&#12290;&#32780; Subversion &#21017;&#26159;&#20197; CVS &#32487;&#20219;&#32773;&#30340;&#38754;&#30446;&#20986;&#29616;&#30340;&#26032;&#22411;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;Subversion &#30340;&#35774;&#35745;&#32773;&#20204;&#21147;&#22270;&#36890;&#36807;&#20004;&#26041;&#38754;&#30340;&#21162;&#21147;&#36194;&#24471; CVS &#29992;&#25143;&#30340;&#38738;&#30544;&#65306;&#20445;&#25345;&#24320;&#28304;&#31995;&#32479;&#30340;&#35774;&#35745;(&#20197;&#21450;&#8220;<span class="quote">&#30028;&#38754;&#39118;&#26684;</span>&#8221;)&#19982; CVS &#23613;&#21487;&#33021;&#31867;&#20284;&#65292;&#21516;&#26102;&#23613;&#21147;&#24357;&#34917; CVS &#35768;&#22810;&#26174;&#33879;&#30340;&#32570;&#38519;&#12290;&#36825;&#20123;&#21162;&#21147;&#30340;&#32467;&#26524;&#20351;&#24471;&#20174; CVS &#36801;&#31227;&#21040; Subversion &#19981;&#38656;&#35201;&#20316;&#20986;&#37325;&#22823;&#30340;&#21464;&#38761;&#65292;Subversion &#30830;&#23454;&#26159;&#38750;&#24120;&#24378;&#22823;&#12289;&#38750;&#24120;&#26377;&#29992;&#21644;&#38750;&#24120;&#28789;&#27963;&#30340;&#24037;&#20855;&#12290;&#24182;&#19988;&#24456;&#37325;&#35201;&#30340;&#19968;&#28857;&#65292;&#20960;&#20046;&#25152;&#26377;&#26032;&#30340;&#24320;&#28304;&#39033;&#30446;&#37117;&#36873;&#25321;&#20102;
            Subversion &#26367;&#20195; CVS&#12290;
         </p>
         <p>&#26412;&#20070;&#26159;&#20026; Subversion 1.6 &#31995;&#21015;&#25776;&#20889;&#30340;&#12290;&#22312;&#20070;&#20013;&#65292;&#25105;&#20204;&#23613;&#21147;&#28085;&#30422; Subversion &#30340;&#25152;&#26377;&#20869;&#23481;&#12290;&#20294;&#26159;&#65292;Subversion &#26377;&#19968;&#20010;&#20852;&#30427;&#21644;&#20805;&#28385;&#27963;&#21147;&#30340;&#24320;&#21457;&#31038;&#21306;&#65292;&#24050;&#26377;&#35768;&#22810;&#26032;&#30340;&#29305;&#24615;&#21644;&#25913;&#36827;&#25514;&#26045;&#35745;&#21010;&#22312; Subversion &#26032;&#29256;&#26412;&#20013;&#23454;&#29616;&#65292;&#26412;&#20070;&#20013;&#35762;&#36848;&#30340;&#21629;&#20196;&#21644;&#29305;&#24615;&#21487;&#33021;&#20250;&#26377;&#25152;&#21464;&#21270;&#12290;</p>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.preface.audience"></a>1.&nbsp;&#35835;&#32773;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#26412;&#20070;&#26159;&#20026;&#20102;&#37027;&#20123;&#22312;&#35745;&#31639;&#26426;&#39046;&#22495;&#26377;&#20016;&#23500;&#30693;&#35782;&#65292;&#24182;&#19988;&#24076;&#26395;&#20351;&#29992; Subversion &#31649;&#29702;&#25968;&#25454;&#30340;&#20154;&#22763;&#20934;&#22791;&#30340;&#12290;&#23613;&#31649; Subversion &#21487;&#20197;&#22312;&#22810;&#31181;&#19981;&#21516;&#30340;&#25805;&#20316;&#31995;&#32479;&#19978;&#36816;&#34892;&#65292;&#20294;&#20854;&#22522;&#26412;&#29992;&#25143;&#25805;&#20316;&#30028;&#38754;&#26159;&#22522;&#20110;&#21629;&#20196;&#34892;&#30340;&#65292;&#20063;&#23601;&#26159;&#25105;&#20204;&#23558;&#35201;&#22312;&#26412;&#20070;&#20013;&#35762;&#36848;&#21644;&#20351;&#29992;&#30340;&#21629;&#20196;&#34892;&#24037;&#20855;(<span class="command"><strong>svn</strong></span>)&#12290;
            </p>
            <p>&#20986;&#20110;&#19968;&#33268;&#24615;&#30340;&#32771;&#34385;&#65292;&#26412;&#20070;&#30340;&#20363;&#23376;&#20551;&#23450;&#35835;&#32773;&#20351;&#29992;&#30340;&#26159;&#31867; Unix &#30340;&#25805;&#20316;&#31995;&#32479;&#65292;&#24182;&#19988;&#29087;&#24713; Unix &#21644;&#21629;&#20196;&#34892;&#30028;&#38754;&#12290;&#24403;&#28982;&#65292;<span class="command"><strong>svn</strong></span> &#31243;&#24207;&#20063;&#21487;&#20197;&#22312;&#22914; Microsoft Windows &#36825;&#26679;&#30340;&#38750; Unix &#24179;&#21488;&#19978;&#36816;&#34892;&#65292;&#38500;&#20102;&#19968;&#20123;&#24494;&#23567;&#30340;&#19981;&#21516;&#65292;&#22914;&#20351;&#29992;&#21453;&#26012;&#32447;(<code class="literal">\</code>)&#20195;&#26367;&#27491;&#26012;&#32447;(<code class="literal">/</code>)&#20316;&#20026;&#36335;&#24452;&#20998;&#38548;&#31526;&#65292;&#22312; Windows &#19978;&#36816;&#34892; svn &#31243;&#24207;&#30340;&#36755;&#20837;&#21644;&#36755;&#20986;&#19982;&#22312; Unix &#24179;&#21488;&#19978;&#36816;&#34892;&#23436;&#20840;&#19968;&#33268;&#12290;
            </p>
            <p>&#22823;&#22810;&#25968;&#35835;&#32773;&#21487;&#33021;&#26159;&#37027;&#20123;&#38656;&#35201;&#36319;&#36394;&#20195;&#30721;&#21464;&#21270;&#30340;&#31243;&#24207;&#21592;&#25110;&#32773;&#31995;&#32479;&#31649;&#29702;&#21592;&#65292;&#36825;&#26159; Subversion &#26368;&#26222;&#36941;&#30340;&#29992;&#36884;&#65292;&#22240;&#27492;&#36825;&#20010;&#22330;&#26223;&#36143;&#31359;&#20110;&#25972;&#26412;&#20070;&#30340;&#20363;&#23376;&#20013;&#12290;&#20294;&#26159; Subversion &#21487;&#20197;&#29992;&#26469;&#31649;&#29702;&#20219;&#20309;&#31867;&#22411;&#30340;&#25968;&#25454;&#65306;&#22270;&#20687;&#12289;&#38899;&#20048;&#12289;&#25968;&#25454;&#24211;&#12289;&#25991;&#26723;&#31561;&#31561;&#12290;&#23545;&#20110; Subversion&#65292;&#25968;&#25454;&#23601;&#26159;&#25968;&#25454;&#32780;&#24050;&#12290;</p>
            <p>&#26412;&#20070;&#20551;&#23450;&#35835;&#32773;&#20174;&#26469;&#27809;&#26377;&#20351;&#29992;&#36807;&#20219;&#20309;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#65292;&#21516;&#26102;&#65292;&#25105;&#20204;&#20063;&#21162;&#21147;&#20351; CVS (&#25110;&#20854;&#20182;&#31995;&#32479;)&#29992;&#25143;&#33021;&#22815;&#36731;&#26494;&#30340;&#25237;&#20837;&#21040; Subversion &#30340;&#20351;&#29992;&#24403;&#20013;&#65292;&#22312;&#20391;&#26639;&#19981;&#26102;&#20250;&#20986;&#29616;&#19968;&#20123;&#28041;&#21450; CVS &#30340;&#20869;&#23481;&#65292;&#27492;&#22806;&#65292;&#22312;&#38468;&#24405;&#30340;&#19968;&#20010;&#31456;&#33410;&#20013;&#24635;&#32467;&#20102; Subversion &#21644; CVS
               &#30340;&#21306;&#21035;&#12290;
            </p>
            <p>&#38656;&#35201;&#35828;&#26126;&#30340;&#26159;&#65292;&#25152;&#26377;&#28304;&#20195;&#30721;&#31034;&#20363;&#20165;&#20165;&#26159;&#20363;&#23376;&#32780;&#24050;&#12290;&#36825;&#20123;&#20363;&#23376;&#38656;&#35201;&#36890;&#36807;&#27491;&#30830;&#32534;&#35793;&#22120;&#21442;&#25968;&#36827;&#34892;&#32534;&#35793;&#65292;&#22312;&#36825;&#37324;&#21015;&#20030;&#23427;&#20204;&#21482;&#26159;&#20026;&#20102;&#35828;&#26126;&#29305;&#23450;&#30340;&#22330;&#26223;&#65292;&#24182;&#38750;&#20026;&#20102;&#23637;&#31034;&#20248;&#31168;&#30340;&#32534;&#30721;&#39118;&#26684;&#25110;&#23454;&#36341;&#12290;</p>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.preface.howread"></a>2.&nbsp;&#24590;&#26679;&#38405;&#35835;&#26412;&#20070;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#25216;&#26415;&#20070;&#31821;&#32463;&#24120;&#35201;&#38754;&#23545;&#36825;&#26679;&#20004;&#38590;&#30340;&#22256;&#22659;&#65306;&#26159;&#36814;&#21512;<em class="firstterm">&#33258;&#19978;&#33267;&#19979;</em>&#30340;&#21021;&#23398;&#32773;&#65292;&#36824;&#26159;<em class="firstterm">&#33258;&#19979;&#33267;&#19978;</em>&#30340;&#21021;&#23398;&#32773;&#12290;&#19968;&#20010;&#33258;&#19978;&#33267;&#19979;&#30340;&#23398;&#20064;&#32773;&#20250;&#21916;&#27426;&#30053;&#35835;&#25991;&#26723;&#65292;&#24471;&#21040;&#23545;&#31995;&#32479;&#24037;&#20316;&#21407;&#29702;&#30340;&#24635;&#20307;&#30475;&#27861;&#65307;&#28982;&#21518;&#22905;&#25165;&#20250;&#24320;&#22987;&#23454;&#38469;&#20351;&#29992;&#36719;&#20214;&#12290;&#32780;&#19968;&#20010;&#33258;&#19979;&#33267;&#19978;&#30340;&#23398;&#20064;&#32773;&#65292;&#26159;&#8220;<span class="quote">&#36890;&#36807;&#23454;&#36341;&#23398;&#20064;</span>&#8221;&#30340;&#20154;&#65292;&#22905;&#24076;&#26395;&#24555;&#36895;&#30340;&#24320;&#22987;&#20351;&#29992;&#36719;&#20214;&#65292;&#33258;&#24049;&#39046;&#20250;&#36719;&#20214;&#30340;&#20351;&#29992;&#65292;&#21482;&#22312;&#24517;&#35201;&#26102;&#35835;&#21462;&#30456;&#20851;&#31456;&#33410;&#12290;&#22823;&#22810;&#25968;&#22270;&#20070;&#20250;&#20542;&#21521;&#20110;&#38024;&#23545;&#26576;&#19968;&#31867;&#35835;&#32773;&#65292;&#32780;&#26412;&#20070;&#27627;&#26080;&#30097;&#38382;&#20542;&#21521;&#20110;&#33258;&#19978;&#33267;&#19979;&#30340;&#26041;&#27861;&#12290;(&#22914;&#26524;&#20320;&#38405;&#35835;&#20102;&#26412;&#33410;&#65292;&#37027;&#20320;&#20063;&#19968;&#23450;&#26159;&#19968;&#20010;&#33258;&#19978;&#33267;&#19979;&#30340;&#23398;&#20064;&#32773;&#65281;)&#28982;&#32780;&#65292;&#22914;&#26524;&#20320;&#26159;&#33258;&#19979;&#33267;&#19978;&#30340;&#20154;&#65292;&#19981;&#35201;&#22833;&#26395;&#12290;&#26412;&#20070;&#20197;
               Subversion &#20026;&#20027;&#39064;&#30340;&#24191;&#27867;&#35266;&#23519;&#36827;&#34892;&#32452;&#32455;&#65292;&#27599;&#20010;&#31456;&#33410;&#37117;&#21253;&#21547;&#20102;&#22823;&#37327;&#21487;&#20197;&#23581;&#35797;&#30340;&#35814;&#32454;&#23454;&#20363;&#12290;&#22914;&#26524;&#20320;&#24076;&#26395;&#39532;&#19978;&#24320;&#24037;&#65292;&#27809;&#26377;&#32784;&#24515;&#31561;&#24453;&#65292;&#20320;&#21487;&#20197;&#30475;<a class="xref" href="svn.intro.html" title="&#38468;&#24405;&nbsp;A.&nbsp;Subversion &#24555;&#36895;&#20837;&#38376;&#25351;&#21335;">&#38468;&#24405;&nbsp;A, <i>Subversion &#24555;&#36895;&#20837;&#38376;&#25351;&#21335;</i></a>&#12290;
            </p>
            <p>&#26412;&#20070;&#36866;&#29992;&#20110;&#20855;&#26377;&#19981;&#21516;&#32972;&#26223;&#30693;&#35782;&#30340;&#21508;&#20010;&#23618;&#27425;&#30340;&#35835;&#32773;&#8212;&#20174;&#26410;&#20351;&#29992;&#36807;&#29256;&#26412;&#25511;&#21046;&#30340;&#26032;&#25163;&#21040;&#32463;&#39564;&#20016;&#23500;&#30340;&#31995;&#32479;&#31649;&#29702;&#21592;&#37117;&#33021;&#22815;&#20174;&#26412;&#20070;&#20013;&#33719;&#30410;&#12290;&#26681;&#25454;&#22522;&#30784;&#30340;&#19981;&#21516;&#65292;&#26576;&#20123;&#30340;&#31456;&#33410;&#21487;&#33021;&#23545;&#26576;&#20123;&#35835;&#32773;&#26356;&#26377;&#20215;&#20540;&#12290;&#19979;&#38754;&#30340;&#20869;&#23481;&#21487;&#20197;&#30475;&#20316;&#26159;&#20026;&#19981;&#21516;&#31867;&#22411;&#30340;&#35835;&#32773;&#25552;&#20379;&#30340;&#8220;<span class="quote">&#25512;&#33616;&#38405;&#35835;&#28165;&#21333;</span>&#8221;&#65306;
            </p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term">&#36164;&#28145;&#31995;&#32479;&#31649;&#29702;&#21592;</span></dt>
                  <dd>
                     <p>&#20551;&#23450;&#20320;&#20174;&#21069;&#20351;&#29992;&#36807;&#29256;&#26412;&#25511;&#21046;&#65292;&#24182;&#19988;&#36843;&#20999;&#38656;&#35201;&#24314;&#31435;&#36215; Subversion &#26381;&#21153;&#22120;&#24182;&#23613;&#24555;&#36816;&#34892;&#36215;&#26469;&#65292;<a class="xref" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;">&#31532;&nbsp;5&nbsp;&#31456; <i>&#29256;&#26412;&#24211;&#31649;&#29702;</i></a>&#21644;<a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a>&#23558;&#20250;&#21578;&#35785;&#20320;&#22914;&#20309;&#24314;&#31435;&#36215;&#19968;&#20010;&#29256;&#26412;&#24211;&#65292;&#24182;&#23558;&#20854;&#22312;&#32593;&#32476;&#19978;&#21457;&#24067;&#12290;&#27492;&#21518;&#65292;&#20381;&#38752;&#20320;&#30340; CVS &#20351;&#29992;&#32463;&#39564;&#65292;<a class="xref" href="svn.tour.html" title="&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#22522;&#26412;&#20351;&#29992;">&#31532;&nbsp;2&nbsp;&#31456; <i>&#22522;&#26412;&#20351;&#29992;</i></a>&#21644;<a class="xref" href="svn.forcvs.html" title="&#38468;&#24405;&nbsp;B.&nbsp;CVS &#29992;&#25143;&#30340; Subversion &#25351;&#21335;">&#38468;&#24405;&nbsp;B, <i>CVS &#29992;&#25143;&#30340; Subversion &#25351;&#21335;</i></a>&#23558;&#21521;&#20320;&#23637;&#31034;&#24590;&#26679;&#20351;&#29992; Subversion &#23458;&#25143;&#31471;&#36719;&#20214;&#12290;
                     </p>
                  </dd>
                  <dt><span class="term">&#26032;&#29992;&#25143;</span></dt>
                  <dd>
                     <p>&#22914;&#26524;&#31649;&#29702;&#21592;&#24050;&#32463;&#20026;&#20320;&#20934;&#22791;&#22909;&#20102; Subversion &#26381;&#21153;&#65292;&#20320;&#25152;&#38656;&#35201;&#30340;&#26159;&#23398;&#20064;&#22914;&#20309;&#20351;&#29992;&#23458;&#25143;&#31471;&#12290;&#22914;&#26524;&#20320;&#27809;&#26377;&#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;(&#20687; CVS)&#30340;&#32463;&#39564;&#65292;&#37027;&#20040;<a class="xref" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;">&#31532;&nbsp;1&nbsp;&#31456; <i>&#22522;&#26412;&#27010;&#24565;</i></a>&#21644;<a class="xref" href="svn.tour.html" title="&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#22522;&#26412;&#20351;&#29992;">&#31532;&nbsp;2&nbsp;&#31456; <i>&#22522;&#26412;&#20351;&#29992;</i></a>&#26159;&#37325;&#35201;&#30340;&#20837;&#38376;&#25945;&#31243;&#65292;&#20854;&#20013;&#20171;&#32461;&#20102;&#29256;&#26412;&#25511;&#21046;&#30340;&#37325;&#35201;&#24605;&#24819;&#12290;
                     </p>
                  </dd>
                  <dt><span class="term">&#39640;&#32423;&#29992;&#25143;</span></dt>
                  <dd>
                     <p>&#26080;&#35770;&#26159;&#29992;&#25143;&#36824;&#26159;&#31649;&#29702;&#21592;&#65292;&#39033;&#30446;&#32456;&#23558;&#20250;&#22766;&#22823;&#36215;&#26469;&#12290;&#37027;&#26102;&#65292;&#23601;&#38656;&#35201;&#23398;&#20064;&#26356;&#22810; Subversion &#30340;&#39640;&#32423;&#21151;&#33021;&#65292;&#20687;&#22914;&#20309;&#20351;&#29992;&#20998;&#25903;&#21644;&#25191;&#34892;&#21512;&#24182;(<a class="xref" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;">&#31532;&nbsp;4&nbsp;&#31456; <i>&#20998;&#25903;&#19982;&#21512;&#24182;</i></a>)&#12289;&#24590;&#26679;&#20351;&#29992; Subversion &#30340;&#23646;&#24615;(<a class="xref" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;">&#31532;&nbsp;3&nbsp;&#31456; <i>&#39640;&#32423;&#20027;&#39064;</i></a>)&#12289;&#24590;&#26679;&#37197;&#21046;&#36816;&#34892;&#21442;&#25968;(<a class="xref" href="svn.customization.html" title="&#31532;&nbsp;7&nbsp;&#31456;&nbsp;&#23450;&#21046;&#20320;&#30340; Subversion &#20307;&#39564;">&#31532;&nbsp;7&nbsp;&#31456; <i>&#23450;&#21046;&#20320;&#30340; Subversion &#20307;&#39564;</i></a>)&#31561;&#31561;&#12290;&#36825;&#20004;&#31456;&#22312;&#23398;&#20064;&#30340;&#21021;&#26399;&#24182;&#19981;&#37325;&#35201;&#65292;&#20294;&#29087;&#24713;&#20102;&#22522;&#26412;&#25805;&#20316;&#20043;&#21518;&#36824;&#26159;&#38750;&#24120;&#26377;&#24517;&#35201;&#20102;&#35299;&#19968;&#19979;&#12290;
                     </p>
                  </dd>
                  <dt><span class="term">&#24320;&#21457;&#32773;</span></dt>
                  <dd>
                     <p>&#20320;&#24212;&#35813;&#24050;&#32463;&#24456;&#29087;&#24713; Subversion &#20102;&#65292;&#24182;&#19988;&#24819;&#25193;&#23637;&#23427;&#25110;&#20351;&#29992;&#23427;&#30340; API &#24320;&#21457;&#26032;&#36719;&#20214;&#12290;<a class="xref" href="svn.developer.html" title="&#31532;&nbsp;8&nbsp;&#31456;&nbsp;&#23884;&#20837; Subversion">&#31532;&nbsp;8&nbsp;&#31456; <i>&#23884;&#20837; Subversion</i></a>&#23558;&#26368;&#36866;&#21512;&#20320;&#12290;
                     </p>
                  </dd>
               </dl>
            </div>
            <p>&#26412;&#20070;&#20197;&#21442;&#32771;&#26448;&#26009;&#20316;&#20026;&#32467;&#26463; &#8212; <a class="xref" href="svn.ref.html" title="&#31532;&nbsp;9&nbsp;&#31456;&nbsp;Subversion &#23436;&#20840;&#21442;&#32771;">&#31532;&nbsp;9&nbsp;&#31456; <i>Subversion &#23436;&#20840;&#21442;&#32771;</i></a>&#26159;&#19968;&#37096; Subversion &#20840;&#37096;&#21629;&#20196;&#30340;&#35814;&#32454;&#25351;&#21335;&#65292;&#27492;&#22806;&#65292;&#22312;&#38468;&#24405;&#20013;&#36824;&#26377;&#35768;&#22810;&#24456;&#26377;&#24847;&#20041;&#30340;&#20027;&#39064;&#12290;&#38405;&#35835;&#23436;&#26412;&#20070;&#21518;&#65292;&#36825;&#20123;&#31456;&#33410;&#23558;&#20250;&#26159;&#20320;&#32463;&#24120;&#26597;&#38405;&#30340;&#20869;&#23481;&#12290;
            </p>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.preface.conventions"></a>3.&nbsp;&#26412;&#20070;&#32422;&#23450;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#26412;&#33410;&#25551;&#36848;&#20102;&#26412;&#20070;&#20013;&#20351;&#29992;&#30340;&#21508;&#31181;&#32422;&#23450;&#12290;</p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term">
                                  <strong class="userinput"><code>&#31561;&#23485;&#23383;&#20307;</code></strong>
                                </span></dt>
                  <dd>
                     <p>&#29992;&#20110;&#29992;&#25143;&#30340;&#21407;&#25991;&#36755;&#20837;&#65292;&#21629;&#20196;&#36755;&#20986;&#21644;&#21629;&#20196;&#34892;&#36873;&#39033;</p>
                  </dd>
                  <dt><span class="term">
                                  <code class="filename">&#26012;&#20307;</code>
                                </span></dt>
                  <dd>
                     <p>Used for program and Subversion tool subcommand
                                    names, file and directory names, and new terms
                     </p>
                  </dd>
                  <dt><span class="term">
                                  <em class="replaceable"><code>&#31561;&#23485;&#23383;&#20307;</code></em>
                                </span></dt>
                  <dd>
                     <p>&#29992;&#20110;&#20195;&#30721;&#21644;&#25991;&#26412;&#20013;&#30340;&#21487;&#26367;&#25442;&#37096;&#20998;</p>
                  </dd>
               </dl>
            </div>
            <p>Also, we sprinkled especially helpful or important bits of
                     information throughout the book (in contextually relevant
                     locations), set off visually so they're easy to find.  Look for
                     the following icons as you read:
            </p>
            <div class="note" style="margin-left: 0.5in; margin-right: 0.5in;">
               <table border="0" summary="Note">
                  <tr>
                     <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="images/note.png"></td>
                     <th align="left">&#27880;&#24847;</th>
                  </tr>
                  <tr>
                     <td align="left" valign="top">
                        <p>&#27492;&#22270;&#26631;&#34920;&#31034;&#26049;&#36793;&#30340;&#20869;&#23481;&#38656;&#29305;&#21035;&#27880;&#24847;&#12290;</p>
                     </td>
                  </tr>
               </table>
            </div>
            <div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;">
               <table border="0" summary="Tip">
                  <tr>
                     <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#25552;&#31034;]" src="images/tip.png"></td>
                     <th align="left">&#25552;&#31034;</th>
                  </tr>
                  <tr>
                     <td align="left" valign="top">
                        <p>&#27492;&#22270;&#26631;&#34920;&#31034;&#26049;&#36793;&#25551;&#36848;&#20102;&#19968;&#20010;&#26377;&#29992;&#30340;&#23567;&#25216;&#24039;&#12290;</p>
                     </td>
                  </tr>
               </table>
            </div>
            <div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;">
               <table border="0" summary="Warning">
                  <tr>
                     <td rowspan="2" align="center" valign="top" width="25"><img alt="[&#35686;&#21578;]" src="images/warning.png"></td>
                     <th align="left">&#35686;&#21578;</th>
                  </tr>
                  <tr>
                     <td align="left" valign="top">
                        <p>&#27492;&#22270;&#26631;&#34920;&#31034;&#35686;&#21578;&#12290;&#27880;&#24847;&#36825;&#20123;&#24773;&#20917;&#20197;&#20813;&#20986;&#29616;&#38382;&#39064;&#12290;</p>
                     </td>
                  </tr>
               </table>
            </div>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.preface.organization"></a>4.&nbsp;&#26412;&#20070;&#30340;&#32467;&#26500;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#20197;&#19979;&#26159;&#21508;&#20010;&#31456;&#33410;&#30340;&#20869;&#23481;&#20171;&#32461;&#65306;</p>
            <div class="variablelist">
               <dl>
                  <dt><span class="term"><a class="xref" href="svn.basic.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;">&#31532;&nbsp;1&nbsp;&#31456; <i>&#22522;&#26412;&#27010;&#24565;</i></a></span></dt>
                  <dd>
                     <p>&#20171;&#32461;&#20102;&#29256;&#26412;&#25511;&#21046;&#30340;&#22522;&#30784;&#30693;&#35782;&#21450;&#19981;&#21516;&#30340;&#29256;&#26412;&#27169;&#22411;&#65292;&#21516;&#26102;&#35762;&#36848;&#20102; Subversion &#29256;&#26412;&#24211;&#65292;&#24037;&#20316;&#21103;&#26412;&#21644;&#20462;&#35746;&#29256;&#26412;&#30340;&#27010;&#24565;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.tour.html" title="&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#22522;&#26412;&#20351;&#29992;">&#31532;&nbsp;2&nbsp;&#31456; <i>&#22522;&#26412;&#20351;&#29992;</i></a></span></dt>
                  <dd>
                     <p>&#24341;&#39046;&#20320;&#24320;&#22987;&#19968;&#20010; Subversion &#29992;&#25143;&#30340;&#24037;&#20316;&#12290;&#31034;&#33539;&#24590;&#26679;&#20351;&#29992; Subversion &#33719;&#24471;&#12289;&#20462;&#25913;&#21644;&#25552;&#20132;&#25968;&#25454;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.advanced.html" title="&#31532;&nbsp;3&nbsp;&#31456;&nbsp;&#39640;&#32423;&#20027;&#39064;">&#31532;&nbsp;3&nbsp;&#31456; <i>&#39640;&#32423;&#20027;&#39064;</i></a></span></dt>
                  <dd>
                     <p>&#35206;&#30422;&#20102;&#35768;&#22810;&#26222;&#36890;&#29992;&#25143;&#26368;&#32456;&#35201;&#38754;&#23545;&#30340;&#22797;&#26434;&#29305;&#24615;&#65292;&#20363;&#22914;&#29256;&#26412;&#21270;&#30340;&#20803;&#25968;&#25454;&#12289;&#25991;&#20214;&#38145;&#23450;&#21644; peg &#20462;&#35746;&#29256;&#26412;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.branchmerge.html" title="&#31532;&nbsp;4&nbsp;&#31456;&nbsp;&#20998;&#25903;&#19982;&#21512;&#24182;">&#31532;&nbsp;4&nbsp;&#31456; <i>&#20998;&#25903;&#19982;&#21512;&#24182;</i></a></span></dt>
                  <dd>
                     <p>&#35752;&#35770;&#20998;&#25903;&#12289;&#21512;&#24182;&#19982;&#26631;&#31614;&#65292;&#21253;&#25324;&#26368;&#20339;&#23454;&#36341;&#30340;&#20171;&#32461;&#65292;&#24120;&#35265;&#29992;&#20363;&#30340;&#25551;&#36848;&#65292;&#24590;&#26679;&#21462;&#28040;&#20462;&#25913;&#65292;&#20197;&#21450;&#24590;&#26679;&#20174;&#19968;&#20010;&#20998;&#25903;&#36716;&#21040;&#21478;&#19968;&#20010;&#20998;&#25903;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.reposadmin.html" title="&#31532;&nbsp;5&nbsp;&#31456;&nbsp;&#29256;&#26412;&#24211;&#31649;&#29702;">&#31532;&nbsp;5&nbsp;&#31456; <i>&#29256;&#26412;&#24211;&#31649;&#29702;</i></a></span></dt>
                  <dd>
                     <p>&#35762;&#36848; Subversion &#29256;&#26412;&#24211;&#30340;&#22522;&#26412;&#27010;&#24565;&#65292;&#24590;&#26679;&#24314;&#31435;&#12289;&#37197;&#32622;&#21644;&#32500;&#25252;&#29256;&#26412;&#24211;&#65292;&#20197;&#21450;&#21738;&#20123;&#24037;&#20855;&#21487;&#20197;&#23436;&#25104;&#19978;&#36848;&#30340;&#24037;&#20316;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.serverconfig.html" title="&#31532;&nbsp;6&nbsp;&#31456;&nbsp;&#26381;&#21153;&#37197;&#32622;">&#31532;&nbsp;6&nbsp;&#31456; <i>&#26381;&#21153;&#37197;&#32622;</i></a></span></dt>
                  <dd>
                     <p>&#25551;&#36848;&#20102;&#22914;&#20309;&#37197;&#32622; Subversion &#26381;&#21153;&#22120;&#65292;&#20197;&#21450;&#19977;&#31181;&#35775;&#38382;&#29256;&#26412;&#24211;&#30340;&#26041;&#24335;&#65292;<code class="literal">HTTP</code>&#12289;<code class="literal">svn</code> &#21327;&#35758;&#21644;&#26412;&#22320;&#30913;&#30424;&#35775;&#38382;&#12290;&#36825;&#37324;&#20063;&#20171;&#32461;&#20102;&#35748;&#35777;&#65292;&#25480;&#26435;&#19982;&#21311;&#21517;&#35775;&#38382;&#30340;&#32454;&#33410;&#12290;
                     </p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.customization.html" title="&#31532;&nbsp;7&nbsp;&#31456;&nbsp;&#23450;&#21046;&#20320;&#30340; Subversion &#20307;&#39564;">&#31532;&nbsp;7&nbsp;&#31456; <i>&#23450;&#21046;&#20320;&#30340; Subversion &#20307;&#39564;</i></a></span></dt>
                  <dd>
                     <p>&#30740;&#31350;&#20102; Subversion &#30340;&#23458;&#25143;&#31471;&#37197;&#32622;&#25991;&#20214;&#65292;&#23545;&#22269;&#38469;&#21270;&#23383;&#31526;&#30340;&#22788;&#29702;&#65292;&#20197;&#21450; Subversion &#22914;&#20309;&#19982;&#22806;&#32622;&#24037;&#20855;&#20132;&#20114;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.developer.html" title="&#31532;&nbsp;8&nbsp;&#31456;&nbsp;&#23884;&#20837; Subversion">&#31532;&nbsp;8&nbsp;&#31456; <i>&#23884;&#20837; Subversion</i></a></span></dt>
                  <dd>
                     <p>&#20171;&#32461;&#20102; Subversion &#30340;&#20869;&#37096;&#20449;&#24687;&#12289;Subversion &#30340;&#25991;&#20214;&#31995;&#32479;&#65292;&#20197;&#21450;&#31243;&#24207;&#21592;&#30524;&#20013;&#30340;&#24037;&#20316;&#21103;&#26412;&#31649;&#29702;&#21306;&#65292;&#23637;&#31034;&#20102;&#22914;&#20309;&#20351;&#29992;&#20844;&#20849; API &#32534;&#20889; Subversion &#24212;&#29992;&#31243;&#24207;&#12290;&#26368;&#37325;&#35201;&#30340;&#20869;&#23481;&#26159;&#65292;&#22914;&#20309;&#20026; Subversion &#30340;&#24320;&#21457;&#36129;&#29486;&#21147;&#37327;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.ref.html" title="&#31532;&nbsp;9&nbsp;&#31456;&nbsp;Subversion &#23436;&#20840;&#21442;&#32771;">&#31532;&nbsp;9&nbsp;&#31456; <i>Subversion &#23436;&#20840;&#21442;&#32771;</i></a></span></dt>
                  <dd>
                     <p>&#20197;&#22823;&#37327;&#30340;&#23454;&#20363;&#65292;&#35814;&#32454;&#25551;&#36848;&#20102; <span class="command"><strong>svn</strong></span>&#12289;<span class="command"><strong>svnadmin</strong></span> &#21644; <span class="command"><strong>svnlook</strong></span> &#30340;&#25152;&#26377;&#23376;&#21629;&#20196;&#12290;
                     </p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.intro.html" title="&#38468;&#24405;&nbsp;A.&nbsp;Subversion &#24555;&#36895;&#20837;&#38376;&#25351;&#21335;">&#38468;&#24405;&nbsp;A, <i>Subversion &#24555;&#36895;&#20837;&#38376;&#25351;&#21335;</i></a></span></dt>
                  <dd>
                     <p>&#23545;&#20110;&#32570;&#20047;&#32784;&#24515;&#30340;&#23478;&#20249;&#65292;&#25105;&#20204;&#20250;&#31435;&#21051;&#35299;&#37322;&#22914;&#20309;&#23433;&#35013;&#21644;&#20351;&#29992; Subversion&#65292;&#25105;&#20204;&#24050;&#32463;&#35686;&#21578;&#20320;&#20102;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.forcvs.html" title="&#38468;&#24405;&nbsp;B.&nbsp;CVS &#29992;&#25143;&#30340; Subversion &#25351;&#21335;">&#38468;&#24405;&nbsp;B, <i>CVS &#29992;&#25143;&#30340; Subversion &#25351;&#21335;</i></a></span></dt>
                  <dd>
                     <p>&#35814;&#32454;&#27604;&#36739;&#20102; Subversion &#19982; CVS &#30340;&#24322;&#21516;&#65292;&#24182;&#38024;&#23545;&#22914;&#20309;&#28040;&#38500;&#22810;&#24180;&#20351;&#29992; CVS &#20859;&#25104;&#30340;&#22351;&#20064;&#24815;&#25552;&#20986;&#24314;&#35758;&#12290;&#20869;&#23481;&#21253;&#25324; Subversion &#20462;&#35746;&#29256;&#26412;&#21495;&#12289;&#29256;&#26412;&#21270;&#30340;&#30446;&#24405;&#12289;&#31163;&#32447;&#25805;&#20316;&#12289;<span class="command"><strong>update</strong></span> &#19982; <span class="command"><strong>status</strong></span> &#30340;&#23545;&#27604;&#12289;&#20998;&#25903;&#12289;&#26631;&#31614;&#12289;&#20803;&#25968;&#25454;&#12289;&#20914;&#31361;&#22788;&#29702;&#21644;&#35748;&#35777;&#12290;
                     </p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.webdav.html" title="&#38468;&#24405;&nbsp;C.&nbsp;WebDAV &#21644;&#33258;&#21160;&#29256;&#26412;">&#38468;&#24405;&nbsp;C, <i>WebDAV &#21644;&#33258;&#21160;&#29256;&#26412;</i></a></span></dt>
                  <dd>
                     <p>&#25551;&#36848;&#20102;WebDAV &#19982; DeltaV &#30340;&#32454;&#33410;&#65292;&#24182;&#20171;&#32461;&#20102;&#22914;&#20309;&#23558; Subversion &#29256;&#26412;&#24211;&#20316;&#20026;&#21487;&#35835;/&#20889;&#30340; DAV &#20849;&#20139;&#35013;&#36733;&#12290;</p>
                  </dd>
                  <dt><span class="term"><a class="xref" href="svn.copyright.html" title="&#38468;&#24405;&nbsp;D.&nbsp;&#29256;&#26435;">&#38468;&#24405;&nbsp;D, <i>&#29256;&#26435;</i></a></span></dt>
                  <dd>
                     <p>Creative Commons Attribution License &#30340;&#21103;&#26412;&#65292;&#26412;&#20070;&#30340;&#35768;&#21487;&#35777;&#12290;</p>
                  </dd>
               </dl>
            </div>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.preface.free"></a>5.&nbsp;&#26412;&#20070;&#26159;&#20813;&#36153;&#30340;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#26412;&#20070;&#26368;&#21021;&#26159;&#20316;&#20026; Subversion &#39033;&#30446;&#30340;&#25991;&#26723;&#65292;&#24182;&#30001; Subversion &#30340;&#24320;&#21457;&#32773;&#24320;&#22987;&#25776;&#20889;&#30340;&#65292;&#21518;&#26469;&#25104;&#20026;&#19968;&#20010;&#29420;&#31435;&#30340;&#39033;&#30446;&#24182;&#36827;&#34892;&#20102;&#37325;&#20889;&#12290;&#19982; Subversion &#30456;&#21516;&#65292;&#23427;&#22987;&#32456;&#25353;&#20813;&#36153;&#35768;&#21487;&#35777;(&#21442;&#35265; <a class="xref" href="svn.copyright.html" title="&#38468;&#24405;&nbsp;D.&nbsp;&#29256;&#26435;">&#38468;&#24405;&nbsp;D, <i>&#29256;&#26435;</i></a>)&#21457;&#24067;&#12290;&#20107;&#23454;&#19978;&#65292;&#26412;&#20070;&#26159;&#22312;&#20844;&#20247;&#30340;&#20851;&#27880;&#20013;&#20889;&#20986;&#26469;&#30340;&#65292;&#26368;&#21021;&#26159; Subversion &#39033;&#30446;&#30340;&#19968;&#37096;&#20998;&#65292;&#36825;&#26377;&#20004;&#31181;&#21547;&#20041;&#65306;
            </p>
            <div class="itemizedlist">
               <ul type="disc">
                  <li>
                     <p>&#24635;&#21487;&#20197;&#22312; Subversion &#30340;&#29256;&#26412;&#24211;&#37324;&#25214;&#21040;&#26412;&#20070;&#30340;&#26368;&#26032;&#29256;&#26412;&#12290;</p>
                  </li>
                  <li>
                     <p>&#21487;&#20197;&#20219;&#24847;&#20998;&#21457;&#25110;&#20462;&#25913;&#26412;&#20070; &#8212; &#23427;&#22312;&#33258;&#30001;&#35768;&#21487;&#35777;&#30340;&#25511;&#21046;&#20043;&#19979;&#12290;&#20320;&#30340;&#21807;&#19968;&#38480;&#21046;&#26159;&#24517;&#39035;&#20445;&#30041;&#27491;&#30830;&#30340;&#26368;&#21021;&#20316;&#32773;&#12290;&#24403;&#28982;&#65292;&#19982;&#20854;&#29420;&#33258;&#21457;&#24067;&#31169;&#26377;&#29256;&#26412;&#65292;&#19981;&#22914;&#21521; Subversion &#24320;&#21457;&#31038;&#21306;&#25552;&#20379;&#21453;&#39304;&#21644;&#20462;&#27491;&#20449;&#24687;&#12290;</p>
                  </li>
               </ul>
            </div>
            <p>&#26412;&#20070;&#30340;&#22312;&#32447;&#20027;&#39029;&#21644;&#35768;&#22810;&#24535;&#24895;&#32773;&#30340;&#32763;&#35793;&#24037;&#20316;&#20301;&#20110; <a class="ulink" href="http://svnbook.red-bean.com" target="_top">http://svnbook.red-bean.com</a>&#12290;&#22312;&#36825;&#20010;&#32593;&#31449;&#19978;&#65292;&#20320;&#21487;&#20197;&#25214;&#21040;&#26412;&#20070;&#26368;&#26032;&#24555;&#29031;&#21644;&#26631;&#31614;&#29256;&#26412;&#30340;&#38142;&#25509;&#30340;&#21508;&#31181;&#26684;&#24335;&#65292;&#20197;&#21450;&#35775;&#38382;&#26412;&#20070;&#30340; Subversion &#29256;&#26412;&#24211;(&#23384;&#25918; DocBook XML &#28304;&#25991;&#20214;)&#30340;&#25351;&#20196;&#12290;&#25105;&#20204;&#27426;&#36814;&#21644;&#40723;&#21169;&#21453;&#39304;&#12290;&#35831;&#23558;&#25152;&#26377;&#30340;&#35780;&#35770;&#12289;&#25265;&#24616;&#21644;&#23545;&#26412;&#20070;&#28304;&#25991;&#20214;&#30340;&#34917;&#19969;&#21457;&#36865;&#21040; <code class="email">&lt;<a class="email" href="mailto:svnbook-dev@red-bean.com">svnbook-dev@red-bean.com</a>&gt;</code>&#12290;
            </p>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.preface.acks"></a>6.&nbsp;&#33268;&#35874;
                     </h2>
                  </div>
               </div>
            </div>
            <p>&#27809;&#26377; Subversion &#23601;&#19981;&#21487;&#33021;&#26377;(&#21363;&#20351;&#26377;&#20063;&#27809;&#20160;&#20040;&#20215;&#20540;)&#36825;&#26412;&#20070;&#12290;&#25152;&#20197;&#20316;&#32773;&#34935;&#24515;&#24863;&#35874; Brian Behlendorf &#21644; CollabNet&#65292;&#20182;&#20204;&#29420;&#21040;&#30340;&#30524;&#20809;&#24320;&#21019;&#20102;&#36825;&#20010;&#20805;&#28385;&#20882;&#38505;&#20294;&#38596;&#24515;&#21187;&#21187;&#30340;&#24320;&#28304;&#39033;&#30446;&#65307;Jim Blandy &#36129;&#29486;&#20102; Subversion
               &#26368;&#21021;&#30340;&#21517;&#23383;&#21644;&#35774;&#35745; &#8212; &#25105;&#20204;&#29233;&#20320;&#65292;Jim&#12290;&#36824;&#26377; Karl Fogel&#65292;&#19968;&#20010;&#22909;&#26379;&#21451;&#21644;&#20255;&#22823;&#30340;&#31038;&#21306;&#39046;&#34966;&#12290;<sup>[<a name="d0e480" href="#ftn.d0e480" class="footnote">1</a>]</sup></p>
            <p>&#24863;&#35874; O'Reilly &#21644;&#25105;&#20204;&#30340;&#32534;&#36753;&#65306;Chuck Toporek&#12289;Linda Mui&#12289;Tatiana Apandi&#12289;Mary Brady &#21644; Mary Treseler&#12290;&#20182;&#20204;&#30340;&#32784;&#24515;&#21644;&#25903;&#25345;&#26159;&#24040;&#22823;&#30340;&#12290;</p>
            <p>&#26368;&#21518;&#65292;&#25105;&#20204;&#35201;&#24863;&#35874;&#25968;&#19981;&#28165;&#30340;&#26366;&#32463;&#20026;&#26412;&#20070;&#20316;&#20986;&#36129;&#29486;&#30340;&#20154;&#20204;&#65292;&#20182;&#20204;&#36827;&#34892;&#20102;&#38750;&#27491;&#24335;&#30340;&#23457;&#38405;&#65292;&#24182;&#32473;&#20986;&#20102;&#22823;&#37327;&#24314;&#35758;&#21644;&#20462;&#25913;&#24847;&#35265;&#12290;&#34429;&#28982;&#26080;&#27861;&#21015;&#20986;&#19968;&#20010;&#23436;&#25972;&#30340;&#21015;&#34920;&#65292;&#20294;&#26412;&#20070;&#30340;&#23436;&#25972;&#21644;&#27491;&#30830;&#31163;&#19981;&#24320;&#20182;&#20204;&#65306;Bhuvaneswaran A, David Alber, C. Scott Ananian,
               David Anderson, Ariel Arjona, Seth Arnold, Jani Averbach, Charles Bailey, Ryan Barrett, Francois Beausoleil, Brian R. Becker,
               Yves Bergeron, Karl Berry, Jennifer Bevan, Matt Blais, Jim Blandy, Phil Bordelon, Sietse Brouwer, Tom Brown, Zack Brown, Martin
               Buchholz, Paul Burba, Sean Callan-Hinsvark, Branko Cibej, Archie Cobbs, Jason Cohen, Ryan Cresawn, John R. Daily, Peter Davis,
               Olivier Davy, Robert P. J. Day, Mo DeJong, Brian Denny, Joe Drew, Markus Dreyer, Nick Duffek, Boris Dusek, Ben Elliston, Justin
               Erenkrantz, Jens M. Felderhoff, Kyle Ferrio, Shlomi Fish, Julian Foad, Chris Foote, Martin Furter, Vlad Georgescu, Peter Gervai,
               Dave Gilbert, Eric Gillespie, David Glasser, Marcel Gosselin, Lieven Govaerts, Steve Greenland, Matthew Gregan, Tom Gregory,
               Maverick Grey, Art Haas, Mark E. Hamilton, Eric Hanchrow, Liam Healy, Malte Helmert, Michael Henderson, &Oslash;yvind A. Holm, Greg
               Hudson, Alexis Huxley, Auke Jilderda, Toby Johnson, Jens B. Jorgensen, Tez Kamihira, David Kimdon, Mark Benedetto King, Robert
               Kleemann, Erik Kline, Josh Knowles, Andreas J. Koenig, Axel Kollmorgen, Nuutti Kotivuori, Kalin Kozhuharov, Matt Kraai, Regis
               Kuckaertz, Stefan Kueng, Steve Kunkee, Scott Lamb, Wesley J. Landaker, Benjamin Landsteiner, Vincent Lefevre, Morten Ludvigsen,
               Dennis Lundberg, Paul Lussier, Bruce A. Mah, Jonathon Mah, Karl Heinz Marbaise, Philip Martin, Feliciano Matias, Neil Mayhew,
               Patrick Mayweg, Gareth McCaughan, Craig McElroy, Simon McKenna, Christophe Meresse, Jonathan Metillon, Jean-Francois Michaud,
               Jon Middleton, Robert Moerland, Marcel Molina Jr., Tim Moloney, Alexander Mueller, Tabish Mustufa, Christopher Ness, Roman
               Neuhauser, Mats Nilsson, Greg Noel, Joe Orton, Eric Paire, Dimitri Papadopoulos-Orfanos, Jerry Peek, Chris Pepper, Amy Lyn
               Pilato, Kevin Pilch-Bisson, Hans Polak, Dmitriy Popkov, Michael Price, Mark Proctor, Steffen Prohaska, Daniel Rall, Srinivasa
               Ramanujan, Jack Repenning, Tobias Ringstrom, Jason Robbins, Garrett Rooney, Joel Rosdahl, Christian Sauer, Ryan Schmidt, Jochem
               Schulenklopper, Jens Seidel, Daniel Shahaf, Larry Shatzer, Danil Shopyrin, Erik Sjoelund, Joey Smith, W. Snyder, Stefan Sperling,
               Robert Spier, M. S. Sriram, Russell Steicke, David Steinbrunner, Sander Striker, David Summers, Johan Sundstroem, Ed Swierk,
               John Szakmeister, Arfrever Frehtes Taifersar Arahesis, Robert Tasarz, Michael W. Thelen, Mason Thomas, Erik van der Kolk,
               Joshua Varner, Eric Wadsworth, Chris Wagner, Colin Watson, Alex Waugh, Chad Whitacre, Andy Whitcroft, Josef Wolf, Luke Worth,
               Hyrum Wright, Blair Zajac, Florian Zumbiehl, &#20197;&#21450;&#25972;&#20010; Subversion &#31038;&#21306;&#12290;
            </p>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.preface.acks.sussman"></a>6.1.&nbsp;&#26469;&#33258; Ben Collins-Sussman
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#24863;&#35874;&#25105;&#30340;&#22971;&#23376; Frances&#65292;&#22312;&#22909;&#20960;&#20010;&#26376;&#37324;&#65292;&#25105;&#19968;&#30452;&#22312;&#23545;&#20320;&#35828;&#65306;&#8220;<span class="quote">&#20294;&#26159;&#20146;&#29233;&#30340;&#65292;&#25105;&#36824;&#22312;&#20026;&#36825;&#26412;&#20070;&#24037;&#20316;</span>&#8221;&#65292;&#27492;&#22806;&#36824;&#26377;&#65292;&#8220;<span class="quote">&#20294;&#26159;&#20146;&#29233;&#30340;&#65292;&#25105;&#36824;&#22312;&#22788;&#29702;&#37038;&#20214;</span>&#8221;&#12290;&#25105;&#19981;&#30693;&#36947;&#22905;&#20026;&#20160;&#20040;&#20250;&#22914;&#27492;&#32784;&#24515;&#65281;&#22905;&#26159;&#25105;&#23436;&#32654;&#30340;&#24179;&#34913;&#28857;&#12290;
               </p>
               <p>&#24863;&#35874;&#25105;&#30340;&#23478;&#20154;&#21644;&#26379;&#21451;&#23545;&#25105;&#35802;&#25370;&#30340;&#40723;&#21169;&#65292;&#23613;&#31649;&#20182;&#20204;&#23545;&#25105;&#30340;&#35838;&#39064;&#19981;&#24863;&#20852;&#36259;&#12290;(&#20320;&#30693;&#36947;&#30340;&#65292;&#19968;&#20010;&#20154;&#35828; &#8220;<span class="quote">&#21703;&#65292;&#20320;&#27491;&#22312;&#20889;&#19968;&#26412;&#20070;&#65311;</span>&#8221;&#65292;&#28982;&#21518;&#24403;&#20182;&#30693;&#36947;&#20320;&#26159;&#20889;&#19968;&#26412;&#35745;&#31639;&#26426;&#20070;&#26102;&#65292;&#37027;&#31181;&#24778;&#35766;&#23601;&#21464;&#24471;&#27809;&#26377;&#37027;&#20040;&#22810;&#20102;&#12290;)
               </p>
               <p>&#24863;&#35874;&#25105;&#36523;&#36793;&#35753;&#25105;&#23500;&#26377;&#30340;&#26379;&#21451;&#65292;&#19981;&#35201;&#37027;&#26679;&#30475;&#25105; &#8212; &#20320;&#20204;&#30693;&#36947;&#20320;&#20204;&#26159;&#35841;&#12290;</p>
               <p>&#24863;&#35874;&#29238;&#27597;&#23545;&#25105;&#30340;&#20302;&#32423;&#26684;&#24335;&#21270;&#65292;&#21644;&#38590;&#20197;&#32622;&#20449;&#30340;&#35282;&#33394;&#20856;&#33539; &#65292;&#24863;&#35874;&#20799;&#23376;&#32473;&#25105;&#26426;&#20250;&#20256;&#25215;&#36825;&#20123;&#19996;&#35199;&#12290;</p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.preface.acks.fitz"></a>6.2.&nbsp;&#26469;&#33258; Brian W. Fitzpatrick
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#38750;&#24120;&#38750;&#24120;&#24863;&#35874;&#25105;&#30340;&#22971;&#23376; Marie &#30340;&#29702;&#35299;&#65292;&#25903;&#25345;&#21644;&#26368;&#37325;&#35201;&#30340;&#32784;&#24515;&#12290;&#24863;&#35874;&#24341;&#23548;&#25105;&#23398;&#20250; Unix &#32534;&#31243;&#30340;&#20804;&#24351; Eric&#65292;&#24863;&#35874;&#25105;&#30340;&#27597;&#20146;&#21644;&#31062;&#27597;&#30340;&#25903;&#25345;&#65292;&#23545;&#25105;&#22312;&#22307;&#35806;&#22812;&#37324;&#22475;&#22836;&#24037;&#20316;&#30340;&#29702;&#35299;&#12290;</p>
               <p>&#33268; Mike &#21644; Ben&#65306;&#19982;&#20320;&#20204;&#19968;&#36215;&#24037;&#20316;&#38750;&#24120;&#24555;&#20048;&#12290;Heck&#65292;&#25105;&#20204;&#22312;&#19968;&#36215;&#24037;&#20316;&#24456;&#24841;&#24555;&#65281;</p>
               <p>&#24863;&#35874;&#25152;&#26377;&#22312; Subversion &#21644; Apache &#36719;&#20214;&#22522;&#37329;&#20250;&#30340;&#20154;&#20204;&#32473;&#25105;&#26426;&#20250;&#19982;&#20320;&#20204;&#22312;&#19968;&#36215;&#65292;&#27809;&#26377;&#19968;&#22825;&#25105;&#19981;&#20174;&#20320;&#20204;&#37027;&#37324;&#23398;&#21040;&#30693;&#35782;&#12290;</p>
               <p>&#26368;&#21518;&#65292;&#24863;&#35874;&#25105;&#30340;&#31062;&#29238;&#65292;&#20182;&#19968;&#30452;&#36319;&#25105;&#35828;&#8220;<span class="quote">&#33258;&#30001;&#31561;&#20110;&#36131;&#20219;</span>&#8221;&#12290;&#25105;&#28145;&#20449;&#19981;&#30097;&#12290;
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.preface.acks.cmpilato"></a>6.3.&nbsp;&#26469;&#33258; C. Michael Pilato
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#29305;&#21035;&#24863;&#35874; Amy&#65292;&#25105; 10 &#24180;&#20013;&#38590;&#20197;&#32622;&#20449;&#30340;&#26368;&#22909;&#30340;&#26379;&#21451;&#21644;&#22971;&#23376;&#65292;&#22240;&#20026;&#22905;&#30340;&#29233;&#21644;&#32784;&#24515;&#25903;&#25345;&#65292;&#22240;&#20026;&#22905;&#25552;&#20379;&#30340;&#28145;&#22812;&#24037;&#20316;&#65292;&#22240;&#20026;&#22905;&#23545;&#25105;&#24378;&#21152;&#32473;&#22905;&#30340;&#29256;&#26412;&#25511;&#21046;&#36807;&#31243;&#30340;&#20248;&#38597;&#25345;&#20037;&#24525;&#21463; &#12290;&#19981;&#35201;&#25285;&#24515;&#65292;&#29980;&#24515; &#8212; &#20320;&#20250;&#31435;&#21051;&#25104;&#20026; TortoiseSVN &#24043;&#24072;&#65281;</p>
               <p>Gavin&#65292;&#25110;&#35768;&#29616;&#22312;&#26412;&#20070;&#30340;&#24456;&#22810;&#35789;&#20320;&#36824;&#19981;&#33021;&#35835;&#20986;&#26469;&#65307;&#24456;&#36951;&#25022;&#65292;&#23427;&#26159;&#25552;&#20379;&#20851;&#38190;&#27010;&#24565;&#30340;&#21478;&#19968;&#21322;&#12290;&#25265;&#27465;&#65292;Aidan - &#25105;&#19981;&#33021;&#25214;&#21040;&#23558; Disney/Pixar &#23383;&#31526;&#36716;&#25442;&#25104;&#25991;&#26412;&#30340;&#26041;&#27861;&#12290;&#20294;&#26159;&#65292;&#29240;&#29240;&#29233;&#20320;&#20204;&#65292;&#19981;&#33021;&#31561;&#24453;&#25945;&#20320;&#20204;&#32534;&#31243;&#30693;&#35782;&#12290;</p>
               <p>&#22920;&#22920;&#21644;&#29240;&#29240;&#65292;&#24863;&#35874;&#20320;&#20204;&#30340;&#25903;&#25345;&#21644;&#28909;&#24773;&#65292;&#23731;&#29238;&#23731;&#27597;&#65292;&#20197;&#21516;&#26679;&#30340;&#29702;&#30001;&#24863;&#35874;&#20320;&#20204;&#65292;&#36824;&#35201;&#24863;&#35874;&#20320;&#20204;&#38590;&#20197;&#32622;&#20449;&#30340;&#22899;&#20799;&#12290;</p>
               <p>&#21521;&#20320;&#20204;&#33268;&#25964;&#65306;Shep Kendall&#65292;&#20026;&#25105;&#25171;&#24320;&#20102;&#36890;&#21521;&#35745;&#31639;&#26426;&#19990;&#30028;&#30340;&#22823;&#38376;&#65307;Ben Collins-Sussman&#65292;&#25105;&#22312;&#24320;&#28304;&#19990;&#30028;&#30340;&#23548;&#24072;&#65307;Karl Fogel&#65292;&#20320;<span class="emphasis"><em>&#26159;</em></span>&#25105;&#30340; <code class="filename">.emacs</code>&#65307;Greg Stain&#65292;&#35753;&#25105;&#22312;&#32534;&#31243;&#23454;&#36341;&#22256;&#22659;&#20013;&#30693;&#36947;&#24590;&#26679;&#20570;&#65307;Brain Fitzpatrick&#65292;&#21516;&#25105;&#20998;&#20139;&#20182;&#30340;&#20889;&#20316;&#32463;&#39564;&#12290;&#25152;&#26377;&#25105;&#19968;&#30452;&#20174;&#20320;&#20204;&#37027;&#37324;&#33719;&#24471;&#26032;&#30693;&#35782;&#30340;&#20154;&#8212;&#23613;&#31649;&#21448;&#19981;&#26029;&#24536;&#35760;&#12290;
               </p>
               <p>&#26368;&#21518;&#65292;&#24863;&#35874;&#25152;&#26377;&#23545;&#25105;&#23637;&#29616;&#23436;&#32654;&#21331;&#36234;&#21019;&#36896;&#21147;&#30340;&#20154;&#20204;&#12290;</p>
            </div>
         </div>
         <div class="sect1" lang="zh-cn">
            <div class="titlepage">
               <div>
                  <div>
                     <h2 class="title" style="clear: both"><a name="svn.intro.whatis"></a>7.&nbsp;Subversion &#26159;&#20160;&#20040;&#65311;
                     </h2>
                  </div>
               </div>
            </div>
            <p>Subversion &#26159;&#19968;&#20010;&#33258;&#30001;/&#24320;&#28304;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#22312; Subversion &#31649;&#29702;&#19979;&#65292;&#25991;&#20214;&#21644;&#30446;&#24405;&#21487;&#20197;&#36229;&#36234;&#26102;&#31354;&#12290;&#20063;&#23601;&#26159; Subversion &#20801;&#35768;&#20320;&#25968;&#25454;&#24674;&#22797;&#21040;&#26089;&#26399;&#29256;&#26412;&#65292;&#25110;&#32773;&#26159;&#26816;&#26597;&#25968;&#25454;&#20462;&#25913;&#30340;&#21382;&#21490;&#12290;&#27491;&#22240;&#20026;&#22914;&#27492;&#65292;&#35768;&#22810;&#20154;&#23558;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#24403;&#20316;&#19968;&#31181;&#31070;&#22855;&#30340;&#8220;<span class="quote">&#26102;&#38388;&#26426;&#22120;</span>&#8221;&#12290;
            </p>
            <p>Subversion &#30340;&#29256;&#26412;&#24211;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#65292;&#20174;&#32780;&#20351;&#29992;&#25143;&#21487;&#20197;&#22312;&#19981;&#21516;&#30340;&#30005;&#33041;&#19978;&#36827;&#34892;&#25805;&#20316;&#12290;&#20174;&#26576;&#31181;&#31243;&#24230;&#19978;&#26469;&#35828;&#65292;&#20801;&#35768;&#29992;&#25143;&#22312;&#21508;&#33258;&#30340;&#31354;&#38388;&#37324;&#20462;&#25913;&#21644;&#31649;&#29702;&#21516;&#19968;&#32452;&#25968;&#25454;&#21487;&#20197;&#20419;&#36827;&#22242;&#38431;&#21327;&#20316;&#12290;&#22240;&#20026;&#20462;&#25913;&#19981;&#20877;&#26159;&#21333;&#32447;&#36827;&#34892;&#65292;&#24320;&#21457;&#36895;&#24230;&#20250;&#26356;&#24555;&#12290;&#27492;&#22806;&#65292;&#30001;&#20110;&#25152;&#26377;&#30340;&#24037;&#20316;&#37117;&#24050;&#29256;&#26412;&#21270;&#65292;&#20063;&#23601;&#19981;&#24517;&#25285;&#24515;&#30001;&#20110;&#38169;&#35823;&#30340;&#26356;&#25913;&#32780;&#24433;&#21709;&#36719;&#20214;&#36136;&#37327;&#8212;&#22914;&#26524;&#20986;&#29616;&#19981;&#27491;&#30830;&#30340;&#26356;&#25913;&#65292;&#21482;&#35201;&#25764;&#38144;&#37027;&#19968;&#27425;&#26356;&#25913;&#25805;&#20316;&#21363;&#21487;&#12290;</p>
            <p>&#26576;&#20123;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#26412;&#36523;&#20063;&#26159;&#36719;&#20214;&#37197;&#32622;&#31649;&#29702;(SCM)&#31995;&#32479;&#65292;&#36825;&#31181;&#31995;&#32479;&#32463;&#36807;&#31934;&#24039;&#30340;&#35774;&#35745;&#65292;&#19987;&#38376;&#29992;&#26469;&#31649;&#29702;&#28304;&#20195;&#30721;&#26641;&#65292;&#24182;&#19988;&#20855;&#22791;&#35768;&#22810;&#19982;&#36719;&#20214;&#24320;&#21457;&#26377;&#20851;&#30340;&#29305;&#24615;&#8212;&#27604;&#22914;&#65292;&#23545;&#32534;&#31243;&#35821;&#35328;&#30340;&#25903;&#25345;&#65292;&#25110;&#32773;&#25552;&#20379;&#31243;&#24207;&#26500;&#24314;&#24037;&#20855;&#12290;&#19981;&#36807; Subversion &#24182;&#19981;&#26159;&#36825;&#26679;&#30340;&#31995;&#32479;&#12290;&#23427;&#26159;&#19968;&#20010;&#36890;&#29992;&#31995;&#32479;&#65292;&#21487;&#20197;&#31649;&#29702;<span class="emphasis"><em>&#20219;&#20309;</em></span>&#31867;&#22411;&#30340;&#25991;&#20214;&#38598;&#12290;&#23545;&#20320;&#26469;&#35828;&#65292;&#36825;&#20123;&#25991;&#20214;&#36825;&#21487;&#33021;&#26159;&#28304;&#31243;&#24207;&#8212;&#32780;&#23545;&#21035;&#20154;&#65292;&#21017;&#21487;&#33021;&#26159;&#19968;&#20010;&#36135;&#29289;&#28165;&#21333;&#25110;&#32773;&#26159;&#25968;&#23383;&#30005;&#24433;&#12290;
            </p>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.intro.righttool"></a>7.1.&nbsp;Subversion &#26159;&#27491;&#30830;&#30340;&#24037;&#20855;&#21527;&#65311;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#22914;&#26524;&#20320;&#26159;&#19968;&#20010;&#32771;&#34385;&#22914;&#20309;&#20351;&#29992; Subversion &#30340;&#29992;&#25143;&#25110;&#31649;&#29702;&#21592;&#65292;&#20320;&#35201;&#38382;&#33258;&#24049;&#30340;&#31532;&#19968;&#20214;&#20107;&#23601;&#26159;&#65306; "&#36825;&#26159;&#36825;&#39033;&#24037;&#20316;&#30340;&#27491;&#30830;&#24037;&#20855;&#21527;&#65311;"&#65292;Subversion &#26159;&#19968;&#20010;&#26790;&#24187;&#33324;&#30340;&#38180;&#23376;&#65292;&#20294;&#35201;&#23567;&#24515;&#19981;&#35201;&#25226;&#20219;&#20309;&#38382;&#39064;&#24403;&#20316;&#38025;&#23376;&#12290;</p>
               <p>&#22914;&#26524;&#20320;&#24076;&#26395;&#24402;&#26723;&#25991;&#20214;&#21644;&#30446;&#24405;&#26087;&#29256;&#26412;&#65292;&#26377;&#21487;&#33021;&#35201;&#24674;&#22797;&#25110;&#38656;&#35201;&#26597;&#30475;&#26085;&#24535;&#33719;&#24471;&#20854;&#20462;&#25913;&#30340;&#21382;&#21490;&#65292;&#37027;&#20040; Subversion &#26159;&#20320;&#38656;&#35201;&#30340;&#24037;&#20855;&#12290;&#22914;&#26524;&#20320;&#38656;&#35201;&#21644;&#21035;&#20154;&#21327;&#20316;&#25991;&#26723;(&#36890;&#24120;&#36890;&#36807;&#32593;&#32476;)&#24182;&#36319;&#36394;&#25152;&#20570;&#30340;&#20462;&#25913;&#65292;&#37027;&#20040; Subversion &#20063;&#36866;&#21512;&#12290;&#36825;&#26159; Subversion &#20026;&#20160;&#20040;&#20351;&#29992;&#22312;&#36719;&#20214;&#24320;&#21457;&#29615;&#22659;&#8212;&#32534;&#31243;&#26159;&#19968;&#20214;&#22825;&#24615;&#30340;&#31038;&#20250;&#27963;&#21160;&#65292;Subversion
                  &#20351;&#24471;&#19982;&#20854;&#20182;&#31243;&#24207;&#21592;&#30340;&#20132;&#20114;&#21464;&#24471;&#31616;&#21333;&#12290;&#24403;&#28982;&#65292;&#20351;&#29992; Subversion &#20063;&#26377;&#20195;&#20215;&#65306;&#31649;&#29702;&#36127;&#25285;&#12290;&#20320;&#20250;&#38656;&#35201;&#31649;&#29702;&#19968;&#20010;&#23384;&#25918;&#25152;&#26377;&#21382;&#21490;&#30340;&#25968;&#25454;&#29256;&#26412;&#24211;&#65292;&#24182;&#38656;&#35201;&#32463;&#24120;&#30340;&#22791;&#20221;&#12290;&#32780;&#22312;&#26085;&#24120;&#30340;&#24037;&#20316;&#20013;&#65292;&#20320;&#19981;&#33021;&#20687;&#24448;&#24120;&#19968;&#26679;&#25335;&#36125;&#12289;&#31227;&#21160;&#12289;&#37325;&#21629;&#21517;&#25110;&#21024;&#38500;&#25991;&#20214;&#65292;&#30456;&#21453;&#65292;&#20320;&#38656;&#35201;&#36890;&#36807; Subversion
                  &#23436;&#25104;&#36825;&#20123;&#24037;&#20316;&#12290;
               </p>
               <p>&#20551;&#23450;&#20320;&#33021;&#22815;&#25509;&#21463;&#39069;&#22806;&#30340;&#24037;&#20316;&#27969;&#31243;&#65292;&#20320;&#19968;&#23450;&#35201;&#30830;&#23450;&#19981;&#35201;&#20351;&#29992; Subversion &#26469;&#35299;&#20915;&#20854;&#20182;&#24037;&#20855;&#33021;&#22815;&#23436;&#25104;&#30340;&#24456;&#22909;&#30340;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#22240;&#20026; Subversion &#20250;&#22797;&#21046;&#25152;&#26377;&#30340;&#25968;&#25454;&#21040;&#21442;&#19982;&#32773;&#65292;&#19968;&#20010;&#24120;&#35265;&#30340;&#35823;&#29992;&#26159;&#23558;&#20854;&#20316;&#20026;&#26222;&#36890;&#30340;&#20998;&#24067;&#24335;&#31995;&#32479;&#12290;&#38382;&#39064;&#26159;&#27492;&#31867;&#25968;&#25454;&#36890;&#24120;&#24456;&#23569;&#20462;&#25913;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20351;&#29992;
                  Subversion &#26377;&#28857;&#8220;<span class="quote">&#36807;&#20102;</span>&#8221;&#12290;<sup>[<a name="d0e574" href="#ftn.d0e574" class="footnote">2</a>]</sup>&#26377;&#19968;&#20123;&#21487;&#20197;&#22797;&#21046;&#25968;&#25454;&#26356;&#31616;&#21333;&#30340;&#24037;&#20855;&#65292;&#27809;&#26377;&#24517;&#35201;&#36807;&#24230;&#30340;&#36319;&#36394;&#21464;&#26356;&#65292;&#20363;&#22914; <span class="command"><strong>rsync</strong></span> &#25110; <span class="command"><strong>unison</strong></span>&#12290;
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.intro.history"></a>7.2.&nbsp;Subversion &#30340;&#21382;&#21490;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#26089;&#22312; 2000 &#24180;&#65292;CollabNet, Inc. (<a class="ulink" href="http://www.collab.net" target="_top">http://www.collab.net</a>)&#23601;&#24320;&#22987;&#23547;&#25214; CVS &#26367;&#20195;&#20135;&#21697;&#30340;&#24320;&#21457;&#20154;&#21592;&#12290;CollabNet &#25552;&#20379;&#20102;&#19968;&#20010;&#21517;&#20026; CollabNet &#20225;&#19994;&#29256;(CEE)&#30340;&#21327;&#20316;&#36719;&#20214;&#22871;&#20214;&#12290;&#36825;&#20010;&#36719;&#20214;&#22871;&#20214;&#30340;&#19968;&#20010;&#32452;&#25104;&#37096;&#20998;&#23601;&#26159;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;&#23613;&#31649; CEE &#22312;&#26368;&#21021;&#37319;&#29992;&#20102; CVS &#20316;&#20026;&#20854;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#20294;&#26159; CVS
                  &#30340;&#23616;&#38480;&#24615;&#20174;&#19968;&#24320;&#22987;&#23601;&#24456;&#26126;&#26174;&#65292;CollabNet &#30693;&#36947;&#65292;&#36831;&#26089;&#35201;&#25214;&#21040;&#19968;&#20010;&#26356;&#22909;&#30340;&#26367;&#20195;&#21697;&#12290;&#36951;&#25022;&#30340;&#26159;&#65292;CVS &#24050;&#32463;&#25104;&#20026;&#24320;&#28304;&#19990;&#30028;&#20107;&#23454;&#19978;&#30340;&#26631;&#20934;&#65292;&#24456;&#22823;&#31243;&#24230;&#19978;&#26159;&#22240;&#20026;<span class="emphasis"><em>&#27809;&#26377;</em></span>&#26356;&#22909;&#30340;&#26367;&#20195;&#21697;&#65292;&#33267;&#23569;&#26159;&#27809;&#26377;&#21487;&#20197;&#33258;&#30001;&#20351;&#29992;&#30340;&#26367;&#20195;&#21697;&#12290;&#25152;&#20197; CollabNet &#20915;&#23450;&#20174;&#22836;&#32534;&#20889;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#36825;&#20010;&#31995;&#32479;&#20445;&#30041; CVS &#30340;&#22522;&#26412;&#24605;&#24819;&#65292;&#20294;&#26159;&#35201;&#20462;&#27491;&#20854;&#20013;&#38169;&#35823;&#21644;&#19981;&#21512;&#29702;&#30340;&#29305;&#24615;&#12290;
               </p>
               <p>2000&#24180;2&#26376;&#65292;&#20182;&#20204;&#32852;&#31995;&#21040; <em class="citetitle">Open Source Development with CVS</em>(Coriolis, 1999) &#30340;&#20316;&#32773; Karl Fogel&#65292;&#24182;&#19988;&#35810;&#38382;&#20182;&#26159;&#21542;&#24076;&#26395;&#20026;&#36825;&#20010;&#26032;&#39033;&#30446;&#24037;&#20316;&#12290;&#24039;&#21512;&#30340;&#26159;&#65292;&#24403;&#26102; Karl &#27491;&#22312;&#19982;&#26379;&#21451; Jim Blandy &#35752;&#35770;&#35774;&#35745;&#19968;&#20010;&#26032;&#30340;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#12290;1995&#24180;&#26102;&#65292;&#20182;&#20204;&#20004;&#20154;&#26366;&#32463;&#24320;&#21150;&#20102;&#19968;&#20010;&#25552;&#20379; CVS &#25903;&#25345;&#30340;&#20844;&#21496;
                  Cyclic Software&#65292;&#23613;&#31649;&#20182;&#20204;&#26368;&#32456;&#21334;&#25481;&#20102;&#20844;&#21496;&#65292;&#20294;&#36824;&#26159;&#22825;&#22825;&#20351;&#29992; CVS &#36827;&#34892;&#26085;&#24120;&#24037;&#20316;&#12290;&#20351;&#29992; CVS &#26102;&#30340;&#25387;&#25240;&#20419;&#20351; Jim &#35748;&#30495;&#30340;&#24605;&#32771;&#22914;&#20309;&#31649;&#29702;&#29256;&#26412;&#21270;&#30340;&#25968;&#25454;&#65292;&#24182;&#19988;&#20182;&#24403;&#26102;&#19981;&#20165;&#20351;&#29992;&#20102; &#8220;<span class="quote">Subversion</span>&#8221; &#36825;&#20010;&#21517;&#23383;&#65292;&#24182;&#19988;&#24050;&#32463;&#23436;&#25104;&#20102; Subversion &#29256;&#26412;&#24211;&#30340;&#26368;&#21021;&#35774;&#35745;&#12290;&#25152;&#20197;&#24403; CollabNet &#25552;&#20986;&#36992;&#35831;&#30340;&#26102;&#20505;&#65292;Karl &#39532;&#19978;&#21516;&#24847;&#20026;&#36825;&#20010;&#39033;&#30446;&#24037;&#20316;&#65292;&#21516;&#26102; Jim &#20063;&#25214;&#21040;&#20102;&#20182;&#30340;&#38599;&#20027;&#8212;Red Hat &#36719;&#20214;&#20844;&#21496;&#8212;&#20801;&#35768;&#20182;&#21040;&#36825;&#20010;&#39033;&#30446;&#24037;&#20316;&#65292;&#24182;&#19988;&#27809;&#26377;&#38480;&#23450;&#26368;&#32456;&#30340;&#26399;&#38480;&#12290;CollabNet
                  &#38599;&#20323;&#20102; Karl &#21644; Ben Collins Sussman&#65292;&#35814;&#32454;&#35774;&#35745;&#24037;&#20316;&#20174;&#20116;&#26376;&#24320;&#22987;&#65292;&#22312; CollabNet &#20013;&#30340; Brian Behlendorf &#21644; Jason Robbins&#65292;&#20197;&#21450; Greg Stein(&#24403;&#26102;&#26159;&#19968;&#20010;&#29420;&#31435;&#24320;&#21457;&#32773;&#65292;&#27963;&#36291;&#22312; WebDAV/DeltaV
                  &#31995;&#32479;&#35268;&#33539;&#21046;&#35746;&#24037;&#20316;&#20013;)&#24688;&#21040;&#22909;&#22788;&#30340;&#28608;&#21169;&#19979;&#65292;Subversion &#24456;&#24555;&#23601;&#21560;&#24341;&#20102;&#35768;&#22810;&#27963;&#36291;&#30340;&#24320;&#21457;&#32773;&#65292;&#32467;&#26524;&#26159;&#35768;&#22810;&#23545; CVS &#26377;&#36807;&#22833;&#26395;&#32463;&#21382;&#30340;&#20154;&#24456;&#20048;&#20110;&#20026;&#36825;&#20010;&#39033;&#30446;&#20570;&#20123;&#20107;&#24773;&#12290;
               </p>
               <p>&#26368;&#21021;&#30340;&#35774;&#35745;&#23567;&#32452;&#35774;&#23450;&#20102;&#31616;&#21333;&#30340;&#24320;&#21457;&#30446;&#26631;&#12290;&#20182;&#20204;&#19981;&#24819;&#22312;&#29256;&#26412;&#25511;&#21046;&#26041;&#27861;&#23398;&#20013;&#24320;&#22438;&#22788;&#22899;&#22320;&#65292;&#20182;&#20204;&#21482;&#26159;&#24076;&#26395;&#20462;&#27491; CVS&#12290;&#20182;&#20204;&#20915;&#23450; Subversion &#24212;&#31526;&#21512; CVS &#30340;&#29305;&#24615;&#65292;&#24182;&#20445;&#30041;&#30456;&#21516;&#30340;&#24320;&#21457;&#27169;&#22411;&#65292;&#20294;&#19981;&#20877;&#37325;&#22797; CVS &#30340;&#19968;&#20123;&#26174;&#33879;&#32570;&#38519;&#12290;&#23613;&#31649; Subversion &#24182;&#19981;&#38656;&#35201;&#25104;&#20026;
                  CVS &#30340;&#23436;&#20840;&#26367;&#20195;&#21697;&#65292;&#20294;&#23427;&#24212;&#35813;&#19982; CVS &#20445;&#25345;&#36275;&#22815;&#30340;&#30456;&#20284;&#24615;&#65292;&#20197;&#20351; CVS &#29992;&#25143;&#21487;&#20197;&#36731;&#26494;&#30340;&#36716;&#31227;&#21040; Subversion &#19978;&#12290;
               </p>
               <p>&#32463;&#36807;14&#20010;&#26376;&#30340;&#32534;&#30721;&#65292;2001&#24180;8&#26376;31&#26085;&#65292;Subversion &#33021;&#22815;&#8220;<span class="quote">&#33258;&#24049;&#31649;&#29702;&#33258;&#24049;</span>&#8221;&#20102;&#65292;&#24320;&#21457;&#32773;&#20572;&#27490;&#20351;&#29992; CVS &#20445;&#23384; Subversion &#30340;&#20195;&#30721;&#65292;&#32780;&#20351;&#29992; Subversion &#26412;&#36523;&#12290;
               </p>
               <p>&#34429;&#28982; CollabNet &#21551;&#21160;&#20102;&#36825;&#20010;&#39033;&#30446;&#65292;&#24182;&#19988;&#19968;&#30452;&#25552;&#20379;&#20102;&#22823;&#37327;&#30340;&#24037;&#20316;&#25903;&#25345;(&#23427;&#20026;&#19968;&#20123;&#20840;&#32844;&#30340; Subversion &#24320;&#21457;&#32773;&#25552;&#20379;&#34218;&#27700;)&#65292;&#20294; Subversion &#20687;&#20854;&#23427;&#35768;&#22810;&#24320;&#28304;&#39033;&#30446;&#19968;&#26679;&#65292;&#34987;&#26494;&#25955;&#30340;&#12289;&#36879;&#26126;&#30340;&#35268;&#21017;&#31649;&#29702;&#30528;&#65292;&#36825;&#26679;&#30340;&#35268;&#21017;&#28608;&#21169;&#30528;&#30693;&#35782;&#30028;&#30340;&#31934;&#33521;&#20204;&#12290;CollabNet
                  &#30340;&#29256;&#26435;&#35768;&#21487;&#35777;&#23436;&#20840;&#31526;&#21512; Debian &#30340;&#33258;&#30001;&#36719;&#20214;&#26041;&#38024;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#26681;&#25454;&#33258;&#24049;&#30340;&#24847;&#24895;&#33258;&#30001;&#30340;&#19979;&#36733;&#12289;&#20462;&#25913;&#21644;&#37325;&#26032;&#21457;&#24067; Subversion&#65292;&#19981;&#38656;&#35201; CollabNet &#25110;&#20854;&#20182;&#20154;&#30340;&#25480;&#26435;&#12290;
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.intro.architecture"></a>7.3.&nbsp;Subversion &#30340;&#26550;&#26500;
                        </h3>
                     </div>
                  </div>
               </div>
               <p><a class="xref" href="svn.preface.html#svn.intro.architecture.dia-1" title="&#22270;&nbsp;1.&nbsp;Subversion &#30340;&#26550;&#26500;">&#22270;&nbsp;1 &#8220;Subversion &#30340;&#26550;&#26500;&#8221;</a>&#32473;&#20986;&#20102; Subversion &#35774;&#35745;&#24635;&#20307;&#19978;&#30340;&#8220;<span class="quote">&#20463;&#35270;&#22270;</span>&#8221;&#12290;
               </p>
               <div class="figure"><a name="svn.intro.architecture.dia-1"></a><p class="title"><b>&#22270;&nbsp;1.&nbsp;Subversion &#30340;&#26550;&#26500;</b></p>
                  <div class="figure-contents">
                     <div><img src="images/ch01dia1.png" alt="Subversion &#30340;&#26550;&#26500;"></div>
                  </div>
               </div><br class="figure-break"><p>&#22270;&#20013;&#30340;&#19968;&#31471;&#26159;&#20445;&#23384;&#25152;&#26377;&#29256;&#26412;&#25968;&#25454;&#30340; Subversion &#29256;&#26412;&#24211;&#65292;&#21478;&#19968;&#31471;&#26159; Subvesion &#30340;&#23458;&#25143;&#31243;&#24207;&#65292;&#31649;&#29702;&#30528;&#25152;&#26377;&#29256;&#26412;&#25968;&#25454;&#30340;&#26412;&#22320;&#24433;&#23556;(&#31216;&#20026;&#8220;<span class="quote">&#24037;&#20316;&#21103;&#26412;</span>&#8221;)&#65292;&#22312;&#36825;&#20004;&#26497;&#20043;&#38388;&#26159;&#21508;&#31181;&#21508;&#26679;&#30340;&#29256;&#26412;&#24211;&#35775;&#38382;(RA)&#23618;&#65292;&#26576;&#20123;&#20351;&#29992;&#30005;&#33041;&#32593;&#32476;&#36890;&#36807;&#32593;&#32476;&#26381;&#21153;&#22120;&#35775;&#38382;&#29256;&#26412;&#24211;&#65292;&#26576;&#20123;&#21017;&#32469;&#36807;&#32593;&#32476;&#26381;&#21153;&#22120;&#30452;&#25509;&#35775;&#38382;&#29256;&#26412;&#24211;&#12290;
               </p>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.intro.components"></a>7.4.&nbsp;Subversion &#30340;&#32452;&#20214;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#23433;&#35013;&#22909;&#30340; Subversion &#30001;&#20960;&#20010;&#37096;&#20998;&#32452;&#25104;&#65292;&#19979;&#38754;&#23558;&#31616;&#21333;&#30340;&#20171;&#32461;&#19968;&#19979;&#36825;&#20123;&#32452;&#20214;&#12290;&#19979;&#25991;&#30340;&#25551;&#36848;&#25110;&#35768;&#36807;&#20110;&#31616;&#30053;&#65292;&#19981;&#26131;&#29702;&#35299;&#65292;&#20294;&#19981;&#29992;&#25285;&#24515;&#8212;&#26412;&#20070;&#21518;&#38754;&#30340;&#31456;&#33410;&#20013;&#20250;&#29992;<span class="emphasis"><em>&#26356;&#22810;&#30340;</em></span>&#20869;&#23481;&#26469;&#35814;&#32454;&#38416;&#36848;&#36825;&#20123;&#32452;&#20214;&#12290;
               </p>
               <div class="variablelist">
                  <dl>
                     <dt><span class="term">svn</span></dt>
                     <dd>
                        <p>&#21629;&#20196;&#34892;&#23458;&#25143;&#31471;&#31243;&#24207;</p>
                     </dd>
                     <dt><span class="term">svnversion</span></dt>
                     <dd>
                        <p>&#27492;&#24037;&#20855;&#29992;&#26469;&#26174;&#31034;&#24037;&#20316;&#21103;&#26412;&#30340;&#29366;&#24577;(&#29992;&#26415;&#35821;&#26469;&#35828;&#65292;&#23601;&#26159;&#24403;&#21069;&#39033;&#30446;&#30340;&#20462;&#35746;&#29256;&#26412;)&#12290;</p>
                     </dd>
                     <dt><span class="term">svnlook</span></dt>
                     <dd>
                        <p>&#30452;&#25509;&#26597;&#30475; Subversion &#29256;&#26412;&#24211;&#30340;&#24037;&#20855;</p>
                     </dd>
                     <dt><span class="term">svnadmin</span></dt>
                     <dd>
                        <p>&#24314;&#31435;&#12289;&#35843;&#25972;&#21644;&#20462;&#22797; Subversion &#29256;&#26412;&#24211;&#30340;&#24037;&#20855;</p>
                     </dd>
                     <dt><span class="term">mod_dav_svn</span></dt>
                     <dd>
                        <p>Apache HTTP &#26381;&#21153;&#22120;&#30340;&#19968;&#20010;&#25554;&#20214;&#65292;&#20351;&#29256;&#26412;&#24211;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;</p>
                     </dd>
                     <dt><span class="term">svnserve</span></dt>
                     <dd>
                        <p>&#19968;&#20010;&#21333;&#29420;&#36816;&#34892;&#30340;&#26381;&#21153;&#22120;&#31243;&#24207;&#65292;&#21487;&#20197;&#20316;&#20026;&#23432;&#25252;&#36827;&#31243;&#25110;&#30001; SSH &#35843;&#29992;&#12290;&#36825;&#26159;&#21478;&#19968;&#31181;&#20351;&#29256;&#26412;&#24211;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#30340;&#26041;&#24335;&#12290;</p>
                     </dd>
                     <dt><span class="term">svndumpfilter</span></dt>
                     <dd>
                        <p>&#36807;&#28388; Subversion &#29256;&#26412;&#24211;&#36716;&#20648;&#25968;&#25454;&#27969;&#30340;&#24037;&#20855;</p>
                     </dd>
                     <dt><span class="term">svnsync</span></dt>
                     <dd>
                        <p>&#19968;&#20010;&#36890;&#36807;&#32593;&#32476;&#22686;&#37327;&#38236;&#20687;&#29256;&#26412;&#24211;&#30340;&#31243;&#24207;</p>
                     </dd>
                  </dl>
               </div>
            </div>
            <div class="sect2" lang="zh-cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h3 class="title"><a name="svn.intro.whatsnew"></a>7.5.&nbsp;Subversion &#26377;&#20160;&#20040;&#26032;&#19996;&#35199;&#65311;
                        </h3>
                     </div>
                  </div>
               </div>
               <p>&#27492;&#20070;&#30340;&#31532;&#19968;&#29256;&#22312; 2004 &#24180;&#21457;&#24067;&#65292;&#20063;&#23601;&#26159; Subversion 1.0 &#21457;&#24067;&#21518;&#19981;&#20037;&#12290;&#32463;&#36807; 4 &#24180;&#65292;Subversion &#21457;&#24067;&#20102; 5 &#20010;&#20027;&#35201;&#30340;&#26032;&#29256;&#26412;&#65292;&#20462;&#27491;&#20102; bug&#65292;&#22686;&#21152;&#20102;&#20027;&#35201;&#30340;&#26032;&#29305;&#24615;&#12290;&#25105;&#20204;&#19968;&#30452;&#20445;&#25345;&#26412;&#20070;&#22312;&#32447;&#29256;&#26412;&#30340;&#26356;&#26032;&#65292;&#25105;&#20204;&#29616;&#22312;&#24456;&#20852;&#22859;&#30340;&#26159; O'Reilly
                  &#23558;&#20250;&#21457;&#24067;&#21253;&#21547; Subversion 1.5 &#29256;&#26412;&#30340;&#31532;&#20108;&#29256;&#65292;&#23427;&#26159;&#39033;&#30446;&#30340;&#19968;&#20010;&#20027;&#35201;&#37324;&#31243;&#30865;&#12290;&#19979;&#38754;&#26159;&#20174; Subversion 1.0 &#20197;&#26469;&#20027;&#35201;&#21464;&#26356;&#30340;&#24635;&#32467;&#12290;&#27880;&#24847;&#36825;&#19981;&#26159;&#23436;&#25972;&#30340;&#21015;&#34920;&#65307;&#35814;&#32454;&#20449;&#24687;&#21487;&#20197;&#35775;&#38382; Subversion &#30340;&#32593;&#31449; <a class="ulink" href="http://subversion.tigris.org" target="_top">http://subversion.tigris.org</a>&#12290;
               </p>
               <div class="variablelist">
                  <dl>
                     <dt><span class="term">Subversion 1.1 (2004&#24180;9&#26376;)</span></dt>
                     <dd>
                        <p>1.1 &#29256;&#26412;&#24341;&#20837;&#20102; FSFS&#65292;&#32431;&#25991;&#20214;&#30340;&#29256;&#26412;&#24211;&#23384;&#20648;&#36873;&#39033;&#12290;&#34429;&#28982; Berkeley DB &#21518;&#31471;&#34987;&#24191;&#27867;&#30340;&#20351;&#29992;&#65292;&#20294;&#22240;&#20026; FSFS &#20854;&#36739;&#20302;&#30340;&#38376;&#27099;&#21644;&#36739;&#23567;&#30340;&#31649;&#29702;&#38656;&#35201;&#65292;FSFS &#36824;&#26159;&#25104;&#20026;&#26032;&#24314;&#29256;&#26412;&#24211;&#30340;&#8220;<span class="quote">&#32570;&#30465;&#30340;</span>&#8221;&#36873;&#39033;&#12290;&#21478;&#22806;&#36825;&#20010;&#29256;&#26412;&#33021;&#22815;&#23558;&#31526;&#21495;&#38142;&#32435;&#20837;&#29256;&#26412;&#25511;&#21046;&#65292;&#33021;&#22815;&#33258;&#21160;&#23553;&#35013; URL&#65292;&#36824;&#26377;&#26412;&#22320;&#21270;&#30340;&#29992;&#25143;&#30028;&#38754;&#12290;
                        </p>
                     </dd>
                     <dt><span class="term">Subversion 1.2 (2005&#24180;5&#26376;)</span></dt>
                     <dd>
                        <p>1.2 &#29256;&#26412;&#24341;&#20837;&#20102;&#25991;&#20214;&#22312;&#26381;&#21153;&#22120;&#31471;&#8220;<span class="quote">&#38145;&#23450;</span>&#8221;&#30340;&#21151;&#33021;&#65292;&#23454;&#29616;&#23545;&#29305;&#23450;&#36164;&#28304;&#30340;&#39034;&#24207;&#35775;&#38382;&#12290;&#34429;&#28982; Subversion &#19968;&#30452;&#22522;&#26412;&#19978;&#26159;&#19968;&#20010;&#24182;&#34892;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#65292;&#29305;&#23450;&#31867;&#22411;&#30340;&#30340;&#20108;&#36827;&#21046;&#25991;&#20214;(&#33402;&#26415;&#20316;&#21697;&#65292;&#20363;&#22914;)&#19981;&#33021;&#21512;&#24182;&#22312;&#19968;&#36215;&#65292;&#38145;&#23450;&#29305;&#24615;&#22635;&#34917;&#20102;&#23545;&#27492;&#31867;&#36164;&#28304;&#30340;&#29256;&#26412;&#21270;&#20445;&#25252;&#12290;&#38543;&#30528;&#38145;&#23450;&#20063;&#24341;&#20837;&#20102;&#19968;&#20010;&#23436;&#25972;&#30340; &#8220;<span class="quote">auto-versioning</span>&#8221; &#23454;&#29616;&#65292;&#20801;&#35768; Subversion &#29256;&#26412;&#24211;&#20316;&#20026;&#32593;&#32476;&#25991;&#20214;&#22841;&#21152;&#36733;&#65292;&#26368;&#21518;&#65292;Subversion 1.2 &#24320;&#22987;&#20351;&#29992;&#26032;&#30340;&#65292;&#26356;&#24555;&#30340;&#20108;&#36827;&#21046;&#24046;&#24322;&#31639;&#27861;&#26469;&#21387;&#32553;&#21644;&#26816;&#32034;&#25991;&#20214;&#30340;&#26087;&#29256;&#26412;&#12290;
                        </p>
                     </dd>
                     <dt><span class="term">Subversion 1.3 (2005&#24180;12&#26376;)</span></dt>
                     <dd>
                        <p>1.3 &#29256;&#26412;&#20026; <span class="command"><strong>svnserve</strong></span> &#26381;&#21153;&#22120;&#24341;&#20837;&#36335;&#24452;&#20026;&#22522;&#30784;&#30340;&#25480;&#26435;&#25511;&#21046;&#65292;&#19982; Apache &#26381;&#21153;&#22120;&#23545;&#24212;&#30340;&#29305;&#24615;&#21305;&#37197;&#12290;Apache &#26381;&#21153;&#22120;&#33258;&#24049;&#20063;&#33719;&#24471;&#20102;&#26032;&#30340;&#26085;&#24535;&#29305;&#24615;&#65292;Subversion &#20854;&#23427;&#35821;&#35328;&#30340; API &#32465;&#23450;&#20063;&#21462;&#24471;&#20102;&#24040;&#22823;&#30340;&#36827;&#27493;&#12290;
                        </p>
                     </dd>
                     <dt><span class="term">Subversion 1.4(2006&#24180;9&#26376;)</span></dt>
                     <dd>
                        <p>1.4 &#29256;&#26412;&#24341;&#20837;&#20102;&#23436;&#20840;&#30340;&#26032;&#24037;&#20855; &#8212; <span class="command"><strong>svnsync</strong></span> &#8212; &#29992;&#26469;&#36890;&#36807;&#32593;&#32476;&#23436;&#25104;&#21333;&#21521;&#30340;&#29256;&#26412;&#24211;&#22797;&#21046;&#12290;&#19968;&#20010;&#37325;&#35201;&#30340;&#37096;&#20998;&#26159;&#24037;&#20316;&#21103;&#26412;&#20803;&#25968;&#25454;&#24471;&#21040;&#20462;&#34917;&#65292;&#19981;&#20877;&#20351;&#29992; XML(&#33719;&#24471;&#23458;&#25143;&#31471;&#30340;&#36895;&#24230;&#25913;&#21892;)&#65292;&#32780; Berkeley DB &#29256;&#26412;&#24211;&#21518;&#31471;&#33719;&#24471;&#20102;&#22312;&#21457;&#29983;&#23849;&#28291;&#26102;&#33258;&#21160;&#8220;<span class="quote">&#24674;&#22797;</span>&#8221;&#30340;&#33021;&#21147;&#12290;
                        </p>
                     </dd>
                     <dt><span class="term">Subversion 1.5 (2008&#24180;6&#26376;)</span></dt>
                     <dd>
                        <p>1.5 &#29256;&#26412;&#33457;&#36153;&#20102;&#27604;&#20197;&#21069;&#29256;&#26412;&#26356;&#38271;&#30340;&#26102;&#38388;&#65292;&#20294;&#26159;&#20851;&#38190;&#29305;&#24615;&#26159;&#24040;&#22823;&#30340;&#65306;&#20998;&#25903;&#21644;&#21512;&#24182;&#30340;&#21322;&#33258;&#21160;&#36319;&#36394;&#12290;&#36825;&#26159;&#20026;&#29992;&#25143;&#24102;&#26469;&#30340;&#24040;&#22823;&#20415;&#21033;&#65292;&#20063;&#20351; Subversion &#30340;&#33021;&#21147;&#36828;&#36828;&#36229;&#36234; CVS&#65292;&#36827;&#20837;&#20102;&#21830;&#19994;&#31454;&#20105;&#32773; Perforce &#21644; Clearcase &#30340;&#32423;&#21035;&#65292;Subversion
                           1.5 &#20063;&#24341;&#20837;&#20102;&#19968;&#20123;&#20854;&#23427;&#29992;&#25143;&#20851;&#27880;&#30340;&#29305;&#24615;&#65292;&#20363;&#22914;&#20132;&#20114;&#24335;&#30340;&#25991;&#20214;&#20914;&#31361;&#35299;&#20915;&#65292;&#37096;&#20998;&#26816;&#20986;&#65292;&#21464;&#26356;&#21015;&#34920;&#30340;&#23458;&#25143;&#31471;&#31649;&#29702;&#65292;&#22806;&#37096;&#23450;&#20041;&#30340;&#24378;&#22823;&#30340;&#26032;&#35821;&#27861;&#65292;&#20197;&#21450;&#23545; <span class="command"><strong>svnserve</strong></span> &#26381;&#21153;&#22120;&#30340; SASL &#35748;&#35777;&#25903;&#25345;&#12290;
                        </p>
                     </dd>
                     <dt><span class="term">Subversion 1.6 (???)</span></dt>
                     <dd>
                        <p>???</p>
                     </dd>
                  </dl>
               </div>
            </div>
         </div>
         <div class="footnotes"><br><hr width="100" align="left">
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e480" href="#d0e480" class="para">1</a>] </sup>&#22114;&#65292;&#36824;&#35201;&#24863;&#35874; Karl &#20026;&#20102;&#26412;&#20070;&#25152;&#20184;&#20986;&#30340;&#36763;&#21220;&#24037;&#20316;&#12290;
               </p>
            </div>
            <div class="footnote">
               <p><sup>[<a name="ftn.d0e574" href="#d0e574" class="para">2</a>] </sup>&#25110;&#32773;&#20687;&#19968;&#20010;&#26379;&#21451;&#35828;&#30340;&#65292;&#8220;<span class="quote">&#29992;&#21035;&#20811;&#25293;&#33485;&#34631;</span>&#8221;&#12290;
               </p>
            </div>
         </div>
      </div>
      <div class="navfooter">
         <hr>
         <table width="100%" summary="Navigation footer">
            <tr>
               <td width="40%" align="left"><a accesskey="p" href="svn.foreword.html">&#19978;&#19968;&#39029;</a>&nbsp;
               </td>
               <td width="20%" align="center">&nbsp;</td>
               <td width="40%" align="right">&nbsp;<a accesskey="n" href="svn.basic.html">&#19979;&#19968;&#39029;</a></td>
            </tr>
            <tr>
               <td width="40%" align="left" valign="top">&#21069;&#35328;&nbsp;</td>
               <td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td>
               <td width="40%" align="right" valign="top">&nbsp;&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#22522;&#26412;&#27010;&#24565;</td>
            </tr>
         </table>
      </div>
   </body>
</html>